-- @Author: baidwwy
-- @Date:   2024-12-14 19:53:28
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-07 00:14:56
-- @Author: baidwwy
-- @Date:   2024-10-20 02:54:08
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-05 18:02:38

local 商城处理类 = class()
local a=0
function 商城处理类:初始化()
	self.购买组号=nil
	self.购买编号=nil
	self.购买数量=nil
	self.购买分类=nil
	a=RpbARGB.序列

end

function 商城处理类:刷新仙玉(id)

    发送数据(玩家数据[id].连接id, 3701, f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]], "账号配置", "仙玉") + 0)
    -- 发送数据(玩家数据[id].连接id, 3701, 玩家数据[id].角色.仙玉 + 0)
end
function 商城处理类:加载商品()
	self.商品组 = {}
	self.商品组[18] = {银子商城={},宝宝={},特殊商城={},锦衣={},祥瑞={},足迹={},光环={},特效={},祥瑞套装={},法宝={},灵宝={},仙玉商城={},会员={},人物类={},宠物类={},孩子类={},宝石类={},符石类={},杂物类={}}
	-- self.商品组[18] = {银子商城={},宝宝={},特殊商城={},锦衣={},祥瑞={},足迹={},光环={},法宝={},灵宝={},礼包={},特效={},祥瑞套装={}}
	self["商品"..tostring(0)](self)
end

function 商城处理类:数据处理(id,内容)
	self.商品组[18]["祥瑞套装"]={
		{名称="白帝江套装飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装桃夭夭",角色限制="桃夭夭",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装巫蛮儿",角色限制="巫蛮儿",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白斗战胜佛白帝江剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江偃无师",角色限制="偃无师",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白泽剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷黑帝江虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷黑帝江巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷黑帝江杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽青花瓷龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装巫蛮儿",角色限制="巫蛮儿",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装偃无师",角色限制="偃无师",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽青花瓷套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装鬼潇潇",角色限制="鬼潇潇",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装桃夭夭",角色限制="桃夭夭",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑帝江套装骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑帝江套装鬼潇潇",角色限制="鬼潇潇",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑帝江套装狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="九尾冰狐飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="神行小驴飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="新水嘟嘟飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="天使猪猪飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},
 	}

	local 沉默=0
	self.临时祥瑞套装={}
	for i=1,#self.商品组[18]["祥瑞套装"] do
		if self.商品组[18]["祥瑞套装"][i].角色限制==玩家数据[id].角色.造型 then
			沉默=沉默+1
		   self.临时祥瑞套装[沉默]=self.商品组[18]["祥瑞套装"][i]
		end
	end
	self.商品组[18]["祥瑞套装"]=self.临时祥瑞套装


	self.购买组号 = 内容.组号 + 0
	self.购买编号 = 内容.编号
	self.购买数量 = 内容.数量+0
	self.购买分类 = 内容.分类
	-- local 仙玉=玩家数据[id].角色.仙玉
	local 仙玉=f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]], "账号配置", "仙玉") + 0
	local 点卡=玩家数据[id].角色.点卡
	local 银子=玩家数据[id].角色.银子
	local 积分=0
	local 消费类别 = "银子"
	local 价格 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格
	local 名称 = self.商品组[self.购买组号][self.购买分类][self.购买编号].名称
	-- if (self.购买分类 == "足迹" or self.购买分类 == "光环" or self.购买分类 == "锦衣" ) and f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","管理") ~= "1" then
	-- 	return 常规提示(id,"#Y限时物品暂时无法购买")
	-- end
	--if self.购买分类 == "宝宝" then
		--return 常规提示(id,"#仅用作展示作用哦")
	--end

	if (self.购买分类 == "锦衣" or self.购买分类 == "祥瑞" )and 玩家数据[id].角色.模型 == "影精灵" then
		return 常规提示(id,"影精灵角色暂不可购买/穿戴锦衣和祥瑞")
	end
	local 临时道具 = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
	if self.购买数量 == nil or (self.购买数量 ~= nil and self.购买数量 < 1) then
		self.购买数量 = 1
	else
		self.购买数量 = self.购买数量 + 0
	end
	self.购买数量=qz(self.购买数量)
	if self.购买数量>99 then
	    self.购买数量=99
	end
	if 价格~=qz(价格) then
		print("商城物品价格被修改，玩家ID=  "..id)
		local 封禁原因=玩家数据[id].角色.ip.."“违规行为：商城购买”价格=="..价格.."，玩家ID=="..id.."，玩家账号=="..玩家数据[id].账号.."时间="..os.date("%Y%m%d")..os.date("%H",os.time())..os.date("%S",os.time())
		f函数.写配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","已违规8",封禁原因)
		f函数.写配置(程序目录..[[各类情况查看\]]..[[\违规汇总.txt]],"违规详情","已违规8:",封禁原因)

	    return
	end
	-- if self.购买分类== "宝宝" then
	-- 	return 常规提示(id,"#Y此类商城不可购买!")
	-- end
	if self.购买分类== "宝宝" then
        	-- 玩家数据[id].召唤兽:添加商城仙玉召唤兽(nil, nil, nil, nil, nil, nil, nil, nil, nil, nil, nil, nil, 临时道具, 价格, "仙玉", "商城购买")
        	-- self:刷新仙玉(id)
     		常规提示(id,"商城宝宝仅供观赏")
		elseif self.购买分类 == "祥瑞" then
			    if 玩家数据[id].角色.坐骑列表~= nil and #玩家数据[id].角色.坐骑列表==7 then
			      常规提示(id,"#Y/购买[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑失败!携带坐骑数量已上限.")
			      return false
			    else
					if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
				      常规提示(id,"#Y你购买了[#R/"..self.商品组[self.购买组号][self.购买分类][self.购买编号].名称.."#Y/]坐骑!")
				      全局坐骑资料:获取坐骑(id,self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
				      发送数据(玩家数据[id].连接id,61,玩家数据[id].角色.坐骑列表)
				    end
			    end
		elseif self.购买分类 == "仙玉商城"  then
				if 临时道具.可叠加 then
					玩家数据[id].道具:商场仙玉购买道具(id,名称,self.购买数量,价格*self.购买数量,临时道具,消费类别,"商城购买")
				else
					  if 名称=="器灵·金蝉"  or 名称=="器灵·无双" then
					  		if not 玩家数据[id].角色:扣除仙玉(价格,0,0,购买渠道,1) then
		                   return false
	                    end
	                    local xzz={"衣服","武器","鞋子","头盔","项链","腰带"}
	                    local xz=xzz[取随机数(1,#xzz)]

				    玩家数据[id].道具:给予道具(id,名称,临时道具.数量,xz )---不可叠加购买
					  else
					玩家数据[id].道具:商场仙玉购买道具(id,名称,nil,价格,临时道具,"仙玉","商城购买")---不可叠加购买

                      end
				end
	       		self:刷新仙玉(id)
	else
				if 临时道具.可叠加 then
					    玩家数据[id].道具:系统购买道具(id,名称,self.购买数量,价格*self.购买数量,临时道具,消费类别,"商城购买")--可叠加购买
				else
					if 名称=="150制造指南书" or 名称=="140制造指南书"  or 名称=="130制造指南书" or 名称=="120制造指南书" then
						local 临时数据 =分割文本(名称,"制造指南书")
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
						    玩家数据[id].道具:给予道具(id,"制造指南书",{临时数据[1]/10,临时数据[1]/10},nil,"商城购买")
						end
					elseif 名称=="150百炼精铁"or 名称=="140百炼精铁"  or 名称=="130百炼精铁" or 名称=="120百炼精铁"   then
						local 临时数据 =分割文本(名称,"百炼精铁")
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"百炼精铁",临时数据[1]+0,nil,"商城购买")
						end
					elseif 名称=="60灵饰指南书" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"灵饰指南书",{6,6},nil,"商城购买")
						end
					elseif 名称=="80灵饰指南书" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"灵饰指南书",{8,8},nil,"商城购买")
						end
					elseif 名称=="100灵饰指南书" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"灵饰指南书",{10,10},nil,"商城购买")
						end
					elseif 名称=="120灵饰指南书" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"灵饰指南书",{12,12},nil,"商城购买")
						end
					elseif 名称=="140灵饰指南书" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"灵饰指南书",{14,14},nil,"商城购买")
						end
					elseif 名称=="60元灵晶石" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"元灵晶石",{6,6},nil,"商城购买")
						end
					elseif 名称=="80元灵晶石" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"元灵晶石",{8,8},nil,"商城购买")
						end
					elseif 名称=="100元灵晶石" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"元灵晶石",{10,10},nil,"商城购买")
						end
					elseif 名称=="120元灵晶石" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"元灵晶石",{12,12},nil,"商城购买")
						end
					elseif 名称=="140元灵晶石" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"元灵晶石",{14,14},nil,"商城购买")
						end
					elseif 名称=="高级魔兽要诀" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"高级魔兽要诀",取高级要诀(),nil,"商城购买")
						end
					elseif 名称=="玲珑宝图" or 名称=="高级藏宝图" or  名称=="藏宝图" or  名称=="炼妖石" or  名称=="上古锻造图策" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,名称)
						end
					elseif 名称=="鬼谷子" then
						if 玩家数据[id].角色:扣除银子(价格,0,0,"商城购买",1) then
							玩家数据[id].道具:给予道具(id,"鬼谷子",nil,1,"商城购买")
						end

					elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == 1000 then
							玩家数据[id].道具:给予法宝(id,名称,价格,消费类别,"商城购买")
					elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == 1002 then
							玩家数据[id].道具:给予灵宝(id,名称,价格,消费类别,"商城购买")
					else
					玩家数据[id].道具:系统购买道具(id,名称,nil,价格,临时道具,消费类别,"商城购买")
					end
				end
	end
end


function 商城处理类:取商品组数据(id, 序号)


	self.商品组[18]["祥瑞套装"]={
		{名称="白帝江套装飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装桃夭夭",角色限制="桃夭夭",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装巫蛮儿",角色限制="巫蛮儿",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白帝江套装英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白斗战胜佛白帝江剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白帝江偃无师",角色限制="偃无师",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷白泽剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷黑帝江虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷黑帝江巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白青花瓷黑帝江杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽青花瓷龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装巫蛮儿",角色限制="巫蛮儿",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装偃无师",角色限制="偃无师",总类=2,分类=15,价格=5000000,子类=2},
		{名称="白泽套装英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽青花瓷套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装鬼潇潇",角色限制="鬼潇潇",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装桃夭夭",角色限制="桃夭夭",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑白泽套装玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑帝江套装骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑帝江套装鬼潇潇",角色限制="鬼潇潇",总类=2,分类=15,价格=5000000,子类=2},
		{名称="黑帝江套装狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="九尾冰狐飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="九尾冰狐巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="九尾冰狐英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="神行小驴飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="神行小驴巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="神行小驴英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="新水嘟嘟飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="新水嘟嘟巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="新水嘟嘟英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},

	    {名称="天使猪猪飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪狐美人",角色限制="狐美人",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=5000000,子类=2},
		{名称="天使猪猪巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪龙太子",角色限制="龙太子",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪神天兵",角色限制="神天兵",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=5000000,子类=2},
	    {名称="天使猪猪英女侠",角色限制="英女侠",总类=2,分类=15,价格=5000000,子类=2},
	}


	self.发送消息 = {}
	序号 = 序号 + 0
	序号 = 18 --之前是19
	-- self.商品组[序号].银子 = 0
	self.商品组[序号].组号 = 18
	self.商品组[序号].银子 = 玩家数据[id].角色.银子  --sj.xy+0
   	 self.商品组[序号].仙玉 = f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]], "账号配置", "仙玉") + 0
   	-- self.商品组[序号].仙玉 = 玩家数据[id].角色.仙玉+0
   	self.商品组[序号].点卡 = 玩家数据[id].角色.点卡+0
	-- self.商品组[序号].累充 = sj.ljcz+0
	-- self.商品组[序号].积分 = sj.xyjf+0
	--(self.商品组[序号])

	-- local 沉默=0
	-- self.临时祥瑞套装={}
	-- for i=1,#self.商品组[18]["祥瑞套装"] do
	-- 	if self.商品组[18]["祥瑞套装"][i].角色限制==玩家数据[id].角色.造型 then
	-- 		沉默=沉默+1
	-- 	   self.临时祥瑞套装[沉默]=self.商品组[18]["祥瑞套装"][i]
	-- 	end
	-- end
	-- self.商品组[18]["祥瑞套装"]=self.临时祥瑞套装

	发送数据(玩家数据[id].连接id, 3700, self.商品组[序号])
	发送数据(玩家数据[id].连接id, 3701, f函数.读配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]], "账号配置", "仙玉") + 0)
	-- 发送数据(玩家数据[id].连接id, 3701, 玩家数据[id].角色.仙玉+0)
end

function 商城处理类:商品0()

	self.商品组[18]["仙玉商城"]={
		{可叠加=true,名称="月卡",价格=988888},
		{可叠加=true,名称="体验月卡",价格=288888},
		{可叠加=true,名称="抽奖令牌",价格=20000},
		{可叠加=true,名称="抽奖仙令",价格=200000},
		{可叠加=true,名称="一亿银票",价格=20000},

        {可叠加=true,名称="技能突破符",价格=288888},
        {可叠加=false,名称="元素曜石礼包",价格=288888},
		{可叠加=true,名称="武器附神锤",价格=288888},
		-- {可叠加=true,名称="160无级别礼包",价格=288888},
		{可叠加=true,名称="菩提果",价格=1000},
        {可叠加=true,总类=190,名称="上古残符",价格=10000},
        {可叠加=true,总类=191,名称="青铜灵物",价格=10000},
        -- {可叠加=true,名称="随机经验礼包",价格=5000},
        -- {可叠加=true,名称="随机经验大礼包",价格=50000},
        -- {可叠加=true,名称="随机仙玉礼包",价格=388},
        -- {可叠加=true,名称="随机仙玉大礼包",价格=3888},
		-- {可叠加=true,名称="四象天罡印",价格=10000},
		-- {可叠加=true,名称="月饼",价格=10000},
		-- {可叠加=true,名称="超级兽诀礼盒",价格=88888},
		-- {可叠加=true,名称="稀有兽诀礼盒",价格=66666},
		-- {可叠加=true,名称="特殊兽诀礼盒",价格=33333},
		-- {可叠加=true,名称="附魔宝珠",级别限制=160,价格=5000},
		-- {可叠加=true,名称="战魄",级别限制=160,价格=5000,子类=160},
		-- {可叠加=true,名称="陨铁",级别限制=160,价格=5000,子类=160},
		-- {可叠加=true,名称="仙露丸子",价格=2000},
		-- {可叠加=false,名称="140灵饰自选-佩饰",总类="装备礼包",价格=388888},
		-- {可叠加=false,名称="140灵饰自选-耳饰",总类="装备礼包",价格=388888},
		-- {可叠加=false,名称="140灵饰自选-手镯",总类="装备礼包",价格=388888},
		-- {可叠加=false,名称="140灵饰自选-戒指",总类="装备礼包",价格=388888},
		-- {可叠加=true,名称="黑宝石max",价格=128888},
		-- {可叠加=true,名称="红玛瑙max",价格=128888},
		-- {可叠加=true,名称="太阳石max",价格=128888},
		-- {可叠加=true,名称="月亮石max",价格=128888},
		-- {可叠加=true,名称="舍利子max",价格=128888},
		-- {可叠加=true,名称="翡翠石max",价格=128888},
		-- {可叠加=true,名称="星辉石max",价格=128888},
		-- {可叠加=true,名称="十级玄灵珠礼包",价格=388888},
		-- {可叠加=true,名称="8级钟灵石礼包",价格=188888},
		-- {可叠加=true,名称="特殊清灵仙露",价格=66666},
		-- {可叠加=false,名称="进阶自在心猿饰品",价格=66666,总类=149,分类=1},
-- 		天猴/天残/精锐/勇武/神威/天科/天元/王者宝石箱:随机各组级宝石1个
-- 		plus宝石箱子:随机宝石种类 1-8级各一个

	 }
	self.商品组[18]["银子商城"]={
		{可叠加=false,总类=11,分类=2,子类=20,级别限制=1,名称="超级合成旗",次数=500,价格=980000},
		-- {价格=100000,可叠加=false,总类=11,xy={[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=105,x=192},[1]={y=7,x=312},[4]={y=186,x=389},[6]={y=240,x=277},[8]={y=248,x=474},[9]={y=197,x=475},[10]={y=167,x=364},[11]={y=86,x=292},[12]={y=180,x=130},[13]={y=19,x=383}  ,[14]={x=238,y=166},[15]={x=133,y=93},[16]={x=106,y=51},[17]={x=181,y=262},[18]={x=324,y=265},[19]={x=408,y=214},[20]={x=512,y=277},[21]={x=496,y=138},[22]={x=518,y=94},[23]={x=529,y=126},[24]={x=358,y=35},[25]={x=404,y=68} },地图=1001,子类=50,y=7,x=312,分类=2,次数=140,名称="红色合成旗"},
		{价格=100000,可叠加=false,总类=11,xy={[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209}  ,[6]={x=13,y=125},[7]={x=33,y=81},[8]={x=191,y=76},[9]={x=122,y=54},[10]={x=127,y=20}},地图=1092,子类=50,y=7,x=312,分类=2,次数=140,名称="黄色合成旗"},
		{价格=100000,可叠加=false,总类=11,xy={[1]={y=203,x=141},[2]={y=183,x=33},[3]={y=74,x=52},[4]={y=14,x=107},[5]={x=106,y=158},[6]={x=120,y=99},[7]={x=43,y=119},[8]={x=25,y=30} },地图=1070,子类=50,y=7,x=312,分类=2,次数=140,名称="绿色合成旗"},
		{价格=100000,可叠加=false,总类=11,xy={[1]={y=117,x=57},[2]={y=81,x=107},[3]={y=36,x=64},[4]={y=18,x=232},[5]={y=108,x=260},[6]={y=122,x=174},[7]={x=22,y=137},[8]={x=36,y=66},[9]={x=221,y=139},[10]={x=214,y=88},[11]={x=120,y=16},[12]={x=143,y=61},[13]={x=33,y=15} },地图=1501,子类=50,y=7,x=312,分类=2,次数=140,名称="白色合成旗"},
		{价格=100000,可叠加=false,总类=11,xy={[1]={y=92,x=581},[2]={y=43,x=630},[3]={y=63,x=16},[4]={y=17,x=24},[5]={y=14,x=217},[6]={y=98,x=201} ,[7]={x=41,y=102},[8]={x=59,y=8},[9]={x=170,y=10},[10]={x=243,y=60},[11]={x=330,y=34},[12]={x=371,y=107},[13]={x=559,y=31},[14]={x=530,y=8},[15]={x=477,y=112},[16]={x=439,y=29}},地图=1173,子类=50,y=7,x=312,分类=2,次数=140,名称="蓝色合成旗"},
		{可叠加=true,价格=5000,名称="摄妖香"},
		{可叠加=true,价格=5000,名称="洞冥草"},
		-- {可叠加=false,名称="回梦丹",价格=500000},
		{可叠加=true,总类=1,名称="秘制回梦饮",价格=3000000},
		{价格=5000,可叠加=true,总类=9,名称="天眼通符",分类=3,子类=0},
		{价格=200000,可叠加=false,名称="秘制红罗羹"},
		{价格=200000,可叠加=false,名称="秘制绿芦羹"},

		{可叠加=true,价格=99999,名称="青龙石"},
		{可叠加=true,价格=99999,名称="白虎石"},
		{可叠加=true,价格=99999,名称="玄武石"},
		{可叠加=true,价格=99999,名称="朱雀石"},
-- 暂不开放，精炼属性太变态了
		-- {可叠加=true,价格=999999,名称="精炼之锤低"},
		-- {可叠加=true,价格=3999999,名称="精炼之锤中"},
		-- {可叠加=true,价格=8999999,名称="精炼之锤高"},
		{可叠加=true,价格=9999999,名称="沸涌炎海的信标"},
		{可叠加=true,价格=9999999,名称="钢铁炼境的信标"},
		{可叠加=true,价格=9999999,名称="雷鸣废土的信标"},
		{可叠加=true,价格=9999999,名称="幽夜暗域的信标"},
		{可叠加=true,价格=9999999,名称="混乱终末的信标"},
		{可叠加=true,价格=9999999,名称="伟大虚空的信标"},
		{可叠加=true,价格=9999999,名称="巅峰领域的信标"},


		{可叠加=true,总类=1,名称="海马",价格=88888},

		{可叠加=true,名称="神兵图鉴",总类=111,分类=1,子类=160,价格=50000},
		{可叠加=true,名称="灵宝图鉴",总类=111,分类=2,子类=160,价格=50000},
		{可叠加=true,名称="灵饰图鉴",总类=111,分类=3,子类=140,价格=50000},
		{可叠加=false,名称="摇钱树苗",价格=1000000},
		{可叠加=false,名称="鬼谷子",价格=2000000},

	 }
	self.商品组[18]["人物类"]={
		-- {可叠加=false,名称="炫彩ID",特效="绿色ID",价格=666666666},
		{可叠加=false,名称="炫彩ID",特效="蓝色ID",价格=22222222},
		{可叠加=false,名称="炫彩ID",特效="紫色ID",价格=33333333},
		{可叠加=false,名称="炫彩ID",特效="黄金ID",价格=55555555},
		{可叠加=true,价格=6666,名称="彩果"},

		-- {可叠加=true,名称="灵饰特效宝珠",总类=182,价格=2000000},
		-- {可叠加=true,总类=181,名称="装备特效宝珠",价格=2000000},
		-- {可叠加=true,名称="装备特效宝珠礼包",价格=20000000},
		-- {可叠加=true,名称="不磨符",总类=183,分类=4,价格=5000000},
		-- {可叠加=true,名称="双加转换符",总类=183,分类=5,价格=3000000},
		-- {价格=2000000,总类=180,可叠加=true,名称="特技书"},
		-- {可叠加=true,总类=183,名称="愤怒符",价格=2000000},
		-- {可叠加=true,名称="九转金丹礼包",价格=20000000},
		{可叠加=true,名称="修炼果礼包",价格=4000000},
		{可叠加=false,名称="种族坐骑",价格=1000000},
	    {可叠加=false,名称="附魔宝珠",级别限制=160,价格=50000000},
		{可叠加=false,名称="淬灵石",价格=2000000},

		}
	self.商品组[18]["宠物类"]={
		{可叠加=true,价格=150000,名称="金柳露"},
		{可叠加=true,价格=300000,名称="超级金柳露"},
		{可叠加=true,价格=300000,名称="净瓶玉露"},
		{可叠加=true,价格=600000,名称="超级净瓶玉露"},
		{价格=100000,可叠加=true,名称="月华露",阶品=1000},
		{可叠加=false,总类=3,分类=10,子类=1,名称="上古锻造图策",价格=1000000},
		{可叠加=false,总类=3,分类=5,子类=1,名称="炼妖石",价格=1000000},
		{可叠加=false,名称="吸附石",价格=200000},
		{可叠加=true,名称="特殊兽诀·碎片",价格=13000000},
		{可叠加=true,名称="超级兽诀·碎片",价格=10000000},
		{可叠加=true,名称="天赋符",价格=500000},
		{可叠加=true,名称="神兜兜",价格=19999999},
		{可叠加=true,名称="灵兜兜",价格=199999999},
		}
	self.商品组[18]["孩子类"]={
		{可叠加=false,总类=117,名称="孤儿手册",价格=100000000},
		{可叠加=false,名称="逍遥镜",价格=10000000},
		}
	self.商品组[18]["宝石类"]={
		{价格 = 880000, 可叠加 = false, 级别限制 = 1, 名称 = "玄灵珠·破军"},
		{价格 = 880000, 可叠加 = false, 级别限制 = 1, 名称 = "玄灵珠·空灵"},
		{价格 = 880000, 可叠加 = false, 级别限制 = 1, 名称 = "玄灵珠·回春"},
		{价格 = 880000, 可叠加 = false, 级别限制 = 1, 名称 = "玄灵珠·噬魂"},
		{可叠加=true,名称="黑宝石max",价格=128888000},
		{可叠加=true,名称="红玛瑙max",价格=128888000},
		{可叠加=true,名称="太阳石max",价格=128888000},
		{可叠加=true,名称="月亮石max",价格=128888000},
		{可叠加=true,名称="舍利子max",价格=128888000},
		{可叠加=true,名称="翡翠石max",价格=128888000},
		{可叠加=true,名称="光芒石max",价格=128888000},
		{可叠加=true,名称="黑宝石11-15",价格=4000000000},
		{可叠加=true,名称="红玛瑙11-15",价格=4000000000},
		{可叠加=true,名称="太阳石11-15",价格=4000000000},
		{可叠加=true,名称="月亮石11-15",价格=4000000000},
		{可叠加=true,名称="舍利子11-15",价格=4000000000},
		{可叠加=true,名称="翡翠石11-15",价格=4000000000},
		{可叠加=true,名称="光芒石11-15",价格=4000000000},
		{可叠加=true,名称="初级星辉石礼包",价格=36450000},
		{可叠加=true,名称="中级星辉石礼包",价格=2900000000},
		{可叠加=true,名称="高级星辉石礼包",价格=11800000000},
		{价格 = 3000000, 可叠加 = true,名称 = "6级钟灵石礼包"},
		{价格 = 80000000, 可叠加 = true,名称 = "八级玄灵珠礼包"},
		{价格 = 99999, 可叠加 = true,名称 = "灵犀之屑"},
	    -- {可叠加=false,名称="珍珠",级别限制=160,价格=10000000},
		}
	self.商品组[18]["符石类"]={
		{可叠加=false,名称="符石卷轴",价格=50000},
		{可叠加=true,名称="新三符石礼包",价格=5000000},
		{可叠加=true,名称="星石礼包",价格=5000000},
		{可叠加=false,价格=2000000,符石属性={魔力=1},总类=889,颜色="黄色",子类=1,名称="未激活的符石",分类=89,符石名称="风符石"},
		{可叠加=false,价格=2000000,符石属性={力量=1},总类=889,颜色="黄色",子类=1,名称="未激活的符石",分类=89,符石名称="炎符石"},
		 {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="黄色",子类=3,名称="未激活的符石",分类=89,符石名称="少阳符石"},--------
		{可叠加=false,价格=2000000,符石属性={气血=10},总类=889,颜色="红色",子类=2,名称="未激活的符石",分类=89,符石名称="红云符石"},
		 {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="红色",子类=3,名称="未激活的符石",分类=89,符石名称="太阳符石"},----------
		{可叠加=false,价格=2000000,符石属性={速度=1.5},总类=889,颜色="绿色",子类=2,名称="未激活的符石",分类=89,符石名称="霞光符石"},
		{可叠加=false,价格=2000000,符石属性={灵力=1.5},总类=889,颜色="绿色",子类=2,名称="未激活的符石",分类=89,符石名称="飘渺符石"},
		 {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="绿色",子类=3,名称="未激活的符石",分类=89,符石名称="太阴符石"},---------------------------
		{可叠加=false,价格=2000000,符石属性={敏捷=1,伤害=1.5},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="狂念符石"},
		{可叠加=false,价格=2000000,符石属性={敏捷=1,气血=10},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="引幽符石"},
		{可叠加=false,价格=2000000,符石属性={敏捷=1,灵力=1.5},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="乱花符石"},
		{可叠加=false,价格=2000000,符石属性={敏捷=1,法术防御=2},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="两仪符石"},
		{可叠加=false,价格=2000000,符石属性={敏捷=1,固定伤害=2},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="七情符石"},
		{可叠加=false,价格=2000000,符石属性={敏捷=1,防御=3},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="召影符石"},
		 {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="紫色",子类=3,名称="未激活的符石",分类=89,符石名称="太极符石"},------------------
		{可叠加=false,价格=2000000,符石属性={力量=1,速度=1.5},总类=889,颜色="黑色",子类=3,名称="未激活的符石",分类=89,符石名称="降龙符石"},
		{可叠加=false,价格=2000000,符石属性={力量=1,气血=10},总类=889,颜色="黑色",子类=3,名称="未激活的符石",分类=89,符石名称="地炎符石"},
		{可叠加=false,价格=2000000,符石属性={力量=1,灵力=1.5},总类=889,颜色="黑色",子类=3,名称="未激活的符石",分类=89,符石名称="流魂符石"},
		{可叠加=false,价格=2000000,符石属性={力量=1,固定伤害=1.5},总类=889,颜色="黑色",子类=3,名称="未激活的符石",分类=89,符石名称="南夕符石"},
         {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="黑色",子类=3,名称="未激活的符石",分类=89,符石名称="阴仪符石"},---------
        {可叠加=false,价格=2000000,符石属性={体质=1,伤害=1.5},总类=889,颜色="蓝色",子类=3,名称="未激活的符石",分类=89,符石名称="北冥符石"},
		{可叠加=false,价格=2000000,符石属性={体质=1,速度=1.5},总类=889,颜色="蓝色",子类=3,名称="未激活的符石",分类=89,符石名称="锦瑟符石"},
		{可叠加=false,价格=2000000,符石属性={体质=1,灵力=1.5},总类=889,颜色="蓝色",子类=3,名称="未激活的符石",分类=89,符石名称="清心符石"},
		{可叠加=false,价格=2000000,符石属性={体质=1,固定伤害=1.5},总类=889,颜色="蓝色",子类=3,名称="未激活的符石",分类=89,符石名称="玄魂符石"},
		{可叠加=false,价格=2000000,符石属性={体质=1,气血=10},总类=889,颜色="蓝色",子类=3,名称="未激活的符石",分类=89,符石名称="乾坤符石"},
		 {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="蓝色",子类=3,名称="未激活的符石",分类=89,符石名称="少阴符石"},--------------
		{可叠加=false,价格=2000000,符石属性={魔力=1,气血=10},总类=889,颜色="白色",子类=3,名称="未激活的符石",分类=89,符石名称="醉魂符石"},
		{可叠加=false,价格=2000000,符石属性={魔力=1,伤害=1.5},总类=889,颜色="白色",子类=3,名称="未激活的符石",分类=89,符石名称="霸风符石"},
		{可叠加=false,价格=2000000,符石属性={魔力=1,速度=1.5},总类=889,颜色="白色",子类=3,名称="未激活的符石",分类=89,符石名称="无极符石"},
		{可叠加=false,价格=2000000,符石属性={魔力=1,固定伤害=2},总类=889,颜色="白色",子类=3,名称="未激活的符石",分类=89,符石名称="圣火符石"},
		 {可叠加=false,价格=2000000,符石属性={气血=15,速度=1.5},总类=889,颜色="白色",子类=3,名称="未激活的符石",分类=89,符石名称="阳仪符石"},------------

		}
	self.商品组[18]["杂物类"]={
		{可叠加=true,价格=9999999,名称="秘境降妖卡"},
		{可叠加=true,名称="五宝盒",价格=500000},
		{可叠加=false,名称="九眼天珠",价格=500000, 灵气=100, 总类=3, 分类=11, 级别限制=155},

		}

	self.商品组[18]["宝宝"]={

    {价格=12888888,名称="超级十全法宠",模型="觉醒涂山雪",等级=0,参战等级=0,种类="宝宝",变异=false,
       技能={[1]="水漫金山",[2]="出其不意",[3]="须弥真言",[4]="圣婴大王",[5]="柳暗花明",[6]="龙魂",[7]="风起龙游",[8]="高级神佑复生",[9]="义薄云天",[10]="高级精神集中",
       [11]="高级幸运",[12]="溜之大吉",[13]="高级招架",[14]="高级驱鬼",[15]="超级魔之心",[16]="超级法术连击",[17]="超级法术波动",[18]="超级法术暴击",[19]="超级遗志",[20]="超级否定信仰",
       [21]="超级水属性吸收",[22]="超级火属性吸收",[23]="超级土属性吸收",[24]="超级雷属性吸收"}
	   ,成长=1.5,攻击资质=1800,防御资质=2000,体力资质=6500,法力资质=4500,速度资质=2000,躲闪资质=20000,内丹={内丹上限=6,可用内丹=6},
	   元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
        },

    {价格=12888888,名称="超级十全物宠",模型="自在心猿",等级=0,参战等级=0,种类="宝宝",变异=false,
       技能={[1]="无上正真",[2]="津津有味",[3]="高级合纵",[4]="理直气壮",[5]="嗜血追击",[6]="气贯长虹",[7]="风起龙游",[8]="高级神佑复生",[9]="高级感知",[10]="乘胜追击",[11]="虎虎生风",
       [12]="高级强力",[13]="高级敏捷",[14]="高级必杀",[15]="超级吸血",[16]="超级夜战",[17]="超级连击",[18]="超级偷袭",[19]="超级飞行",[20]="超级否定信仰",[21]="超级水属性吸收",
       [22]="超级火属性吸收",[23]="超级土属性吸收",[24]="超级雷属性吸收"}
	   ,成长=1.5,攻击资质=1800,防御资质=2000,体力资质=6500,法力资质=4500,速度资质=2000,躲闪资质=2000,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},

	{价格=5888888,名称="定制五福法宠",模型="涂山雪",等级=0,参战等级=0,种类="宝宝",变异=false,
       技能={[1]="超级法术暴击",[2]="超级法术波动",[3]="超级法术连击",[4]="超级魔之心",[5]="超级精神集中",[6]="出其不意",
	   [7]="高级招架",[8]="高级神佑复生",[9]="高级驱鬼",[10]="须弥真言",[11]="高级幸运",[12]="圣婴大王",
	   [13]="溜之大吉",[14]="义薄云天",[15]="风起龙游",[16]="龙魂",[17]="柳暗花明",[18]="水漫金山"}
	   ,成长=1.35,攻击资质=1650,防御资质=1800,体力资质=6000,法力资质=4000,速度资质=1700,躲闪资质=1700,内丹={内丹上限=6,可用内丹=6},
	   元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},

	{价格=5888888,名称="定制五福攻宠",模型="进阶金翼",等级=0,参战等级=0,种类="宝宝",变异=false,
       技能={[1]="超级强力",[2]="超级偷袭",[3]="超级连击",[4]="超级必杀",[5]="超级吸血",[6]="高级夜战",[7]="无上正真",
  	    [8]="高级神佑复生",[9]="高级感知",[10]="高级敏捷",[11]="虎虎生风",[12]="津津有味",
		[13]="高级合纵",[14]="从天而降",[15]="嗜血追击",[16]="气贯长虹",[17]="乘胜追击",[18]="风起龙游"}
		,成长=1.35,攻击资质=1650,防御资质=1800,体力资质=6000,法力资质=4000,速度资质=1700,躲闪资质=1700,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},

	{价格=1888888,名称="定制10技能全红法宠",模型="进阶妙华天女",等级=0,参战等级=0,种类="宝宝",变异=false,
	   技能={[1]="须弥真言",[2]="出其不意",[3]="水漫金山",[4]="高级法术暴击",[5]="高级法术波动",[6]="高级法术连击",[7]="高级魔之心",[8]="高级神佑复生",[9]="高级感知",[10]="超级敏捷"}
		,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5800,法力资质=3800,速度资质=1600,躲闪资质=1600,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},

	{价格=1888888,名称="定制10技能全红物宠",模型="进阶雷龙",等级=0,参战等级=0,种类="宝宝",变异=false,
		技能={[1]="无上正真",[2]="津津有味",[3]="高级连击",[4]="高级必杀",[5]="高级吸血",[6]="高级夜战",[7]="高级敏捷",[8]="高级神佑复生",[9]="高级感知",[10]="超级偷袭"}
		,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5800,法力资质=3800,速度资质=1600,躲闪资质=1600,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},
      	-------------------------------------------------------胚子列表--------------------------------------------------
	-- {价格=588888,名称="24技能胚子",模型="进阶幻姬",等级=0,参战等级=0,种类="宝宝",变异=false,
	-- 	技能={[1]="反震",[2]="吸血",[3]="反击",[4]="连击",[5]="飞行",[6]="必杀",[7]="感知",[8]="再生",[9]="冥思",[10]="慧根",[11]="强力",[12]="幸运",[13]="神迹",[14]="招架",[15]="永恒",[16]="敏捷",[17]="法术连击",[18]="火属性吸收",[19]="水属性吸收",[20]="土属性吸收",[21]="落岩",[22]="水攻",[23]="烈火",[24]="雷击"}
	-- 	,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5500,法力资质=3500,速度资质=1400,躲闪资质=1400,内丹={内丹上限=6,可用内丹=6},
	-- 	元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
 --      	},
 --    {价格=366666,名称="20技能胚子",模型="进阶谛听",等级=0,参战等级=0,种类="宝宝",变异=false,
	-- 	技能={[1]="反震",[2]="吸血",[3]="反击",[4]="连击",[5]="飞行",[6]="必杀",[7]="感知",[8]="再生",[9]="冥思",[10]="慧根",[11]="强力",[12]="幸运",[13]="神迹",[14]="招架",[15]="永恒",[16]="敏捷",[17]="法术连击",[18]="火属性吸收",[19]="水属性吸收",[20]="土属性吸收"}
	-- 	,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5500,法力资质=3500,速度资质=1400,躲闪资质=1400,内丹={内丹上限=6,可用内丹=6},
	-- 	元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
 --      	},
  --   {价格=258888,名称="16技能胚子",模型="进阶灵灯侍者",等级=0,参战等级=0,种类="宝宝",变异=false,
		-- 技能={[1]="反震",[2]="吸血",[3]="反击",[4]="连击",[5]="飞行",[6]="必杀",[7]="感知",[8]="再生",[9]="冥思",[10]="慧根",[11]="强力",[12]="幸运",[13]="神迹",[14]="招架",[15]="永恒",[16]="敏捷"}
		-- ,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5500,法力资质=3500,速度资质=1400,躲闪资质=1400,内丹={内丹上限=6,可用内丹=6},
		-- 元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
  --     	},
    {价格=168888,名称="12技能胚子",模型="魔化毗舍童子",等级=0,参战等级=0,种类="宝宝",变异=false,
		技能={[1]="反震",[2]="吸血",[3]="反击",[4]="连击",[5]="飞行",[6]="必杀",[7]="感知",[8]="再生",[9]="冥思",[10]="慧根",[11]="强力",[12]="幸运"}
		,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5500,法力资质=3500,速度资质=1400,躲闪资质=1400,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},
    {价格=111111,名称="10技能胚子",模型="鬼将",等级=0,参战等级=0,种类="宝宝",变异=false,
		技能={[1]="反震",[2]="吸血",[3]="反击",[4]="连击",[5]="飞行",[6]="必杀",[7]="感知",[8]="再生",[9]="冥思",[10]="慧根"}
		,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5500,法力资质=3500,速度资质=1400,躲闪资质=1400,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},
    {价格=50000,名称="8技能胚子",模型="食铁兽",等级=0,参战等级=0,种类="宝宝",变异=false,
		技能={[1]="反震",[2]="吸血",[3]="反击",[4]="连击",[5]="飞行",[6]="必杀",[7]="感知",[8]="再生"}
		,成长=1.3,攻击资质=1600,防御资质=1600,体力资质=5500,法力资质=3500,速度资质=1400,躲闪资质=1400,内丹={内丹上限=6,可用内丹=6},
		元宵={可用=10,水晶糕=20,元宵时间=0,千金露=4,炼兽真经=5,如意丹=1000,千金露使用=0,真经时间=0},五行="火",战斗技能={},认证码="4000165_1559845339_183652_927177709273",染色方案=nil,染色组={},忠诚=100,装备={},特性五维={魔力=0,耐力=0,敏捷=0,力量=0,体质=0},伤害=26,法伤=35,法防=35,防御=35,攻击=26,潜力=0,体质=20,最大魔法=78,灵力=32,寿命=5000,魔法=78,最大气血=156,速度=28,耐力=20,敏捷=20,当前经验=0,最大经验=50,气血=156,魔力=20,力量=20,
      	},

    }




	self.商品组[18]["法宝"]={
		{可叠加=true,名称="储灵袋",价格=88888},
		-- {可叠加=false,总类=1000,名称="九霄灵息",价格=200000000},-----无
		-- {可叠加=false,总类=1000,名称="驱风宝诰",价格=200000000},
		-- {可叠加=false,总类=1000,名称="万古坚冰",价格=200000000},
		-- {可叠加=false,总类=1000,名称="初诞春芽",价格=200000000},
		-- {可叠加=false,总类=1000,名称="澄空净铃",价格=200000000},
		-- {可叠加=false,总类=1000,名称="狂飙天爪",价格=200000000},
		-- {可叠加=false,总类=1000,名称="止风神剑",价格=200000000},
		{可叠加=false,总类=1000,名称="五色旗盒",价格=1200000},
		{可叠加=false,总类=1000,名称="拭剑石",价格=1200000},
		{可叠加=false,总类=1000,名称="飞剑",价格=1200000},
		{可叠加=false,总类=1000,名称="风袋",价格=1200000},
		{可叠加=false,总类=1000,名称="定风珠",价格=1200000},
		{可叠加=false,总类=1000,名称="天师符",价格=1200000},
		{可叠加=false,总类=1000,名称="织女扇",价格=1200000},
		{可叠加=false,总类=1000,名称="雷兽",价格=1200000},
		{可叠加=false,总类=1000,名称="迷魂灯",价格=1200000},
		{可叠加=false,总类=1000,名称="幽灵珠",价格=1200000},
		{可叠加=false,总类=1000,名称="碧玉葫芦",价格=1200000},
		{可叠加=false,总类=1000,名称="汇灵盏",价格=1200000},
		{可叠加=false,总类=1000,名称="九黎战鼓",价格=1200000},
		{可叠加=false,总类=1000,名称="盘龙壁",价格=1200000},
		{可叠加=false,总类=1000,名称="神行飞剑",价格=1200000},
		{可叠加=false,总类=1000,名称="金甲仙衣",价格=1200000},
		{可叠加=false,总类=1000,名称="嗜血幡",价格=1200000},
		{可叠加=false,总类=1000,名称="惊魂铃",价格=1200000},
		{可叠加=false,总类=1000,名称="清心咒",价格=1200000},
		{可叠加=false,总类=1000,名称="缚妖索",价格=1200000},
		{可叠加=false,总类=1000,名称="金钱镖",价格=1200000},

		{可叠加=false,总类=1000,名称="七杀",价格=2600000},
		{可叠加=false,总类=1000,名称="宝烛",价格=2600000},
		{可叠加=false,总类=1000,名称="金刚杵",价格=2600000},
		{可叠加=false,总类=1000,名称="兽王令",价格=2600000},
		{可叠加=false,总类=1000,名称="分水",价格=2600000},
		{可叠加=false,总类=1000,名称="琉璃灯",价格=2600000},
		{可叠加=false,总类=1000,名称="赤焰",价格=2600000},
		{可叠加=false,总类=1000,名称="神木宝鼎",价格=2600000},
		{可叠加=false,总类=1000,名称="天煞",价格=2600000},
		{可叠加=false,总类=1000,名称="罗汉珠",价格=2600000},
		{可叠加=false,总类=1000,名称="摄魂",价格=2600000},
		{可叠加=false,总类=1000,名称="附灵玉",价格=2600000},
		{可叠加=false,总类=1000,名称="降魔斗篷",价格=2600000},
		{可叠加=false,总类=1000,名称="发瘟匣",价格=2600000},
		{可叠加=false,总类=1000,名称="断线木偶",价格=2600000},
		{可叠加=false,总类=1000,名称="五彩娃娃",价格=2600000},
		{可叠加=false,总类=1000,名称="番天印",价格=2600000},
		{可叠加=false,总类=1000,名称="现形符",价格=2600000},
		{可叠加=false,总类=1000,名称="捆仙绳",价格=2600000},

		{可叠加=false,总类=1000,名称="月光宝盒",价格=4800000},
		{可叠加=false,总类=1000,名称="失心钹",价格=4800000},
		{可叠加=false,总类=1000,名称="五火神焰印",价格=4800000},
		{可叠加=false,总类=1000,名称="九幽",价格=4800000},
		{可叠加=false,总类=1000,名称="普渡",价格=4800000},
		{可叠加=false,总类=1000,名称="斩魔",价格=4800000},
		{可叠加=false,总类=1000,名称="金箍棒",价格=4800000},
		{可叠加=false,总类=1000,名称="干将莫邪",价格=4800000},
		{可叠加=false,总类=1000,名称="乾坤玄火塔",价格=4800000},
		{可叠加=false,总类=1000,名称="慈悲",价格=4800000},
		{可叠加=false,总类=1000,名称="救命毫毛",价格=4800000},
		{可叠加=false,总类=1000,名称="伏魔天书",价格=4800000},
		{可叠加=false,总类=1000,名称="镇海珠",价格=4800000},
		{可叠加=false,总类=1000,名称="奇门五行令",价格=4800000},
		{可叠加=false,总类=1000,名称="月影",价格=4800000},
		{可叠加=false,总类=1000,名称="曼陀罗",价格=4800000},
		{可叠加=false,总类=1000,名称="忘情",价格=4800000},
		{可叠加=false,总类=1000,名称="金蟾",价格=4800000},
		{可叠加=false,总类=1000,名称="混元伞",价格=4800000},
		{可叠加=false,总类=1000,名称="无魂傀儡",价格=4800000},
		{可叠加=false,总类=1000,名称="苍白纸人",价格=4800000},
		{可叠加=false,总类=1000,名称="照妖镜",价格=4800000},
		{可叠加=false,总类=1000,名称="无尘扇",价格=4800000},
		{可叠加=false,总类=1000,名称="鬼泣",价格=4800000},
		{可叠加=false,总类=1000,名称="无字经",价格=4800000},
		{可叠加=false,总类=1000,名称="七宝玲珑灯",价格=4800000},
		{可叠加=false,总类=1000,名称="缚龙索",价格=4800000},
		{可叠加=false,总类=1000,名称="缩地尺",价格=4800000},
		{可叠加=false,总类=1000,名称="影蛊",价格=4800000},
		{可叠加=false,总类=1000,名称="铸兵锤",价格=4800000},
		{可叠加=false,总类=1000,名称="驭魔笼",价格=4800000},
		{可叠加=false,总类=1000,名称="落宝金钱",价格=4800000},

		{可叠加=false,总类=1000,名称="凌波仙符",价格=9600000},
		{可叠加=false,总类=1000,名称="流影云笛",价格=9600000},
		{可叠加=false,总类=1000,名称="宿幕星河",价格=9600000},
		{可叠加=false,总类=1000,名称="蟠龙玉璧",价格=9600000},
		{可叠加=false,总类=1000,名称="落星飞鸿",价格=9600000},
		{可叠加=false,总类=1000,名称="归元圣印",价格=9600000},
		{可叠加=false,总类=1000,名称="千斗金樽",价格=9600000},
		{可叠加=false,总类=1000,名称="重明战鼓",价格=9600000},
		{可叠加=false,总类=1000,名称="梦云幻甲",价格=9600000},
		{可叠加=false,总类=1000,名称="河图洛书",价格=9600000},
		{可叠加=false,总类=1000,名称="炽焰丹珠",价格=9600000},
		{可叠加=false,总类=1000,名称="翡翠芝兰",价格=9600000},
		{可叠加=false,总类=1000,名称="太虚玉液",价格=9600000},
		{可叠加=false,总类=1000,名称="软烟罗锦",价格=9600000},
		{可叠加=false,总类=1000,名称="谷玄星盘",价格=9600000},
		{可叠加=false,总类=1000,名称="翠碧玉箫",价格=9600000},
		{可叠加=false,总类=1000,名称="血魄元幡",价格=9600000},
		{可叠加=false,总类=1000,名称="北冥巨鳞",价格=9600000},
		{可叠加=false,总类=1000,名称="冷龙石磐",价格=9600000},
		{可叠加=false,总类=1000,名称="琉璃云罩",价格=9600000},
		{可叠加=false,总类=1000,名称="璞玉灵钵",价格=9600000},
		{可叠加=false,总类=1000,名称="九梵清莲",价格=9600000},
		{可叠加=false,总类=1000,名称="紫火如意",价格=9600000},
		{可叠加=false,总类=1000,名称="舞雪冰蝶",价格=9600000},
		{可叠加=false,总类=1000,名称="苍灵雪羽",价格=9600000},
		{可叠加=false,总类=1000,名称="烽火狼烟",价格=9600000},
	 }

	self.商品组[18]["特效"]={
		{可叠加=false,总类=2,名称="齐天大圣·群法",价格=3000000,分类=21,子类=7,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="齐天大圣（法）",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="齐天大圣（攻）",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="牛气冲天",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="虎威一震白",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="虎威一震黑",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="虎威一震金",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="虎啸生风黑",价格=3000000,分类=20,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="虎啸生风金",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="耀炎麒麟白",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="耀炎麒麟黑",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="耀炎麒麟金",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="万物生长白",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="万物生长黑",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="万物生长绿",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="曜焰麒麟白",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="曜焰麒麟黑",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="比翼飞粉",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="比翼飞蓝",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="扶摇九霄",价格=3000000,分类=20,子类=6,种类="稀有",类型=2,部位类型="特效"},
		{可叠加=false,总类=2,名称="四海归源",价格=3000000,分类=19,子类=5,种类="稀有",类型=2,部位类型="特效"},

		}
	self.商品组[18]["祥瑞套装"]={
		{名称="白帝江套装飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白帝江套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白帝江套装桃夭夭",角色限制="桃夭夭",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白帝江套装巫蛮儿",角色限制="巫蛮儿",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白帝江套装舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白帝江套装玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白帝江套装英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白斗战胜佛白帝江剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},

		{名称="白青花瓷白帝江龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷白帝江神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷白帝江逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷白帝江偃无师",角色限制="偃无师",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷白泽剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷黑帝江虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷黑帝江巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白青花瓷黑帝江杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=2000000,子类=2},

		{名称="白泽青花瓷龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白泽套装飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白泽套装巫蛮儿",角色限制="巫蛮儿",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白泽套装偃无师",角色限制="偃无师",总类=2,分类=15,价格=2000000,子类=2},
		{名称="白泽套装英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},

		{名称="黑白泽青花瓷套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装鬼潇潇",角色限制="鬼潇潇",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装杀破狼",角色限制="杀破狼",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装桃夭夭",角色限制="桃夭夭",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑白泽套装玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑帝江套装骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑帝江套装鬼潇潇",角色限制="鬼潇潇",总类=2,分类=15,价格=2000000,子类=2},
		{名称="黑帝江套装狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},

		-- {名称="福气冲天吾皇飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		-- {名称="福气冲天吾皇骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		-- {名称="福气冲天吾皇狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},
		-- {名称="福气冲天吾皇虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		-- {名称="福气冲天吾皇剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
	 --    {名称="福气冲天吾皇龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},


	    {名称="九尾冰狐飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		{名称="九尾冰狐骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="九尾冰狐狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},
		{名称="九尾冰狐虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		{名称="九尾冰狐剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},
		{名称="九尾冰狐巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="九尾冰狐龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="九尾冰狐神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="九尾冰狐舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="九尾冰狐逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="九尾冰狐玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="九尾冰狐英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},

	    {名称="神行小驴飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		{名称="神行小驴骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="神行小驴狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},
		{名称="神行小驴虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		{名称="神行小驴剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},
		{名称="神行小驴巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="神行小驴龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="神行小驴神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="神行小驴舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="神行小驴逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="神行小驴玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="神行小驴英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},

	    {名称="新水嘟嘟飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		{名称="新水嘟嘟骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="新水嘟嘟狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},
		{名称="新水嘟嘟虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		{名称="新水嘟嘟剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},
		{名称="新水嘟嘟巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="新水嘟嘟龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="新水嘟嘟神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="新水嘟嘟舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="新水嘟嘟逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="新水嘟嘟玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="新水嘟嘟英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},

	    {名称="天使猪猪飞燕女",角色限制="飞燕女",总类=2,分类=15,价格=2000000,子类=2},
		{名称="天使猪猪骨精灵",角色限制="骨精灵",总类=2,分类=15,价格=2000000,子类=2},
		{名称="天使猪猪狐美人",角色限制="狐美人",总类=2,分类=15,价格=2000000,子类=2},
		{名称="天使猪猪虎头怪",角色限制="虎头怪",总类=2,分类=15,价格=2000000,子类=2},
		{名称="天使猪猪剑侠客",角色限制="剑侠客",总类=2,分类=15,价格=2000000,子类=2},
		{名称="天使猪猪巨魔王",角色限制="巨魔王",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="天使猪猪龙太子",角色限制="龙太子",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="天使猪猪神天兵",角色限制="神天兵",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="天使猪猪舞天姬",角色限制="舞天姬",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="天使猪猪逍遥生",角色限制="逍遥生",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="天使猪猪玄彩娥",角色限制="玄彩娥",总类=2,分类=15,价格=2000000,子类=2},
	    {名称="天使猪猪英女侠",角色限制="英女侠",总类=2,分类=15,价格=2000000,子类=2},
	 }
	self.商品组[18]["会员"]={

	 }

	self.商品组[18]["特殊商城"]={
		{可叠加=false,总类=161,分类=1,子类=1,名称="队标特效",价格=300000},
		{可叠加=false,总类=144,分类=1,子类=1,名称="灿烂葵花",价格=300000},
		{可叠加=false,总类=144,分类=2,子类=1,名称="冰清玉洁",价格=300000},
		{可叠加=false,总类=144,分类=3,子类=1,名称="甜蜜葡萄",价格=300000},
		{可叠加=false,总类=144,分类=4,子类=1,名称="觅缘",价格=300000},
		{可叠加=false,总类=144,分类=5,子类=1,名称="喜结连理",价格=300000},
		{可叠加=false,总类=144,分类=6,子类=1,名称="甜甜蜜蜜",价格=300000},
		{可叠加=false,总类=144,分类=7,子类=1,名称="泡泡相约",价格=300000},
		{可叠加=false,总类=144,分类=8,子类=1,名称="秋意浓",价格=300000},
		{可叠加=false,总类=144,分类=9,子类=1,名称="踏雪寻梅",价格=300000},
		{可叠加=false,总类=144,分类=10,子类=1,名称="竹下饮",价格=300000},
		{可叠加=false,总类=144,分类=11,子类=1,名称="午夜惊魂",价格=300000},
		{可叠加=false,总类=144,分类=12,子类=1,名称="暖暖线球",价格=300000},
		{可叠加=false,总类=144,分类=13,子类=1,名称="云中传音",价格=300000},
		{可叠加=false,总类=144,分类=14,子类=1,名称="夏日西瓜",价格=300000},
		{可叠加=false,总类=144,分类=15,子类=1,名称="鸿雁传情",价格=300000},
		{可叠加=false,总类=144,分类=16,子类=1,名称="中国结",价格=300000},
		{可叠加=false,总类=144,分类=17,子类=1,名称="冰雪天地",价格=300000},
		{可叠加=false,总类=144,分类=18,子类=1,名称="星月童话",价格=300000},
		{可叠加=false,总类=144,分类=19,子类=1,名称="绯色蔷薇",价格=300000},
		{可叠加=false,总类=144,分类=20,子类=1,名称="荷塘虹影",价格=300000},
		{可叠加=false,总类=144,分类=22,子类=1,名称="四叶草",价格=300000},
		{可叠加=false,总类=144,分类=23,子类=1,名称="海洋乐园",价格=300000},
		{可叠加=false,总类=144,分类=24,子类=1,名称="木纹回忆",价格=300000},
		{可叠加=false,总类=144,分类=25,子类=1,名称="悦动之心",价格=300000},
		{可叠加=false,总类=144,分类=26,子类=1,名称="飞翔之翼",价格=300000},
		{可叠加=false,总类=144,分类=27,子类=1,名称="花之浪漫",价格=300000},
		{可叠加=false,总类=144,分类=28,子类=1,名称="龙虎斗",价格=300000},
	    {可叠加=false,总类=144,分类=29,子类=1,名称="吉祥如意",价格=300000},
		{可叠加=false,总类=144,分类=30,子类=1,名称="糖果",价格=300000},
	 }
	self.商品组[18]["锦衣"]={

			{可叠加=false,总类=2,名称="青花瓷",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="花间梦",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="鹿角弯弯",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="水云归",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="飞天舞",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="飞天舞朝露",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="羽仙歌",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="炽云缎墨黑",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="从军行",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="从军行月曜",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="绯雪织凝霜",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="冰寒绡月白",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="蒹葭苍苍寒月",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="浪淘纱",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="浪淘纱墨黑",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="萌萌小厨",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="霞姿月韵",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="雪眸影夜烬",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="夜影",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			 {可叠加=false,总类=2,名称="冰雪玉兔",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			{可叠加=false,总类=2,名称="官服",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			{可叠加=false,总类=2,名称="闲云野鹤",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
			{可叠加=false,总类=2,名称="明光宝甲",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
		    {可叠加=false,总类=2,名称="化圣",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
		    {可叠加=false,总类=2,名称="渡劫",价格=1000000,属性=true,分类=15,子类=1,种类="稀有",类型=6,部位类型="服饰"},
		}
	self.商品组[18]["足迹"]={
		{可叠加=false,总类=2,名称="浮游水母",价格=1000000,分类=18,子类=4,种类="稀有",类型=3,部位类型="足迹"},
		{可叠加=false,总类=2,名称="闪光足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		{可叠加=false,总类=2,名称="青草足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=1,部位类型="足迹"},
		{可叠加=false,总类=2,名称="糖果足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=1,部位类型="足迹"},
		{可叠加=false,总类=2,名称="爱心足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=1,部位类型="足迹"},
		{可叠加=false,总类=2,名称="玉剑足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=2,部位类型="足迹"},
		{可叠加=false,总类=2,名称="晶翅足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=2,部位类型="足迹"},
		{可叠加=false,总类=2,名称="蝴蝶足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=3,部位类型="足迹"},
		{可叠加=false,总类=2,名称="爱的泡泡",价格=1000000,分类=18,子类=4,种类="稀有",类型=3,部位类型="足迹"},
		{可叠加=false,总类=2,名称="爱的风暴",价格=1000000,分类=18,子类=4,种类="稀有",类型=3,部位类型="足迹"},
		{可叠加=false,总类=2,名称="璀璨烟花",价格=1000000,分类=18,子类=4,种类="稀有",类型=3,部位类型="足迹"},
		{可叠加=false,总类=2,名称="心享气球",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},

		-- {可叠加=false,总类=2,名称="皮球足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="龙卷风足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="星光",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="小心机",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="跃动喷泉",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="彩蝶飞",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="锦鲤游",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="雷电足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="旋律足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="踩浪花",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="藤蔓蔓延",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="飞天足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="枫叶足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="随风舞",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="落羽",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="星如雨",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="璀璨足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="星光泡泡",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},
		-- {可叠加=false,总类=2,名称="鱼群足迹",价格=1000000,分类=18,子类=4,种类="稀有",类型=4,部位类型="足迹"},


		}
	self.商品组[18]["光环"]={
		{可叠加=false,总类=2,名称="寒霜冰凌",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="金枝春绽",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="九霄云图",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="浪淘沙月白",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="凌霄天宫月白",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="流云蝶影",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="琪草瑶花",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="月半潮墨黑",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="九尾庞庞",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="浪淘沙墨黑",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="凌霄天宫",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="凌霄天宫墨黑",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="流云蝶影",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="沙骨王座",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="午夜魔蝠",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="星驰剑阵",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="星驰剑阵染",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="月半潮",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="月半潮月白",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="云龙梦",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="云龙梦墨黑",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
		{可叠加=false,总类=2,名称="云龙梦月白",价格=10000000,分类=17,子类=3,种类="稀有",类型=2,部位类型="光环"},
	 }


	self.商品组[18]["灵宝"]={
		}
		for i=1,#商城灵宝 do
			self.商品组[18]["灵宝"][#self.商品组[18]["灵宝"]+1]={可叠加=false,总类=1002,名称=商城灵宝[i],价格=800000000}
		end

	--  self.商品组[18]["祥瑞"]={
	-- 	{名称="紫霞云麒",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="玄冰灵虎",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="玄火神驹",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="七彩小驴",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="九尾冰狐",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="吾皇",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="战火穷奇",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="白金战火穷奇",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="玉脂福羊",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="神行小驴",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="猪猪小侠",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="飞天猪猪",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="青霄天麟",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="雷霆战豹",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="怒雷狂狮",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="妙缘暖犀",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="御风灵貂",总类="祥瑞",分类=16,价格=50000000,子类=2},
	-- 	{名称="鹤雪锦犀",总类="祥瑞",分类=16,价格=50000000,子类=2},

	-- }
end

return 商城处理类
