-- @Author: baidwwy
-- @Date:   2024-09-11 20:07:56
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-07 08:47:46
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-09-11 12:08:38
-- @Author: baidwwy
-- @Date:   2024-04-14 22:24:26
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-07-21 12:01:28
-- @Author: baidwwy
-- @Date:   2024-03-05 15:36:07
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-04-03 13:05:51
local 商店处理类 = class()

function 商店处理类:初始化()
	local n = {}
		n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
		n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
		n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
		n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
		n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
		n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
		n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
		n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
		n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
		n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
		n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
		n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
		n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
		n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
		n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
		n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
		n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
		n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
		n[19] = {{"方巾","簪子"},{"布帽","玉钗",},{"面具","梅花簪子"},{"纶巾","珍珠头带"},{"缨络丝带","凤头钗"},{"羊角盔","媚狐头饰"},{"水晶帽","玉女发冠"},{"乾坤帽","魔女发冠"},{"黑魔冠","七彩花环"},{"白玉龙冠","凤翅金翎"},{"水晶夔帽","寒雉霜蚕"},{"翡翠曜冠","曜月嵌星"},{"金丝黑玉冠","郁金流苏簪"},{"白玉琉璃冠","玉翼附蝉翎"},{"兽鬼珐琅面","鸾羽九凤冠"},{"紫金磐龙冠","金珰紫焰冠"},{"浑天玄火盔","乾元鸣凤冕"}}
		n[20] = {"护身符","五色飞石","珍珠链",{"骷髅吊坠","苍魂珠"},{"江湖夜雨","九宫坠"},{"荧光坠子","高速之星"},{"风月宝链","八卦坠"},{"碧水青龙","鬼牙攫魂"},{"万里卷云","疾风之铃"},"七彩玲珑","黄玉琉佩","鸾飞凤舞","衔珠金凤佩","七璜珠玉佩","鎏金点翠佩","紫金碧玺佩","落霞陨星坠"}
		n[21] = {{"布裙","布衣"},{"丝绸长裙","皮衣"},{"五彩裙","鳞甲"},{"龙鳞羽衣","锁子甲"},{"天香披肩","紧身衣"},{"金缕羽衣","钢甲"},{"霓裳羽衣","夜魔披风"},{"流云素裙","龙骨甲"},{"七宝天衣","死亡斗篷"},{"飞天羽衣","神谕披风"},{"穰花翠裙","珊瑚玉衣"},{"金蚕丝裙","金蚕披风"},{"紫香金乌裙","乾坤护心甲"},{"碧霞彩云衣","蝉翼金丝甲"},{"金丝蝉翼衫","金丝鱼鳞甲"},{"五彩凤翅衣","紫金磐龙甲"},{"鎏金浣月衣","混元一气甲"}}
		n[22] = {"腰带","缎带","银腰带",{"水晶腰带","玉树腰带"},{"琥珀腰链","白面狼牙"},{"乱牙咬","魔童大牙"},{"攫魂铃","双魂引"},{"兽王腰带","百窜云"},{"八卦锻带","圣王坠"},"幻彩玉带","珠翠玉环","金蟾含珠","乾坤紫玉带","琉璃寒玉带","蝉翼鱼佩带","磐龙凤翔带","紫霄云芒带"}
		n[23] = {"布鞋","牛皮靴","马靴","侠客履","神行靴","绿靴","追星踏月","九州履","万里追云履","踏雪无痕","平步青云","追云逐电","乾坤天罡履","七星逐月靴","碧霞流云履","金丝逐日履","辟尘分光履"}
		n[24] = {"竹编护腕","皮腕","针腕","骨镯","青铜护腕","玛瑙护腕","琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","缚龙筋","凤翎护腕","织锦彩带","冰蚕丝带"}
		n[25] = {"竹编脖环","钢圈","荆棘环","骨环","青铜颈环","玛瑙石环","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","缚龙圈","鸾尾环","织锦颈圈","冰蚕丝圈"}
		n[26] = {"竹藤甲","皮甲","刺甲","骨排甲","青铜披甲","玛瑙软甲","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲","缚龙甲","凤凰彩衣","织锦软褡","冰蚕织甲"}

	self.商品列表={}
		self.商品列表[1]={"方巾*500","簪子*500","布衣*500","布裙*500","布鞋*500","护身符*500","腰带*500","布帽*1000","玉钗*1000","皮衣*1000","丝绸长裙*1000","牛皮靴*1000","五色飞石*1000","缎带*1000"} --建邺城防具店
		self.商品列表[2]={"四叶花*40","草果*40","紫丹罗*40","山药*40","血色茶花*1500","熊胆*2500","丁香水*1500","麝香*1500","金创药*3000","佛光舍利子*25000"} --建邺城药店
		self.商品列表[3]={"折扇*500","红缨枪*500","牛皮鞭*500","曲柳杖*500","铁爪*500","松木锤*500","琉璃珠*500","双短剑*500","青铜短剑*500","柳叶刀*500","青铜斧*500","五色缎带*500","黄铜圈*500","硬木弓*500","细木棒*500","钝铁重剑*500","素纸灯*500","油纸伞*500"} --建邺城药店
		self.商品列表[4]={"铁骨扇*1000","曲尖枪*1000","牛筋鞭*1000","红木杖*1000","天狼爪*1000","镔铁锤*1000","水晶珠*1000","镔铁双剑*1000","铁齿剑*1000","苗刀*1000","开山斧*1000","幻彩银纱*1000","精钢日月圈*1000","铁胆弓*1000","金丝魔棒*1000","桃印铁刃*1000","竹骨灯*1000","红罗伞*1000"} --建邺城药店
		self.商品列表[5]={"摄妖香*1000","洞冥草*500","飞行符*500"}
		self.商品列表[6]={"飞行符*500","乾坤袋*7000","白色导标旗*20000",} --罗道人
		self.商品列表[7]={"面具*5000","梅花簪子*5000","鳞甲*5000","五彩裙*5000","马靴*5000"}
		self.商品列表[8]={"精钢扇*5000","锯齿矛*5000","乌龙鞭*5000","白椴杖*5000","幽冥鬼爪*5000","八棱金瓜*5000","珍宝珠*5000","龙凤双剑*5000","吴越剑*5000","夜魔弯刀*5000","双面斧*5000","金丝彩带*5000","离情环*5000","紫檀弓*5000","玉如意*5000","赭石巨剑*5000","红灯笼*5000","紫竹伞*5000"}
		self.商品列表[9]={"包子*100"}
		self.商品列表[10]={"乌金三叉戟*9000","双弦钺*9000","青锋剑*9000","竹节双剑*9000","无极丝*9000","青龙牙*9000","铁面扇*9000","点金棒*9000","狼牙锤*9000","钢结鞭*9000","金刺轮*9000","金背大砍刀*9000","墨铁拐*9000","宝雕长弓*9000","翡翠珠*9000","壁玉长铗*9000","鲤鱼灯*9000","锦绣椎*9000"}
		self.商品列表[11]={"纶巾*9000","珍珠头带*9000","水晶腰带*9000","玉树腰带*9000","侠客履*9000","龙鳞羽衣*9000","锁子甲*9000","骷髅吊坠*9000","苍魂珠*9000"}
		self.商品列表[12]={"白玉骨头*200","天青地白*200","龙须草*140"}
		self.商品列表[13]={"摄妖香*1000","洞冥草*500","桃花*500","兰花","蜡烛*500","香*500","黄纸*500"}
		self.商品列表[14]={"女儿红*500"}
		self.商品列表[15]={"九宫坠*14000","江湖夜雨*14000","凤头钗*14000","缨络丝带*14000","神行靴*14000","琥珀腰链*14000","紧身衣*14000","天香披肩*14000","白面狼牙*14000"}
		self.商品列表[16]={}
		self.商品列表[17]={"灵脂*200","曼陀罗花*275","鬼切草*200","佛手*80","九香虫*80","八角莲叶*80","人参*300"}
		self.商品列表[18]={"包子*100"}
		self.商品列表[19]={"香叶*140","百色花*140","鬼切草*200","佛手*80","九香虫*80","八角莲叶*80","人参*300"} --药店老板" then  --建邺
		self.商品列表[20]={"银腰带*5000","珍珠链*5000","腰带*500","护身符*500"} --饰品店老板" then  --建邺
		self.商品列表[39]={}--{"芝麻沁香元宵*15","桂花酒酿元宵*15","细磨豆沙元宵*15","蜜糖腰果元宵*15","山楂拔丝元宵*15","滑玉莲蓉元宵*15","炼兽真经*10"}
		self.商品列表[41]={"展翅高飞*5000000","旗开得胜*5000000","霸王雄风*5000000","独眼观天*5000000","威武不屈*5000000","深藏不露*5000000","异域浓情*5000000","流星天马*5000000","知情达理*5000000","气宇轩昂*5000000","如花似玉*5000000","傲视天下*5000000","铁血豪情*5000000","唯我独尊*5000000","叱咤风云*5000000","异域风情*5000000","假面勇者*5000000","霓裳魅影*5000000","披星戴月*5000000","烈焰燃情*5000000","天雨流芳*5000000","灵光再现*5000000","倾国倾城*5000000"}--副本
		--41是副本
		self.商品列表[42]={"秘制红罗羹*500000","秘制绿芦羹*500000"} --购买秘制烹饪
		self.商品列表[43]={"秘制食谱*100*1","秘制食谱*125*2","秘制食谱*175*4","秘制食谱*250*5","秘制食谱*275*6","秘制食谱*300*7","秘制食谱*325*8","秘制食谱*350*9","秘制食谱*375*10","秘制食谱*1000*11"}
		self.商品列表[45]={"洞冥草*500","桃花*100","摄妖香*1000","兰花*100","高级宠物口粮*1000","宠物口粮*50"}
		-- 45 建邺杂货店老板
		self.商品列表[46]={"香*100","蜡烛*100","黄纸*100"}
		self.商品列表[47]={"飞刀*50000","飞蝗石*55000","铁蒺黎*60000","无影神针*65000","孔雀翎*70000","含沙射影*75000","回龙镊魂镖*80000","寸阴若梦*85000","魔睛子*90000","顺逆神针*100000"}
		self.商品列表[48]={}--{"断穹巨剑*5000","静心禅珠*5000","宁心道符*5000","相思寒针*5000","风舞心经*5000","锢魂命谱*5000","青狮獠牙*5000","冥火炼炉*5000","缚仙蛛丝*5000","煞魂冥灯*5000","九霄龙锥*5000","化怨清莲*5000","真阳令旗*5000","天雷音鼓*5000","寒霜盾戟*5000"}
		self.商品列表[49]={}--{"乾坤金卷*2000","乾坤木卷*2000","乾坤水卷*2000","乾坤火卷*2000","乾坤土卷*2000","定神仙琴*2000","赤炎战笛*2000","护体灵盾*2000","惊兽云尺*2000","战神宝典*2000"}
		self.商品列表[50]={}--{"干将莫邪*1500","慈悲*1500","曼陀罗*1500","救命毫毛*1500","伏魔天书*1500","普渡*1500","镇海珠*1500","奇门五行令*1500","失心钹*1500","五火神焰印*1500","九幽*1500","忘情*1500","月影*1500","斩魔*1500","金蟾*1500"}
		self.商品列表[51]={"九霄清心丸*100000","天机培元丹*100000"}
		self.商品列表[52]={"醉仙果*40000","七珍丸*20000","凝气丸*20000","舒筋活络丸*20000","固本培元丹*20000","九转续命丹*20000","十全大补丸*20000"} --PK药品
		self.商品列表[53]={"醉仙果*1","七珍丸*1","凝气丸*1","舒筋活络丸*1","固本培元丹*1","九转续命丹*1","十全大补丸*1"} --PK药品
		self.商品列表[54]={"高级魔兽要诀*200","召唤兽内丹*100",}  --购买矿产  采矿大师
	--21 23 为珍品商人

	for i=1,18 do
		self.商品列表[16][i]=n[i][5].."*14000"
	end
		self.商品列表[44]={              --副本官员积分兑换
		-- "玄天残卷·上卷*500",
		-- "玄天残卷·中卷*100",
		-- "玄天残卷·下卷*500",
		"圣兽丹*1500",
		"玲珑宝图*300",
		"130无级别礼包*6000",
		"150无级别礼包*10000",
		"160无级别礼包*15000",
		"召唤兽内丹*300",
		"高级召唤兽内丹*600",
		"灵兜兜*18888",
		"附魔宝珠*500",
		"珍珠*500*150",
		"珍珠*800*160",
		"灵饰特效宝珠*8000",
		"高级魔兽要诀*500",
		"精炼之锤低*100",
		"精炼之锤中*500",
		"精炼之锤高*1000",
		"随机经验大礼包*1000",
		"随机仙玉大礼包*5000",
		}
	 --云游道人
	self.商品列表[24]={"高级魔兽要诀*8000000","魔兽要诀*500000","随机怪物卡片*200000","召唤兽内丹*500000","高级召唤兽内丹*10000000"} --云游道人 --云游道人
	 --宝石商人
	 -------------------超级技能
		MRSPXZ={}
		local cla=(取随机数(1,50)/100+1) * 1500000 --改价的话重置赐福材料价格()里面也要改
		local clb=(取随机数(1,50)/100+1) * 150000
		MRSPXZ={神兽涎={数量=9,价格=cla},仙露小丸子={数量=99,价格=clb}}
		-------------------复制给初始化脚本里的商店列表
	self.商品列表[32]={"珍珠*2000000*160","钟灵石*3000000*5","翡翠石*1000000*5","舍利子*1000000*5","红玛瑙*1000000*5",
                          "黑宝石*1000000*5","光芒石*1000000*5","月亮石*1000000*5","太阳石*1000000*5","精魄灵石*3000000*5","玉葫灵髓*5000000",
                          "如意丹*10000","易经丹*2000000","金鸦火羽（高级）*250000","精致碎石锤*1000000*1","福禄丹*3000000","天赋符*2000000",
                          "神兽涎*" ..MRSPXZ["神兽涎"].价格 ,"仙露小丸子*" ..MRSPXZ["仙露小丸子"].价格,"清灵净瓶*9999" }
end

function 商店处理类:刷新珍品()
	local 等级范围={5,8,6,7,6,7,6,7,8,6,5,7,8,6,6,7,8,7}
	for n=21,23 do
		self.商品列表[n]={}
		for i=1,取随机数(17,20) do
			local 等级=等级范围[取随机数(1,#等级范围)]
			local 名称=取随机装备名称(等级)
			local 价格=0
			if 等级==5 then
				价格=200000
			elseif 等级==6 then
				价格=300000
			elseif 等级==7 then
				价格=400000
			elseif 等级==8 then
				价格=500000
			else
				价格=35000000
			end
			self.商品列表[n][i]=名称.."*"..价格
		end
	end
end

function 商店处理类:设置神秘宝箱(id)
	神秘宝箱[id]={}
	local 名称=""
	local 参数={}
	local 备注=""
	local 说明=""
	中奖=取随机数(1,24)
	神秘宝箱[id]={
		[1]={
			名称="宝石礼盒",
		},
		[2]={
			名称="高级魔兽要诀",
		},
		[3]={
			名称="宝石礼盒",
		},
		[4]={
			名称="太阳石",
		},
		[5]={
			名称="灵饰指南书",
		},
		[6]={
			名称="红玛瑙",
		},
		[7]={
			名称="月亮石",
		},
		[8]={
			名称="黑宝石",
		},
		[9]={
			名称="修炼果",
		},
		[10]={
			名称="灵兜兜",
		},
		[11]={
			名称="制造指南书",
		},
		[12]={
			名称="神兜兜",
		},
		[13]={
			名称="宝石礼盒",
		},
		[14]={
			名称="星辉石",
		},
		[15]={
			名称="百炼精铁",
		},
		[16]={
			名称="舍利子",
		},
		[17]={
			名称="元灵晶石",
		},
		[18]={
			名称="陨铁",
		},
		[19]={
			名称="战魄",
		},
		[20]={
			名称="圣兽丹",
		},
		[21]={
			名称="高级魔兽要诀",
		},
		[22]={
			名称="玲珑宝图",
		},
		[23]={
			名称="星辉石",
		},
		[24]={
			名称="星辉石",
		},
		中奖=中奖,
	}
end

function 商店处理类:神奇宝箱(id)--1000仙玉一次抽奖
	神秘宝箱[id]={}
	local 名称=""
	local 参数={}
	local 备注=""
	local 说明=""
	中奖=取随机数(1,24)
	local 奖池 = {"高级藏宝图","高级召唤兽内丹","高级魔兽要诀","魔兽要诀","附魔宝珠","灵兜兜","神兜兜","月亮石","黑宝石","光芒石","金刚石","定魂珠","玲珑宝图","高级宝石礼盒"}
	for i=1,24 do
		神秘宝箱[id][i] = {}
		神秘宝箱[id][i].名称 =奖池[取随机数(1,#奖池)]
	end
	神秘宝箱[id].中奖=中奖
end

function 商店处理类:赤金宝箱(id)
	神秘宝箱[id]={}
	local 名称=""
	local 参数={}
	local 备注=""
	local 说明=""
	中奖=取随机数(1,24)
	local 奖池 = {"高级藏宝图","彩果","九转金丹","修炼果","高级魔兽要诀","魔兽要诀","超级金柳露","红玛瑙","舍利子","月亮石","黑宝石","光芒石","金刚石","定魂珠","龙鳞","避水珠","夜光珠","星辉石","金银锦盒","分解符","海马","中级宝石礼盒","高级宝石礼盒"}
	for i=1,24 do
		神秘宝箱[id][i] = {}
		神秘宝箱[id][i].名称 =奖池[取随机数(1,#奖池)]
	end
	神秘宝箱[id].中奖=中奖
end

function 商店处理类:乌金宝箱(id)
	神秘宝箱[id]={}
	local 名称=""
	local 参数={}
	local 备注=""
	local 说明=""
	中奖=取随机数(1,24)
	local 奖池 = {"藏宝图","彩果","魔兽要诀","超级金柳露","红玛瑙","舍利子","月亮石","黑宝石","光芒石","金刚石","定魂珠","龙鳞","避水珠","夜光珠","金柳露","金银锦盒","五味露","中级宝石礼盒"}
	for i=1,24 do
		神秘宝箱[id][i] = {}
		神秘宝箱[id][i].名称 =奖池[取随机数(1,#奖池)]
	end
	神秘宝箱[id].中奖=中奖
end

function 商店处理类:黄铜宝箱(id)
	神秘宝箱[id]={}
	local 名称=""
	local 参数={}
	local 备注=""
	local 说明=""
	中奖=取随机数(1,24)
	local 奖池 = {"藏宝图","魔兽要诀","超级金柳露","红玛瑙","舍利子","月亮石","黑宝石","光芒石","青龙石","龙鳞","避水珠","夜光珠","月华露","白虎石","金柳露","玄武石","朱雀石","低级宝石礼盒"}
	for i=1,24 do
		神秘宝箱[id][i] = {}
		神秘宝箱[id][i].名称 =奖池[取随机数(1,#奖池)]
	end
	神秘宝箱[id].中奖=中奖
end

function 商店处理类:更新(dt) end
function 商店处理类:显示(x,y) end

return 商店处理类