-- @Author: baidwwy
-- @Date:   2025-04-09 22:20:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-09 22:20:28
do local ret= {
    铃铛：万年魔灵= {
        难度=1.2,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=20,
        ITEM= {
            随机仙玉礼包=1,
            宝石=1,
            怪物卡片=2,
            强化石=1,
            装备书铁=2,
            随机经验小礼包=1,
            随机仙玉小礼包=1,
            超级兽诀·碎片=1,
            特殊兽诀·碎片=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.8,
        银子=1.2
    }
    ,
    镖王任务= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=1,
        ITEM= {
            怪物卡片=1,
            宝石=1,
            杂物=1,
            鬼谷子=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    剑会5v5：胜利= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=86,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    车迟斗法三妖= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=64,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    二十八星宿= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=58,
        ITEM= {
            星辉石=1,
            随机仙玉礼包=1,
            超级兽诀·碎片=1,
            特殊兽诀·碎片=1,
            藏宝图=1,
            随机经验微礼包=1,
            鬼谷子=1,
            随机仙玉微礼包=1,
            月华露=1,
            钟灵石=1,
            高级藏宝图=1,
            精魄灵石=1,
            随机经验礼包=1,
            玄灵珠=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.9,
        银子=3
    }
    ,
    地煞：星级3= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=44,
        ITEM= {
            随机仙玉礼包=1,
            超级兽诀·碎片=1,
            特技书=1,
            特殊兽诀·碎片=1,
            灵饰特效宝珠=1,
            双加转换符=1,
            随机仙玉小礼包=1,
            不磨符=1,
            随机经验礼包=1,
            随机经验小礼包=1,
            愤怒符=1,
            特效宝珠=1,
            装备特效宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.8,
        银子=1.8
    }
    ,
    地宫51至60= {
        难度=1.6,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=70,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=5,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=5,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=5,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.6,
        银子=1.6
    }
    ,
    投放怪：巡山小妖= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=48,
        ITEM= {
            随机仙玉礼包=1,
            珍珠=1,
            随机经验礼包=1,
            未激活的星石=1,
            摇钱树苗=1,
            吸附石=1,
            玲珑宝图=1,
            钨金=5,
            宝石=1,
            藏宝图=1,
            高级藏宝图=1,
            清灵净瓶=2,
            随机仙玉微礼包=1,
            未激活的符石=1,
            强化石=5,
            元宵=1,
            随机经验微礼包=1,
            镇妖拘魂铃=1,
            杂物=1,
            灵犀之屑=1
        }
        ,
        爆率=60,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    鬼王= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=4,
        ITEM= {
            十万银票=1,
            环装=1,
            强化石=1,
            怪物卡片=1,
            修炼果=2,
            九转金丹=10,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1.5
    }
    ,
    黑神话：星级6= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特技书=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            随机仙玉大礼包=1,
            宠装特效宝珠=1,
            超级兽诀·碎片=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            随机经验大礼包=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            不磨符=1,
            随机经验中礼包=1,
            战魄=1,
            抽奖令牌=1,
            附魔宝珠=1,
            菩提果=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.6,
        银子=1
    }
    ,
    地煞：星级2= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=43,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            随机经验微礼包=1,
            灵饰特效宝珠=1,
            随机仙玉微礼包=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=15,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1.5
    }
    ,
    帮战：PVP胜利= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=30,
        ITEM= {
            杂物=1,
            宝石=1,
            战魄=1,
            随机仙玉中礼包=1,
            陨铁=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    帮战：失败奖励= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=32,
        ITEM= {
            随机经验礼包=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    远古妖魔头目= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=59,
        ITEM= {
            随机仙玉礼包=1,
            超级兽诀·碎片=1,
            特技书=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            不磨符=1,
            随机经验礼包=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=3,
        银子=3
    }
    ,
    帮战夺旗：抢夺旗帜= {
        难度=1.2,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=35,
        ITEM= {
            随机经验中礼包=1,
            特技书=1,
            随机仙玉中礼包=1,
            灵饰特效宝珠=1,
            超级兽诀·碎片=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1.5
    }
    ,
    地煞：星级1= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=42,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            随机经验微礼包=1,
            灵饰特效宝珠=1,
            随机仙玉微礼包=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=10,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    车迟斗法三清= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=62,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    自动抓鬼= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=76,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    彩虹：传送大使= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=16,
        ITEM= {
            杂物=1,
            超级兽诀·碎片=1,
            特殊兽诀·碎片=1,
            随机经验微礼包=1,
            宝石=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1
    }
    ,
    地宫1至10= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=65,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=1,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=1,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=1,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.1,
        银子=1
    }
    ,
    帮战伐木：伐木工= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=33,
        ITEM= {
            随机经验微礼包=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    圣兽青龙= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=80,
        ITEM= {
            精魄灵石=1,
            青龙印=2,
            怪物卡片=1
        }
        ,
        爆率=40,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.1
    }
    ,
    黑神话：星级2= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特技书=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            特殊兽诀·碎片=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            菩提果=1,
            灵饰特效宝珠=1,
            随机仙玉小礼包=1,
            装备特效宝珠=1,
            不磨符=1,
            超级兽诀·碎片=1,
            随机经验小礼包=1,
            抽奖令牌=1,
            战魄=1,
            附魔宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.2,
        银子=1
    }
    ,
    远古妖魔领主= {
        难度=1.3,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=60,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            灵饰特效宝珠=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=4,
        银子=4
    }
    ,
    地宫11至20= {
        难度=1.2,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=66,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=2,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=2,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=2,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1.2
    }
    ,
    游泳比赛= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=12,
        ITEM= {
            召唤兽内丹=5,
            随机仙玉礼包=1,
            宝石=1,
            随机经验礼包=1,
            藏宝图=1,
            高级藏宝图=1,
            怪物卡片=1,
            高级召唤兽内丹=2,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.5
    }
    ,
    黑神话：星级1= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特技书=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            特殊兽诀·碎片=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            菩提果=1,
            灵饰特效宝珠=1,
            随机仙玉小礼包=1,
            装备特效宝珠=1,
            不磨符=1,
            超级兽诀·碎片=1,
            随机经验小礼包=1,
            抽奖令牌=1,
            战魄=1,
            附魔宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.1,
        银子=1
    }
    ,
    爆率模板= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=111,
        ITEM= {
            神兽涎=1,
            装备书铁=1,
            未激活的符石=1,
            怪物卡片=1,
            高级召唤兽内丹=1,
            淬灵石=1,
            摇钱树苗=1,
            陨铁=1,
            随机仙玉小礼包=1,
            玲珑宝图=1,
            灵兜兜=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            随机仙玉中礼包=1,
            魔兽要诀=1,
            不磨符=1,
            灵饰书铁=1,
            环装=1,
            元宵=1,
            愤怒符=1,
            特效宝珠=1,
            武器附神锤=1,
            宝宝书铁=1,
            菩提果=1,
            十万银票=1,
            九转金丹=1,
            玄灵珠=1,
            修炼果=1,
            珍珠=1,
            特殊兽诀·碎片=1,
            鬼谷子=1,
            神兜兜=1,
            吸附石=1,
            月华露=1,
            超级兽诀·碎片=1,
            钟灵石=1,
            附魔宝珠=1,
            灵饰特效宝珠=1,
            随机仙玉微礼包=1,
            种族坐骑=1,
            随机经验小礼包=1,
            召唤兽内丹=1,
            随机经验礼包=1,
            随机仙玉礼包=1,
            随机经验微礼包=1,
            灵犀之屑=1,
            精魄灵石=1,
            随机仙玉大礼包=1,
            宝石=1,
            暗器=1,
            随机经验大礼包=1,
            杂物=1,
            装备特效宝珠=1,
            清灵净瓶=1,
            超级兽诀礼盒=1,
            星辉石=1,
            钨金=1,
            高级摄灵珠=1,
            战魄=1,
            藏宝图=1,
            高级藏宝图=1,
            高级魔兽要诀=1,
            特技书=1,
            未激活的星石=1,
            强化石=1,
            特殊兽诀礼盒=1,
            仙露小丸子=1,
            镇妖拘魂铃=1,
            双加转换符=1,
            百万银票=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    妖王= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=77,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    地宫21至30= {
        难度=1.3,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=67,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=3,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=3,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=3,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.3
    }
    ,
    抓鬼= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=3,
        ITEM= {
            强化石=1,
            杂物=1,
            环装=1
        }
        ,
        爆率=100,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    新手活动怪= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=2,
        ITEM= {
            十万银票=1,
            修炼果=1,
            杂物=2,
            宝石=2,
            随机经验礼包=1,
            强化石=2,
            金丹=1,
            装备书铁=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    冒牌猪八戒= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=54,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    摇钱树= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=85,
        ITEM= {
            百万银票=1,
            宝石=8,
            金柳露=10,
            十万银票=1,
            怪物卡片=6,
            超级金柳露=6,
            精魄灵石=6,
            特赦令牌=2,
            彩果=5
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    冒牌大圣= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=54,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    天罡：星级1= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=36,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            随机经验微礼包=1,
            灵饰特效宝珠=1,
            随机仙玉微礼包=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=10,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    冒牌沙僧= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=53,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    六耳猕猴= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=56,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    保卫长安：鼍龙兕怪= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=26,
        ITEM= {
            召唤兽内丹=5,
            随机仙玉礼包=2,
            宝石=1,
            怪物卡片=1,
            藏宝图=1,
            高级藏宝图=1,
            随机经验小礼包=1,
            随机仙玉小礼包=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.7,
        银子=1.7
    }
    ,
    门派闯关= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=11,
        ITEM= {
            十万银票=1,
            随机经验微礼包=1,
            随机仙玉礼包=1,
            未激活的符石=1,
            随机经验礼包=1,
            附魔宝珠=2,
            魔兽要诀=5,
            高级魔兽要诀=2,
            随机仙玉微礼包=1,
            宝石=1,
            强化石=1,
            怪物卡片=1,
            藏宝图=1,
            高级藏宝图=1,
            杂物=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1.1
    }
    ,
    文韵墨香= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=13,
        ITEM= {
            随机经验微礼包=1,
            星辉石=1,
            清灵净瓶=1,
            宝石=1,
            特殊兽诀·碎片=1,
            未激活的符石=1,
            灵犀之屑=1,
            钟灵石=1,
            精魄灵石=1,
            未激活的星石=1,
            强化石=1,
            元宵=1,
            陨铁=1,
            超级兽诀·碎片=1,
            玄灵珠=1,
            吸附石=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    地宫31至40= {
        难度=1.4,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=68,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=4,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=4,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=4,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.4,
        银子=1.4
    }
    ,
    黑神话：星级8= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特殊兽诀·碎片=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            随机仙玉大礼包=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            菩提果=1,
            灵饰特效宝珠=1,
            特技书=1,
            装备特效宝珠=1,
            不磨符=1,
            随机经验大礼包=1,
            超级兽诀·碎片=1,
            抽奖令牌=1,
            战魄=1,
            附魔宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.8,
        银子=1
    }
    ,
    保卫长安：小怪先锋= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=21,
        ITEM= {
            召唤兽内丹=5,
            随机仙玉礼包=1,
            宝石=1,
            随机经验礼包=1,
            藏宝图=1,
            高级藏宝图=1,
            怪物卡片=1,
            高级召唤兽内丹=2,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    圣兽白虎= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=81,
        ITEM= {
            怪物卡片=1,
            精魄灵石=1,
            白虎印=2
        }
        ,
        爆率=40,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.1
    }
    ,
    保卫长安：振威大王= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=27,
        ITEM= {
            召唤兽内丹=5,
            随机经验中礼包=1,
            随机仙玉中礼包=1,
            宝石=1,
            怪物卡片=1,
            藏宝图=1,
            高级藏宝图=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2,
        银子=2
    }
    ,
    保卫长安：魑魅魍魉= {
        难度=1.2,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=25,
        ITEM= {
            召唤兽内丹=5,
            随机经验小礼包=1,
            随机仙玉小礼包=1,
            宝石=1,
            怪物卡片=1,
            藏宝图=1,
            高级藏宝图=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1.5
    }
    ,
    地宫81至90= {
        难度=1.9,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=73,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=5,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=5,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=5,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.9,
        银子=1.9
    }
    ,
    封妖= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=5,
        ITEM= {
            召唤兽内丹=1,
            环装=1,
            未激活的符石=1,
            特技书=1,
            高级召唤兽内丹=1,
            淬灵石=1,
            暗器=1,
            愤怒符=1,
            吸附石=1,
            百万银票=1,
            宠装特效宝珠=1,
            宝石=1,
            双加转换符=1,
            魔兽要诀=1,
            灵饰特效宝珠=1,
            怪物卡片=1,
            元宵=1,
            不磨符=1,
            装备特效宝珠=1,
            宝宝书铁=1,
            高级魔兽要诀=1,
            特效宝珠=1,
            强化石=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.8
    }
    ,
    剑会：胜利= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=5,
            [2]=8
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=28,
        ITEM= {
            陨铁=1,
            随机仙玉微中礼包=1,
            杂物=1,
            宝石=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    冒牌唐僧= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=55,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    帮战：胜利奖励= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=31,
        ITEM= {
            杂物=1,
            宝石=1,
            战魄=1,
            随机仙玉小礼包=1,
            陨铁=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    是俺老孙= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=57,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    全服物品奖励= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=88,
        ITEM= {
            杂物=1
        }
        ,
        爆率=100,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    黑神话：星级9= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特殊兽诀·碎片=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            随机仙玉大礼包=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            菩提果=1,
            灵饰特效宝珠=1,
            特技书=1,
            装备特效宝珠=1,
            不磨符=1,
            随机经验大礼包=1,
            超级兽诀·碎片=1,
            抽奖令牌=1,
            战魄=1,
            附魔宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.9,
        银子=1
    }
    ,
    剑会5v5：失败= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=87,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    龙族= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=84,
        ITEM= {
            青龙印=2,
            神兽涎=1,
            宠装特效宝珠=1,
            白虎印=2,
            精魄灵石=1,
            朱雀印=2,
            宝宝书铁=1,
            玄武印=2,
            仙露小丸子=1
        }
        ,
        爆率=40,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.7,
        银子=1.5
    }
    ,
    圣兽玄武= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=83,
        ITEM= {
            怪物卡片=1,
            玄武印=2,
            精魄灵石=1
        }
        ,
        爆率=40,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.1
    }
    ,
    圣兽朱雀= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=82,
        ITEM= {
            精魄灵石=1,
            朱雀印=2,
            怪物卡片=1
        }
        ,
        爆率=40,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.1
    }
    ,
    裂风兽= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=51,
        ITEM= {
            未激活的符石=1,
            特殊兽诀·碎片=1,
            未激活的星石=1,
            高级魔兽要诀=1,
            随机仙玉微礼包=1,
            超级兽诀·碎片=1,
            杂物=1,
            魔兽要诀=1,
            随机经验小礼包=1,
            随机仙玉小礼包=1,
            抽奖令牌=1,
            随机经验微礼包=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.4,
        银子=1.4
    }
    ,
    初出江湖= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=79,
        ITEM= {
            装备书铁=1,
            灵饰书铁=1,
            杂物=1,
            怪物卡片=1,
            宝宝书铁=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2,
        银子=1
    }
    ,
    天罡：星级6= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=41,
        ITEM= {
            随机经验中礼包=1,
            特技书=1,
            随机仙玉中礼包=1,
            超级兽诀·碎片=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            抽奖令牌=1,
            不磨符=1,
            战魄=2,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=35,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=3,
        银子=3
    }
    ,
    黑神话：星级7= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特殊兽诀·碎片=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            随机仙玉大礼包=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            菩提果=1,
            灵饰特效宝珠=1,
            特技书=1,
            装备特效宝珠=1,
            不磨符=1,
            随机经验大礼包=1,
            超级兽诀·碎片=1,
            抽奖令牌=1,
            战魄=1,
            附魔宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.7,
        银子=1
    }
    ,
    黑神话：星级5= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特技书=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            随机仙玉大礼包=1,
            宠装特效宝珠=1,
            超级兽诀·碎片=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            随机经验大礼包=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            不磨符=1,
            随机经验中礼包=1,
            战魄=1,
            抽奖令牌=1,
            附魔宝珠=1,
            菩提果=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.5,
        银子=1
    }
    ,
    黑神话：星级4= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特技书=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            随机仙玉大礼包=1,
            宠装特效宝珠=1,
            超级兽诀·碎片=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            随机经验大礼包=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            不磨符=1,
            随机经验中礼包=1,
            战魄=1,
            抽奖令牌=1,
            附魔宝珠=1,
            菩提果=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.4,
        银子=1
    }
    ,
    远古妖魔尊主= {
        难度=1.5,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=61,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            不磨符=1,
            抽奖令牌=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=5,
        银子=5
    }
    ,
    黑神话：星级3= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            灵兽星斗盘=1,
            特技书=1,
            愤怒符=1,
            特效宝珠=1,
            特殊清灵仙露=1,
            特殊兽诀·碎片=1,
            宠装特效宝珠=1,
            随机经验中礼包=1,
            双加转换符=1,
            随机仙玉中礼包=1,
            菩提果=1,
            灵饰特效宝珠=1,
            随机仙玉小礼包=1,
            装备特效宝珠=1,
            不磨符=1,
            超级兽诀·碎片=1,
            随机经验小礼包=1,
            抽奖令牌=1,
            战魄=1,
            附魔宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.3,
        银子=1
    }
    ,
    天罡：星级5= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=40,
        ITEM= {
            随机经验中礼包=1,
            特技书=1,
            随机仙玉中礼包=1,
            超级兽诀·碎片=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            抽奖令牌=1,
            不磨符=1,
            战魄=2,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=30,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.5,
        银子=2.5
    }
    ,
    通天塔= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=78,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1
    }
    ,
    地宫91至100= {
        难度=2,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=74,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=5,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=5,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=5,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2,
        银子=2
    }
    ,
    彩虹：场景小怪= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=15,
        ITEM= {
            随机经验礼包=1,
            杂物=1,
            宝石=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    剑会：失败= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=3,
            [2]=6
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=29,
        ITEM= {
            随机仙玉礼包=1,
            杂物=1,
            宝石=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    地煞：星级6= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=47,
        ITEM= {
            随机经验中礼包=1,
            特技书=1,
            随机仙玉中礼包=1,
            超级兽诀·碎片=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            战魄=2,
            不磨符=1,
            抽奖令牌=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=35,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=3,
        银子=3
    }
    ,
    天罡：星级4= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=39,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            特殊兽诀·碎片=1,
            战魄=2,
            灵饰特效宝珠=1,
            抽奖令牌=1,
            双加转换符=1,
            不磨符=1,
            随机仙玉小礼包=1,
            随机经验小礼包=1,
            愤怒符=1,
            特效宝珠=1,
            装备特效宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2,
        银子=2
    }
    ,
    地宫71至80= {
        难度=1.8,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=72,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=5,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=5,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=5,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.8,
        银子=1.8
    }
    ,
    地宫61至70= {
        难度=1.7,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=71,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=5,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=5,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=5,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.7,
        银子=1.7
    }
    ,
    铃铛：小怪= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=18,
        ITEM= {
            超级兽诀·碎片=1,
            强化石=1,
            宝石=1,
            特殊兽诀·碎片=1,
            装备书铁=2,
            怪物卡片=2,
            修炼果=2
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1.1
    }
    ,
    彩虹：仙境泡泡= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=17,
        ITEM= {
            随机经验礼包=1,
            随机仙玉礼包=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.7,
        银子=1
    }
    ,
    冒牌小白龙= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=52,
        ITEM= {
            灵饰书铁=1,
            宝宝书铁=1,
            装备书铁=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    天罡：星级3= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=38,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            双加转换符=1,
            不磨符=1,
            随机仙玉小礼包=1,
            随机经验小礼包=1,
            愤怒符=1,
            特效宝珠=1,
            装备特效宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.8,
        银子=1.8
    }
    ,
    帮战夺旗：夺旗守卫= {
        难度=1.1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=34,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            随机经验微礼包=1,
            灵饰特效宝珠=1,
            随机仙玉微礼包=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.1,
        银子=1.3
    }
    ,
    铃铛：千年魔灵= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=19,
        ITEM= {
            修炼果=2,
            宝石=1,
            特殊兽诀·碎片=1,
            随机经验微礼包=1,
            随机仙玉微礼包=1,
            强化石=1,
            装备书铁=2,
            超级兽诀·碎片=1,
            怪物卡片=2
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1.1
    }
    ,
    地煞：星级5= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=46,
        ITEM= {
            随机经验中礼包=1,
            特技书=1,
            随机仙玉中礼包=1,
            超级兽诀·碎片=1,
            灵饰特效宝珠=1,
            特殊兽诀·碎片=1,
            战魄=2,
            不磨符=1,
            抽奖令牌=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=30,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2.5,
        银子=2.5
    }
    ,
    红孩儿副本= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=89,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    天降辰星= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=14,
        ITEM= {
            修炼果=2,
            超级兽诀·碎片=1,
            强化石=1,
            宝石=1,
            特殊兽诀·碎片=1,
            装备书铁=2,
            随机经验微礼包=1,
            怪物卡片=2
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1.2
    }
    ,
    天罡：星级2= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=37,
        ITEM= {
            超级兽诀·碎片=1,
            特技书=1,
            随机经验微礼包=1,
            灵饰特效宝珠=1,
            随机仙玉微礼包=1,
            不磨符=1,
            特殊兽诀·碎片=1,
            装备特效宝珠=1,
            愤怒符=1,
            特效宝珠=1,
            双加转换符=1
        }
        ,
        爆率=15,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1.5
    }
    ,
    保卫长安：小怪大王= {
        难度=1.1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=24,
        ITEM= {
            召唤兽内丹=5,
            宝石=1,
            怪物卡片=1,
            藏宝图=1,
            随机经验微礼包=1,
            随机仙玉微礼包=1,
            随机经验礼包=2,
            高级藏宝图=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.3,
        银子=1.3
    }
    ,
    投放怪：白骨精= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=49,
        ITEM= {
            随机仙玉礼包=1,
            珍珠=1,
            随机经验礼包=1,
            未激活的星石=1,
            摇钱树苗=1,
            吸附石=1,
            玲珑宝图=1,
            钨金=5,
            宝石=1,
            藏宝图=1,
            高级藏宝图=1,
            清灵净瓶=2,
            随机仙玉微礼包=1,
            未激活的符石=1,
            强化石=5,
            元宵=1,
            随机经验微礼包=1,
            镇妖拘魂铃=1,
            杂物=1,
            灵犀之屑=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    投放怪：狮驼国= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=50,
        ITEM= {
            未激活的符石=1,
            魔兽要诀=1,
            高级魔兽要诀=1,
            随机仙玉微礼包=1,
            杂物=1,
            随机经验小礼包=1,
            随机仙玉小礼包=1,
            未激活的星石=1,
            随机经验微礼包=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1,
        银子=1
    }
    ,
    蚩尤元神= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=75,
        ITEM= {
            超级兽诀·碎片=1,
            战魄=1,
            附魔宝珠=1,
            菩提果=1,
            特殊清灵仙露=1,
            特殊兽诀·碎片=1,
            抽奖令牌=1,
            特效宝珠=1,
            灵兽星斗盘=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=3,
        银子=3
    }
    ,
    车迟斗法雷电雨= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=63,
        ITEM= {
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.2,
        银子=1
    }
    ,
    保卫长安：小怪头目= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=23,
        ITEM= {
            召唤兽内丹=5,
            宝石=1,
            怪物卡片=1,
            藏宝图=1,
            随机经验微礼包=1,
            随机仙玉微礼包=1,
            高级召唤兽内丹=2,
            高级藏宝图=1,
            玲珑宝图=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.1,
        银子=1.1
    }
    ,
    地煞：星级4= {
        难度=1,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=45,
        ITEM= {
            战魄=2,
            随机仙玉礼包=1,
            超级兽诀·碎片=1,
            特技书=1,
            特殊兽诀·碎片=1,
            抽奖令牌=1,
            灵饰特效宝珠=1,
            双加转换符=1,
            随机仙玉小礼包=1,
            不磨符=1,
            随机经验礼包=1,
            随机经验小礼包=1,
            愤怒符=1,
            特效宝珠=1,
            装备特效宝珠=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=2,
        银子=2
    }
    ,
    地宫41至50= {
        难度=1.5,
        书铁= {
            [1]=150,
            [2]=150
        }
        ,
        宝石= {
            [1]=1,
            [2]=5
        }
        ,
        怪物卡片= {
            [1]=1,
            [2]=8
        }
        ,
        宝珠钨金珍珠= {
            [1]=160,
            [2]=160
        }
        ,
        排序=69,
        ITEM= {
            环装=1,
            未激活的符石=1,
            怪物卡片=1,
            元宵=1,
            暗器=1,
            宝宝书铁=1,
            宝石=1,
            菩提果=5,
            装备书铁=1,
            珍珠=1,
            特殊兽诀·碎片=5,
            高级摄灵珠=1,
            钨金=1,
            灵饰书铁=1,
            超级兽诀·碎片=5,
            强化石=1,
            杂物=1
        }
        ,
        爆率=25,
        金丹= {
            [1]=100,
            [2]=200
        }
        ,
        经验=1.5,
        银子=1.5
    }
}

return ret end