-- @Author: baidwwy
-- @Date:   2023-12-31 05:45:37
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-16 20:25:21
local 十八妖王 = class()
function 十八妖王:初始化()
	地图处理类.地图数据[5145]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5145]={}
	地图处理类.地图坐标[5145]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5145]={}
	地图处理类.单位编号[5145]=1000

	地图处理类.地图数据[5146]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5146]={}
	地图处理类.地图坐标[5146]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5146]={}
	地图处理类.单位编号[5146]=1000

	地图处理类.地图数据[5147]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5147]={}
	地图处理类.地图坐标[5147]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5147]={}
	地图处理类.单位编号[5147]=1000

	地图处理类.地图数据[5148]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5148]={}
	地图处理类.地图坐标[5148]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5148]={}
	地图处理类.单位编号[5148]=1000

	地图处理类.地图数据[5149]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5149]={}
	地图处理类.地图坐标[5149]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5149]={}
	地图处理类.单位编号[5149]=1000

	地图处理类.地图数据[5150]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5150]={}
	地图处理类.地图坐标[5150]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5150]={}
	地图处理类.单位编号[5150]=1000

	地图处理类.地图数据[5151]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5151]={}
	地图处理类.地图坐标[5151]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5151]={}
	地图处理类.单位编号[5151]=1000

	地图处理类.地图数据[5152]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5152]={}
	地图处理类.地图坐标[5152]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5152]={}
	地图处理类.单位编号[5152]=1000

	地图处理类.地图数据[5153]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5153]={}
	地图处理类.地图坐标[5153]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5153]={}
	地图处理类.单位编号[5153]=1000

	地图处理类.地图数据[5154]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5154]={}
	地图处理类.地图坐标[5154]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5154]={}
	地图处理类.单位编号[5154]=1000

	地图处理类.地图数据[5155]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5155]={}
	地图处理类.地图坐标[5155]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5155]={}
	地图处理类.单位编号[5155]=1000

	地图处理类.地图数据[5156]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5156]={}
	地图处理类.地图坐标[5156]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5156]={}
	地图处理类.单位编号[5156]=1000

	地图处理类.地图数据[5157]={npc={},单位={},传送圈={}}
	地图处理类.地图玩家[5157]={}
	地图处理类.地图坐标[5157]=地图处理类.地图坐标[1207]
	地图处理类.地图单位[5157]={}
	地图处理类.单位编号[5157]=1000
  self.检测已刷=0
end
local 刷新数据 ={
	[1]={名称="黄风怪",模型="小蚩尤"},[2]={名称="白骨精",模型="小蚩尤"},[3]={名称="狮猁怪",模型="小蚩尤"},[4]={名称="眼魔君",模型="小蚩尤"},
	[5]={名称="蝎子精",模型="小蚩尤"},[6]={名称="红孩儿",模型="小蚩尤"},[7]={名称="六耳猕猴",模型="小蚩尤"},[8]={名称="玉兔精",模型="小蚩尤"},
	[9]={名称="独角兕大王",模型="小蚩尤"},[10]={名称="混世魔王",模型="小蚩尤"},[11]={名称="黑风怪",模型="小蚩尤"},[12]={名称="九尾狐狸",模型="小蚩尤"},
	[13]={名称="妖王之主",模型="蚩尤"},
}

function 十八妖王:活动定时器()
  if 服务端参数.分钟+0==0 and os.time() - self.检测已刷 >= 0 then
     self.检测已刷 = os.time() + 120
     self:十八路妖王()
  end
end

function 十八妖王:十八路妖王()
	妖王限制={}
	local 地图范围=5144
	local 结束时间=890
	for n=1,#刷新数据 do
 	  local 地图=地图范围+n
	 	  local 任务id="_"..n.."_"..取随机数(1,999).."1255"..os.time().."_"..随机序列.."_"..取随机数(1,999)
			随机序列=随机序列+1
			local 临时序号 = 取随机数(1,4)
			local xy=地图处理类.地图坐标[地图]:取随机点()
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=结束时间,
				玩家id=id,
				队伍组={},
				名称=刷新数据[n].名称,
				模型=刷新数据[n].模型,
				称谓="★★★★★妖王★★★★★",
				x=xy.x,
				y=xy.y,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=1255
			}
			地图处理类:添加单位(任务id)
	end
	广播消息({内容=format("#Y(十八路妖王) #G各路妖王再一次出现再各界世界里了,大家快去挑战获得更多的顶级宝物吧!"),频道="xt"})
end

function 取妖王重复(id)
	local 数量=0
	for i=1,#刷新数据 do
		local 类型 = 刷新数据[i].名称
		if 十八路妖王[类型] and 十八路妖王[类型].当前斩妖者 and 十八路妖王[类型].当前斩妖者.ID == id then
			数量 = 数量 + 1
		end
	end
	return 数量
end

function 十八妖王:妖王排行()
	for i in pairs(战斗准备类.战斗盒子) do
    if 战斗准备类.战斗盒子[i].战斗类型==100224 then
      战斗准备类.战斗盒子[i]:结束战斗(0,0,1)
    end
  end
	for i=1,#刷新数据 do
		local 类型 = 刷新数据[i].名称
		if 十八路妖王[类型] and #十八路妖王[类型] > 0 then
			local 临时主宰 = DeepCopy(十八路妖王[类型][1])
			local 当前斩妖者
			if 十八路妖王[类型].当前斩妖者 then
				当前斩妖者 = DeepCopy(十八路妖王[类型].当前斩妖者)
			end
			十八路妖王[类型]={}
			if 当前斩妖者==nil then
				十八路妖王[类型].当前斩妖者 = 临时主宰
				广播消息({内容=format("#B(斩妖排行) #G在本次斩妖大赛挑战赛中，%s力压群雄，获得新一届%s!",临时主宰.名称,类型),频道="xt"})
			elseif 临时主宰.积分 > 当前斩妖者.积分 and 临时主宰.ID ~= 当前斩妖者.ID then
				十八路妖王[类型].当前斩妖者 = 临时主宰
				广播消息({内容=format("#B(斩妖排行) #G在本次斩妖大赛挑战赛中，%s力压%s，获得新一届%s!",临时主宰.名称,当前斩妖者.名称,类型),频道="xt"})
			else
				十八路妖王[类型].当前斩妖者 = 当前斩妖者
				广播消息({内容=format("#B(斩妖排行) #G在本次斩妖大赛挑战赛中，%s未能超过%s的伤害记录，恭喜%s蝉联新一届%s界主!",临时主宰.名称,当前斩妖者.名称,类型,当前斩妖者.名称),频道="xt"})
			end
			if 玩家数据[十八路妖王[类型].当前斩妖者.ID] then
				if 取妖王重复(十八路妖王[类型].当前斩妖者.ID) < 3 then
					玩家数据[十八路妖王[类型].当前斩妖者.ID].角色:添加称谓(类型,类型)
				end
			end
		end
	end
end

function 十八妖王:取妖王存在(id,地图编号) --战斗中主宰属性
	for i=1,#刷新数据 do
		local 类型 = 刷新数据[i].名称
		if 十八路妖王[类型] and 十八路妖王[类型].当前斩妖者 and 十八路妖王[类型].当前斩妖者.ID == id  and 地图编号 == 5144+i then
			return true
		end
	end
end

function 十八妖王:取妖王存在类型(id) --PK死亡查找妖王类型
	local 妖王类型={}
	for i=1,#刷新数据 do
		local 类型 = 刷新数据[i].名称
		if 十八路妖王[类型] and 十八路妖王[类型].当前斩妖者 and 十八路妖王[类型].当前斩妖者.ID == id  then
			妖王类型[#妖王类型+1] = 类型
		end
	end
	return 妖王类型
end

function 十八妖王:处理妖王称谓(id)
	for i=1,#刷新数据 do
		local 类型 = 刷新数据[i].名称
		if 十八路妖王[类型] and 十八路妖王[类型].当前斩妖者 and 十八路妖王[类型].当前斩妖者.ID == id and 取妖王重复(id) <= 3 then
			玩家数据[十八路妖王[类型].当前斩妖者.ID].角色:添加称谓(类型,类型)
		else
			玩家数据[id].角色:删除称谓(类型)
		end
	end
end

__GWdh111[1255]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
  对话数据.对话="你是想来挑战本妖王的吗?"
  对话数据.选项={"这就宰你","查看当前地图斩妖者","告辞"}
  if 十八路妖王[任务数据[标识].名称] and 十八路妖王[任务数据[标识].名称].当前斩妖者 and 十八路妖王[任务数据[标识].名称].当前斩妖者.ID ==数字id then
  	对话数据.选项[#对话数据.选项+1] = "放弃妖王"
  end
  return 对话数据
end

__GWdh222[1255]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="这就宰你" then
      if 任务数据[玩家数据[数字id].地图单位.标识] == nil then return  end
      if 取妖王重复(数字id) >= 3 then 添加最后对话(数字id,"你当前已经是3个妖王地图斩妖者了，无法继续挑战妖王！") return end
      if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/该活动要求全员等级达到155级，队伍中有成员等级不符合要求") return  end
      if 妖王限制[数字id] and 妖王限制[数字id].次数 >= 3 then 常规提示(数字id,"#Y/你本轮已经累计挑战过3次妖王，无法继续挑战") return end
      if 妖王限制[数字id] and 妖王限制[数字id][任务数据[玩家数据[数字id].地图单位.标识].名称] then 常规提示(数字id,"#Y/你本轮已经挑战过该妖王了，无法继续挑战") return end
      if 妖王限制[数字id] == nil then 妖王限制[数字id]={次数=1,[任务数据[玩家数据[数字id].地图单位.标识].名称]=true} end
      战斗准备类:创建战斗(数字id+0,100224,玩家数据[数字id].地图单位.标识)
      任务数据[玩家数据[数字id].地图单位.标识].战斗=true
      玩家数据[数字id].地图单位=nil
      return

	elseif 事件=="查看当前地图斩妖者" then
		local 类型 = 任务数据[玩家数据[数字id].地图单位.标识].名称
		if 十八路妖王[类型] and 十八路妖王[类型].当前斩妖者 then
			添加最后对话(数字id,string.format("当前该地图斩妖者信息如下(伤害为0时为杀人争夺):\n\n名称：%s(%s)\n\n等级：%s\n\n伤害：%s\n\n门派：%s",十八路妖王[类型].当前斩妖者.名称,十八路妖王[类型].当前斩妖者.ID,十八路妖王[类型].当前斩妖者.等级,十八路妖王[类型].当前斩妖者.积分,十八路妖王[类型].当前斩妖者.门派))
		else
			添加最后对话(数字id,"当前该地图还没有斩妖者哦！")
		end
	elseif 事件=="放弃妖王" then
		local 类型 = 任务数据[玩家数据[数字id].地图单位.标识].名称
		if 十八路妖王[类型] and 十八路妖王[类型].当前斩妖者 and 十八路妖王[类型].当前斩妖者.ID ==数字id then
      玩家数据[数字id].角色:删除称谓(类型)
      十八路妖王[类型].当前斩妖者=nil
      添加最后对话(数字id,"放弃妖王成功")
		else
			添加最后对话(数字id,"你不是该妖王的斩杀者无法放弃")
		end
  end
end
function 完成十八路妖王(任务id,id组,战斗类型)
  if 任务数据[任务id] then
    for i=1,#id组 do
      local id = id组[i]
      local 队伍人数 = #id组
      local 等级 = 玩家数据[id].角色.等级
if 任务数据[任务id].名称 == "黄风怪" then
    local 经验=等级*取随机数(12000,13000)
    local 银子=等级*取随机数(100,150)+200000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "白骨精" then
    local 经验=等级*取随机数(12000,14000)
    local 银子=等级*取随机数(100,160)+200000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "狮猁怪" then
    local 经验=等级*取随机数(12000,14000)
    local 银子=等级*取随机数(110,160)+200000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=50 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="未激活的星石"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "眼魔君" then
    local 经验=等级*取随机数(12000,15000)
    local 银子=等级*取随机数(120,160)+200000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=50 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="未激活的星石"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "蝎子精" then
    local 经验=等级*取随机数(13000,15000)
    local 银子=等级*取随机数(130,180)+200000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=50 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="未激活的星石"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "红孩儿" then
    local 经验=等级*取随机数(13000,16000)
    local 银子=等级*取随机数(140,180)+250000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=50 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="摇钱树苗"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "六耳猕猴" then
    local 经验=等级*取随机数(15000,18000)
    local 银子=等级*取随机数(150,200)+250000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=55 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "玉兔精" then
    local 经验=等级*取随机数(13000,18000)
    local 银子=等级*取随机数(160,200)+260000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=60 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="装备特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="特技书"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=38 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=55 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=80 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的星石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "独角兕大王" then
    local 经验=等级*取随机数(15000,19000)
    local 银子=等级*取随机数(170,220)+300000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=65 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="神兜兜礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="装备特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="灵饰特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="战魄"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,3,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=75 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=90 then
        local 名称="陨铁"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "混世魔王" then
    local 经验=等级*取随机数(15000,18000)
    local 银子=等级*取随机数(180,250)+350000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=70 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="修炼果礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="装备特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="修炼果"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
       elseif 奖励参数<=50 then
        local 名称="战魄"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(5,15),nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
     elseif 奖励参数<=80 then
        local 名称="神兜兜礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=90 then
        local 名称="陨铁"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "黑风怪" then
    local 经验=等级*取随机数(16000,18000)
    local 银子=等级*取随机数(190,250)+400000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=75 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=10 then
        local 名称="修炼果礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="灵饰特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="装备特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,3,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="神兜兜礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="超级兽诀·碎片"
         玩家数据[id].道具:给予超链接道具(id,名称,3,nil,链接)
    elseif 奖励参数<=55 then
        local 名称="超级魔兽要诀"
         玩家数据[id].道具:给予超链接道具(id,名称,3,nil,链接)
      elseif 奖励参数<=56 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,3,nil,链接)
      elseif 奖励参数<=65 then
        local 名称="特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称="特技书"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的星石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "九尾狐狸" then
    local 经验=等级*取随机数(12000,14000)
    local 银子=等级*取随机数(200,250)+450000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=80 then
      local 奖励参数=取随机数(1,200)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
     if 奖励参数<=80 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,8,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="修炼果礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=130 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=150 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,4,nil,链接)
      elseif 奖励参数<=155 then
        local 名称="特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=160 then
        local 名称="装备特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=161 then
        local 名称="超级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=180 then
        local 名称="神兜兜礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=181 then
        local 名称="特技书"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=182 then
        local 名称="愤怒符"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=185 then
        local 名称="战魄"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
		elseif 任务数据[任务id].名称 == "妖王之主" then
    local 经验=等级*取随机数(18000,20000)
    local 银子=等级*取随机数(220,260)+500000
    玩家数据[id].角色:添加经验(经验,"木车")
    玩家数据[id].角色:添加银子(银子,"木车",1)
    if 取随机数()<=90 then
      local 奖励参数=取随机数(1,200)
      链接={提示=format("#S(十八路妖王)#R/%s#Y/在#R/斩杀妖王活动中#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
      if 奖励参数<=50 then
        local 名称="特殊兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,10,nil,链接)
      elseif 奖励参数<=105 then
        local 名称="神兜兜礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=120 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=150 then
        local 名称="超级兽诀·碎片"
        玩家数据[id].道具:给予超链接道具(id,名称,5,nil,链接)
      elseif 奖励参数<=151 then
        local 名称="特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=152 then
        local 名称="超级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=153 then
        local 名称="装备特效宝珠"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=180 then
        local 名称="修炼果礼包"
        玩家数据[id].道具:给予超链接道具(id,名称,2,nil,链接)
      elseif 奖励参数<=185 then
        local 名称="特技书"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=186 then
        local 名称="愤怒符"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=190 then
        local 名称="战魄"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    end
    end
  end
end
return 十八妖王
