-- @Author: baidwwy
-- @Date:   2024-03-05 15:36:07
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-22 11:07:10
local 地煞星 = class()
function 地煞星:初始化()
	self.随机名称 = {"地阴星","地壮星","地数星","地耗星","地健星","地刑星","地狗星","地劣星","地恶星","地角星","地平星","地魂星","地囚星","地藏星",
		"地魔星","地空星","地伏星","地全星","地理星","地隐星","地羁星","地异星","地乐星","地捷星","地速星","地镇星","地文星","地正星","地辟星","地阖星",
		"地强星","地暗星","地佐星","地会星","地辅星","地兽星","地灵星","地佑星","地彗星","地微星","地暴星","地猖星","地狂星","地默星","地猛星","地奇星",
		"地英星","地威星","地煞星","地魁星","地勇星","地杰星","地雄星",
	 }
	 self.锦衣={"青花瓷","花间梦","鹿角弯弯","从军行","水云归","飞天舞","羽仙歌"}
	 self.星魂={"泽被星魂","隐忍星魂","结义星魂","磨砺星魂","平和星魂","仁人星魂","霸道星魂","王者星魂"}
end
function 地煞星:活动定时器()
	if 服务端参数.分钟+0==0 and 服务端参数.秒+0==2 then
		for i=1,2 do
		self:刷新资源()
		end
	end
end

function 地煞星:刷新资源()
	local 任务id
	local 地图
	local xy
	local 战斗名称
	local 名称
	local 武器等级
	local 模型
	local mp
	local 地图范围={1506,1091,1193,1514,1142,1198,1131,1512,1140,1513,1146,1201,1203}
	local dtmc=""
	local dttab={}
	 for i=1,10 do
    local sj=取随机数(1,#地图范围)
		dttab[i]=地图范围[sj]
		if i==10 then
			 dtmc=dtmc..取地图名称(地图范围[sj])
		else
			dtmc=dtmc..取地图名称(地图范围[sj]).."、"
		end
		table.remove(地图范围,sj)
	 end
	 local gwmc = {"初出茅庐","初出茅庐","小有所成","小有所成","伏虎斩妖","伏虎斩妖","御风神行","御风神行"}
	 for i=1,3 do --1星共4只 2星3只 其他2只
		for n=1,3 do
			任务id=取唯一任务(206)
			地图=dttab[n]
			xy=地图处理类.地图坐标[地图]:取随机点()
			战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
			名称 = gwmc[n]..战斗名称
			武器等级 = 90
			模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
			mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]
			local nandu = 1
			if n==3 then
				 nandu=2
			end

			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3000,
				玩家id=0,
				名称=名称,
				战斗名称=战斗名称,
				模型=模型,
				门派=mp,
				难度=nandu,
				武器=取角色等级武器(模型,武器等级),
				武器等级=武器等级,
				等级=等级,
				x=xy.x,
				y=xy.y,
				销毁=true,
				炫彩=取染色id(模型),
				炫彩组=取炫彩染色(随机颜色[取随机数(1,#随机颜色)]),
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=206
			}
			地图处理类:添加单位(任务id)
		end
	 end

	 for n=4,8 do --2-4星  2星3只 其他2只
		任务id=取唯一任务(206)
		地图=dttab[n]
		xy=地图处理类.地图坐标[地图]:取随机点()
		战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
		名称 = gwmc[n]..战斗名称
		武器等级 = 120
		模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
		mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]
		local nandu = 2
		if n==5 or n==6 then
			 nandu=3
		 elseif n==7 or n==8 then
			 nandu=4
		end

		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3000,
			玩家id=0,
			名称=名称,
			战斗名称=战斗名称,
			模型=模型,
			门派=mp,
			难度=nandu,
			武器=取角色等级武器(模型,武器等级),
			武器等级=武器等级,
			等级=等级,
			x=xy.x,
			y=xy.y,
			销毁=true,
			炫彩=取染色id(模型),
			炫彩组=取炫彩染色(随机颜色[取随机数(1,#随机颜色)]),
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=206
		}
		地图处理类:添加单位(任务id)
	end
	--------------5星
	任务id=取唯一任务(206)
	地图=dttab[9]
	xy=地图处理类.地图坐标[地图]:取随机点()
	战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
	名称 = "履水吐焰"..战斗名称
	武器等级 = 150
	模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
	mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]

	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3000,
		玩家id=0,
		名称=名称,
		战斗名称=战斗名称,
		模型=模型,
		门派=mp,
		武器=取角色等级武器(模型,武器等级),
		武器等级=武器等级,
		等级=等级,
		难度=5,
		销毁=true,
		x=xy.x,
		y=xy.y,
		锦衣=self.锦衣[取随机数(1,#self.锦衣)],
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=206
	}
	地图处理类:添加单位(任务id)
	--------------6星
	任务id=取唯一任务(206)
	地图=dttab[10]
	xy=地图处理类.地图坐标[地图]:取随机点()
	战斗名称 = self.随机名称[取随机数(1,#self.随机名称)]
	名称 = "摄魂追魄"..战斗名称
	武器等级 = 160
	模型 = Qu随机角色[取随机数(1,#Qu随机角色)]
	mp =Qu角色属性[模型].门派[取随机数(1,#Qu角色属性[模型].门派)]
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=3000,
		玩家id=0,
		名称=名称,
		战斗名称=战斗名称,
		模型=模型,
		门派=mp,
		武器=取角色等级武器(模型,武器等级),
		武器等级=武器等级,
		等级=等级,
		难度=6,
		销毁=true,
		x=xy.x,
		y=xy.y,
		锦衣=self.锦衣[取随机数(1,#self.锦衣)],
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=206
	}
	地图处理类:添加单位(任务id)
广播消息({内容=format("神秘的地煞星带着天界宝物降临在了#Y%s#W一带，只有智勇双全的强者才有机缘获得宝物，少侠敢来挑战么？#80",dtmc),频道="xt"})
end

function 地煞星:怪物对话内容(id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 任务数据[标识].zhandou==nil then
		对话数据.对话="嘿嘿，要不要来切磋一把？要是能赢我，我就送你们一样宝贝。"
		对话数据.选项={"我准备好了！","路过瞻仰一下！"}
	else
		对话数据.对话="我正在战斗中，请勿打扰。"
	end
	return 对话数据
end

function 地煞星:对话事件处理(id,名称,事件,类型,rwid)
	if 任务数据[rwid].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
	if 玩家数据[id].队伍==0 then  常规提示(id,"#Y/你必须组队才能挑战我！") return  end
	if 取队伍人数(id)<5 and 调试模式==false then 常规提示(id,"#Y挑战地煞星最少必须由五人进行") return  end
	if 取等级要求(id,60)==false and 调试模式==false then 常规提示(id,"#Y/队伍中有成员等级不符合要求") return  end
	if 事件=="我准备好了！" then
		if 任务数据[rwid].难度>=2 and 辅助内挂类:是否明雷挂机中(id)==false then
			 local 队伍id=玩家数据[id].队伍
			for n=1,#队伍数据[队伍id].成员数据 do
				local cyid=队伍数据[队伍id].成员数据[n]
				if 玩家数据[cyid].角色.初出茅庐地煞星==nil then
					添加最后对话(id,"队伍中"..玩家数据[cyid].角色.名称.."需要挑战过“初出茅庐地煞星”才能和我切磋哦。")
					 return
				end
			end
		end
		if 任务数据[rwid].难度 >= 5 then
			战斗准备类:创建战斗(id,111126,rwid)
			  任务数据[rwid].zhandou=true
		 else
			战斗准备类:创建战斗(id,111125,rwid)
			  任务数据[rwid].zhandou=true
		end
	end
end

function 地煞星:战斗胜利处理(id组,战斗类型,任务id)
	local id=id组[1]
	if 任务数据[任务id]==nil then
		return
	end
	local 难度=任务数据[任务id].难度
	for n=1,#id组 do
		local cyid=id组[n]
		local 等级=玩家数据[cyid].角色.等级
		local dxmc = "地煞：星级"..难度
		local 经验=等级*取随机数(3500,3900)+难度*50000
		local 银子=等级*800+难度*16000
		玩家数据[cyid].角色:添加经验(经验*HDPZ[dxmc].经验,"地煞星",1)
		玩家数据[cyid].角色:添加银子(qz(银子*HDPZ[dxmc].银子),"地煞星",1)
		玩家数据[cyid].角色:添加每日活跃度(cyid, 1)
		if 难度==1 then
			 玩家数据[cyid].角色.初出茅庐地煞星=true
		end

		if 取随机数()<=HDPZ[dxmc].爆率 then
			local 链接 = {提示=format("#S(地煞星)#Y/%s对#G%s#Y的武艺深表佩服，特送上一个珍藏很久的",任务数据[任务id].名称,玩家数据[cyid].角色.名称),频道="xt",结尾="#80"}
								local 名称,数量,参数=生成产出(产出物品计算(HDPZ[dxmc].ITEM),dxmc)
								if 数量== 9999 then --环
									玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
								else
									玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
				end
		   end
	end
	地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
	任务数据[任务id]=nil
end
return 地煞星























