-- @Author: baidwwy
-- @Date:   2024-05-23 06:02:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-07-31 02:44:06
local 天降辰星 = class()
function 天降辰星:初始化()
	self.活动开关=false
	self.数据={}
	self.NPC={
		{名称="子鼠",模型="鼠先锋",x=67,y=141,方向=1,地图=1001}
		,{名称="丑牛",模型="踏云兽",x=500,y=214,方向=1,地图=1001}
		,{名称="寅虎",模型="噬天虎",x=17,y=101,方向=1,地图=1193}
		,{名称="卯兔",模型="兔子怪",x=134,y=20,方向=1,地图=1193}
		,{名称="辰龙",模型="蛟龙",x=27,y=6,方向=0,地图=1501}
		,{名称="巳蛇",模型="千年蛇魅",x=260,y=120,方向=0,地图=1501}
		,{名称="午马",模型="马面",x=60,y=22,方向=0,地图=1506}
		,{名称="未羊",模型="羊头怪",x=75,y=64,方向=0,地图=1514}
		,{名称="申猴",模型="长眉灵猴",x=125,y=12,方向=0,地图=1514}
		,{名称="酉鸡",模型="雷鸟人",x=67,y=24,方向=2,地图=1173}
		,{名称="戌犬",模型="狼",x=291,y=72,方向=0,地图=1173}
		,{名称="亥猪",模型="野猪",x=516,y=81,方向=0,地图=1173}
	}
	self.活动时间=QJHDSJ["天降辰星"]
end

function 天降辰星:活动定时器()
	if self.活动开关 then
		if self.开启Time-os.time()<0 then
			self:关闭活动()
		end
	else
		if self.活动时间.日期=="每天" then
			if self.活动时间.时==服务端参数.小时+0 and self.活动时间.分==服务端参数.分钟+0 and self.活动时间.秒<=服务端参数.秒+0 then
				self:开启活动()
			end
		else
			local zhouji=tonumber(os.date("%w", os.time()))
			if zhouji==self.活动时间.日期 then
				if self.活动时间.时==服务端参数.小时+0 and self.活动时间.分==服务端参数.分钟+0 and self.活动时间.秒<=服务端参数.秒+0 then
					self:开启活动()
				end
			elseif self.活动时间.日期=="周135" and (zhouji==1 or zhouji==3 or zhouji==5) then
				if self.活动时间.时==服务端参数.小时+0 and self.活动时间.分==服务端参数.分钟+0 and self.活动时间.秒<=服务端参数.秒+0  then
					self:开启活动()
				end
			elseif self.活动时间.日期=="周246" and (zhouji==2 or zhouji==4 or zhouji==6) then
				if self.活动时间.时==服务端参数.小时+0 and self.活动时间.分==服务端参数.分钟+0 and self.活动时间.秒<=服务端参数.秒+0  then
					self:开启活动()
				end
			end
		end
	end
end

function 天降辰星:开启活动()

	self.开启Time=os.time()+3600
	for n=1,12 do
		local 任务id=取唯一任务(1165)
		任务数据[任务id]={
			id=任务id,
			销毁=true,
			起始=os.time(),
			结束=3600,
			名称=self.NPC[n].名称,
			模型=self.NPC[n].模型,
			x=self.NPC[n].x,
			y=self.NPC[n].y,
			方向=self.NPC[n].方向,
			地图编号=self.NPC[n].地图,
			任务显示=true,
			序列=n,
			地图名称=取地图名称(self.NPC[n].地图),
			类型=1165
		}
		地图处理类:添加单位(任务id)
	end
	广播消息({内容="#P/(天降辰星)#W活动已经开启，各位玩家可以前往#G游奕灵官(长安城,128,97)#W处领取任务吧#32",频道="xt"})
	发送公告("#P/(天降辰星)#W活动已经开启，各位玩家可以前往#G游奕灵官(长安城,128,97)#W处领取任务吧")
	self.活动开关=true
end

function 天降辰星:关闭活动(id)
	self.数据={}
	self.活动开关 = false
	self.开启Time=nil
	广播消息({内容="#P/(天降辰星)#W活动结束。",频道="xt"})
end

function 天降辰星:新增任务(id)
	if self.数据[id]==nil then
		self.数据[id]={次数=1,环数=1,取消=0}
	else
		self.数据[id].次数=1
	end
	local FL=1
	local 任务id,ZU=取唯一任务(1166,id)
	任务数据[任务id]={
		领取人id=id,
		id=任务id,
		玩家id=id,
		DWZ=ZU,
		销毁=true,
		起始=os.time(),
		结束=2400,
		队伍组={},
		分类=FL,
		名称=self.NPC[FL].名称,
		类型=1166
	}
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local cyid=队伍数据[队伍id].成员数据[n]
		if self.数据[cyid]==nil then
			self.数据[cyid]={次数=1,环数=1,取消=0}
		else
			self.数据[cyid].次数=1
		end
		十二元辰[cyid]=1
		发送数据(玩家数据[cyid].连接id,1501,{名称="游奕灵官",模型="天兵",对话=format("鼠，耗虫也，于是夜尚未央，正鼠得令之候，故子属鼠。前往挑战子鼠分影。")})
		玩家数据[cyid].角色:添加任务(任务id)
	end
end

function 天降辰星:任务说明(玩家id,任务id)
	local 说明 = {}
	if not self.活动开关 then
		说明={"十二元辰",format("活动已经结束。")}
		return 说明
	end
	local 环数=self.数据[玩家id].环数
	local 次数=self.数据[玩家id].次数
	if 次数==1 then
		说明={"十二元辰",format("子鼠分影降人间，速去前往长安城挑战".."#R/qqq|子鼠*1001*临时npc*%s*%s/子鼠".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",67,141,环数,次数)}
	elseif 次数==2 then
		说明={"十二元辰",format("丑牛分影降人间，速去前往长安城挑战".."#R/qqq|丑牛*1001*临时npc*%s*%s/丑牛".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",500,214,环数,次数)}
	elseif 次数==3 then
		说明={"十二元辰",format("寅虎分影降人间，速去前往江南野外挑战".."#R/qqq|寅虎*1193*临时npc*%s*%s/寅虎".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",17,101,环数,次数)}
	elseif 次数==4 then
		说明={"十二元辰",format("卯兔分影降人间，速去前往江南野外挑战".."#R/qqq|卯兔*1193*临时npc*%s*%s/卯兔".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",134,20,环数,次数)}
	elseif 次数==5 then
		说明={"十二元辰",format("辰龙分影降人间，速去前往建邺城挑战".."#R/qqq|辰龙*1501*临时npc*%s*%s/辰龙".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",27,6,环数,次数)}
	elseif 次数==6 then
		说明={"十二元辰",format("巳蛇分影降人间，速去前往建邺城挑战".."#R/qqq|巳蛇*1501*临时npc*%s*%s/巳蛇".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",260,120,环数,次数)}
	elseif 次数==7 then
		说明={"十二元辰",format("午马分影降人间，速去前往东海湾挑战".."#R/qqq|午马*1506*临时npc*%s*%s/午马".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",60,22,环数,次数)}
	elseif 次数==8 then
		说明={"十二元辰",format("未羊分影降人间，速去前往花果山挑战".."#R/qqq|未羊*1514*临时npc*%s*%s/未羊".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",75,64,环数,次数)}
	elseif 次数==9 then
		说明={"十二元辰",format("申猴分影降人间，速去前往花果山挑战".."#R/qqq|申猴*1514*临时npc*%s*%s/申猴".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",125,12,环数,次数)}
	elseif 次数==10 then
		说明={"十二元辰",format("酉鸡分影降人间，速去前往大唐境外挑战".."#R/qqq|酉鸡*1173*临时npc*%s*%s/酉鸡".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",67,24,环数,次数)}
	elseif 次数==11 then
		说明={"十二元辰",format("戌犬分影降人间，速去前往大唐境外挑战".."#R/qqq|戌犬*1173*临时npc*%s*%s/戌犬".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",291,72,环数,次数)}
	elseif 次数==12 then
		说明={"十二元辰",format("亥猪分影降人间，速去前往大唐境外挑战".."#R/qqq|亥猪*1173*临时npc*%s*%s/亥猪".."#W！剩余时间"..取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始)).."分钟。当前第%s轮第%s环。",516,81,环数,次数)}
	end
	return 说明
end

function 天降辰星:对话事件处理(id,名称,事件)
	if 事件=="我欲前往收服十二元辰" then
		if not self.活动开关  then --测试模式
			添加最后对话(id,"当前不是活动时间~")
			return
		elseif 玩家数据[id].队伍==0 or 取队伍人数(id)<3 or 取队伍最低等级(玩家数据[id].队伍,60) then
			添加最后对话(id,"天降辰星参与条件：≥60级，≥3人")
			return
		elseif 玩家数据[id].队长==false then
			添加最后对话(id,"这种重要的事情还是让队长来吧！")
			return
		end
		local go=true
		local 队伍id=玩家数据[id].队伍
		for n=1,#队伍数据[队伍id].成员数据 do
			local cyid=队伍数据[队伍id].成员数据[n]
			if self.数据[cyid] and self.数据[cyid].取消>os.time() then
				添加最后对话(id,玩家数据[cyid].角色.名称.."在五分钟内取消过任务，需等待五分钟后才可以继续任务哦。")
				if cyid~=id then
					添加最后对话(cyid,"取消任务后，需等待5分钟后才可以继续领取。")
				end
				return
			end
			if 十二元辰[cyid]~=nil then 常规提示(id,cyid .."今日次数已达上限！") return end
			if 玩家数据[cyid].角色:取任务(1166)~=0 then
				常规提示(cyid,"你已经有了一个这样的任务了！")
				if cyid~=id then
					添加最后对话(id,玩家数据[cyid].角色.名称.."已经领取过任务了")
				end
				go=false
				break
			end
		end
		if go then
			self:新增任务(id)
		end
	elseif 事件=="此行甚是疲惫，我想取消任务" then
		local 任务id=玩家数据[id].角色:取任务(1166)
		if 任务id~=0 then
			玩家数据[id].角色:取消任务(任务id)
			if self.活动开关 then
				if self.数据[id]==nil then
					self.数据[id]={次数=0,环数=1,取消=0}
				end
				self.数据[id].取消=os.time()+300
			end
			添加最后对话(id,"已成功取消，并清空任务次数。5分钟可再次领取。")
		else
			添加最后对话(id,"你没有这样的任务哦。")
		end
	end
end

__GWdh111[1165]=function(连接id,id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	对话数据.对话="小侠客，准备好了就来挑战我的分影化身吧"
	对话数据.选项={"待我一战！","路过。"}
	return 对话数据
end

__GWdh222[1165]=function (连接id,id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件=="待我一战！" then
		if 玩家数据[id].队伍==0 or 取队伍人数(id)<3 or 取队伍最低等级(玩家数据[id].队伍,40) then
			添加最后对话(id,"天降辰星参与条件：≥40级，≥3人")
			return
		end
		local 任务id=玩家数据[id].角色:取任务(1166)
		if 任务id~=0 then
			if 任务数据[任务id].名称==名称 then
				if 名称=="子鼠" then
					战斗准备类:创建战斗(id+0,130041,玩家数据[id].地图单位.标识)
				elseif 名称=="丑牛" then
					战斗准备类:创建战斗(id+0,130042,玩家数据[id].地图单位.标识)
				elseif 名称=="寅虎" then
					战斗准备类:创建战斗(id+0,130043,玩家数据[id].地图单位.标识)
				elseif 名称=="卯兔" then
					战斗准备类:创建战斗(id+0,130044,玩家数据[id].地图单位.标识)
				elseif 名称=="辰龙" then
					战斗准备类:创建战斗(id+0,130045,玩家数据[id].地图单位.标识)
				elseif 名称=="巳蛇" then
					战斗准备类:创建战斗(id+0,130046,玩家数据[id].地图单位.标识)
				elseif 名称=="午马" then
					战斗准备类:创建战斗(id+0,130047,玩家数据[id].地图单位.标识)
				elseif 名称=="未羊" then
					战斗准备类:创建战斗(id+0,130048,玩家数据[id].地图单位.标识)
				elseif 名称=="申猴" then
					战斗准备类:创建战斗(id+0,130049,玩家数据[id].地图单位.标识)
				elseif 名称=="酉鸡" then
					战斗准备类:创建战斗(id+0,130050,玩家数据[id].地图单位.标识)
				elseif 名称=="戌犬" then
					战斗准备类:创建战斗(id+0,130051,玩家数据[id].地图单位.标识)
				elseif 名称=="亥猪" then
					战斗准备类:创建战斗(id+0,130052,玩家数据[id].地图单位.标识)
				end
			else
				添加最后对话(id,"小侠客，你当前应该挑战的是"..任务数据[任务id].名称.."才对哦。")
			end
		else
			添加最后对话(id,"小侠客，想挑战我的分影化身吗？不过得先去找游奕灵官(长安城,128,97)领取天降辰星任务才可以哦。")
		end
	end
end

function 天降辰星:刷新任务(id,FL)
	local 任务id=玩家数据[id].角色:取任务(1166)
	if 任务id~=0 then
		if FL==1 then
			发送数据(玩家数据[id].连接id,1501,{名称="游奕灵官",模型="天兵",对话=format("鼠，耗虫也，于是夜尚未央，正鼠得令之候，故子属鼠。前往挑战子鼠分影。")})
		elseif FL==2 then
			发送数据(玩家数据[id].连接id,1501,{名称="子鼠",模型="鼠先锋",对话=format("地辟于丑，而牛则开地之物也，故丑属牛。前往挑战丑牛分影。")})
		elseif FL==3 then
			发送数据(玩家数据[id].连接id,1501,{名称="丑牛",模型="踏云兽",对话=format("人生于寅，有生则有杀，杀人者，虎也，又寅者，畏也。可畏莫如虎，故寅属虎。前往挑战寅虎分影。")})
		elseif FL==4 then
			发送数据(玩家数据[id].连接id,1501,{名称="寅虎",模型="噬天虎",对话=format("卯者，日出之候。日本离体，而中含太阴玉兔之精，故卯属兔。前往挑战卯兔分影。")})
		elseif FL==5 then
			发送数据(玩家数据[id].连接id,1501,{名称="卯兔",模型="兔子怪",对话=format("辰者，三月之卦，正群龙行雨之时，故辰属龙。前往挑战辰龙分影。")})
		elseif FL==6 then
			发送数据(玩家数据[id].连接id,1501,{名称="辰龙",模型="蛟龙",对话=format("巳者，四月之卦，于时草茂，而蛇得其所。又，巳时蛇不上道，故属蛇。前往挑战巳蛇分影。")})
		elseif FL==7 then
			发送数据(玩家数据[id].连接id,1501,{名称="巳蛇",模型="千年蛇魅",对话=format("午者，阳极而一阴甫生。马者，而健而不离地，阴类也，故午属马。前往挑战午马分影。")})
		elseif FL==8 then
			发送数据(玩家数据[id].连接id,1501,{名称="午马",模型="马面",对话=format("养啮未时之草茁，故未属羊。前往挑战未羊分影。")})
		elseif FL==9 then
			发送数据(玩家数据[id].连接id,1501,{名称="未羊",模型="羊头怪",对话=format("申时，日落而猿啼，且伸臂也，臂之气数，将乱则狂作横行，故申属猴。前往挑战申猴分影。")})
		elseif FL==10 then
			发送数据(玩家数据[id].连接id,1501,{名称="申猴",模型="长眉灵猴",对话=format("酉者，月出之时，月本坎体，而中含太阳金鸡之精，故酉属鸡。前往挑战酉鸡分影。")})
		elseif FL==11 then
			发送数据(玩家数据[id].连接id,1501,{名称="酉鸡",模型="雷鸟人",对话=format("戌时，忠犬出没。前往挑战戌犬分影。")})
		elseif FL==12 then
			发送数据(玩家数据[id].连接id,1501,{名称="戌犬",模型="狼",对话=format("亥时，猪则饮食之外无一所知，故亥属猪。前往挑战亥猪分影。")})
		end
		任务数据[任务id].名称=self.NPC[FL].名称
		任务数据[任务id].起始=os.time()
		玩家数据[id].角色:刷新任务跟踪()
	end
end

function 天降辰星:增加任务次数(id)
	if self.活动开关 then
		if self.数据[id]==nil then
			self.数据[id]={次数=0,环数=1,取消=0}
		end
		self.数据[id].次数=self.数据[id].次数+1
	end
end

function 天降辰星:战斗胜利处理(id组,战斗类型)
	local id=id组[1]
	self:增加任务次数(id)
	for n=1,#id组 do
		local cyid=id组[n]
		if self.活动开关 and self.数据[cyid] then
			self.数据[cyid].次数=self.数据[id].次数
			if self.数据[cyid].次数>12 then
				local 链接 = {提示=format("#P(天降辰星)#G/%s#W完成了又一轮十二元辰挑战，特赠送",玩家数据[cyid].角色.名称),频道="hd",结尾="#W以资鼓励！"}
				local 名称="修炼果"
				玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接,"成功")
				self.数据[cyid].环数=self.数据[cyid].环数+1
				玩家数据[cyid].角色:取消任务(玩家数据[cyid].角色:取任务(1166))
				发送数据(玩家数据[cyid].连接id,1501,{名称="游奕灵官",模型="天兵",对话=format("果然身手不错！此番十二元辰挑战你已经全部完成，请明日再来挑战！#81")})
			else
				self:刷新任务(cyid,self.数据[cyid].次数)
			end
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2150,2550)
			local 银子=等级*200+40000
			玩家数据[cyid].角色:添加经验(经验*HDPZ["天降辰星"].经验,"天降辰星",1)
			玩家数据[cyid].角色:添加银子(银子*HDPZ["天降辰星"].银子,"天降辰星",1)
			玩家数据[cyid].角色:添加储备(银子*2*HDPZ["天降辰星"].银子,"天降辰星",1)
			self:设置奖励(cyid)
		end
	end
end

function 天降辰星:设置奖励(cyid)
	if 取随机数()<=HDPZ["天降辰星"].爆率 then
		local 链接 = {提示=format("#P(天降辰星)#W游奕灵官对#G/%s的表现尤为赞赏，特赠送",玩家数据[cyid].角色.名称),频道="hd",结尾="#W以资鼓励！"}
						local 名称,数量,参数=生成产出(产出物品计算(HDPZ["天降辰星"].ITEM),"天降辰星")
						if 数量== 9999 then --环
							玩家数据[cyid].道具:给予道具(cyid,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
						else
							玩家数据[cyid].道具:给予超链接道具(cyid,名称,数量,参数,链接)
		end
	end
end
return 天降辰星