local 帮派青龙玄武 = class()
 Q_青龙人物随机={
	 [1]={地图=1501,名称="老孙头",X=223,Y=12}
	,[2]={地图=1501,名称="牛大胆",X=231,Y=35}
	,[3]={地图=1501,名称="管家",X=34,Y=57}
	,[4]={地图=1501,名称="小花",X=207,Y=108}
	,[5]={地图=1501,名称="马全有",X=49,Y=95}
	,[6]={地图=1501,名称="王大嫂",X=141,Y=12}
	,[7]={地图=1506,名称="楚恋依",X=57,Y=37}
	,[8]={地图=1142,名称="绿儿",X=77,Y=68}
	,[9]={地图=1174,名称="龙女妹妹",X=138,Y=71}
	,[10]={地图=1070,名称="钟书生",X=43,Y=51}
	,[11]={地图=1111,名称="顺风耳",X=104,Y=105}
	,[12]={地图=1173,名称="山贼头子",X=96,Y=28}
	,[13]={地图=1173,名称="姚太尉",X=324,Y=44}
	,[14]={地图=1110,名称="山神",X=43,Y=98}
	,[15]={地图=1110,名称="海释和尚",X=139,Y=157}
}
Q_随机小药品={
 "佛光舍利子"
	,"金创药"
	,"五龙丹"
	,"孔雀红"
	,"鹿茸"
	,"六道轮回"
	,"火凤之睛"
	,"龙之心屑"
	,"熊胆"
	,"丁香水"
	,"麝香"
}

Q_随机药品={
	"金香玉"
	,"小还丹"
	,"千年保心丹"
	,"风水混元丹"
	,"定神香"
	,"蛇蝎美人"
	,"九转回魂丹"
	,"佛光舍利子"
	,"十香返生丸"
	,"金创药"
	,"五龙丹"
	,"孔雀红"
	,"鹿茸"
	,"仙狐涎"
	,"地狱灵芝"
	,"六道轮回"
	,"凤凰尾"
	,"火凤之睛"
	,"龙之心屑"
	,"紫石英"
	,"白露为霜"
	,"熊胆"
	,"血色茶花"
	,"丁香水"
	,"麝香"
}

Q_随机三级药={
	"金香玉"
	,"小还丹"
	,"千年保心丹"
	,"风水混元丹"
	,"定神香"
	,"蛇蝎美人"
	,"九转回魂丹"
	,"佛光舍利子"
	,"十香返生丸"
	,"金创药"
	,"五龙丹"
}

Q_随机小烹饪={
	"烤肉"
	,"烤鸭"
	,"虎骨酒"
	,"包子"
	,"女儿红"
}

Q_随机烹饪={
	"烤肉"
	,"醉生梦死"
	,"蛇胆酒"
	,"百味酒"
	,"梅花酒"
	,"长寿面"
	,"翡翠豆腐"
	,"桂花丸"
	,"珍露酒"
	,"豆斋果"
	,"臭豆腐"
	,"佛跳墙"
	,"烤鸭"
	,"虎骨酒"
	,"包子"
	,"女儿红"
}


function 帮派青龙玄武:设置青龙任务(id)
	-- if 玩家数据[id].角色.地图数据.编号~=1865 then
	--   __S服务:输出("玩家"..id.." 非法使用外挂警告！！！")
	--   写配置("./ip封禁.ini","ip",玩家数据[id].ip,1)
	--   写配置("./ip封禁.ini","ip",玩家数据[id].ip.." 非法使用外挂刷青龙,玩家ID:"..id,1)
	--   发送数据(玩家数据[id].连接id,998,"请注意你的角色异常！已经对你进行封IP")
	--   __S服务:断开连接(玩家数据[id].连接id)
	--   return
	-- end
	if 玩家数据[id].角色:取任务(301) ~= 0 then
			添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
			return
	end
	local 任务id = id.."_"..取随机数(88,1111).."_301_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
	self.随机数字 = 取随机数(1,100)
	local 任务分类=1
	if self.随机数字<=25 then
		任务分类=1
	elseif self.随机数字<=65 then
		任务分类=2
	else
		任务分类=3
	-- else
	--   任务分类=4
	end
	if 调试模式 then
		 任务分类=1
	end
	任务数据[任务id]={
		领取人id={id},
		id=任务id,
		起始=os.time(),
		结束=1314520,
		玩家id=id,
		队伍组={},
		分类=任务分类,
		帮派总管=玩家数据[id].最后对话.名称,
		类型=301
	}
	if 任务分类==1 then
		local 序列=取随机数(1,#Q_青龙人物随机)
		--序列 = 1 --测试，老孙头
		任务数据[任务id].人物=Q_青龙人物随机[序列].名称
		任务数据[任务id].人物地图=Q_青龙人物随机[序列].地图
		任务数据[任务id].序列=序列
		玩家数据[id].道具:给予道具(id,"密信",nil,nil,nil,"专用")
		任务数据[任务id].物品  = "密信"
		添加最后对话(id,format("请帮我将这封书信送给#Y%s#W的#R%s#W，事出紧急，切勿在路上耽搁。",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物))
	elseif 任务分类==2 then
		self.随机药品=Q_随机小药品[取随机数(1,#Q_随机小药品)]
		任务数据[任务id].药品=self.随机药品
		任务数据[任务id].物品  = 任务数据[任务id].药品
		任务数据[任务id].人物="青龙总管"
		添加最后对话(id,format("近日物资紧缺，请你前寻找#Y%s#W，事出紧急，切勿在路上耽搁。",任务数据[任务id].药品))
	elseif 任务分类==3 then
		self.随机烹饪=Q_随机小烹饪[取随机数(1,#Q_随机小烹饪)]
		任务数据[任务id].烹饪=self.随机烹饪
		任务数据[任务id].物品  = 任务数据[任务id].烹饪
		任务数据[任务id].人物="青龙总管"
		添加最后对话(id,format("近日物资紧缺，请你前寻找#Y%s#W，事出紧急，切勿在路上耽搁。",任务数据[任务id].烹饪))
	-- else
	--   任务数据[任务id].巡逻=0
	--   添加最后对话(id,format("最近常有敌对门派探子在青龙堂内出现，还请你在青龙堂内巡逻一番。"))
	end
	玩家数据[id].角色:添加任务(任务id)
end

function 帮派青龙玄武:完成青龙任务(任务id,数字id,类型)
	if 任务数据[任务id]==nil or 任务数据[任务id].分类~=类型 then
		常规提示(数字id,"#Y/你没有这样的任务")
		return
	end
	任务数据[任务id]=nil
	玩家数据[数字id].角色:取消任务(任务id)
	self.青龙经验 = math.floor(玩家数据[数字id].角色.等级*玩家数据[数字id].角色.等级*8) --*15
	self.青龙银子 = math.floor(玩家数据[数字id].角色.等级*90)+4000
	玩家数据[数字id].角色:添加经验(self.青龙经验,"青龙任务",1)
	--玩家数据[数字id].角色:添加活跃度(数字id,1)
	添加帮贡(数字id,10)
	玩家数据[数字id].角色:添加银子(self.青龙银子,"青龙任务",1)
	local bh = 玩家数据[数字id].角色.BPBH
	if 玩家数据[数字id].角色.BPMC ~= "无帮派" and 帮派数据[bh] then
		帮派处理:增加当前内政(bh,100)
	end
end

function 帮派青龙玄武:设置玄武任务(id)
	if 玩家数据[id].角色:取任务(302) ~= 0 then
			添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
			return
	elseif 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
			常规提示(id,"#Y/该任务必须组队完成且由队长领取")
			return
	elseif 取队伍人数(id)<2 then
			常规提示(id,"#Y/本任务至少需要三人组队完成")
			return
	end
	local 任务id = id.."_"..取随机数(88,1111).."_302_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
	local x临时人物队伍={}
	if 玩家数据[id].队伍~=nil and 玩家数据[id].队伍~=0 then
		for i=1,#队伍数据[玩家数据[id].队伍].成员数据 do
			if 队伍数据[玩家数据[id].队伍].成员数据[i]~=nil then
				x临时人物队伍[#x临时人物队伍+1]=队伍数据[玩家数据[id].队伍].成员数据[i]
			end
		end
	end
	local 队伍id=玩家数据[id].队伍
	self.随机数字 = 取随机数(1,100)
	local 任务分类=1
	if self.随机数字<=35 then
		任务分类=1
	elseif self.随机数字<=55 then
		任务分类=2
	elseif self.随机数字<=80 then
		任务分类=3
	else
		任务分类=4
	end
	任务数据[任务id]={
		领取人id=x临时人物队伍,
		id=任务id,
		起始=os.time(),
		结束=1314520,
		玩家id={},
		队伍组={},
		分类=任务分类,
		帮派总管=玩家数据[id].最后对话.名称,
		类型=302
	}
	if 任务分类==1 then
		local 序列=取随机数(1,#Q_青龙人物随机)
		任务数据[任务id].人物=Q_青龙人物随机[序列].名称
		任务数据[任务id].人物地图=Q_青龙人物随机[序列].地图
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
			玩家数据[临时id].角色:添加任务(任务id)
			发送数据(玩家数据[临时id].连接id,1501,{名称="厢房总管",模型="男人_兰虎",对话=format("请帮我将这封书信送给#Y%s#W的#R%s#W，事出紧急，切勿在路上耽搁。",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物)})
		end
	elseif 任务分类==2 then
		self.随机药品=Q_随机小药品[取随机数(1,#Q_随机小药品)]
		任务数据[任务id].药品=self.随机药品
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
			玩家数据[临时id].角色:添加任务(任务id)
			发送数据(玩家数据[临时id].连接id,1501,{名称="厢房总管",模型="男人_兰虎",对话=format("近日物资紧缺，请你前寻找#Y%s#W，事出紧急，切勿在路上耽搁。",任务数据[任务id].药品)})
		end
	elseif 任务分类==3 then
		self.随机烹饪=Q_随机小烹饪[取随机数(1,#Q_随机小烹饪)]
		任务数据[任务id].烹饪=self.随机烹饪
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
			玩家数据[临时id].角色:添加任务(任务id)
			发送数据(玩家数据[临时id].连接id,1501,{名称="厢房总管",模型="男人_兰虎",对话=format("近日物资紧缺，请你前寻找#Y%s#W，事出紧急，切勿在路上耽搁。",任务数据[任务id].烹饪)})
		end
	else
		任务数据[任务id].巡逻=0
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
			玩家数据[临时id].角色:添加任务(任务id)
			发送数据(玩家数据[临时id].连接id,1501,{名称="厢房总管",模型="男人_兰虎",对话=format("最近常有敌对门派探子在长安城内出现，还请你在四周巡逻一番。")})
		end
	end
end

function 帮派青龙玄武:完成玄武任务(任务id,id组,类型)
	if 任务数据[任务id]==nil or 任务数据[任务id].分类~=类型 then
		常规提示(id,"#Y/你没有这样的任务")
		return
	end
	for n=1,#id组 do
			local bh = 玩家数据[id组[n]].角色.帮派数据.编号
			self.青龙经验 = math.floor(玩家数据[id组[n]].角色.等级*玩家数据[id组[n]].角色.等级*8)--*15
			self.青龙银子 = math.floor(玩家数据[id组[n]].角色.等级*75)+3000
			玩家数据[id组[n]].角色:添加经验(self.青龙经验,"玄武任务",1)
			玩家数据[id组[n]].角色:添加银子(self.青龙银子,"玄武任务",1)
			if 玩家数据[id组[n]].角色.参战信息~=nil then
				玩家数据[id组[n]].召唤兽:获得经验(玩家数据[id组[n]].角色.参战宝宝.认证码,qz(self.青龙经验*0.5),id组[n],"玄武任务",self.地图等级)
			end
			玩家数据[id组[n]].角色:添加活跃度(id组[n],2)
			玩家数据[id组[n]].角色.帮贡 = 玩家数据[id组[n]].角色.帮贡 + 5
			帮派数据[bh].成员数据[id组[n]].帮贡.当前 = 帮派数据[bh].成员数据[id组[n]].帮贡.当前 + 5
			帮派数据[bh].成员数据[id组[n]].帮贡.上限 = 帮派数据[bh].成员数据[id组[n]].帮贡.上限 + 5
			帮派数据[bh].安定度 = 帮派数据[bh].安定度 + 1
			常规提示(id组[n],"#Y/你获得了5点帮派贡献度，帮派增加了1点安定度")
			任务数据[任务id]=nil
			玩家数据[id组[n]].角色:取消任务(任务id)
	end
end

function 任务说明301(玩家id,任务id)
	local 说明={}
	if 任务数据[任务id].分类 == 1 then
		说明={"青龙任务",format("请帮我将这封书信送给#R%s#W的".."#R/qqq|%s*%s*临时npc*%s*%s/%s".."#W，事出紧急，切勿在路上耽搁。",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物,Q_青龙人物随机[任务数据[任务id].序列].地图,Q_青龙人物随机[任务数据[任务id].序列].X,Q_青龙人物随机[任务数据[任务id].序列].Y,任务数据[任务id].人物)}
	elseif 任务数据[任务id].分类 == 2 then
		说明={"青龙任务",format("近日物资紧缺，请你前寻找#R/qqq|%s*物品查询*/%s#W，事出紧急，切勿在路上耽搁。",任务数据[任务id].药品,任务数据[任务id].药品)}
	elseif 任务数据[任务id].分类 == 3 then
		说明={"青龙任务",format("近日物资紧缺，请你前寻找#R/qqq|%s*物品查询*/%s#W，事出紧急，切勿在路上耽搁。",任务数据[任务id].烹饪,任务数据[任务id].烹饪)}
	end
	-- #Y/qqq|%s*物品查询*/%s#L
	return 说明
end



return 帮派青龙玄武