-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:38
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-02-05 15:33:51
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-21 20:25:12
local 投放怪 = class()

function 投放怪:初始化()
	self.活动时间=QJHDSJ["定时刷怪"]
end
function 投放怪:活动定时器()
	for k,v in pairs(self.活动时间) do
		if v.时==0 then
			if v.分==服务端参数.分钟+0 and v.秒==服务端参数.秒+0 then --默认每小时开放
				if self[k] then self[k]() end
			end
		else
			if v.时==服务端参数.小时+0 and v.分==服务端参数.分钟+0 and v.秒==服务端参数.秒+0 then --特定的小时开放
				if self[k] then self[k]() end
			end
		end
	end
end

function 投放怪:怪物对话内容(id,类型,标识,地图)
    local 对话数据={}
	  对话数据.模型=任务数据[标识].模型
	  对话数据.名称=任务数据[标识].名称
	  if 任务数据[标识].zhandou~=nil then
		对话数据.对话="我正在战斗中，请勿打扰。"
		return 对话数据
	elseif  取等级要求(id,60)==false then
		常规提示(id,"#Y此任务要求角色等级不能低于60级")
		return
	end
	if 类型==1171 then--巡山小妖
		if 任务数据[标识].名称=="奔波儿灞" or 任务数据[标识].名称=="灞波儿奔" then
			对话数据.对话="我叫"..任务数据[标识].名称.."。是乱石山碧波潭万圣龙王手下的蛤蟆精。我家万圣公主招得一个驸马唤叫做九头精怪，神通广大。#28"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="精细鬼" or 任务数据[标识].名称=="伶俐虫" then
			对话数据.对话="我身上可有一宝贝，大王让我用来收服孙悟空用的，可别让我逮到唐僧他们几个#18"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="小钻风" then
			对话数据.对话="大王叫我来巡山，小心提防那孙悟空，伊儿哟来伊儿伊儿哟#42"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="有来有去" or 任务数据[标识].名称=="有去无回" then
			对话数据.对话="我乃麒麟山獬豸洞赛太岁的心腹小校#2"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		elseif 任务数据[标识].名称=="刁钻古怪" or 任务数据[标识].名称=="古怪刁钻" then
			对话数据.对话="我等奉黄狮精之命拿二十两银子去买猪羊，我家大王的爷爷可是九头元圣#24"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		else
			对话数据.对话="我大王神通广大，本事高强，一口曾吞了十万天兵。"
			对话数据.选项={"让我来看看你是什么小妖精","哎呀，肚子疼，先上个茅房"}
		end
	elseif 类型==1173 then--白骨精
		对话数据.对话="啊？竟然找上门来了，没吃到唐僧肉反而来了一群细皮嫩肉的！少侠，我实在饿得厉害，你看不如这样，我看你细皮嫩肉的，不如就给我做点心吧！"
		对话数据.选项={"妖怪！看打！","我找错人了"}
	elseif 类型==1174 then--狮驼国
		if 任务数据[标识].名称=="金翅大鹏雕分身" then
			对话数据.对话="如来佛祖居然也得叫我一声娘舅#28"
			对话数据.选项={"妖怪！看打！","我找错人了"}
		else
			对话数据.对话="你这等雄纠纠的，嚷上我门，莫不是要打么？有风方起浪，无潮水自平。你不惹我，我好寻你？"
			对话数据.选项={"妖怪！看打！","我找错人了"}
		end
	elseif 类型==1175 then --真假美猴王
		if 任务数据[标识].名称~="是俺老孙" then
			对话数据.对话="真亦假来假亦真，如若能取得真经，又为何要分个真假呢？"
			对话数据.选项={"既然如此执迷不悟，我只好打死你了","我再想想"}
		else
			对话数据.对话="既然分不清真与假，那就和我打一场，真假自然明了！"
			对话数据.选项={"为求真相只有与你一战了","哎呀，肚子疼，先上个茅房"}
		end
	end
	return 对话数据
end

function 投放怪:对话事件处理(id,名称,事件,类型)
	    if 类型==1171 then--巡山小妖
		  if 事件=="让我来看看你是什么小妖精" then
			if 名称=="小钻风" or 名称=="有来有去" or 名称=="有去无回" or 名称=="刁钻古怪" or 名称=="古怪刁钻" then
				战斗准备类:创建战斗(id+0,130066,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
		elseif 名称=="奔波儿灞" or 名称=="灞波儿奔" then
				战斗准备类:创建战斗(id+0,130067,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
		else
				战斗准备类:创建战斗(id+0,130068,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			end

		  end
	    elseif 类型==1173 then--白骨精
		    if 事件=="妖怪！看打！" then
			   战斗准备类:创建战斗(id+0,130072,玩家数据[id].地图单位.标识)
			   任务数据[玩家数据[id].地图单位.标识].zhandou=true
		  end
	    elseif 类型==1174 then--狮驼国
		    if 事件=="妖怪！看打！" then
			  if 名称=="青毛狮子分身" then
				战斗准备类:创建战斗(id+0,130073,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="白象精分身" then
				战斗准备类:创建战斗(id+0,130074,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="金翅大鹏雕分身" then
				战斗准备类:创建战斗(id+0,130075,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			end
		  end
	    elseif 类型==1175 then--真假美猴王
		    if 事件=="既然如此执迷不悟，我只好打死你了" then
			  if 名称=="冒牌小白龙" then
				战斗准备类:创建战斗(id+0,130076,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌沙僧" then
				战斗准备类:创建战斗(id+0,130077,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌猪八戒" then
				战斗准备类:创建战斗(id+0,130078,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌大圣" then
				战斗准备类:创建战斗(id+0,130079,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="冒牌唐僧" then
				战斗准备类:创建战斗(id+0,130080,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			elseif 名称=="六耳猕猴" then
				战斗准备类:创建战斗(id+0,130081,玩家数据[id].地图单位.标识)
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
			end
		  elseif 事件=="为求真相只有与你一战了" then
			  战斗准备类:创建战斗(id+0,130082,玩家数据[id].地图单位.标识)
			  任务数据[玩家数据[id].地图单位.标识].zhandou=true
	    end
	end
end

function 投放怪:巡山小妖()
  local 怪物名称 = {"奔波儿灞","灞波儿奔","精细鬼","伶俐虫","小钻风","有来有去","有去无回","刁钻古怪","古怪刁钻","云里雾","雾里云","急先锋"}
  local 怪物造型 = {"蛤蟆精","蛤蟆精","马面","海毛虫","犀牛将军兽形","狼","狼","树怪","树怪","兔子怪","兔子怪","鼠先锋"}
  for n=1,3 do
    for i=1,12 do
      local xy=地图处理类.地图坐标[1876]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1171"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[i],
        行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=1876,
        战斗显示=true,
        地图名称=取地图名称(1514),
        销毁=true,
        类型=1171,
      }
      地图处理类:添加单位(任务id)
    end
  end
  广播消息({内容=format("#P(取经之路-巡山小妖)#Y南岭山#W里出现了一群巡山小妖，嚷嚷着要活捉唐僧！".."#"..取随机数(1,110)),频道="xt"})
end

function 投放怪:三打白骨精()
	    for i=1,15 do
		  local 地图1=1513
		  local xy=地图处理类.地图坐标[地图1]:取随机点()
		  local 任务id=取随机数(1,99).."1173"..os.time().."_"..随机序列.."_"..取随机数(99,99)
		  随机序列=随机序列+1
		  任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=1800,
			玩家id=id,
			队伍组={},
			名称="白骨精",
			模型="进阶蝎子精",
			x=xy.x,
			y=xy.y,
			战斗显示=true,
			地图编号=地图1,
			地图名称=取地图名称(地图1),
			类型=1173,
			销毁=true,
			难度=5,
		}
		 地图处理类:添加单位(任务id)
	end

  广播消息({内容=format("#P(三打白骨精)#W唐僧师徒四人在西行的路上，白骨精趁虚而入，为夺唐僧而在#Y盘丝岭#W巧设圈套！".."#"..取随机数(1,110)),频道="xt"})
end

function 投放怪:狮驼国()
     local 怪物名称 = {"青毛狮子分身","白象精分身","金翅大鹏雕分身"}
     local 怪物造型 = {"大大王","新二大王","三大王"}
     local 地图=1131
     for i=1,2 do
     for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1174"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        玩家id=id,
        队伍组={},
        名称=怪物名称[k],
        模型=怪物造型[k],
        x=xy.x,
        y=xy.y,
        战斗显示=true,
        地图编号=地图,
        地图名称=取地图名称(地图),
        销毁=true,
        类型=1174,
        难度=6
      }
       地图处理类:添加单位(任务id)
    end
  end
  广播消息({内容=format("#P(狮驼国)#W唐僧师徒四人行至#Y狮驼国#W，发现此地骷髅若岭，骸骨如林。尸山血海，恐怖之至。看样子是免不了一场苦战了！".."#"..取随机数(1,110)),频道="xt"})
end

function 投放怪:真假美猴王()
      local 怪物名称 = {"冒牌小白龙","冒牌沙僧","冒牌猪八戒","冒牌大圣","冒牌唐僧","六耳猕猴","是俺老孙"} --7 真假大圣 谛听
      local 怪物造型 = {"男人_小白龙","沙和尚","新猪八戒","孙悟空","雨师","超级六耳猕猴","新孙悟空"}
      local 地图范围={1237,1237,1237,1237,1237,1237,1237}
      local 刷新地图={}
      for i=1,#地图范围 do
      local 地图=地图范围[i]
      for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1175"..os.time().."_"..随机序列.."_"..取随机数(99,99)
        随机序列=随机序列+1
        任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[i],
        行走开关=false,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1175,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
      刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(真假美猴王)#Y%s#W竟然出现了唐僧、猪八戒、沙悟净、小白龙、孙悟空这些个冒牌替身，叫嚣着要自己去取了西经。为了避免为祸人间，少侠们速速前去辨明真伪！".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 投放怪:战斗胜利处理(id组,战斗类型,任务id)
	if 任务数据[任务id]==nil then
		return
	end
	    地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
	    任务数据[任务id]=nil
	if 战斗类型>=130066 and 战斗类型<=130068 then
	    self:完成巡山小妖(id组)
	elseif 战斗类型==130072 then
	    self:完成白骨精(id组)
	elseif 战斗类型>=130073 and 战斗类型<=130075 then
	    self:完成狮驼国(id组)
	elseif 战斗类型>=130076 and 战斗类型<=130082 then
	    self:完成真假美猴王(id组,战斗类型)
	end
end

function 投放怪:完成巡山小妖(id组)
	for n=1,#id组 do
	    local id=id组[n]
	    local 等级=玩家数据[id].角色.等级
	    local 经验=等级*300+40000
	    local 储备=等级*140+10000
	         玩家数据[id].角色:添加经验(经验*HDPZ["投放怪：巡山小妖"].经验,"巡山小妖",1)
	         玩家数据[id].角色:添加银子(储备*HDPZ["投放怪：巡山小妖"].银子,"巡山小妖",1)
		       if 取随机数()<=HDPZ["投放怪：巡山小妖"].爆率 then
		 local 链接 = {提示=format("#P(投放怪：巡山小妖)#W沉默对#G/%s的表现尤为赞赏，特赠送",玩家数据[id].角色.名称),频道="xt",结尾="以资鼓励！"}
		        	local 名称,数量,参数=生成产出(产出物品计算(HDPZ["投放怪：巡山小妖"].ITEM),"投放怪：巡山小妖")
		        	if 数量== 9999 then --环
		        	玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
		       else
		        	玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
		     end
		end
	end
end

function 投放怪:完成白骨精(id组)
	for n=1,#id组 do
	    local id=id组[n]
	    local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
		  local 经验=平均等级*取随机数(2500,2600)
		  local 银子=平均等级*300+10000
		        玩家数据[id].角色:添加经验(经验*HDPZ["投放怪：白骨精"].经验,"三打白骨精",1)
		        玩家数据[id].角色:添加银子(qz(银子*HDPZ["投放怪：白骨精"].银子),"三打白骨精",1)
		if 取随机数()<=HDPZ["投放怪：白骨精"].爆率 then
			local 链接 = {提示=format("#S(三打白骨精)#G/%s#Y借用强大的神之御手，以强大的修为战胜了波月洞内的白骨精！意外获得",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
		        local 名称,数量,参数=生成产出(产出物品计算(HDPZ["投放怪：白骨精"].ITEM),"投放怪：白骨精")
		        if 数量== 9999 then --环
		        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
		      else
		        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
		    end
		end
	end
end

function 投放怪:完成狮驼国(id组)
	for n=1,#id组 do
	    local id=id组[n]
	    local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
		  local 经验=平均等级*取随机数(2600,2700)
	    local 银子=平均等级*400+10000
		        玩家数据[id].角色:添加经验(经验*HDPZ["投放怪：狮驼国"].经验,"完成狮驼国",1)
		        玩家数据[id].角色:添加银子(qz(银子*HDPZ["投放怪：狮驼国"].银子),"完成狮驼国",1)
		     if 取随机数()<=HDPZ["投放怪：狮驼国"].爆率 then
			local 链接 = {提示=format("#S(狮驼国)#R/%s#Y与狮驼国三大妖王分身厮杀了三百回合！获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
		        local 名称,数量,参数=生成产出(产出物品计算(HDPZ["投放怪：狮驼国"].ITEM),"投放怪：狮驼国")
		        if 数量== 9999 then --环
		        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
		        else
		        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
		    end
		end
	end
end

function 投放怪:完成真假美猴王(id组,战斗类型)
	for n=1,#id组 do
	    local id=id组[n]
	    local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
	    local 链接
	    if 战斗类型==130076 then --冒牌小白龙
	        local 经验=平均等级*取随机数(2700,2800)
			local 银子=平均等级*400+18000
			     玩家数据[id].角色:添加经验(经验*HDPZ["冒牌小白龙"].经验,"真假美猴王",1)
			     玩家数据[id].角色:添加银子(qz(银子*HDPZ["冒牌小白龙"].银子),"真假美猴王",1)
			     链接={提示=format("#S(真假美猴王)#R/%s#Y与冒牌小白龙斗智斗勇！成功识破了他的幻化之象，并将其击败，获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
			if 取随机数()<=HDPZ["冒牌小白龙"].爆率 then
			      local 名称,数量,参数=生成产出(产出物品计算(HDPZ["冒牌小白龙"].ITEM),"冒牌小白龙")
			      if 数量== 9999 then --环
			      玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			      else
			      玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			        	end
			end

		elseif 战斗类型==130077 then --冒牌沙僧
			local 经验=平均等级*取随机数(1800,1900)
			local 银子=平均等级*400+18000
			      玩家数据[id].角色:添加经验(经验*HDPZ["冒牌沙僧"].经验,"真假美猴王",1)
			      玩家数据[id].角色:添加银子(qz(银子*HDPZ["冒牌沙僧"].银子),"真假美猴王",1)
			      链接 = {提示=format("#S(真假美猴王)#R/%s#Y与冒牌沙僧智斗勇！成功识破了他的幻化之象，并将其击败，获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
			if 取随机数()<=HDPZ["冒牌沙僧"].爆率 then
			      local 名称,数量,参数=生成产出(产出物品计算(HDPZ["冒牌沙僧"].ITEM),"冒牌沙僧")
			      if 数量== 9999 then --环
			      玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			      else
			      玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			      end
			end
		elseif 战斗类型==130078 then --冒牌猪八戒
			local 经验=平均等级*取随机数(1900,2000)
			local 银子=平均等级*400+18000
			      玩家数据[id].角色:添加经验(经验*HDPZ["冒牌猪八戒"].经验,"真假美猴王",1)
			      玩家数据[id].角色:添加银子(qz(银子*HDPZ["冒牌猪八戒"].银子),"真假美猴王",1)
			      链接 = {提示=format("#S(真假美猴王)#R/%s#Y与冒牌猪八戒智斗勇！成功识破了他的幻化之象，并将其击败，获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
			if 取随机数()<=HDPZ["冒牌猪八戒"].爆率 then
			      local 名称,数量,参数=生成产出(产出物品计算(HDPZ["冒牌猪八戒"].ITEM),"冒牌猪八戒")
			      if 数量== 9999 then --环
			      玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			      else
			      玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			     end
			end
		elseif 战斗类型==130079 then --冒牌大圣
			local 经验=平均等级*取随机数(2000,2100)
			local 银子=平均等级*400+20000
			      玩家数据[id].角色:添加经验(经验*HDPZ["冒牌大圣"].经验,"真假美猴王",1)
			      玩家数据[id].角色:添加银子(qz(银子*HDPZ["冒牌大圣"].银子),"真假美猴王",1)
			      链接 = {提示=format("#S(真假美猴王)#R/%s#Y与冒牌大圣斗智斗勇！成功识破了他的幻化之象，并将其击败，获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
			if 取随机数()<=HDPZ["冒牌大圣"].爆率 then
			      local 名称,数量,参数=生成产出(产出物品计算(HDPZ["冒牌大圣"].ITEM),"冒牌大圣")
			      if 数量== 9999 then --环
			      玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			      else
			      玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			      end
			end

		elseif 战斗类型==130080 then --冒牌唐僧
			local 经验=平均等级*取随机数(2100,2200)
			local 银子=平均等级*400+26000
			      玩家数据[id].角色:添加经验(经验*HDPZ["冒牌唐僧"].经验,"真假美猴王",1)
			      玩家数据[id].角色:添加银子(qz(银子*HDPZ["冒牌唐僧"].银子),"真假美猴王",1)
			      链接 = {提示=format("#S(真假美猴王)#R/%s#Y与冒牌唐僧斗智斗勇！成功识破了他的幻化之象，并将其击败，获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
			if 取随机数()<=HDPZ["冒牌唐僧"].爆率 then
			      local 名称,数量,参数=生成产出(产出物品计算(HDPZ["冒牌唐僧"].ITEM),"冒牌唐僧")
			      if 数量== 9999 then --环
			      玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			      else
			      玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			    end
			end

		elseif 战斗类型==130081 then --六耳猕猴
			local 经验=平均等级*取随机数(2200,2300)
			local 银子=平均等级*400+30000
			      玩家数据[id].角色:添加经验(经验*HDPZ["六耳猕猴"].经验,"真假美猴王",1)
			      玩家数据[id].角色:添加银子(qz(银子*HDPZ["六耳猕猴"].银子),"真假美猴王",1)
			      链接 = {提示=format("#S(真假美猴王)#R/%s#Y与六耳猕猴斗智斗勇！成功识破了他的幻化之象，并将其击败，获得奖励",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
			if 取随机数()<=HDPZ["六耳猕猴"].爆率 then
			      local 名称,数量,参数=生成产出(产出物品计算(HDPZ["六耳猕猴"].ITEM),"六耳猕猴")
			      if 数量== 9999 then --环
			      玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			    else
			      玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			    end
			end

		elseif 战斗类型==130082 then --是俺老孙
			local 经验=平均等级*取随机数(2000,2500)
			local 银子=平均等级*400+35000
			       玩家数据[id].角色:添加经验(经验*HDPZ["是俺老孙"].经验,"真假美猴王",1)
			       玩家数据[id].角色:添加银子(qz(银子*HDPZ["是俺老孙"].银子),"真假美猴王",1)
			       链接 = {提示=format("#P(真假美猴王)#G/%s#Y实力超群，与齐天大圣孙悟空从北天门打到了南天门，大圣被其正义之心所折服，送了一个",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110).."#Y给大侠。"}
			if 取随机数()<=HDPZ["是俺老孙"].爆率 then
			        local 名称,数量,参数=生成产出(产出物品计算(HDPZ["是俺老孙"].ITEM),"是俺老孙")
			        if 数量== 9999 then --环
			        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			      else
			        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			    end
			end
		end
	end
end

return 投放怪