-- @Author: baidwwy
-- @Date:   2024-05-23 06:02:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-10-29 23:18:57
local 押镖 = class()

function 押镖:初始化()
	self.数据={}
	self.押镖地图={
		{地图=1150,名称="二郎神"}
		,{地图=1141,名称="观音姐姐"}
		,{地图=1124,名称="地藏王"}
		,{地图=1117,名称="东海龙王"}
		,{地图=1054,名称="程咬金"}
		,{地图=1043,名称="空度禅师"}
		,{地图=1143,名称="孙婆婆"}
		,{地图=1137,名称="菩提老祖"}
		,{地图=1112,名称="李靖"}
		,{地图=1145,名称="牛魔王"}
		,{地图=1147,名称="镇元子"}
		,{地图=1134,名称="大大王"}
		,{地图=1154,名称="巫奎虎"}
		,{地图=1156,名称="地涌夫人"}
		,{地图=1144,名称="白晶晶"}
	}
end

function 押镖:重置数据()
	self.数据={}
end

function 押镖:添加任务(id,难度)
	if 玩家数据[id].角色.地图数据.编号~=1024 then
		写配置("./ip封禁.ini", "ip", 玩家数据[id].角色.ip, 1)
		f函数.写配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","封禁","1")
		local 封禁原因=玩家数据[id].角色.ip.."“违规行为：开挂押镖”地图=="..玩家数据[id].角色.地图数据.编号.."，玩家ID=="..id.."，玩家账号=="..玩家数据[id].账号.."时间="..os.date("%Y%m%d")..os.date("%H",os.time())..os.date("%S",os.time())
		f函数.写配置(程序目录..[[data\]]..玩家数据[id].账号..[[\账号信息.txt]],"账号配置","已违规11",封禁原因)
		f函数.写配置(程序目录..[[各类情况查看\]]..[[\违规汇总.txt]],"违规详情","已违规11:",封禁原因)
		发送数据(玩家数据[id].连接id, 998, "请注意你的角色异常！已经对你进行封禁")
		__S服务:断开连接(玩家数据[id].连接id)
		return 0
	end
	if 玩家数据[id].队伍 ~= 0 then
		添加最后对话(id,"请单人来接取押镖任务！")
		return
	elseif 玩家数据[id].角色.门派=="无门派" then
		添加最后对话(id,"你连门派都没有我不能放心的让你去押镖！")
		return
	elseif 玩家数据[id].角色:取任务(300)~=0 then
		添加最后对话(id,"少侠身上已经有了押镖任务，还不赶紧送过去！")
		return
	elseif self.数据[id] and self.数据[id].次数>= 50 then
		添加最后对话(id,"少侠今天已经很累了，休息休息，明天继续！")
		return
	end
	if self.数据[id]==nil then
	    self.数据[id]={次数=0,取消=0}
	end
	self.数据[id].次数=self.数据[id].次数+1
	local 任务id,ZU=取唯一任务(1163,id)
	任务数据[任务id]={
		领取人id={id},
		id=任务id,
		DWZ=ZU,
		销毁=true,
		起始=os.time(),
		结束=99999999,
		玩家id=id,
		次数=self.数据[id].次数,
		队伍组={},
		难度=难度,
		类型=300
	}
	local 序列=取随机数(1,#self.押镖地图)
	任务数据[任务id].人物=self.押镖地图[序列].名称
	任务数据[任务id].人物地图=self.押镖地图[序列].地图
	添加最后对话(id,format("请帮我把镖银送给#Y%s#W的#R%s#W，事出紧急，切勿在路上耽搁。当前#R第%s镖",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物,任务数据[任务id].次数))
	玩家数据[id].角色:添加任务(任务id)
end

function 押镖:完成押镖任务(任务id,id,地图)
	if 任务数据[任务id]==nil then
		return
	end
	if 玩家数据[id].角色.地图数据.编号~=地图 then
		发送数据(玩家数据[id].连接id,998,"请注意你的角色异常！已经对你进行下线处理")
		__S服务:断开连接(玩家数据[id].连接id)
		return
	end
	local 难度=任务数据[任务id].难度
	local 奖励系数 = 1
	local 押镖银子 = 20000
	if 难度==30 then
		奖励系数 = 0
	elseif 难度==50 then
		奖励系数 = 20000
	elseif 难度==70 then
		奖励系数 = 30000
	elseif 难度==90 then
		奖励系数 = 40000
	elseif 难度==110 then
		奖励系数 = 50000
	end
	玩家数据[id].角色:添加银子(qz(押镖银子+奖励系数),"押镖",1)
	-- 玩家数据[id].角色:添加活跃度(id,1)
	if self.数据[id] and self.数据[id].次数< 30 then
	    if 取随机数()<=25 then
	    	local 链接 = {提示=format("#S(押镖任务)#G/%s#Y顺利完成押送镖银任务，郑镖头奖励了他一本",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110).."#Y！"}
	    	玩家数据[id].道具:给予超链接道具(id,"鬼谷子",nil,nil,链接,"成功")
	    end
	else
		常规提示(id,"#Y/今日押镖已达30次，不会再获得物品奖励！")
	end
	玩家数据[id].角色:取消任务(任务id)
	任务数据[任务id]=nil
end

function 任务说明300(玩家id,任务id)
	return {"押镖任务",format("请帮我把镖银送给#R%s#W的#R%s#W，事出紧急，切勿在路上耽搁。当前第#R%s#W镖",取地图名称(任务数据[任务id].人物地图),任务数据[任务id].人物,任务数据[任务id].次数,"#W可获得经验、银子，可几率获得物品。押送将几率获得物品鬼谷子。")}
end

return 押镖