-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-09 15:56:35
local 沉默分身类 = class()

function 沉默分身类:初始化()
	self.检测已刷time=0
end

function 沉默分身类:活动定时器()
	if 服务端参数.分钟 == "30" and tonumber(self.检测已刷time) ~= nil and os.time() - self.检测已刷time >= 1 then-- and (tonumber(os.date("%w", os.time()))==6 or  tonumber(os.date("%w", os.time()))==0)
	    if 服务端参数.小时 == "19" then
	   	   self:刷出沉默分身()
	     end
	end
end

function 沉默分身类:刷出沉默分身()
	self.检测已刷time=os.time()+3600
	local 名称组={"沉默分身"}
	local 模型组={"进阶觉醒涂山雪"}
	local 地图组={1040}
	local 广播地图名称=""
	for n=1,1 do
		local 任务id=取唯一任务(3487)
		local dtbh=地图组[n]
		local xy=地图处理类.地图坐标[dtbh]:取随机点()
		local 炫彩颜色=随机颜色[取随机数(1,#随机颜色)]
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=900,
			玩家id=id,
			名称=名称组[n],
		--	称谓="沉默分身",
			模型=模型组[n],
			方向=4,
			x=85,
			y=62,
			地图编号=dtbh,
			地图名称=取地图名称(dtbh),
			饰品显示=true,
			沉默分身=true,
			-- 炫彩=取染色id(模型组[n]),
			-- 炫彩颜色=炫彩颜色,
			-- 炫彩组=取炫彩染色(炫彩颜色),
			难度=n,
			销毁=true,
			类型=3487
		}
		沉默分身[任务id]={}
		沉默分身[任务id].起始=os.time()
		地图处理类:添加单位(任务id)
		广播地图名称=广播地图名称 .."#R/丨#W/" ..任务数据[任务id].地图名称 .."(" ..任务数据[任务id].x .."," ..任务数据[任务id].y ..")"
	end
	发送公告("#S(全服活动)#Y/沉默分身#G/已刷出#W/请各位侠士前往挑战，挑战时间结束后将按伤害排名分发奖励。")
	发送公告("#S(全服活动)#Y/沉默分身#G/已刷出#W/请各位侠士前往挑战，挑战时间结束后将按伤害排名分发奖励。")
	发送公告("#S(全服活动)#Y/沉默分身#G/已刷出#W/请各位侠士前往挑战，挑战时间结束后将按伤害排名分发奖励。")
	广播消息({内容=format("#S(全服活动)#Y/沉默分身#G/已刷在#W/" ..广播地图名称),频道="hd"})
	广播消息({内容=format("#S(全服活动)#Y/沉默分身#G/已刷在#W/" ..广播地图名称),频道="hd"})
	广播消息({内容=format("#S(全服活动)#Y/沉默分身#G/已刷在#W/" ..广播地图名称),频道="hd"})
	广播消息({内容=format("#S(全服活动)#Y/沉默分身#G/已刷在#W/" ..广播地图名称),频道="hd"})
	广播消息({内容=format("#S(全服活动)#Y/沉默分身#G/已刷在#W/" ..广播地图名称),频道="hd"})
end

function 沉默分身类:沉默分身对话内容(id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	对话数据.对话="#Y/" ..任务数据[标识].名称 .. " #G/沉默分身#R/" ..任务数据[标识].难度 .."星\n#R/沉默分身挑战规则：\n战斗10回合以上且全队存活直至战斗自动结束，按全队对分身总伤害计算排名。前三名队伍奖励最高，余下名次统一奖励。"
	对话数据.选项={"我准备好了！","我们才不稀罕你宝贝呢，拜拜！"}
	return 对话数据
end

function 沉默分身类:沉默分身对话事件处理(id,名称,事件,类型,rwid)
	if 事件 ~= "我准备好了！" then return end
	if 玩家数据[id].队伍 ~= 0 then
		战斗准备类:创建战斗(id,134871,rwid)
		任务数据[rwid].zhandou=true
	else
	    常规提示(id,"挑战沉默的权威请务必组队！")
	end
end

function 沉默分身类:实时更新排行(任务id) --8.18
	if 沉默分身[任务id] == nil then return end
	local 伤害数据={}
	self.伤害排行={}
	local 要求回合 = 10
	for k,v in pairs(沉默分身[任务id]) do
		if type(k) == "number" and 玩家数据[k] then --取玩家id
			伤害数据[#伤害数据+1] = v.造成伤害
		end
	end
	table.sort(伤害数据,function(a,b) return a>b end )
	for k,v in pairs(伤害数据) do
		for kn,vn in pairs(沉默分身[任务id]) do
			if type(k) == "number" and 玩家数据[kn] and 沉默分身[任务id][kn].造成伤害 == v and 沉默分身[任务id][kn].战斗回合 then-->= 要求回合 then
				self.伤害排行[#self.伤害排行+1] = {名称=玩家数据[kn].角色.名称,id=kn,伤害=v}
				self.伤害排行[#self.伤害排行+1] = {名称=玩家数据[kn].角色.名称,id=kn,伤害=v}
				self.伤害排行[#self.伤害排行+1] = {名称=玩家数据[kn].角色.名称,id=kn,伤害=v}
            end
		end
	end
	for k,v in pairs(玩家数据) do
		if 玩家数据[k].zhandou ~= 0 and 战斗准备类.战斗盒子[玩家数据[k].zhandou]:取战斗类型(k)==134871 then
			发送数据(玩家数据[k].连接id,5566,self.伤害排行)
		end
	end
end

function 沉默分身类:沉默分身活动结束处理(任务id)
	if 沉默分身[任务id] == nil then return end
	local 伤害数据={}
	local 伤害排行={}
	local 要求回合 = 10
	for k,v in pairs(沉默分身[任务id]) do
		if type(k) == "number" and 玩家数据[k] then --取玩家id
			伤害数据[#伤害数据+1] = v.造成伤害
		end
	end
	table.sort(伤害数据,function(a,b) return a>b end )
	local tism=""
	local paiming=0
	for k,v in pairs(伤害数据) do
		for kn,vn in pairs(沉默分身[任务id]) do
			if type(k) == "number" and 玩家数据[kn] and 沉默分身[任务id][kn].造成伤害 == v and 沉默分身[任务id][kn].战斗回合 >= 要求回合 then
				伤害排行[#伤害排行+1] = kn
				if paiming <= 10 then
					tism = tism .."第" ..#伤害排行 .."名：" ..玩家数据[kn].角色.名称 .."、"
				end
				paiming=paiming+1
            end
		end
	end

	for k,v in pairs(伤害排行) do --v是玩家id(队伍id)
		self:沉默分身单独发放奖励(v,k,任务数据[任务id].难度)
    end
    发送公告("#S(全服活动)#Y/沉默分身#W/活动已结束,未获得好名次的玩家下次活动再接再厉。")
    for ak,vn in pairs(玩家数据) do
    	if 玩家数据[ak]~=nil then
	    	消息提示(ak, "#S沉默分身排名:#W/" ..tism)
	    end
    end
end

function 沉默分身类:沉默分身单独发放奖励(队伍id,排名,难度)
	for n=1,#队伍数据[队伍id].成员数据 do
		local id=队伍数据[队伍id].成员数据[n]
		local 宝石名称=取宝石()
		if 难度 == 1 then
			if 排名 == 1 then --第一名
				玩家数据[id].道具:给予道具(id,"特技书",1)
				玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
				玩家数据[id].道具:给予道具(id,"装备特效宝珠",1)
				玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",10)
				玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",10)
				玩家数据[id].角色:添加每日活跃度(id, 5)
		        广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得特技书、装备特效宝珠、超级兽诀·碎片*10、特殊兽诀·碎片*10、抽奖令牌"),频道="xt"})
			elseif 排名 == 2 then --第二名
				玩家数据[id].道具:给予道具(id,"特技书",1)
				玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
				玩家数据[id].道具:给予道具(id,"装备特效宝珠",1)
				玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",8)
				玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",8)
				玩家数据[id].角色:添加每日活跃度(id, 5)
				 广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得特技书、、装备特效宝珠、超级兽诀·碎片*8、特殊兽诀·碎片*8、抽奖令牌"),频道="xt"})
			elseif 排名 == 3 then
				 玩家数据[id].道具:给予道具(id,"特技书",1)
				 玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
				 玩家数据[id].道具:给予道具(id,"装备特效宝珠",1)
				 玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",6)
				 玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",6)
				 玩家数据[id].角色:添加每日活跃度(id, 5)
				 广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得特技书、、装备特效宝珠、超级兽诀·碎片*6、特殊兽诀·碎片*6、抽奖令牌"),频道="xt"})
			elseif 排名 == 4 then
				 玩家数据[id].道具:给予道具(id,"特技书",1)
				 玩家数据[id].道具:给予道具(id,"神兜兜",10)
				 玩家数据[id].道具:给予道具(id,"装备特效宝珠",1)
				 玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",5)
				 玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",5)
				 玩家数据[id].角色:添加每日活跃度(id, 5)
				 广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得特技书、神兜兜、装备特效宝珠、超级兽诀·碎片*2、特殊兽诀·碎片*5"),频道="xt"})
			elseif 排名 == 5 then
				玩家数据[id].道具:给予道具(id,"特技书",1)
				玩家数据[id].道具:给予道具(id,"装备特效宝珠",1)
				玩家数据[id].道具:给予道具(id,"超级兽诀·碎片",4)
				玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",4)
				玩家数据[id].角色:添加每日活跃度(id, 5)
				 广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得特技书、高级召唤兽内丹、装备特效宝珠、超级兽诀·碎片*4、特殊兽诀·碎片*4"),频道="xt"})
			elseif 排名 <= 10 then
				玩家数据[id].道具:给予道具(id,"装备特效宝珠",1)
				玩家数据[id].道具:给予道具(id,"战魄")
                玩家数据[id].道具:给予道具(id,"特殊兽诀·碎片",1)
				玩家数据[id].道具:给予道具(id,"玲珑宝图")
				玩家数据[id].道具:给予道具(id,"陨铁")
				玩家数据[id].角色:添加每日活跃度(id, 5)
				广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得装备特效宝珠、战魄、装备特效宝珠、陨铁、玲珑宝图"),频道="xt"})
			else
				玩家数据[id].道具:给予道具(id,"玲珑宝图")
                广播消息({内容=format("#G"..玩家数据[id].角色.名称.."#Y成功击杀沉默分身，获得玲珑宝图"),频道="xt"})
			end
		end
	end
end

return 沉默分身类

