-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-03 19:21:26
-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:38
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-14 11:31:05
-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:38
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-09-01 14:22:44
local 自写活动 = class()
function 自写活动:怪物对话内容(id,类型,标识,地图)
    local 对话数据={}
    对话数据.模型=任务数据[标识].模型
    对话数据.名称=任务数据[标识].名称
    if 任务数据[标识].zhandou~=nil then
        对话数据.对话="我正在战斗中，请勿打扰。"
        return 对话数据
    end

    if 类型==1176 then--知了大王
     if 任务数据[标识].名称=="知了大王"  then
            对话数据.对话="这里可是好地方哇,以后我就长居凡界了。#24"--例如这个是1号对话
            对话数据.选项={"我来瞧瞧你的啥","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1186 then--裂风兽
     if 任务数据[标识].名称=="裂风兽"  then
            对话数据.对话="你想挑战裂风兽吗？"
            对话数据.选项={"我要击败裂风兽","我先溜了"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1177 then--知了统领
     if 任务数据[标识].名称=="知了统领"  then
            对话数据.对话="我躲吖躲...咿...少侠是怎么找到我的？"
            对话数据.选项={"宝物给我拿过来","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1182 then--千年知了王
     if 任务数据[标识].名称=="千年知了王"  then
            对话数据.对话="你想挑战千年知了王？"
            对话数据.选项={"让我来收服你","我先溜了"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1178 then--知了小王
     if 任务数据[标识].名称=="知了小王"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1179 then--50级世界BOSS
     if 任务数据[标识].名称=="远古妖魔头目"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1180 then--100级世界BOSS
     if 任务数据[标识].名称=="远古妖魔领主"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1181 then--150级世界BOSS
     if 任务数据[标识].名称=="远古妖魔尊主"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"让我来收服你","哎呀，肚子疼，先上个茅房"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1185 then--6星天罡
     if 任务数据[标识].名称=="六星天罡"  then
            对话数据.对话="龙行飘忽，所谓神龙见首不见尾，龙脉之地也是神秘万分，少侠可愿前取寻找龙脉所在？"
            对话数据.选项={"我想超越自我","我比较怂"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1187 then
     if 任务数据[标识].名称=="圣兽青龙"  then
            对话数据.对话="我乃上古神兽四圣之一的青龙，你还敢想要我的东西？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1188 then
     if 任务数据[标识].名称=="圣兽白虎"  then
            对话数据.对话="我乃上古神兽四圣之一的白虎，你还敢想要我的东西？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1189 then
     if 任务数据[标识].名称=="圣兽朱雀"  then
            对话数据.对话="我乃上古神兽四圣之一的朱雀，你还敢想要我的东西？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
    elseif 类型==1190 then
     if 任务数据[标识].名称=="圣兽玄武"  then
            对话数据.对话="我乃上古神兽四圣之一的玄武，你还敢想要我的东西？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end

----------------------------宝石怪------沸涌炎海的信标-----
    elseif 类型==1187.1 then
     if 任务数据[标识].名称=="沸涌炎海巡守" or 任务数据[标识].名称== "沸涌炎海帝子" or 任务数据[标识].名称=="沸涌炎海统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
 -------------------------------------------钢铁炼境的信标-----
    elseif 类型==1187.2 then
     if 任务数据[标识].名称=="钢铁炼境巡守" or 任务数据[标识].名称== "钢铁炼境帝子" or 任务数据[标识].名称=="钢铁炼境统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------雷鸣废土的信标-----------
    elseif 类型==1187.3 then
     if 任务数据[标识].名称=="雷鸣废土巡守" or 任务数据[标识].名称== "雷鸣废土帝子" or 任务数据[标识].名称=="雷鸣废土统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------幽夜暗域的信标-----------
    elseif 类型==1187.4 then
     if 任务数据[标识].名称=="幽夜暗域巡守" or 任务数据[标识].名称== "幽夜暗域帝子" or 任务数据[标识].名称=="幽夜暗域统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------混乱终末的信标-----------
    elseif 类型==1187.5 then
     if 任务数据[标识].名称=="混乱终末巡守" or 任务数据[标识].名称== "混乱终末帝子" or 任务数据[标识].名称=="混乱终末统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------伟大虚空的信标-----------
    elseif 类型==1187.6 then
     if 任务数据[标识].名称=="伟大虚空巡守" or 任务数据[标识].名称== "伟大虚空帝子" or 任务数据[标识].名称=="伟大虚空统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
      --------------------------------------巅峰领域的信标-----------
    elseif 类型==1187.7 then
     if 任务数据[标识].名称=="巅峰领域巡守" or 任务数据[标识].名称== "巅峰领域帝子" or 任务数据[标识].名称=="巅峰领域统御"  then
            对话数据.对话="如果恐惧能被掩藏，那你，又在怕什么？"
            对话数据.选项={"把东西交给我","我只是路过的"}
        else
         对话数据.对话="我正在战斗中，请勿打扰。"
      end
-----------------------------------------
end
    return 对话数据
end


function 自写活动:对话事件处理(id,名称,事件,类型)

   if 类型==1176 then
        if 事件=="我来瞧瞧你的啥" then
            战斗准备类:创建战斗(id+0,155559,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1186 then--裂风兽
        if 事件=="我要击败裂风兽" then
            战斗准备类:创建战斗(id+0,155557,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1177 then--知了统领
        if 事件=="宝物给我拿过来" then
            战斗准备类:创建战斗(id+0,155560,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1182 then--千年知了王
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155565,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1178 then--知了小王
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155561,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1179 then--50级世界BOSS
        if 事件=="让我来收服你" then
            if 玩家数据[id].角色.等级 >= 70 then
                常规提示(id,"此活动仅限70级以下玩家参与")
                return
            end
            战斗准备类:创建战斗(id+0,155562,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1180 then--100级世界BOSS
        if 事件=="让我来收服你" then
            if 玩家数据[id].角色.等级 >= 110 then
                常规提示(id,"此活动仅限110级以下玩家参与")
                return
            end
            战斗准备类:创建战斗(id+0,155563,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1185 then
        if 事件=="我想超越自我" then
            战斗准备类:创建战斗(id+0,155558,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
   elseif 类型==1181 then--150级世界BOSS
        if 事件=="让我来收服你" then
            战斗准备类:创建战斗(id+0,155564,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1187 then
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,155564.11,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1188 then
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,155564.21,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1189 then
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,155564.31,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    elseif 类型==1190 then
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,155564.41,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end

    ---------------------------沸涌炎海的信标-----------宝石怪-----------
    elseif 类型==1187.1 then
        if 事件=="把东西交给我" then
            战斗准备类:创建战斗(id+0,155564.1,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------钢铁炼境的信标----------------------
    elseif 类型==1187.2 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.2,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------雷鸣废土的信标----------------------
    elseif 类型==1187.3 then
        if 事件=="把东西交给我" then-------
            战斗准备类:创建战斗(id+0,155564.3,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------幽夜暗域的信标----------------------
    elseif 类型==1187.4 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.4,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------混乱终末的信标----------------------
    elseif 类型==1187.5 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.5,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------伟大虚空的信标----------------------
    elseif 类型==1187.6 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.6,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
        ---------------------------巅峰领域的信标----------------------
    elseif 类型==1187.7 then
        if 事件=="把东西交给我" then--------
            战斗准备类:创建战斗(id+0,155564.7,玩家数据[id].地图单位.标识)
            任务数据[玩家数据[id].地图单位.标识].zhandou=true
        end
    end
end
--------------------------------------------------------------
function 自写活动:知了大王()
  local 怪物名称 = {"知了大王","知了大王"}
  local 怪物造型 = {"知了王","知了王"}
  local 地图范围={1092,1514}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,30 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1176"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[i],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1176,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了大王)#W/雷霆一劈，天空中飞来许多知了大王，他们出现在了#Y/%s、%s#w/处捣乱，还请各位英雄侠土赶紧去降服它们。#G(难度4)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
function 自写活动:知了统领()
  local 怪物名称 = {"知了统领","知了统领"}
  local 怪物造型 = {"知了王"}
  local 地图范围={1193,1040}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1177"..os.time().."_"..随机序列.."_"..取随机数(99,99)..k
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[取随机数(1,#怪物造型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1177,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了统领)#W/知了统领，携带大量宝物，跑到#G%s、%s#W处躲藏，请各位少侠们，前去抓住他获得宝物。#G(难度2)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:六星天罡()
  local 怪物名称 = {"六星天罡","六星天罡"}
  local 怪物造型 = {"骨精灵","骨精灵"}
  local 地图范围={1110,1110}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,4 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1185"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[i],
        x=xy.x,
        y=xy.y,
        锦衣="青花瓷",
        武器="醍醐",
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1185,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(六星天罡)#W/六星天罡天女星雅洁出尘，一身白衣飘动，袅娜而来，宛若自月宫中临尘在#Y/%s、%s#w/处。#G(难度6)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end

function 自写活动:千年知了王()
  local 怪物名称 = {"千年知了王","千年知了王"}
  local 怪物造型 = {"知了王"}
  local 地图范围={1091,1205}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,20 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1182"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[取随机数(1,#怪物造型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1182,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(千年知了王)#W/千年知了王，携带超级宝物，跑到#G%s、%s#W处躲藏，请各位少侠们，前去抓住他获得宝物。#G(难度5)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
function 自写活动:裂风兽()
  local 怪物名称 = {"裂风兽","裂风兽"}
  local 怪物造型 = {"进阶执音"}
  local 地图范围={1221}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1186"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=怪物造型[取随机数(1,#怪物造型)],
        饰品=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1186,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(裂风兽)#W/裂风兽，携带超级宝物，跑到#G%s#W处躲藏，请各位少侠们，前去抓住他获得宝物。#G(宝物众多,难度极高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end
function 自写活动:知了小王()
  local 怪物名称 = {"知了小王","知了小王"}
  local 生肖模型 = {"知了王","知了王","知了王","知了王","知了王","知了王","知了王","知了王","知了王","知了王","知了王","知了王"}
  local 地图范围={1208,1226}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,50 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1178"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1178,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(知了王)#W一群知了小王闪着金色光芒正在#G%s、%s#W场景中四处游玩，各位少侠可以去消灭他们。#G(难度3)".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
function 自写活动:世界boss(id)
  local 怪物名称 = {"远古妖魔头目","远古妖魔头目"}
  local 生肖模型 = {"小蚩尤","小蚩尤"}
  local 地图范围={1126}
  local 等级=70
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..等级.."_"..取随机数(1999,11111).."_1179_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..等级
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="世界BOSS("..等级.."级)",
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1179,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end

  广播消息({内容=format("#P(世界boss)#W妖门大开，魔王现世。#Y远古妖魔头目#W已经出现在#G%s#W场景内祸害四分，各位少侠可以去消灭他们。#G(大量银子,物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
  local 怪物名称 = {"远古妖魔领主","远古妖魔领主"}
  local 生肖模型 = {"小蚩尤","小蚩尤"}
  local 地图范围={1202}
  local 等级=110
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..等级.."_"..取随机数(1999,11111).."_1180_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..等级
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="世界BOSS("..等级.."级)",
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1180,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(世界boss)#W妖门大开，魔王现世。#Y远古妖魔领主#W已经出现在#G%s#W场景内祸害四分，各位少侠可以去消灭他们。#G(大量银子,物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
  local 怪物名称 = {"远古妖魔尊主","远古妖魔尊主"}
  local 生肖模型 = {"小蚩尤","小蚩尤"}
  local 地图范围={1204}
  local 等级=160
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,3 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..等级.."_"..取随机数(1999,11111).."_1181_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..等级
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3500,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        称谓="世界BOSS("..等级.."级)",
 --       行走开关=true,
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1181,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
  广播消息({内容=format("#P(世界boss)#W妖门大开，魔王现世。#Y远古妖魔尊主#W已经出现在#G%s#W场景内祸害四分，各位少侠可以去消灭他们。#G(大量银子,物品,经验,难度高)".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

-------------------------------------------------------------------------宝石怪---------------------------------------------------------------
-- function 自写活动:沸涌炎海的信标()
--   local 怪物名称 = {"沸涌炎海巡守","沸涌炎海帝子","沸涌炎海统御"}----地图上刷出来的怪的名字之前是
--   local 生肖模型 = {"食铁兽","火月蛙","炎魔神"}----地图上的怪物造型
--   local 地图范围={5001}-------刷在什么地图 我只有官方的地图ID 没有这个
--   local 刷新地图={}
--   for i=1,#地图范围 do ---------刷在具体哪个范围  这个地图调用的哪里 我如果例如再按这个去写
--     local 地图=地图范围[i]
--     for k=1,10 do---------------------刷多少个   打玩就消失
--       local xy=地图处理类.地图坐标[地图]:取随机点() ---刷在地图上的具体坐标点 随机的  关键是对话 我也写了些注解，估计你很难搞定 你尝试尝试再说吧 我看看对话
--       local 任务id="_"..i.."_"..取随机数(1,99).."1187.1"..os.time().."_"..随机序列.."_"..取随机数(99,99)
--       随机序列=随机序列+1
--       任务数据[任务id]={
--         id=任务id,
--         起始=os.time(),
--         结束=3600,---------刷出来多久---不打的话会消失
--         玩家id=id,
--         队伍组={},
--         名称=怪物名称[i],
--         模型=生肖模型[取随机数(1,#生肖模型)],
--         x=xy.x,
--         y=xy.y,
--         地图编号=地图,
--         战斗显示=true,
--         地图名称=取地图名称(地图),
--         类型=1187.1,-----范围要在下面之间  因为在怪物对话内容lua里规定了 当然,你可以重新规定,初学你还是照抄吧  下面是我复制过来的内容,自己搜一下理解.
--          -- elseif 类型 >= 1176 and 类型<= 1186  then
--       --   对话数据 = 自写活动:怪物对话内容(数字id,类型,标识,地图)
--         销毁=true,
--       }
--       地图处理类:添加单位(任务id)
--     end
--     刷新地图[#刷新地图+1] = 取地图名称(地图)
--   end
--    广播消息({内容=format("#S神秘人打开了【沸涌炎海】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
-- end
-- -----
-- function 自写活动:完成沸涌炎海的信标(id组)
--     for n=1,#id组 do
--         local id=id组[n]
--         local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
--         local 经验=平均等级*取随机数(2000,2200)
--         local 银子=平均等级*160+22000*1000
--         玩家数据[id].角色:添加经验(经验,"沸涌炎海的信标",1)
--         玩家数据[id].角色:添加银子(银子,"沸涌炎海的信标",1)

--         local 奖励参数=取随机数()--默认值 昨天教过你
--         if 奖励参数<=10 then ---奖励在这  右键一个哪道具 就会传送到这地图里来 别人进不来，只有有道具的 可以飞到这里
--             local 名称="五宝盒"
--             玩家数据[id].道具:给予道具(id,名称,1)--可叠加道具 必须加上道具数量
--             常规提示(id,"#Y/你获得了"..名称)
--             广播消息({内容=format("#S(沸涌炎海的信标)#R/%s#Y在#R沸涌炎海#S一顿乱摸，因此获得了其携带的#G/%s#Y",玩家数据[id].角色.名称,名称),频道="xt"})--这里每个%s对应后面 ,的一个超连接数据

--             elseif 奖励参数<=25 then
--             local 名称="特殊兽诀·碎片"
--             玩家数据[id].道具:给予道具(id,名称,1)
--             常规提示(id,"#Y/你获得了"..名称)
--             广播消息({内容=format("#S(沸涌炎海的信标)#R/%s#Y在#R沸涌炎海#S一顿乱摸，因此获得了其携带的#G/%s#Y",玩家数据[id].角色.名称,名称),频道="xt"})

--              elseif 奖励参数<=35 then
--             local 名称="特殊兽诀·碎片"
--             玩家数据[id].道具:给予道具(id,名称,1)
--             常规提示(id,"#Y/你获得了"..名称)
--             广播消息({内容=format("#S(沸涌炎海的信标)#R/%s#Y在#R沸涌炎海#S一顿乱摸，因此获得了其携带的#G/%s#Y",玩家数据[id].角色.名称,名称),频道="xt"})

--         else
--             ----------自己写
--         end
--     end---for循环结束

-- end---整个函数结束
--------------------------------------------------------------炎海----------------------------------------------------
function 自写活动:沸涌炎海的信标(id)
  local 怪物名称 = {"沸涌炎海巡守","沸涌炎海帝子","沸涌炎海统御"}
  local 生肖模型 = {"食铁兽","火月蛙","炎魔神"}
  local 地图范围={5001}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.1"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.1,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【沸涌炎海】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
----------------------
function 自写活动:完成沸涌炎海的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(3000,30000)
        local 银子=平均等级*取随机数(500,1000)
        local 仙玉=平均等级*1+100
        local 通知开关=true
        local 奖励参数=取随机数(1,100)
        玩家数据[id].角色:添加经验(经验,"沸涌炎海的信标",1)
        玩家数据[id].角色:添加银子(银子,"沸涌炎海的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"沸涌炎海的信标",1)

        local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=11 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=15  then
            玩家数据[id].道具:给予道具(id,"星辉石",1)
               广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"星辉石"),频道="xt"})
        elseif 奖励参数<=24  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",3)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=26 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"菩提果",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"随机经验礼包",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"随机仙玉礼包",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"修炼果",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"九转金丹",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
----------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:钢铁炼境的信标(id)
  local 怪物名称 = {"钢铁炼境巡守","钢铁炼境帝子","钢铁炼境统御"}
  local 生肖模型 = {"进阶白熊","进阶黑山老妖","进阶地狱战神"}
  local 地图范围={1241}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.2"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.2,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【钢铁炼境】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成钢铁炼境的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(4000,40000)
        local 银子=平均等级*取随机数(500,1500)
        local 仙玉=平均等级*1.5+100
        local 通知开关=true
        local 奖励参数=取随机数(1,112)
        玩家数据[id].角色:添加经验(经验,"钢铁炼境的信标",1)
        玩家数据[id].角色:添加银子(银子,"钢铁炼境的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"钢铁炼境的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=11 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=15  then
            玩家数据[id].道具:给予道具(id,"星辉石",1)
               广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"星辉石"),频道="xt"})
        elseif 奖励参数<=24  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",3)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=26 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"菩提果",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"随机经验礼包",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"随机仙玉礼包",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"修炼果",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"九转金丹",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",1)
              广播消息({内容=format("#S【沸涌炎海的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
----------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:雷鸣废土的信标(id)
  local 怪物名称 = {"雷鸣废土巡守","雷鸣废土帝子","雷鸣废土统御"}
  local 生肖模型 = {"进阶雨师","净瓶女娲","进阶雷龙"}
  local 地图范围={1885}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.3"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        可见id=id,
        玩家id=id,
        起始=os.time(),
        结束=1800,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.3,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【雷鸣废土】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成雷鸣废土的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(5000,50000)
        local 银子=平均等级*取随机数(500,2000)
        local 仙玉=平均等级*2+200
        local 通知开关=true
        local 奖励参数=取随机数(1,115)
        玩家数据[id].角色:添加经验(经验,"雷鸣废土的信标",1)
        玩家数据[id].角色:添加银子(银子,"雷鸣废土的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"雷鸣废土的信标",1)


local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=12 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=25 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=33 then
            玩家数据[id].道具:给予道具(id,"菩提果",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=36 then
            玩家数据[id].道具:给予道具(id,"随机经验礼包",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"随机仙玉礼包",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"修炼果",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"九转金丹",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",2)
              广播消息({内容=format("#S【雷鸣废土的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
--------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:幽夜暗域的信标(id)
  local 怪物名称 = {"幽夜暗域巡守","幽夜暗域帝子","幽夜暗域统御"}
  local 生肖模型 = {"雷龙","进阶谛听","风祖飞廉"}
  local 地图范围={1223}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.4"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        可见id=id,
        玩家id=id,
        起始=os.time(),
        结束=1800,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.4,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【幽夜暗域】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成幽夜暗域的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(6000,60000)
        local 银子=平均等级*取随机数(500,2500)
        local 仙玉=平均等级*2.5+250
        local 通知开关=true
        local 奖励参数=取随机数(1,122)
        玩家数据[id].角色:添加经验(经验,"幽夜暗域的信标",1)
        玩家数据[id].角色:添加银子(银子,"幽夜暗域的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"幽夜暗域的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=13 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=25 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"菩提果",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"随机经验礼包",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"随机仙玉礼包",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"修炼果",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"九转金丹",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",3)
              广播消息({内容=format("#S【幽夜暗域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:混乱终末的信标(id)
  local 怪物名称 = {"混乱终末巡守","混乱终末帝子","混乱终末统御"}
  local 生肖模型 = {"新二大王","新猪八戒","新孙悟空"}
  local 地图范围={1041}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.5"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        玩家id=id,
        可见id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.5,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【混乱终末】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成混乱终末的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(7000,70000)
        local 银子=平均等级*取随机数(500,3000)
        local 仙玉=平均等级*3+280
        local 通知开关=true
        local 奖励参数=取随机数(1,127)
        玩家数据[id].角色:添加经验(经验,"混乱终末的信标",1)
        玩家数据[id].角色:添加银子(银子,"混乱终末的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"混乱终末的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=14 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",3)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=26 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",3)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"菩提果",4)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"随机经验大礼包",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"随机仙玉大礼包",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=46 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=48 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"修炼果",5)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"九转金丹",5)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",4)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",4)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",4)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",4)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",4)
              广播消息({内容=format("#S【混乱终末的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
---------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:伟大虚空的信标(id)
  local 怪物名称 = {"伟大虚空巡守","伟大虚空帝子","伟大虚空统御"}
  local 生肖模型 = {"自在天魔宝珠","自在天魔","自在天魔刀"}
  local 地图范围={1212}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.6"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.6,
        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【伟大虚空】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成伟大虚空的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(8000,80000)
        local 银子=平均等级*取随机数(500,3500)
        local 仙玉=平均等级*3.5+300
        local 通知开关=true
        local 奖励参数=取随机数(1,127)
        玩家数据[id].角色:添加经验(经验,"伟大虚空的信标",1)
        玩家数据[id].角色:添加银子(银子,"伟大虚空的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"伟大虚空的信标",1)

 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=15 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=20  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",4)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=25 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",4)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"菩提果",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=40 then
            玩家数据[id].道具:给予道具(id,"随机经验大礼包",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=42 then
            玩家数据[id].道具:给予道具(id,"随机仙玉大礼包",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=45 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=48 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=55 then
            玩家数据[id].道具:给予道具(id,"修炼果",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=69 then
            玩家数据[id].道具:给予道具(id,"九转金丹",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",5)
              广播消息({内容=format("#S【伟大虚空的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
--------------------------------------------------------------------------------------------------------------------------------------
function 自写活动:巅峰领域的信标(id)
  local 怪物名称 = {"巅峰领域巡守","巅峰领域帝子","巅峰领域统御"}
  local 生肖模型 = {"进阶雷龙","进阶涂山雪","进阶大力金刚"}
  local 地图范围={5006}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=1,5 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187.7"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=1800,
        可见id=id,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187.7,

        销毁=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#S神秘人打开了【巅峰领域】的封印#G%s#W珠光宝气、霞光满天，究竟是福是祸，犹未可知".."#"..取随机数(1,110),刷新地图[1],刷新地图[2]),频道="xt"})
end
-----
function 自写活动:完成巅峰领域的信标(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(9000,90000)
        local 银子=平均等级*取随机数(500,4000)
        local 仙玉=平均等级*4+350
        local 通知开关=true
        local 奖励参数=取随机数(1,127)
        玩家数据[id].角色:添加经验(经验,"巅峰领域的信标",1)
        玩家数据[id].角色:添加银子(银子,"巅峰领域的信标",1)
        玩家数据[id].角色:添加仙玉(仙玉,"巅峰领域的信标",1)


 local 奖励参数=取随机数()
        if 奖励参数<=10 then
        elseif 奖励参数<=15 then
            玩家数据[id].道具:给予道具(id,"抽奖令牌",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"抽奖令牌"),频道="xt"})
        elseif 奖励参数<=22  then
            玩家数据[id].道具:给予道具(id,"特殊兽决·碎片",5)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,3),玩家数据[id].角色.名称,"特殊兽决·碎片"),频道="xt"})
        elseif 奖励参数<=29 then
            玩家数据[id].道具:给予道具(id,"超级兽决·碎片",5)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"超级兽决·碎片"),频道="xt"})
        elseif 奖励参数<=35 then
            玩家数据[id].道具:给予道具(id,"菩提果",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"菩提果"),频道="xt"})
        elseif 奖励参数<=38 then
            玩家数据[id].道具:给予道具(id,"随机经验大礼包",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机经验礼包"),频道="xt"})
        elseif 奖励参数<=42 then
            玩家数据[id].道具:给予道具(id,"随机仙玉大礼包",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"随机仙玉礼包"),频道="xt"})
        elseif 奖励参数<=50 then
            玩家数据[id].道具:给予道具(id,"附魔宝珠",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"附魔宝珠"),频道="xt"})
        elseif 奖励参数<=53 then
            玩家数据[id].道具:给予道具(id,"战魄",1)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"战魄"),频道="xt"})
        elseif 奖励参数<=60 then
            玩家数据[id].道具:给予道具(id,"修炼果",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"修炼果"),频道="xt"})
        elseif 奖励参数<=70 then
            玩家数据[id].道具:给予道具(id,"九转金丹",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"九转金丹"),频道="xt"})
        elseif 奖励参数<=80 then
            玩家数据[id].道具:给予道具(id,"神兜兜",5)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"神兜兜"),频道="xt"})
        elseif 奖励参数<=85 then
            玩家数据[id].道具:给予道具(id,"青龙印",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"青龙印"),频道="xt"})
        elseif 奖励参数<=90 then
            玩家数据[id].道具:给予道具(id,"白虎印",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"白虎印"),频道="xt"})
        elseif 奖励参数<=95 then
            玩家数据[id].道具:给予道具(id,"朱雀印",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"朱雀印"),频道="xt"})
        elseif 奖励参数<=100 then
            玩家数据[id].道具:给予道具(id,"玄武印",6)
              广播消息({内容=format("#S【巅峰领域的信标】%s#R狗屎运爆棚,居然获得了#%s".."#"..取随机数(1,1),玩家数据[id].角色.名称,"玄武印"),频道="xt"})

        end
    end
end
----------------------------------------------------------------------------

function 自写活动:圣兽青龙()
  local 怪物名称 = {"圣兽青龙"}
  local 生肖模型 = {"进阶虬龙"}
  local 地图范围={1343}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=50,80 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1187"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3600,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1187,----------------------------------------------------------------
        销毁=true,
        饰品=true,
        行走开关=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#P（四圣兽）#Y上古四圣兽已被放出，现在正在#G%s#W场景中叫嚣···".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end
---
function 自写活动:圣兽白虎()
  local 怪物名称 = {"圣兽白虎"}
  local 生肖模型 = {"进阶噬天虎"}
  local 地图范围={1343}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=50,80 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1188"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3600,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1188,----------------------------------------------------------------
        销毁=true,
        饰品=true,
        行走开关=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#P（四圣兽）#Y上古四圣兽已被放出，现在正在#G%s#W场景中叫嚣···".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end
---
function 自写活动:圣兽朱雀()
  local 怪物名称 = {"圣兽朱雀"}
  local 生肖模型 = {"执音"}
  local 地图范围={1343}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=50,80 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1189"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3600,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1189,----------------------------------------------------------------
        销毁=true,
        饰品=true,
        行走开关=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#P（四圣兽）#Y上古四圣兽已被放出，现在正在#G%s#W场景中叫嚣···".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end
---
function 自写活动:圣兽玄武()
  local 怪物名称 = {"圣兽玄武"}
  local 生肖模型 = {"进阶龙龟"}
  local 地图范围={1343}
  local 刷新地图={}
  for i=1,#地图范围 do
    local 地图=地图范围[i]
    for k=50,80 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      local 任务id="_"..i.."_"..取随机数(1,99).."1190"..os.time().."_"..随机序列.."_"..取随机数(99,99)
      随机序列=随机序列+1
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3600,
        玩家id=id,
        队伍组={},
        名称=怪物名称[i],
        模型=生肖模型[取随机数(1,#生肖模型)],
        x=xy.x,
        y=xy.y,
        地图编号=地图,
        战斗显示=true,
        地图名称=取地图名称(地图),
        类型=1190,----------------------------------------------------------------
        销毁=true,
        饰品=true,
        行走开关=true,
      }
      地图处理类:添加单位(任务id)
    end
    刷新地图[#刷新地图+1] = 取地图名称(地图)
  end
   广播消息({内容=format("#P（四圣兽）#Y上古四圣兽已被放出，现在正在#G%s#W场景中叫嚣···".."#"..取随机数(1,110),刷新地图[1]),频道="xt"})
end

function 自写活动:完成圣兽青龙(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2000,2200)
        local 银子=平均等级*160+22000
        local 修业数额=HDPZ["圣兽青龙"].银子*取随机数(120,300)
        玩家数据[id].角色:添加经验(经验,"圣兽青龙",1)
        玩家数据[id].角色:添加银子(银子,"圣兽青龙",1)
        玩家数据[id].角色:添加储备(银子,"圣兽青龙",1)
        if 玩家数据[id].角色.修业点==nil then 玩家数据[id].角色.修业点=0 end
        玩家数据[id].角色.修业点=玩家数据[id].角色.修业点+修业数额
        常规提示(id,"你的修业点增加了#R"..修业数额.."点")
        if 取随机数()<=HDPZ["圣兽青龙"].爆率 then
            local 链接 = {提示=format("#S(圣兽青龙)#R/%s#Y经过一番激烈的战斗，最终战胜了#R圣兽青龙#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["圣兽青龙"].ITEM),"圣兽青龙")
                    if 数量== 9999 then
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成圣兽白虎(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2000,2200)
        local 银子=平均等级*160+22000
        local 修业数额=HDPZ["圣兽白虎"].银子*取随机数(120,300)
        玩家数据[id].角色:添加经验(经验,"圣兽白虎",1)
        玩家数据[id].角色:添加银子(银子,"圣兽白虎",1)
        玩家数据[id].角色:添加储备(银子,"圣兽白虎",1)
        if 玩家数据[id].角色.修业点==nil then 玩家数据[id].角色.修业点=0 end
        玩家数据[id].角色.修业点=玩家数据[id].角色.修业点+修业数额
        常规提示(id,"你的修业点增加了#R"..修业数额.."点")
        if 取随机数()<=HDPZ["圣兽白虎"].爆率 then
            local 链接 = {提示=format("#S(圣兽白虎)#R/%s#Y经过一番激烈的战斗，最终战胜了#R圣兽白虎#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["圣兽白虎"].ITEM),"圣兽白虎")
                    if 数量== 9999 then
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成圣兽朱雀(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2000,2200)
        local 银子=平均等级*160+22000
        local 修业数额=HDPZ["圣兽朱雀"].银子*取随机数(120,300)
        玩家数据[id].角色:添加经验(经验,"圣兽朱雀",1)
        玩家数据[id].角色:添加银子(银子,"圣兽朱雀",1)
        玩家数据[id].角色:添加储备(银子,"圣兽朱雀",1)
        if 玩家数据[id].角色.修业点==nil then 玩家数据[id].角色.修业点=0 end
        玩家数据[id].角色.修业点=玩家数据[id].角色.修业点+修业数额
        常规提示(id,"你的修业点增加了#R"..修业数额.."点")
        if 取随机数()<=HDPZ["圣兽朱雀"].爆率 then
            local 链接 = {提示=format("#S(圣兽朱雀)#R/%s#Y经过一番激烈的战斗，最终战胜了#R圣兽朱雀#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["圣兽朱雀"].ITEM),"圣兽朱雀")
                    if 数量== 9999 then
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成圣兽玄武(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2000,2200)
        local 银子=平均等级*160+22000
        local 修业数额=HDPZ["圣兽玄武"].银子*取随机数(120,300)
        玩家数据[id].角色:添加经验(经验,"圣兽玄武",1)
        玩家数据[id].角色:添加银子(银子,"圣兽玄武",1)
        玩家数据[id].角色:添加储备(银子,"圣兽玄武",1)
        if 玩家数据[id].角色.修业点==nil then 玩家数据[id].角色.修业点=0 end
        玩家数据[id].角色.修业点=玩家数据[id].角色.修业点+修业数额
        常规提示(id,"你的修业点增加了#R"..修业数额.."点")
        if 取随机数()<=HDPZ["圣兽玄武"].爆率 then
            local 链接 = {提示=format("#S(圣兽玄武)#R/%s#Y经过一番激烈的战斗，最终战胜了#R圣兽玄武#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["圣兽玄武"].ITEM),"圣兽玄武")
                    if 数量== 9999 then
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end


function 自写活动:战斗胜利处理(id组,战斗类型,任务id) --这里少了函数名称啊
    if 任务数据[任务id]==nil then
        return
    end
    地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    任务数据[任务id]=nil
    if 战斗类型==155559 then
        self:完成知了大王(id组)
     elseif 战斗类型==155557 then
        self:完成裂风兽(id组)
    elseif 战斗类型==155560 then
        self:完成知了统领(id组)
    elseif 战斗类型==155565 then
        self:完成千年知了王(id组)
    elseif 战斗类型==155561 then
        self:完成知了小王(id组)
    elseif 战斗类型==155562 then
        self:完成50级世界boss(id组)
    elseif 战斗类型==155563 then
        self:完成100级世界boss(id组)
    elseif 战斗类型==155564 then
        self:完成150级世界boss(id组)
    elseif 战斗类型==155558 then
        self:完成六星天罡(id组)
    elseif 战斗类型==155564.11 then
        self:完成圣兽青龙(id组)
    elseif 战斗类型==155564.21 then
        self:完成圣兽白虎(id组)
    elseif 战斗类型==155564.31 then
        self:完成圣兽朱雀(id组)
    elseif 战斗类型==155564.41 then
        self:完成圣兽玄武(id组)

--------------------------------宝石怪
    elseif 战斗类型==155564.1 then
        self:完成沸涌炎海的信标(id组)

    elseif 战斗类型==155564.2 then
        self:完成钢铁炼境的信标(id组)

    elseif 战斗类型==155564.3 then
        self:完成雷鸣废土的信标(id组)

    elseif 战斗类型==155564.4 then
        self:完成幽夜暗域的信标(id组)

    elseif 战斗类型==155564.5 then
        self:完成混乱终末的信标(id组)

    elseif 战斗类型==155564.6 then
        self:完成伟大虚空的信标(id组)

    elseif 战斗类型==155564.7 then
        self:完成巅峰领域的信标(id组)

    end
end
function 自写活动:完成知了大王(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2200,2300)
        local 银子=平均等级*160+24000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了大王"].经验,"知了大王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了大王"].银子),"知了大王",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["知了大王"].银子),"知了大王",1)
        if 取随机数()<=HDPZ["知了大王"].爆率 then
            local 链接 = {提示=format("#S(知了大王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了大王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["知了大王"].ITEM),"知了大王")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成知了统领(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(1950,2050)
        local 银子=平均等级*160+20000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了统领"].经验,"知了统领",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了统领"].银子),"知了统领",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["知了统领"].银子),"知了统领",1)
           if 取随机数()<=HDPZ["知了统领"].爆率 then
           local 链接 = {提示=format("#S(知了统领)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了统领#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
           local 名称,数量,参数=生成产出(产出物品计算(HDPZ["知了统领"].ITEM),"知了统领")
           if 数量== 9999 then --环
           玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
        else
            玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
            end
        end
    end
end
function 自写活动:完成千年知了王(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2200,2500)
        local 银子=平均等级*160+30000
        玩家数据[id].角色:添加每日活跃度(id, 1)
        玩家数据[id].角色:添加经验(经验*HDPZ["千年知了王"].经验,"千年知了王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["千年知了王"].银子),"千年知了王",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["千年知了王"].银子),"千年知了王",1)
         if  玩家数据[id].角色.活跃度==nil then
            玩家数据[id].角色.活跃度=0
        end
        if  玩家数据[id].角色.累积活跃==nil then
            玩家数据[id].角色.累积活跃=0
        end
           玩家数据[id].角色.活跃度 =玩家数据[id].角色.活跃度+5
           玩家数据[id].角色.累积活跃 =玩家数据[id].角色.累积活跃+5
           常规提示(id, "#Y/你获得了1点活跃度\n(#G用于领取奖励和签到#)")
        if 取随机数()<=HDPZ["千年知了王"].爆率 then
            local 链接 = {提示=format("#S(千年知了王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R千年知了王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["千年知了王"].ITEM),"千年知了王")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成知了小王(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(2000,2200)
        local 银子=平均等级*160+22000
        玩家数据[id].角色:添加经验(经验*HDPZ["知了小王"].经验,"知了小王",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["知了小王"].银子),"知了小王",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["知了小王"].银子),"知了小王",1)
        if 取随机数()<=HDPZ["知了小王"].爆率 then
            local 链接 = {提示=format("#S(知了小王)#R/%s#Y经过一番激烈的战斗，最终战胜了#R知了小王#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["知了小王"].ITEM),"知了小王")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成裂风兽(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(6666,6888)+5000000
        local 银子=平均等级*1666+500000
        玩家数据[id].角色:添加经验(经验*HDPZ["裂风兽"].经验,"裂风兽",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["裂风兽"].银子),"裂风兽",1)
        玩家数据[id].角色:添加储备(qz(银子*0.2*HDPZ["裂风兽"].银子),"裂风兽",1)
        玩家数据[id].角色:添加每日活跃度(id, 10)
        if 取随机数()<=HDPZ["裂风兽"].爆率 then
            local 链接 = {提示=format("#S(裂风兽)#R/%s#Y经过一番激烈的战斗，最终战胜了#R裂风兽#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["裂风兽"].ITEM),"裂风兽")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成50级世界boss(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(18000,19000)
        local 银子=平均等级*500+100000
        玩家数据[id].角色:添加经验(经验*HDPZ["远古妖魔头目"].经验,"远古妖魔头目",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["远古妖魔头目"].银子),"远古妖魔头目",1)
        if 取随机数()<=HDPZ["远古妖魔头目"].爆率 then
            local 链接 = {提示=format("#S(远古妖魔头目)#R/%s#Y经过一番激烈的战斗，最终战胜了#R妖魔头目#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["远古妖魔头目"].ITEM),"远古妖魔头目")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                         玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成100级世界boss(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(19000,20500)
        local 银子=平均等级*500+150000
        玩家数据[id].角色:添加经验(经验*HDPZ["远古妖魔领主"].经验,"远古妖魔领主",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["远古妖魔领主"].银子),"远古妖魔领主",1)
        if 取随机数()<=HDPZ["远古妖魔领主"].爆率 then
            local 链接 = {提示=format("#S(远古妖魔领主)#R/%s#Y经过一番激烈的战斗，最终战胜了#R妖魔领主#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["远古妖魔领主"].ITEM),"远古妖魔领主")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
                    end
        end
    end
end
function 自写活动:完成150级世界boss(id组)
    for n=1,#id组 do
        local id=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(20000,21500)
        local 银子=平均等级*500+180000
        玩家数据[id].角色:添加经验(经验*HDPZ["远古妖魔尊主"].经验,"远古妖魔尊主",1)
        玩家数据[id].角色:添加银子(qz(银子*HDPZ["远古妖魔尊主"].银子),"远古妖魔尊主",1)
        if 取随机数()<=HDPZ["远古妖魔尊主"].爆率 then
            local 链接 = {提示=format("#S(远古妖魔尊主)#R/%s#Y经过一番激烈的战斗，最终战胜了#R妖魔头目#Y，#Y因此获得了唐王奖励的#G/",玩家数据[id].角色.名称),频道="xt",结尾="#"..取随机数(1,110)}
                    local 名称,数量,参数=生成产出(产出物品计算(HDPZ["远古妖魔尊主"].ITEM),"远古妖魔尊主")
                    if 数量== 9999 then --环
                        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
                    else
                        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
             end
        end
    end
end
function 自写活动:完成六星天罡(id组)
    for n=1,#id组 do
        local id=id组[n]
        local cyid=id组[n]
        local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
        local 经验=平均等级*取随机数(5666,5888)+5000000
        local 银子=平均等级*1555+150000
        玩家数据[id].角色:添加每日活跃度(id, 5)
        玩家数据[id].角色:添加经验(经验,"六星天罡",1)
        玩家数据[id].角色:添加银子(银子,"六星天罡",1)
         if  玩家数据[id].角色.活跃度==nil then
            玩家数据[id].角色.活跃度=0
        end
        if  玩家数据[id].角色.累积活跃==nil then
            玩家数据[id].角色.累积活跃=0
        end
           玩家数据[id].角色.活跃度 =玩家数据[id].角色.活跃度+5
           玩家数据[id].角色.累积活跃 =玩家数据[id].角色.累积活跃+5
           常规提示(id, "#Y/你获得了1点活跃度\n(#G用于领取奖励和签到#)")
        if 取随机数()<=80 then
                local 奖励参数=取随机数(1,100)
                链接={提示=format("#S(六星天罡)#G/%s#Y击败了六星天罡并意外获得了其慌忙逃走时丢下的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
                 if 奖励参数<=15 then
                    local 名称="战魄"
                   玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=30 then
                    local 名称="神兜兜礼包"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=35 then
                    local 名称="特技书"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=40 then
                    local 名称="修炼果礼包"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=55 then
                    local 名称="特殊兽诀礼盒"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=58 then
                    local 名称="特殊兽诀·碎片"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,5,nil,链接)
                  elseif 奖励参数<=70 then
                    local 名称="超级兽诀·碎片"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,5,nil,链接)
                  elseif 奖励参数<=80 then
                    local 名称="双加转换符"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                 elseif 奖励参数<=85 then
                    local 名称="愤怒符"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=88 then
                    local 名称="不磨符"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                else
                    local 名称="装备特效宝珠"
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,2),nil,链接)
            end
        end
    end
end



return 自写活动