-- @Author: baidwwy
-- @Date:   2024-07-18 17:24:23
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-28 19:41:45
local 雁塔地宫 = class()
function 雁塔地宫:初始化()
	self.活动开关=false
	self.间隔=30
	self.数据={}
	if f函数.文件是否存在([[sql/雁塔地宫.txt]])==false then
		写出文件([[sql/雁塔地宫.txt]],table.tostring({}))
	else
		self.数据=table.loadstring(读入文件([[sql/雁塔地宫.txt]]))
	end

	self:加载数据()
	self:更新怪物()
end

function 雁塔地宫:每日下调()
	for k,v in pairs(self.数据) do
		v.层数=v.层数-10
		v.次数=0
		if v.层数<1 then
		   v.层数=1
		end
	end
	写出文件([[sql/雁塔地宫.txt]],table.tostring(self.数据))
end

function 雁塔地宫:每周归零()
	self.数据={}
	写出文件([[sql/雁塔地宫.txt]],table.tostring({}))
end

function 雁塔地宫:取地宫最低层数(队员)
	 local tab = {}
	 for n = 1, #队员 do
	 	if not self.数据[队员[n]] then
	 	    self.数据[队员[n]] ={层数=1,次数=0}
	 	end
		tab[n] = {cs =  self.数据[队员[n]].层数,id=队员[n]}
	 end
	 table.sort(tab, function(a, b) return a.cs < b.cs end)
	 return tab[1].cs,tab[1].id
end

function 雁塔地宫:地宫对话内容(map,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	local mx=self.取怪物[(map-3000+1)][1].模型
	if 编号 == 1 then
		wb[1] = "我乃第"..(map-3000+1).."层的守护兽，少侠可有勇气挑战我？"
		local xx = {"我来会会你","我准备一下"}
		return {mx,mx,wb[取随机数(1,#wb)],xx}
	elseif 编号 == 2 then
		wb[1] ="我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我只是看看"}
		return {"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	end
	return
end

function 雁塔地宫:对话事件处理(id,名称,事件,地图编号)
	if 事件=="送我进去（队伍最深层数）" then
		if not 调试模式 and (玩家数据[id].队伍==0 or 取队伍人数(id)<3 or 取队伍最低等级(玩家数据[id].队伍,50)) then
			添加最后对话(id,"地宫对于少侠来说还是过于危险了，还是好好磨练一番再来吧。（进入地宫需要等级≥50，人数≥3人）") return
		end
		for n = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
		 	local cyid=队伍数据[玩家数据[id].队伍].成员数据[n]
		 	if 玩家数据[cyid].角色.飞行中 then
				添加最后对话(id,"#Y/地宫中凶险万分，少侠还是走路比较安全。（禁止飞行）")
				return
			end
		 end
		local  层数,aidi = self:取地宫最低层数(队伍数据[玩家数据[id].队伍].成员数据)
		添加最后对话(id,"目前你们队伍中层数最低的玩家是#Y"..玩家数据[aidi].角色.名称.."，层数："..层数.."层#W。我的能力只能送你们去这个层数，是否考虑好了？",{"请送我们过去吧","我再想想"})
	elseif 事件=="请送我们过去吧" then
		if not 调试模式 and (玩家数据[id].队伍==0 or 取队伍人数(id)<3 or 取队伍最低等级(玩家数据[id].队伍,50)) then
			添加最后对话(id,"地宫对于少侠来说还是过于危险了，还是好好磨练一番再来吧。（进入地宫需要等级≥50，人数≥3人）") return
		end

		 local  层数,aidi =  self:取地宫最低层数(队伍数据[玩家数据[id].队伍].成员数据)
		地图处理类:跳转地图(id,self.ditu.层数[层数],self.ditu.传送坐标[层数].x,self.ditu.传送坐标[层数].y)
	elseif 事件=="了解地宫规则" then
		添加最后对话(id,"雁塔地宫为不限时挑战模式，每日可进行30次挑战，每天晚12点会自动下降10层挑战层数，每周日晚12点将自动归零。每次挑战按队伍中最低层数来进行。")
	elseif 事件=="我来会会你" then
		local 怪物层数=地图编号-3000+1
		local  层数,aidi =  self:取地宫最低层数(队伍数据[玩家数据[id].队伍].成员数据)
		if 层数>=100 then
		    return 添加最后对话(id,"你已经达到最顶层100层。")
		end
		for n = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
		 	local cyid=队伍数据[玩家数据[id].队伍].成员数据[n]
		 	if 怪物层数~=层数 then
		 	    添加最后对话(id,"你们目前应该挑战的层数为："..层数.."层")
				return
		 	end

		 	if self.数据[cyid].次数>=30 then
		 		添加最后对话(id,"队伍中#Y".. 玩家数据[cyid].角色.名称.."今日挑战次数已达30次，无法再继续挑战！")
				return
		 	end
		 end
		战斗准备类:创建战斗(id,140000,1)
	end
end
function 雁塔地宫:取奖励等级(层数)
	if 层数<=10 then
	    return "地宫1至10"
	    elseif 层数<=20 then
	    return "地宫11至20"
	    elseif 层数<=30 then
	    return "地宫21至30"
	    elseif 层数<=40 then
	    return "地宫31至40"
	    elseif 层数<=50 then
	    return"地宫41至50"
	    elseif 层数<=60 then
	    return "地宫51至60"
	    elseif 层数<=70 then
	    return "地宫61至70"
	    elseif 层数<=80 then
	    return "地宫71至80"
	    elseif 层数<=90 then
	    return "地宫81至90"
	    else
	    return "地宫91至100"
	end
end
function 雁塔地宫:战斗胜利处理(id组,战斗类型)
	self.数据[id组[1]].层数=self.数据[id组[1]].层数+1
	local cs=self.数据[id组[1]].层数
	for n=1,#id组 do
		local id=id组[n]
		玩家数据[id].zhandou=0
		if self.数据[id] then
			self.数据[id].层数=cs
		else
			self.数据[id] ={层数=cs,重置=false,次数=0}
		end
		self.数据[id].层数=cs
		self.数据[id].次数=self.数据[id].次数+1
		local 等级=玩家数据[id].角色.等级
		local 经验=等级*2888+cs*3000
		local 银子=等级*355+cs*555
		local jiangli=self:取奖励等级(cs)
		玩家数据[id].角色:添加经验(经验*HDPZ[jiangli].经验,"雁塔地宫",1)
		玩家数据[id].角色:添加银子(银子*HDPZ[jiangli].银子,"雁塔地宫",1)
		if 取随机数()<=HDPZ[jiangli].爆率 then
			local 链接 = {提示=format("#S(雁塔地宫)#G/%s#Y少侠在雁塔地宫中不断探寻，并成功通过了#P/%s#Y层地宫守护兽的考验，神秘人将地宫中挖掘出的",玩家数据[id].角色.名称,cs),频道="hd",结尾="#Y奖励给他，真是令人羡慕#80#80#80"}
			local 名称,数量,参数=生成产出(产出物品计算(HDPZ[jiangli].ITEM),jiangli)
			if 数量== 9999 then --环
				玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			else
				玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			end
		end
	end
	if self.ditu.层数[cs] then
	    地图处理类:跳转地图(id组[1],self.ditu.层数[cs],self.ditu.传送坐标[cs].x,self.ditu.传送坐标[cs].y)
	end
end

local 前缀属性={}
前缀属性["强壮的"]={增伤百分比=20,气血=50}
前缀属性["全能的"]={气血=20,伤害=20,法伤=20,速度=20}
前缀属性["坚定的"]={抵抗封印等级=50}
前缀属性["激进的"]={速度=50}
前缀属性["肥胖的"]={速度=-40,气血=100}
前缀属性["笨重的"]={速度=-40,气血=40}
前缀属性["无畏的"]={抵抗封印等级=20}
前缀属性["裸衣的"]={受伤百分比=50,增伤百分比=50}
前缀属性["坚韧的"]={受伤百分比=50}
前缀属性["好战的"]={递增伤害=5}
前缀属性["聪慧的"]={受伤百分比=150}
前缀属性["隐忍的"]={伤害=100}
前缀属性["偏执的"]={伤害=100}
前缀属性["疯癫的"]={伤害=400}
前缀属性["入魔的"]={受伤百分比=20,增伤百分比=50}
local 后缀属性={}
后缀属性["莽夫"]={伤害=5,法伤=5}
后缀属性["精英"]={气血=20,伤害=20,法伤=20,速度=20}
后缀属性["刺客"]={伤害=400,气血=-50} ---附带高级隐身，隐身结束前只会平么。
local fenlei={}
fenlei["物理"]={"大唐官府","狮驼岭","凌波城","阴曹地府","天宫","五庄观"}
fenlei["法系"]={"化生寺","方寸山","神木林","魔王寨","天宫","龙宫"}
fenlei["固伤"]={"女儿村","阴曹地府","无底洞","普陀山"}
fenlei["封系"]={"方寸山","女儿村","盘丝洞","无底洞","五庄观"}
fenlei["辅助"]={"化生寺","无底洞","普陀山"}

function 雁塔地宫:更新怪物()
	for a=1,#self.取怪物 do
		for b=1,#self.取怪物[a] do
			local 前缀=self.取怪物[a][b].前缀
			local 后缀=self.取怪物[a][b].后缀
			local 模型=self.取怪物[a][b].模型
			local 名称=模型
			self.取怪物[a][b].额外面板百分比={气血=1,伤害=1,法伤=1,速度=1,固定伤害=1,治疗能力=1,封印命中等级=1,抵抗封印等级=1,受伤百分比=1,增伤百分比=1,递增伤害=1} --百分比
			if 前缀 then
				名称=前缀..名称
				if 前缀属性[前缀] then
					for k,v in pairs(前缀属性[前缀]) do
						self.取怪物[a][b].额外面板百分比[k]=1+v/100
					end
				end
			end
			if 后缀 then
				名称=名称..后缀
				if 后缀属性[后缀] then
					for k,v in pairs(后缀属性[后缀]) do
						self.取怪物[a][b].额外面板百分比[k]=1+v/100
					end
				end
			end
			self.取怪物[a][b].名称=名称
			self.取怪物[a][b].QT={}
			if self.染色[模型] and self.染色[模型][前缀]  then
				self.取怪物[a][b].QT=table.copy(self.染色[模型][前缀])  --{变异=nil , 饰品=true , 染色方案=107 , 染色组={[1]=1,[2]=1} }
				if self.取怪物[a][b].QT.AI then
					if 前缀~="疯癫的" and 后缀~="刺客" then
					         if self.取怪物[a][b].QT.AI=="物理" and 取随机数()<=20 then
						elseif self.取怪物[a][b].QT.AI=="法系" and 取随机数()<=25 then
							local sss={"地狱烈火","奔雷咒","水漫金山","泰山压顶"}
							self.取怪物[a][b].QT.主动技能={sss[取随机数(1,4)]}
						else
							self.取怪物[a][b].QT.门派=fenlei[self.取怪物[a][b].QT.AI][取随机数(1,#fenlei[self.取怪物[a][b].QT.AI])]
						end
					end
				end
			end
		end
	end
end

function 雁塔地宫:加载数据()
	self.取怪物={
		[1]={
			{模型="白熊",前缀=nil,后缀=nil},--1
			{模型="白熊",前缀=nil,后缀=nil},--2
			{模型="白熊",前缀=nil,后缀=nil},--3
			{模型="白熊",前缀=nil,后缀=nil},--4
			{模型="白熊",前缀=nil,后缀=nil},--5
			{模型="白熊",前缀=nil,后缀=nil},--6
			{模型="白熊",前缀=nil,后缀=nil},--7
			{模型="白熊",前缀=nil,后缀=nil},--8
			{模型="白熊",前缀=nil,后缀=nil},--9
			{模型="白熊",前缀=nil,后缀=nil},--10
		},
		[2]={
			{模型="白熊",前缀=nil,后缀=nil},--1
			{模型="白熊",前缀=nil,后缀=nil},--2
			{模型="白熊",前缀=nil,后缀=nil},--3
			{模型="白熊",前缀=nil,后缀=nil},--4
			{模型="白熊",前缀=nil,后缀=nil},--5
			{模型="白熊",前缀=nil,后缀=nil},--6
			{模型="白熊",前缀=nil,后缀=nil},--7
			{模型="白熊",前缀=nil,后缀=nil},--8
			{模型="白熊",前缀=nil,后缀=nil},--9
			{模型="白熊",前缀=nil,后缀=nil},--10
		},
		[3]={
			{模型="白熊",前缀=nil,后缀=nil},--1
			{模型="白熊",前缀=nil,后缀=nil},--2
			{模型="白熊",前缀=nil,后缀=nil},--3
			{模型="天兵",前缀=nil,后缀=nil},--4
			{模型="天兵",前缀=nil,后缀=nil},--5
			{模型="白熊",前缀=nil,后缀=nil},--6
			{模型="白熊",前缀=nil,后缀=nil},--7
			{模型="白熊",前缀=nil,后缀=nil},--8
			{模型="白熊",前缀=nil,后缀=nil},--9
			{模型="白熊",前缀=nil,后缀=nil},--10
		},
		[4]={
			{模型="锦毛貂精",前缀=nil,后缀=nil},--1
			{模型="天兵",前缀=nil,后缀=nil},--2
			{模型="天兵",前缀=nil,后缀=nil},--3
			{模型="天兵",前缀=nil,后缀=nil},--4
			{模型="天兵",前缀=nil,后缀=nil},--5
			{模型="天兵",前缀=nil,后缀=nil},--6
			{模型="天兵",前缀=nil,后缀=nil},--7
			{模型="天兵",前缀=nil,后缀=nil},--8
			{模型="天兵",前缀=nil,后缀=nil},--9
			{模型="天兵",前缀=nil,后缀=nil},--10
		},
		[5]={
			{模型="白熊"   ,前缀="裸衣的" ,后缀=nil  },--1
			{模型="白熊" , 前缀=nil , 后缀=nil  },--2
			{模型="白熊" , 前缀=nil , 后缀=nil  },--3
			{模型="白熊" , 前缀=nil , 后缀=nil  },--4
			{模型="白熊" , 前缀=nil , 后缀=nil  },--5
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil  },--6
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil  },--7
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil  },--8
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil  },--9
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil  },--10
		},
		[6]={
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil  },--1 --粉红
			{模型="天兵" , 前缀=nil , 后缀=nil  },--2
			{模型="天兵" , 前缀=nil , 后缀=nil  },--3
			{模型="天兵" , 前缀=nil , 后缀=nil  },--4
			{模型="天兵" , 前缀=nil , 后缀=nil  },--5
			{模型="天兵" , 前缀=nil , 后缀=nil  },--6
			{模型="天兵" , 前缀=nil , 后缀=nil  },--7
			{模型="天兵" , 前缀=nil , 后缀=nil  },--8
			{模型="天兵" , 前缀=nil , 后缀=nil  },--9
			{模型="天兵" , 前缀=nil , 后缀=nil  },--10
		},
		[7]={
			{模型="雨师" , 前缀=nil , 后缀=nil  },--1
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="天兵" , 前缀=nil , 后缀=nil  },--4
			{模型="天兵" , 前缀=nil , 后缀=nil  },--5
			{模型="天兵" , 前缀=nil , 后缀=nil  },--6
			{模型="天兵" , 前缀=nil , 后缀=nil  },--7
			{模型="天兵" , 前缀=nil , 后缀=nil  },--8
			{模型="天兵" , 前缀=nil , 后缀=nil  },--9
			{模型="天兵" , 前缀=nil , 后缀=nil  },--10
		},
		[8]={
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil },--1
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--2--金黄
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil } ,--3--金黄
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--4
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--5
			{模型="雨师" , 前缀=nil , 后缀=nil  },--6
			{模型="天兵" , 前缀=nil , 后缀=nil  },--7
			{模型="天兵" , 前缀=nil , 后缀=nil  },--8
			{模型="天兵" , 前缀=nil , 后缀=nil  },--9
			{模型="天兵" , 前缀=nil , 后缀=nil  },--10
		},
		[9]={
			{模型="锦毛貂精" , 前缀=nil , 后缀=nil  },--1
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--2 --粉红
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--3 --粉红
			{模型="白熊"  , 前缀="坚韧的" , 后缀=nil },--4
			{模型="白熊"  , 前缀="坚韧的" , 后缀=nil  },--5
			{模型="雨师" , 前缀=nil , 后缀=nil  },--6
			{模型="雨师" , 前缀=nil , 后缀=nil  },--7
			{模型="雨师" , 前缀=nil , 后缀=nil  },--8
			{模型="雨师" , 前缀=nil , 后缀=nil  },--9
			{模型="雨师" , 前缀=nil , 后缀=nil  },--10
		},
		[10]={
			{模型="白熊" , 前缀="强壮的" , 后缀=nil  },--1
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil  },--2
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil  },--3
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--4
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--6
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil  },--7--红色
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil  },--8
			{模型="雨师" , 前缀=nil , 后缀=nil  },--9
			{模型="雨师" , 前缀=nil , 后缀=nil  },--10
		},
		[11]={
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--1
			{模型="白熊" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--3
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="雨师" , 前缀=nil , 后缀=nil  },--5
			{模型="雨师" , 前缀=nil , 后缀=nil  },--6
			{模型="雨师" , 前缀=nil , 后缀=nil  },--7
			{模型="雨师" , 前缀=nil , 后缀=nil  },--8
			{模型="雨师" , 前缀=nil , 后缀=nil  },--9
			{模型="雨师" , 前缀=nil , 后缀=nil  },--10
		},
		[12]={
			{模型="蚌精" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--3
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil  },--4
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--5
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--6
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--7
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--8
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--9
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--10
		},
		[13]={
			{模型="蚌精" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil  },--4
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--5
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--6
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--7
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--8
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--9
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--10
		},
		[14]={
			{模型="蚌精" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--3
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil  },--4
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--5
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--6
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--7
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--8
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--9
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil  },--10
		},
		[15]={
			{模型="蚌精" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--5
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--6
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--7
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--9
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--10
		},
		[16]={
			{模型="蚌精" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--4
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--5
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--6
            {模型="白熊" , 前缀="强壮的" , 后缀=nil },--7
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--8
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--9
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--10
		},
		[17]={
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--1
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--3
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--4
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--6
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--7
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--8
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--9
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--10
		},
		[18]={
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--1
			{模型="雨师" , 前缀="强壮的" , 后缀=nil },--2
			{模型="雨师" , 前缀="强壮的" , 后缀=nil },--3
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--4
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--5
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--6
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--7
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--8
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--9
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--10
		},
		[19]={
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--1
			{模型="白熊" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--5
			{模型="蚌精" , 前缀="坚韧的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--8
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--9
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--10
		},
		[20]={
			{模型="进阶狂豹人形" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--2
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--3
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--4
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--6
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--7
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--8
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--9
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--10
		},
		[21]={
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--1
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--2
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--5
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--6
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--7
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--8
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--9
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--10
		},
		[22]={
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--1
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--3
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--4
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[23]={
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--1
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--2
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--3
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--4
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[24]={
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--1
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--2
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--3
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--6
		},
		[25]={
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--4
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--5
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--6
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[26]={
			{模型="雷鸟人" , 前缀="好赌的" , 后缀=nil },--1
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--2
			{模型="蚌精" , 前缀="入魔的" , 后缀=nil },--3
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--4
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--6
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[27]={
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--1
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--2
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--3
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--4
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--6
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[28]={
			{模型="巨力神猿" , 前缀="强壮的" , 后缀=nil },--1
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--2
			{模型="蚌精" , 前缀="敏捷的" , 后缀=nil },--3
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--4
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--5
			{模型="巨力神猿" , 前缀="强壮的" , 后缀=nil },--6
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[29]={
			{模型="巨力神猿" , 前缀="强壮的" , 后缀=nil },--1
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="雨师" , 前缀="自愈的" , 后缀=nil },--3
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--4
			{模型="狂豹人形" , 前缀="强壮的" , 后缀=nil },--5
			{模型="进阶锦毛貂精" , 前缀="裸衣的" , 后缀="富豪" },--6
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--8
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--9
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--10
		},
		[30]={
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--1
			{模型="进阶天兵" , 前缀="强壮的" , 后缀="刺客" },--2
			{模型="进阶天兵" , 前缀="强壮的" , 后缀="刺客" },--3
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--4
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--5
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--7
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--8
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--9
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--10
		},
		[31]={
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--2
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--5
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--6
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[32]={
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--1
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--2
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--3
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--4
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--5
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--6
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[33]={
			{模型="巨力神猿" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="白熊" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="白熊" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="天兵" , 前缀="肥胖的" , 后缀=nil },--4
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="肥胖的" , 后缀=nil },--6
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[34]={
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="嗜血的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--4
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--6
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[35]={
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--4
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--6
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--7
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--8
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--9
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--10
		},
		[36]={
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--1
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="白熊" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--5
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--6
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--7
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--8
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--9
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--10
		},
		[37]={
			{模型="幽萤娃娃" , 前缀="无畏的" , 后缀=nil },--1
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--2
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--3
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--5
			{模型="幽萤娃娃" , 前缀="无畏的" , 后缀=nil },--6
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--9
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--10
		},
		[38]={
			{模型="画魂" , 前缀="虔诚的" , 后缀=nil },--1
			{模型="画魂" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="画魂" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--4
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--5
			{模型="天兵" , 前缀="汗血的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--7
			{模型="天兵" , 前缀="汗血的" , 后缀=nil },--8
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--9
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--10
		},
		[39 ]={
			{模型="画魂" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="画魂" , 前缀="虔诚的" , 后缀=nil },--2
			{模型="画魂" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--4
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--6
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--7
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--8
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--9
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--10
		},
		[40]={
			{模型="画魂" , 前缀="虔诚的" , 后缀=nil },--1
			{模型="进阶白熊" , 前缀="肥胖的" , 后缀="死士" },--2
			{模型="进阶白熊" , 前缀="肥胖的" , 后缀="死士" },--3
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--4
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--5
			{模型="幽萤娃娃" , 前缀="聪慧的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--7
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[41]={
			{模型="幽萤娃娃" , 前缀="无畏的" , 后缀=nil },--1
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--2
			{模型="雷鸟人" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="狂豹人形" , 前缀="肥胖的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--5
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--7
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[42]={
			{模型="混沌兽" , 前缀="聪慧的" , 后缀=nil },--1
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--2
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--3
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--4
			{模型="巨力神猿" , 前缀="裸衣的" , 后缀=nil },--5
			{模型="混沌兽" , 前缀="坚韧的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[43]={
			{模型="混沌兽" , 前缀="虔诚的" , 后缀=nil },--1
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--2
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--3
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--4
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--6
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--9
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--10
		},
		[44]={
			{模型="混沌兽" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="白熊" , 前缀="强壮的" , 后缀=nil },--2
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--3
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="雨师" , 前缀="强壮的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--6
			{模型="画魂" , 前缀="虔诚的" , 后缀=nil },--7
			{模型="画魂" , 前缀="坚韧的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[45]={
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--1
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--2
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--3
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--4
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--5
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--7
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[46]={
			{模型="天兵" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="天兵" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="天兵" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--4
			{模型="天兵" , 前缀="肥胖的" , 后缀=nil },--5
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--6
			{模型="白熊" , 前缀="坚韧的" , 后缀=nil },--7
			{模型="白熊" , 前缀="坚韧的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[47]={
			{模型="画魂" , 前缀="狡猾的" , 后缀=nil },--1
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--2
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="狡猾的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="狡猾的" , 后缀=nil },--5
			{模型="画魂" , 前缀="肥胖的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--7
			{模型="雷鸟人" , 前缀="聪慧的" , 后缀=nil },--8
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--9
			{模型="混沌兽" , 前缀="无畏的" , 后缀=nil },--10
		},
		[48]={
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--1
			{模型="白熊" , 前缀="疯癫的" , 后缀=nil },--2
			{模型="天兵" , 前缀="疯癫的" , 后缀=nil },--3
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--4
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--5
			{模型="混沌兽" , 前缀="聪慧的" , 后缀=nil },--6
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--7
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--8
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--9
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--10
		},
		[49]={
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--1
			{模型="画魂" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="画魂" , 前缀="狡猾的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="强壮的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--6
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--7
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--8
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[50]={
			{模型="进阶锦毛貂精" , 前缀="坚韧的" , 后缀="富豪" },--1
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="敏捷的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="狡猾的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="狡猾的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--6
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--8
			{模型="混沌兽" , 前缀="入魔的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[51]={
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="天兵" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="天兵" , 前缀="强壮的" , 后缀=nil },--3
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--4
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--5
			{模型="混沌兽" , 前缀="肥胖的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[52]={
			{模型="葫芦宝贝" , 前缀="狡猾的" , 后缀=nil },--1
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--3
			{模型="狂豹人形" , 前缀="裸衣的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="无畏的" , 后缀=nil },--5
			{模型="巨力神猿" , 前缀="裸衣的" , 后缀=nil },--6
			{模型="葫芦宝贝" , 前缀="狡猾的" , 后缀=nil },--7
			{模型="画魂" , 前缀="狡猾的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[53]={
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--1
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--4
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--5
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--6
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--7
			{模型="葫芦宝贝" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[54]={
			{模型="葫芦宝贝" , 前缀="敏捷的" , 后缀=nil },--1
			{模型="葫芦宝贝" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="葫芦宝贝" , 前缀="狡猾的" , 后缀=nil },--3
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--4
			{模型="白熊" , 前缀="裸衣的" , 后缀=nil },--5
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--6
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--7
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[55]={
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--1
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--2
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--3
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--4
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--5
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="葫芦宝贝" , 前缀="敏捷的" , 后缀=nil },--9
			{模型="葫芦宝贝" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[56]={
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--1
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="天兵" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--4
			{模型="巨力神猿" , 前缀="裸衣的" , 后缀=nil },--5
			{模型="葫芦宝贝" , 前缀="虔诚的" , 后缀=nil },--6
			{模型="葫芦宝贝" , 前缀="坚韧的" , 后缀=nil },--7
			{模型="葫芦宝贝" , 前缀="狡猾的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[57]={
			{模型="混沌兽" , 前缀="好赌的" , 后缀=nil },--1
			{模型="雷鸟人" , 前缀="好赌的" , 后缀=nil },--2
			{模型="雷鸟人" , 前缀="好赌的" , 后缀=nil },--3
			{模型="幽灵娃娃" , 前缀="好赌的" , 后缀=nil },--4
			{模型="幽灵娃娃" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--6
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--7
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--9
			{模型="葫芦宝贝" , 前缀="敏捷的" , 后缀=nil },--10
		},
		[58]={
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--1
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--2
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="无畏的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="无畏的" , 后缀=nil },--5
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="肥胖的" , 后缀=nil },--7
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--8
			{模型="狂豹人形" , 前缀="肥胖的" , 后缀=nil },--9
			{模型="狂豹人形" , 前缀="无畏的" , 后缀=nil },--10
		},
		[59]={
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--1
			{模型="画魂" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="画魂" , 前缀="狡猾的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="强壮的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="虔诚的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--7
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[60]={
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--1
			{模型="巴蛇" , 前缀="裸衣的" , 后缀=nil },--2
			{模型="巴蛇" , 前缀="裸衣的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--4
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--5
			{模型="葫芦宝贝" , 前缀="虔诚的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="虔诚的" , 后缀=nil },--7
			{模型="雨师" , 前缀="无畏的" , 虔诚的=nil },--8
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--9
			{模型="混沌兽" , 前缀="聪慧的" , 虔诚的=nil },--10
		},
		[61]={
			{模型="狂豹人形" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="夜罗刹" , 前缀="强制的" , 后缀=nil },--2
			{模型="夜罗刹" , 前缀="强制的" , 后缀=nil },--3
			{模型="雨师" , 前缀="坚韧的" , 后缀=nil },--4
			{模型="雨师" , 前缀="笨重的" , 后缀=nil },--5
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--6
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--7
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[62]={
			{模型="巴蛇" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="曼珠沙华" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="曼珠沙华" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="巴蛇" , 前缀="无畏的" , 后缀=nil },--4
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--5
			{模型="混沌兽" , 前缀="好赌的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--7
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--8
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--=9
			{模型="狂豹人形" , 前缀="强制的" , 后缀=nil },--10
		},
		[63]={
			{模型="白熊" , 前缀="汗血的" , 后缀=nil },--1
			{模型="狂豹人形" , 前缀="嗜血的" , 后缀=nil },--2
			{模型="狂豹人形" , 前缀="嗜血的" , 后缀=nil },--3
			{模型="巨力神猿" , 前缀="嗜血的" , 后缀=nil },--4
			{模型="巨力神猿" , 前缀="嗜血的" , 后缀=nil },--5
			{模型="雷鸟人" , 前缀="好赌的" , 后缀=nil },--6
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--7
			{模型="雨师" , 前缀="自愈的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[64]={
			{模型="曼珠沙华" , 前缀="敏捷的" , 后缀=nil },--1
			{模型="曼珠沙华" , 前缀="狡猾的" , 后缀=nil },--2
			{模型="曼珠沙华" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--4
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="裸衣的" , 后缀=nil },--6
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--7
			{模型="雨师" , 前缀="敏捷的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[65]={
			{模型="混沌兽" , 前缀="好赌的" , 后缀="百姓" },--1
			{模型="雷鸟人" , 前缀="暴怒的" , 后缀=nil },--2
			{模型="雷鸟人" , 前缀="暴怒的" , 后缀=nil },--3
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--4
			{模型="雨师" , 前缀="狡猾的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="裸衣的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="好战的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[66]={
			{模型="葫芦宝贝" , 前缀="狡猾的" , 后缀=nil },--1
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--2
			{模型="锦毛貂精" , 前缀="肥胖的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="强壮的" , 后缀=nil },--4
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--5
			{模型="雷鸟人" , 前缀="敏捷的" , 后缀=nil },--6
			{模型="狂豹人形" , 前缀="汗血的" , 后缀=nil },--7
			{模型="曼珠沙华" , 前缀="狡猾的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[67]={
			{模型="曼珠沙华" , 前缀="敏捷的" , 后缀=nil },--1
			{模型="曼珠沙华" , 前缀="狡猾的" , 后缀=nil },--2
			{模型="曼珠沙华" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--4
			{模型="巴蛇" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="裸衣的" , 后缀=nil },--6
			{模型="雷鸟人" , 前缀="坚定的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="汗血的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[68]={
			{模型="噬天虎" , 前缀="隐忍的" , 后缀=nil },--1
			{模型="噬天虎" , 前缀="无畏的" , 后缀=nil },--2
			{模型="噬天虎" , 前缀="嗜血的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好赌的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好赌的" , 后缀=nil },--5
			{模型="巨力神猿" , 前缀="嗜血的" , 后缀=nil },--6
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--7
			{模型="巨力神猿" , 前缀="嗜血的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[69]={
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--1
			{模型="雨师" , 前缀="虔诚的" , 后缀=nil },--2
			{模型="葫芦宝贝" , 前缀="坚韧的" , 后缀=nil },--3
			{模型="蚌精" , 前缀="聪慧的" , 后缀=nil },--4
			{模型="狂豹人形" , 前缀="肥胖的" , 后缀=nil },--5
			{模型="雷鸟人" , 前缀="好赌的" , 后缀=nil },--6
			{模型="混沌兽" , 前缀="虔诚的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="嗜血的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[70]={
			{模型="进阶蚌精" , 前缀="全能的" , 后缀=nil },--1我加的怪
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[71]={
			{模型="进阶蚌精" , 前缀="好赌的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[72]={
			{模型="进阶狂豹人形" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[73]={
			{模型="进阶狂豹人形" , 前缀="全能的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[74]={
			{模型="进阶狂豹人形" , 前缀="好战的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[75]={
			{模型="进阶狂豹人形" , 前缀="嗜血的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[76]={
			{模型="进阶狂豹人形" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[77]={
			{模型="进阶狂豹人形" , 前缀="裸衣的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[78]={
			{模型="进阶雷鸟人" , 前缀="好赌的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[79]={
			{模型="进阶雷鸟人" , 前缀="入魔的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[80]={
			{模型="进阶幽萤娃娃" , 前缀="坚韧的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[81]={
			{模型="进阶画魂" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[82]={
			{模型="进阶画魂" , 前缀="狡猾的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[83]={
			{模型="进阶混沌兽" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[84]={
			{模型="进阶混沌兽" , 前缀="虔诚的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[85]={
			{模型="进阶混沌兽" , 前缀="聪慧的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[86]={
			{模型="进阶混沌兽" , 前缀="暴怒的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[87]={
			{模型="进阶夜罗刹" , 前缀="好战的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[88]={
			{模型="进阶夜罗刹" , 前缀="无畏的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[89]={
			{模型="进阶夜罗刹" , 前缀="全能的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[90]={
			{模型="进阶葫芦宝贝" , 前缀="全能的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[91]={
			{模型="进阶巴蛇" , 前缀="疯癫的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[92]={
			{模型="进阶曼珠沙华" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[93]={
			{模型="进阶噬天虎" , 前缀="嗜血的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[94]={
			{模型="进阶藤蔓妖花" , 前缀="轻灵的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[95]={
			{模型="进阶藤蔓妖花" , 前缀="自愈的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[96]={
			{模型="进阶藤蔓妖花" , 前缀="全能的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[97]={
			{模型="进阶藤蔓妖花" , 前缀="虔诚的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[98]={
			{模型="进阶藤蔓妖花" , 前缀="肥胖的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[99]={
			{模型="进阶藤蔓妖花" , 前缀="全能的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
		[100]={
			{模型="进阶藤蔓妖花" , 前缀="轻灵的" , 后缀=nil },--1
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--2
			{模型="巨力神猿" , 前缀="好战的" , 后缀=nil },--3
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--4
			{模型="混沌兽" , 前缀="好战的" , 后缀=nil },--5
			{模型="锦毛貂精" , 前缀="自愈的" , 后缀=nil },--6
			{模型="夜罗刹" , 前缀="好战的" , 后缀=nil },--7
			{模型="噬天虎" , 前缀="裸衣的" , 后缀=nil },--8
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--9
			{模型="夜罗刹" , 前缀="强壮的" , 后缀=nil },--10
		},
	}
	-- 裸衣的=受到伤害结果增加50%，自己伤害结果增加50%。  --物法
	-- 坚韧的=受到所有伤害降低大约50%。包括固伤。   --全系
	-- 强壮的=伤害结果+20%，血量增加50%    --物法
	-- 敏捷的=速度加20% 。  --全系
	-- 汗血的=每回合掉20%当前血，一般封住了让他掉血掉死最好。 --全系
	-- 自愈的=高再生 每回合回复上限血量20%血。 --全系
	-- 好战的=每回合伤害结果增加5%。  --物法
	-- 狡猾的=物理躲避          --全系
	-- 好赌的=附加高级法波，高级法爆技能。--法
	-- 笨重的=速度降低40%，伤害结果增加30%，略微增加血量。--物法
	-- 嗜血的=高级吸血          --物
	-- 隐忍的=偶数回合才会出手，被封印解封当回合直接出手（隐忍狂豹除外）出手伤害+100%。--物法
	-- 偏执的=单数回合才会出手，被封印后解封当回合开始出手，出手伤害+100% 。--物法
	-- 无畏的=抗封20%，同时血量越低增加伤害结果。--物法
	-- 轻灵的=速度+20%，躲避+20%，一般能有这个词缀的也不会比你慢。 --全系
	-- 聪慧的=法伤增加20%，同时受到150%伤害，力批很好用。  --法
	-- 全能的=5项属性提高20% 。 --全系
	-- 疯癫的=会随机攻击双方单位，伤害增加400%，受到伤害降低。    --物  普攻
	-- 入魔的=法术伤害结果增加50%，受到伤害增加20%，推荐优先击杀。--法
	-- 虔诚的=会高级神佑。不推荐先点，神了就崩盘。 --全系
	-- 坚定的=增加50%抵抗封印命中几率。--全系
	-- 激进的=带有此前缀的怪物，基本上就是一速了。--封
	-- 暴怒的=带有高级法爆。 --法
	-- 肥胖的=速度降低40%，血量加倍。 --辅助

	-- 后缀
	-- 莽夫=输出增加5%，被攻击200%伤害。
	-- 精英=全属性提高20%
	-- 花魁=被击杀时，给敌方所有怪物提升30%伤害结果。
	-- 士卒=对方场上每被击杀一只怪物，提升10%伤害结果。
	-- 刺客=输出增加400%，血量减少50%，附带高级隐身，隐身结束前只会平么。
	-- 富豪=每回合会反间一只EB，被封解封。
	-- 百姓=场上没有满怪会以召唤的方式分身，必须优先击杀。
	-- 傀儡=无法选中，主怪被击杀后会逃跑，增加2O%伤害结果。
	-- 死士=气血低于30%，会自爆,血量剩的越多，自爆伤害越高。
	-- 护卫=会自动保护被物理攻击的单位，但是每回合保护同一单位血里是有上限的。
	-- 俳忧=每回合开始前对全队使用死亡之音，随机附加一个FC的封印，可能水封，持续1回合。
	-- 谋士=魔法免疫，但是受到物理伤害+50%。
	-- 武士=物理免疫，但是受到法术伤害+50%。
	-- 酒鬼=回合开始时进入催眠，被打醒或解封，提升100%伤害结果出手，同时每回合增加10%伤害结果。
	-- 更夫=每回合自己出手之前解封敌方《回合数/2）个单位的法术封印。
	self.染色={
		白熊={
			肥胖的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=61 , 染色组={[1]=1,[2]=0} }, --浅蓝
			疯癫的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=97 , 染色组={[1]=1,[2]=0} }, --深绿
			汗血的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} }, --深绿
			坚韧的={被动技能=nil , AI="物理" , 变异=true , 饰品=nil , 染色方案=nil , 染色组=nil }, --蓝色
			强壮的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=90 , 染色组={[1]=1,[2]=1} }, --深绿
			裸衣的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} }, --粉红
		},
		天兵={
			肥胖的={被动技能=nil , AI="物理" , 变异=nil , 饰品=true , 染色方案=107 , 染色组={[1]=1,[2]=1} },
			疯癫的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=89 , 染色组={[1]=1,[2]=0} },
			汗血的={被动技能=nil , AI="物理" , 变异=nil , 饰品=true , 染色方案=55 , 染色组={[1]=1,[2]=1} },
			坚韧的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			强壮的={被动技能=nil , AI="物理" , 变异=nil , 饰品=true , 进阶=true , 染色方案=nil , 染色组=nil },
			裸衣的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} },
		},
		锦毛貂精={
			敏捷的={被动技能={"怪物高级敏捷"}  , AI="辅助", 变异=nil , 饰品=nil , 染色方案=89 , 染色组={[1]=1,[2]=0} },
			肥胖的={被动技能=nil, AI="辅助" , 变异=nil , 饰品=nil , 染色方案=20103 , 染色组={[1]=0,[2]=3} },
			虔诚的={被动技能={"高级神佑复生"} , AI="辅助", 变异=nil , 饰品=nil , 染色方案=70 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil, AI="辅助" , 变异=nil , 饰品=nil , 染色方案=81 , 染色组={[1]=1,[2]=0} },
		},
		雨师={
			虔诚的={被动技能={"高级神佑复生"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=98 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=100 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=58 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=53 , 染色组={[1]=1,[2]=0} },
			强壮的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=60 , 染色组={[1]=1,[2]=1} },
			笨重的={被动技能=nil, AI="封系" , 变异=nil , 饰品=nil , 染色方案=107 , 染色组={[1]=1,[2]=1} },
			狡猾的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=69 , 染色组={[1]=1,[2]=0} },
		},
		蚌精={
			坚韧的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=85 , 染色组={[1]=1,[2]=0} },
			狡猾的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"} , AI="法系", 变异=nil , 饰品=nil , 染色方案=69 , 染色组={[1]=1,[2]=0} },
			入魔的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=63 , 染色组={[1]=1,[2]=0} },
			强壮的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=75 , 染色组={[1]=1,[2]=1} },
			偏执的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2062 , 染色组={[1]=1,[2]=0} },
			聪慧的={被动技能={"高级魔之心"} , AI="法系", 变异=nil , 饰品=nil , 染色方案=74 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="法系", 变异=nil , 饰品=nil , 染色方案=107 , 染色组={[1]=1,[2]=1} },
		},
		进阶蚌精={
			全能的={被动技能=nil, AI="法系" , 变异=nil , 饰品=nil , 染色方案=107 , 染色组={[1]=1,[2]=1} },
			好赌的={被动技能={"高级法术波动","高级法术暴击"}, AI="法系" , 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
		},
		狂豹人形={
			肥胖的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2057 , 染色组={[1]=0,[2]=1} },
			全能的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=nil ,  染色方案=2057 , 染色组={[1]=0,[2]=1} },
			汗血的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=true , 染色方案=107 , 染色组={[1]=1,[2]=1} },
			强壮的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=nil , 染色方案=nil , 染色组=nil},
			裸衣的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2071 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"}  , AI="物理" , 变异=nil , 饰品=true , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
			无畏的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=true , 染色方案=55 , 染色组={[1]=1,[2]=1} },
			隐忍的={被动技能=nil  , AI="物理" , 变异=nil , 饰品=nil , 染色方案=111 , 染色组={[1]=0,[2]=1} },
		},
		进阶狂豹人形={
			肥胖的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=0,[2]=1} },
			全能的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil ,  染色方案=55 , 染色组={[1]=1,[2]=1} },
			好战的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=114 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"}  , AI="物理", 变异=nil , 饰品=nil , 染色方案=85 , 染色组={[1]=5,[2]=0} },
			坚韧的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=112 , 染色组={[1]=0,[2]=1} },
			裸衣的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=98 , 染色组={[1]=0,[2]=1} },
		},

		雷鸟人={
			坚韧的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=89 , 染色组={[1]=1,[2]=0} },
			偏执的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=97 , 染色组={[1]=1,[2]=0} },
			好赌的={被动技能={"高级法术波动","高级法术暴击"} , AI="法系", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="法系", 变异=nil , 饰品=nil , 染色方案=77 , 染色组={[1]=1,[2]=0} },
			入魔的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=85 , 染色组={[1]=1,[2]=0} },
			聪慧的={被动技能={"高级魔之心"} , AI="法系", 变异=nil , 饰品=nil , 染色方案=67 , 染色组={[1]=1,[2]=0} },
			肥胖的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2065 , 染色组={[1]=1,[2]=0} },
		},
		进阶雷鸟人={
			好赌的={被动技能={"高级法术波动","高级法术暴击"}, AI="法系" , 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			入魔的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=85 , 染色组={[1]=1,[2]=0} },
		},
		巨力神猿={
			肥胖的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} },
			汗血的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			强壮的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=97 , 染色组={[1]=1,[2]=0} },
			裸衣的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"}  , AI="物理", 变异=nil , 饰品=true , 染色方案=nil , 染色组=nil },
			好战的={被动技能=nil  , AI="物理", 变异=nil , 饰品=true , 染色方案=nil , 染色组=nil },
		},
		幽萤娃娃={
			无畏的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} },
			笨重的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			好战的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=82 , 染色组={[1]=1,[2]=0} },
			偏执的={被动技能=nil, AI="法系" , 变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			好赌的={被动技能={"高级法术波动","高级法术暴击"}, AI="法系" , 变异=nil , 饰品=nil , 染色方案=2065 , 染色组={[1]=1,[2]=0} },
			聪慧的={被动技能={"高级魔之心"}, AI="法系" , 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
		},
		进阶幽萤娃娃={
			坚韧的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
		},
		画魂={
			肥胖的={被动技能=nil , AI="固伤",变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil , AI="固伤", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"}, AI="固伤", 变异=nil , 饰品=nil , 染色方案=100 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil , AI="固伤", 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"} , AI="固伤", 变异=nil , 饰品=nil , 染色方案=55 , 染色组={[1]=1,[2]=1} },
			狡猾的={被动技能=nil , AI="固伤", 变异=nil , 饰品=nil , 染色方案=83 , 染色组={[1]=1,[2]=1} },
		},
		进阶画魂={
			肥胖的={被动技能=nil, AI="固伤",  变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			狡猾的={被动技能=nil , AI="固伤", 变异=nil , 饰品=nil , 染色方案=83 , 染色组={[1]=1,[2]=1} },
		},
		混沌兽={
			肥胖的={被动技能=nil, AI="法系" , 变异=nil , 饰品=true , 染色方案=89 , 染色组={[1]=1,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"}, AI="法系" , 变异=nil , 饰品=nil , 染色方案=92 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil, AI="法系" , 变异=nil , 饰品=nil , 染色方案=52 , 染色组={[1]=1,[2]=0} },
			无畏的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2079 , 染色组={[1]=5,[2]=0} },
			好战的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			偏执的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
			隐忍的={被动技能=nil , AI="法系", 变异=nil , 饰品=nil , 染色方案=97 , 染色组={[1]=1,[2]=0} },
			入魔的={被动技能=nil , AI="法系", 变异=nil , 饰品=true , 染色方案=78 , 染色组={[1]=1,[2]=0} },
			好赌的={被动技能={"高级法术波动","高级法术暴击"}, AI="法系" , 变异=nil , 饰品=true , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			聪慧的={被动技能={"高级魔之心"} , AI="法系", 变异=nil , 饰品=true , 染色方案=96 , 染色组={[1]=1,[2]=0} },
		},
		进阶混沌兽={
			肥胖的={被动技能=nil , AI="法系", 变异=nil , 饰品=true , 染色方案=89 , 染色组={[1]=1,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"}, AI="法系" , 变异=nil , 饰品=true , 染色方案=92 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil , AI="法系", 变异=nil , 饰品=true , 染色方案=52 , 染色组={[1]=1,[2]=0} },
			好赌的={被动技能={"高级法术波动","高级法术暴击"} , AI="法系", 变异=nil , 饰品=true , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			聪慧的={被动技能={"高级魔之心"} , AI="法系", 变异=nil , 饰品=true , 染色方案=97 , 染色组={[1]=1,[2]=0} },
			入魔的={被动技能=nil, AI="法系" , 变异=nil , 饰品=true , 染色方案=78 , 染色组={[1]=1,[2]=0} },
			暴怒的={被动技能={"高级法术暴击"} , AI="法系", 变异=nil , 饰品=true , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil , AI="法系", 变异=nil , 饰品=true , 染色方案=96 , 染色组={[1]=1,[2]=0} },
		},
		夜罗刹={
			强壮的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=106 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"}  , AI="物理", 变异=nil , 饰品=true , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
			笨重的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=20113 , 染色组={[1]=4,[2]=0} },
			全能的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=67, 染色组={[1]=1,[2]=0} },
			隐忍的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=83 , 染色组={[1]=1,[2]=0} },
			好战的={被动技能=nil , AI="物理" , 变异=nil , 饰品=true , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
		},
		进阶夜罗刹={
			虔诚的={被动技能={"高级神佑复生"}  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2070 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=76, 染色组={[1]=1,[2]=0} },
			好战的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			无畏的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=60 , 染色组={[1]=1,[2]=0} },
		},
		葫芦宝贝={
			虔诚的={被动技能={"高级神佑复生"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=83 , 染色组={[1]=1,[2]=0} },
			轻灵的={被动技能={"怪物高级敏捷"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=82 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil, AI="封系" , 变异=nil , 饰品=nil , 染色方案=80 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=85 , 染色组={[1]=1,[2]=0} },
			狡猾的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=74 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"} , AI="封系", 变异=nil , 饰品=true , 染色方案=98 , 染色组={[1]=1,[2]=0} },
		},
		进阶葫芦宝贝={
			全能的={被动技能=nil, AI="封系" , 变异=nil , 饰品=nil , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
			狡猾的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
		},
		巴蛇={
			裸衣的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=114 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"} , AI="物理" , 变异=nil , 饰品=nil , 染色方案=80 , 染色组={[1]=1,[2]=0} },
			无畏的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2065 , 染色组={[1]=1,[2]=0} },
			隐忍的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=60 , 染色组={[1]=1,[2]=0} },
			好战的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=82 , 染色组={[1]=1,[2]=0} },
		},
		进阶巴蛇={
			裸衣的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=114 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"}  , AI="物理", 变异=nil , 饰品=nil , 染色方案=80 , 染色组={[1]=1,[2]=0} },
			无畏的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2065 , 染色组={[1]=1,[2]=0} },
			疯癫的={被动技能=nil  , AI="物理", 变异=nil , 饰品=true , 染色方案=60 , 染色组={[1]=1,[2]=0} },
			好战的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=82 , 染色组={[1]=1,[2]=0} },
		},
		曼珠沙华={
			肥胖的={被动技能=nil  , AI="法系", 变异=nil , 饰品=nil , 染色方案=83 , 染色组={[1]=1,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"}  , AI="法系", 变异=nil , 饰品=nil , 染色方案=100 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil  , AI="法系", 变异=nil , 饰品=nil , 染色方案=51 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"}  , AI="法系", 变异=nil , 饰品=nil , 染色方案=82 , 染色组={[1]=1,[2]=0} },
			狡猾的={被动技能=nil  , AI="法系", 变异=nil , 饰品=nil , 染色方案=60 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"}  , AI="法系", 变异=nil , 饰品=nil , 染色方案=114 , 染色组={[1]=1,[2]=0} },
		},
		进阶曼珠沙华={
			肥胖的={被动技能=nil  , AI="法系", 变异=nil , 饰品=nil , 染色方案=98 , 染色组={[1]=1,[2]=0} },
		},
		噬天虎={
			汗血的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=0 , 染色组={[1]=1,[2]=0} },
			强壮的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=106 , 染色组={[1]=1,[2]=0} },
			裸衣的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=77 , 染色组={[1]=1,[2]=0} },
			无畏的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			隐忍的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} },
			笨重的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
		},
		进阶噬天虎={
			嗜血的={被动技能={"高级吸血"}  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2000 , 染色组={[1]=2,[2]=0} },
		},
		鬼将={
			全能的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			嗜血的={被动技能={"高级吸血"} , AI="物理" , 变异=nil , 饰品=true , 染色方案=2078 , 染色组={[1]=5,[2]=0} },
			无畏的={被动技能=nil , AI="物理" , 变异=nil , 饰品=nil , 染色方案=67 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="物理" , 变异=nil , 饰品=nil , 染色方案=2065 , 染色组={[1]=1,[2]=0} },
			狡猾的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=119 , 染色组={[1]=1,[2]=0} },
			轻灵的={被动技能={"怪物高级敏捷"}  , AI="物理", 变异=nil , 饰品=nil , 染色方案=90 , 染色组={[1]=1,[2]=1} },
		},
		藤蔓妖花={
			虔诚的={被动技能={"高级神佑复生"}, AI="封系" , 变异=nil , 饰品=nil , 染色方案=56 , 染色组={[1]=1,[2]=1} },
			全能的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=106 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=82 , 染色组={[1]=1,[2]=0} },
			狡猾的={被动技能=nil , AI="封系", 变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=77 , 染色组={[1]=1,[2]=0} },
			轻灵的={被动技能={"怪物高级敏捷"}, AI="封系" , 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
		},
		进阶藤蔓妖花={
			虔诚的={被动技能={"高级神佑复生"} , AI="封系", 变异=nil , 饰品=nil , 染色方案=20113 , 染色组={[1]=4,[2]=1} },
			全能的={被动技能=nil, AI="封系" , 变异=nil , 饰品=nil , 染色方案=2057 , 染色组={[1]=0,[2]=1} },
			肥胖的={被动技能=nil , AI="封系" ,变异=nil , 饰品=nil , 染色方案=107 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"}, AI="封系" , 变异=nil , 饰品=nil , 染色方案=100 , 染色组={[1]=1,[2]=0} },
			轻灵的={被动技能={"怪物高级敏捷"}, AI="封系" , 变异=nil , 饰品=nil , 染色方案=89 , 染色组={[1]=1,[2]=0} },
		},
		律法女娲={
			肥胖的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=101 , 染色组={[1]=1,[2]=0} },
			汗血的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=54 , 染色组={[1]=1,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"}  , AI="物理", 变异=nil , 饰品=nil , 染色方案=60 , 染色组={[1]=1,[2]=0} },
			强壮的={被动技能=nil  , AI="物理", 变异=nil , 饰品=nil , 染色方案=85 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil  , AI="物理", 变异=nil , 饰品=true , 染色方案=83 , 染色组={[1]=1,[2]=0} },
			好战的={被动技能=nil  , AI="物理", 变异=nil , 饰品=true , 染色方案=114 , 染色组={[1]=1,[2]=0} },
		},
		金身罗汉={
			肥胖的={被动技能=nil , AI="辅助", 变异=nil , 饰品=nil , 染色方案=83 , 染色组={[1]=1,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"} , AI="辅助", 变异=nil , 饰品=nil , 染色方案=106 , 染色组={[1]=1,[2]=0} },
			坚韧的={被动技能=nil , AI="辅助", 变异=nil , 饰品=nil , 染色方案=64 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil , AI="辅助", 变异=nil , 饰品=nil , 染色方案=77 , 染色组={[1]=1,[2]=0} },
			敏捷的={被动技能={"怪物高级敏捷"} , AI="辅助", 变异=nil , 饰品=nil , 染色方案=2051 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"}, AI="辅助", 变异=nil , 饰品=nil , 染色方案=76 , 染色组={[1]=1,[2]=0} },
		},
		进阶金身罗汉={
			肥胖的={被动技能=nil , AI="辅助", 变异=nil , 饰品=nil , 染色方案=81 , 染色组={[1]=1,[2]=0} },
			虔诚的={被动技能={"高级神佑复生"}, AI="辅助" , 变异=nil , 饰品=nil , 染色方案=20103 , 染色组={[1]=0,[2]=3} },
			坚韧的={被动技能=nil , AI="辅助", 变异=nil , 饰品=nil , 染色方案=51 , 染色组={[1]=1,[2]=0} },
			全能的={被动技能=nil , AI="辅助", 变异=nil , 饰品=nil , 染色方案=53 , 染色组={[1]=1,[2]=0} },
			自愈的={被动技能={"怪物高级再生"}, AI="辅助" , 变异=nil , 饰品=nil , 染色方案=111 , 染色组={[1]=0,[2]=1} },
		},
	}
	-- self.地宫怪物={
	-- 	物理={
	-- 		类型="物理",
	-- 		造型={"狂豹人形","白熊","天兵","巨力神猿","夜罗刹","巴蛇","律法女娲","噬天虎","鬼将"},
	-- 		门派={"大唐官府","狮驼岭","凌波城","阴曹地府","天宫","五庄观"},
	-- 		前缀={"裸衣的","强壮的","好战的","笨重的","隐忍的","偏执的","无畏的","疯癫的","坚韧的","敏捷的","汗血的","自愈的","狡猾的","轻灵的","全能的","虔诚的","坚定的","嗜血的"}
	-- 	},
	-- 	法系={
	-- 		类型="法系",
	-- 		造型={"蚌精","雷鸟人","幽萤娃娃","混沌兽","星灵仙子","曼珠沙华"},
	-- 		门派={"化生寺","方寸山","神木林","魔王寨","天宫","龙宫"},
	-- 		前缀={"裸衣的","强壮的","好战的","笨重的","隐忍的","偏执的","无畏的","好赌的","聪慧的","入魔的","暴怒的","坚韧的","敏捷的","汗血的","自愈的","狡猾的","轻灵的","全能的","虔诚的","坚定的"},
	-- 	},
	-- 	固伤={
	-- 		类型="固伤",
	-- 		造型={"画魂"},
	-- 		门派={"女儿村","阴曹地府","无底洞","普陀山"},
	-- 		前缀={"坚韧的","敏捷的","汗血的","自愈的","狡猾的","轻灵的","全能的","虔诚的","坚定的"},
	-- 	},
	-- 	封系={
	-- 		类型="封系",
	-- 		造型={"雨师","葫芦宝贝","藤蔓妖花"},
	-- 		门派={"方寸山","女儿村","盘丝洞","无底洞","五庄观"},
	-- 		前缀={"坚韧的","敏捷的","汗血的","自愈的","狡猾的","轻灵的","全能的","虔诚的","坚定的","激进的"},
	-- 	},
	-- 	辅助={
	-- 		类型="辅助",
	-- 		造型={"锦毛貂精","金身罗汉"},
	-- 		门派={"化生寺","无底洞","普陀山"},
	-- 		前缀={"坚韧的","敏捷的","汗血的","自愈的","狡猾的","轻灵的","全能的","虔诚的","坚定的"},
	-- 	},
	-- 	-- 后缀={"莽夫","精英","花魁","士卒","刺客","富豪","百姓","傀儡","死士","护卫","俳忧","谋士","武士","酒鬼","更夫"}
	--  }
	local 坐标={
		{x=37,y=57},
		{x=65,y=21},
		{x=73,y=64},
		{x=61,y=21},
		{x=96,y=31},
	}
	local sss={1004,1005,1006,1007,1008}
	self.ditu={}
	self.ditu.层数={}
	self.ditu.传送坐标={}
	local b=1
	local a=1

	for i=3000,3150 do
		地图处理类.地图数据[i]={npc={},单位={},传送圈={}} --1
		地图处理类.地图玩家[i]={}
		地图处理类.地图坐标[i]=地图处理类.地图坐标[sss[a]]
		地图处理类.地图单位[i]={}
		地图处理类.单位编号[i]=1000
		self.ditu.层数[b]=i
		self.ditu.传送坐标[b]=table.copy(坐标[a])
		a=a+1
		b=b+1
		if a>5 then
		    a=1
		end
	end
end

return 雁塔地宫