-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-06 03:03:28
local 假人事件类 = class()
local insert = table.insert
function 假人事件类:初始化()
	self.喊话文本 = {
	 -- [1] = "#W/超高价回收#W/锦盒 宝石 金丹彩果 兽诀 五宝#C/6666====10.1万#Y/c666====20.1万#G/强化=====7.5万#P/ 月华露=====8w #B/颜灵果=====15w#F/五宝======70w#R/认准↓↓↓↓↓",
	 --  [2] = "#W/高价回收#P/连击 必杀 吸血隐身 强力 精神#C/6666====10.1万#Y/c666====20.1万#G/强化=====7.5万#P/ 月华露=====8w #B/颜灵果=====15w#F/五宝======60w#W/认准↓↓↓↓↓",
	 --  [3] = "#W/高价回收#Y/锦盒 宝石 金丹彩果 兽诀 五宝#C/6666====10.1万#Y/c666====20.1万#G/强化=====7.5万#P/ 月华露=====8w #Y/颜灵果=====15w#F/五宝======70w#R/认准↓↓↓↓↓",
}
self.锦衣列表={}
self.锦衣列表["男"] ={"青花瓷","花间梦","鹿角弯弯","水云归","飞天舞","羽仙歌","飞天舞朝露","炽云缎墨黑","绯雪织凝霜","冰寒绡月白","蒹葭苍苍寒月","浪淘纱","浪淘纱墨黑","萌萌小厨","霞姿月韵","雪眸影夜烬","夜影"}
self.锦衣列表["女"] = {"青花瓷","花间梦","鹿角弯弯","水云归","飞天舞","羽仙歌","飞天舞朝露","炽云缎墨黑","绯雪织凝霜","冰寒绡月白","蒹葭苍苍寒月","浪淘纱","浪淘纱墨黑","萌萌小厨","霞姿月韵","雪眸影夜烬","夜影"}
-- self.光环列表={}
-- self.光环列表 = {"寒霜冰凌","金枝春绽","九霄云图","浪淘沙月白","凌霄天宫月白","流云蝶影","琪草瑶花","琪花瑶草"}
-- self.足迹列表={}
-- self.足迹列表 = {"浮游水母","闪光足迹","糖果足迹","爱心足迹","玉剑足迹","晶翅足迹","蝴蝶足迹","爱的泡泡","爱的风暴","璀璨烟花","心享气球"}
self.活动内容 = {"通天河","乌鸡国","一斛珠","双城记","五更寒"}
-----------------------============================-----------------------============================-----------------------============================
	self.摊位名称 = {"二药专卖","秘方三药","秘方烹饪","未鉴定军火","未鉴定灵饰","下线不掉FFF","杂货清仓","元宵真经","战魄钨金杂物","书铁大全","内丹齐全"}
	self.随机事件 = {"挂机","抓鬼","打怪"}
	-- self.标记 = {"队长","队员","队员","队员","队员"}----假人带队 暂时封存
	self.假人id = {}
	self.摆摊总数=0
	self.飞行传送点={
		[1]={1001,233,120},
		[2]={1501,65,112},
		[3]={1092,122,54},
		[4]={1070,106,158},
		[5]={1040,108,98},
		[6]={1226,117,48},
		[7]={1208,128,36},
		[8]={1001,235,135},
		[9]={1001,227,120},
		-- [10]={1001,117,48},
		-- [11]={1501,128,36},
		-- [12]={1092,117,52},
		-- [13]={1070,128,36},
		-- [14]={1001,239,118},
		-- [15]={1001,230,115},
		-- [16]={1001,214,121},
		-- [17]={1001,233,113},
		-- [18]={1001,242,116},
		-- [19]={1001,218,121},
		-- [20]={1001,221,121},
		}
	self.全员地图 = {1001,1501,1092,1070}---
	self.摆摊地图 = {1001,1501,1092}---,1501,1092
	self.摆摊数据 = {}
	self.摆摊数据[1001] = {
			-- {x=213,y=120},
			-- {x=205,y=113},
			-- {x=223,y=124},
			-- {x=240,y=119},
			-- {x=235,y=111},
			-- {x=231,y=136},
			-- {x=227,y=128},
			-- {x=219,y=102},
			-- {x=235,y=126},
			-- {x=244,y=129},
			-- {x=219,y=127},
			-- {x=238,y=138},
			-- {x=211,y=108},
			-- {x=246,y=120},
			-- {x=250,y=118},
			-- {x=240,y=120},
			-- {x=245,y=111},
			-- {x=224,y=114},
			-- {x=222,y=138},
			-- {x=474,y=206},
			-- {x=482,y=205},
			-- {x=463,y=193},
			-- {x=444,y=184},
			-- {x=444,y=185},
			-- {x=444,y=183},
			-- {x=444,y=182},
			-- {x=210,y=126},
			-- {x=444,y=181},
			-- {x=451,y=182},
			-- {x=451,y=183},
			-- {x=451,y=184},
			-- {x=451,y=185},
			-- {x=491,y=192},
			-- {x=491,y=193},
			-- {x=491,y=194},
			-- {x=491,y=195},
			-- {x=491,y=196},
			-- {x=224,y=128},
			-- {x=220,y=120},
			-- {x=209,y=123},
			-- {x=208,y=121},
			-- {x=219,y=121},
			-- {x=219,y=123},
			-- {x=225,y=128},
			-- {x=232,y=119},
			-- {x=229,y=114},
			---------重新更改地点
			{x=208,y=123},
			{x=216,y=120},
			{x=223,y=116},
			{x=231,y=111},
			{x=239,y=114},
			{x=231,y=119},
			{x=219,y=121},
			{x=214,y=126},
			{x=221,y=128},
			{x=228,y=124},
			{x=238,y=120},
			{x=244,y=116},
			{x=240,y=123},
			{x=229,y=130},
			{x=229,y=120},
			{x=231,y=115},
			{x=233,y=122},
			{x=215,y=129},
			{x=213,y=123},
			{x=224,y=125},
			{x=235,y=117},
			{x=208,y=116},


			-- {x=239,y=118},
			-- {x=230,y=115},
			-- {x=214,y=121},
			-- {x=233,y=113},
			-- {x=242,y=116},
			-- {x=218,y=121},
			-- {x=221,y=121},
			-- {x=235,y=135},
			-- {x=227,y=120},

			{x=361,y=28},
			{x=363,y=31},
			{x=366,y=32},
			-- {x=356,y=31},
			{x=358,y=33},
			{x=361,y=34},
			-- {x=366,y=36},
			-- {x=364,y=38},
			-- {x=360,y=38},
			{x=351,y=32},
			{x=354,y=35},
			-- {x=346,y=35},
			{x=351,y=38},
			{x=355,y=39},
			-- {x=357,y=43},
			{x=360,y=46},
			{x=361,y=47},
			{x=366,y=50},
			{x=372,y=49},
			-- {x=377,y=47},
			{x=378,y=44},
			{x=375,y=42},
			{x=373,y=39},
			{x=370,y=36},
			-- {x=368,y=33},
			{x=373,y=31},
			{x=374,y=34},
			{x=378,y=32},
			{x=381,y=35},
			-- {x=378,y=36},
			{x=384,y=37},
			{x=343,y=43},
			{x=340,y=44},
			{x=337,y=46},
			{x=340,y=48},
			-- {x=346,y=46},
			{x=350,y=46},
			{x=349,y=50},
			{x=356,y=49},
			{x=350,y=52},
			{x=357,y=30},
			{x=360,y=33},
			{x=363,y=34},
			-- {x=359,y=36},
			{x=361,y=38},
			{x=364,y=37},
			{x=366,y=35},
			{x=366,y=38},
			-- {x=345,y=37},
			{x=345,y=45},
	}
	self.摆摊数据[1501] = {
		{x=34,y=115},
		{x=34,y=118},
		{x=39,y=118},
		{x=38,y=122},
		{x=44,y=125},
		{x=47,y=122},
		{x=45,y=120},
		{x=42,y=118},
		{x=46,y=116},
		{x=49,y=119},
		{x=52,y=118},
		{x=53,y=121},
		-- {x=57,y=122},
		{x=59,y=125},
		-- {x=59,y=128},
		{x=64,y=133},
		{x=67,y=122},
		{x=64,y=119},
		{x=87,y=98},
		-- {x=57,y=115},
		{x=55,y=111},
		{x=59,y=113},
		{x=63,y=113},
		{x=57,y=130},
		{x=50,y=130},
		{x=69,y=118},
		-- {x=68,y=122},
		{x=77,y=115},
		{x=76,y=111},
		-- {x=69,y=109},
		{x=65,y=107},
		{x=64,y=102},
		{x=58,y=106},
		-- {x=67,y=102},
		{x=75,y=103},
		{x=80,y=105},
		{x=85,y=109},
		-- {x=84,y=114},
		{x=85,y=117},
		{x=84,y=99},
		-- {x=90,y=101},
		{x=94,y=98},
		-- {x=93,y=95},
		{x=97,y=95},
		{x=99,y=93},
		{x=95,y=97},
		-- {x=89,y=102},
		{x=80,y=110},
		-- {x=75,y=116},
		{x=69,y=111},
		}
	self.摆摊数据[1092] = {
		{x=109,y=39},
		{x=111,y=37},
		{x=117,y=37},
		{x=112,y=35},
		{x=119,y=39},
		{x=131,y=43},
		{x=128,y=46},
		{x=121,y=44},
		{x=116,y=42},
		{x=112,y=43},
		{x=112,y=46},
		{x=117,y=47},
		{x=126,y=47},
		{x=126,y=52},
		{x=131,y=51},
		{x=132,y=46},
		{x=136,y=47},
		-- {x=136,y=52},
		{x=148,y=50},
		{x=154,y=52},
		{x=156,y=55},
		{x=154,y=58},
		{x=150,y=61},
		{x=147,y=56},
		{x=142,y=53},
		-- {x=137,y=53},
		{x=131,y=51},
		{x=130,y=55},
		{x=137,y=58},
		{x=137,y=61},
		-- {x=132,y=63},
		{x=128,y=60},
		{x=123,y=60},
		{x=119,y=53},
		{x=112,y=52},
		{x=107,y=51},
		{x=104,y=54},
		-- {x=109,y=56},
		{x=111,y=58},
		{x=116,y=58},
		-- {x=110,y=53},
		{x=113,y=67},
		{x=133,y=68},
		{x=119,y=51},
		{x=118,y=55},
		{x=104,y=60},
		{x=109,y=60},
		-- {x=114,y=62},
		{x=119,y=63},
		{x=126,y=66},
		}

		self.占用摊位 = {}
		self.待更新事件 = {}
		-- self.摊位名称 = {}
end


function 假人事件类:创建角色()
	local fun  = require("ffi函数")
	local 账号 = 服务端参数.假人账号
		-- local 名称 = --{"Louise゛","捣你菊花","情深不寿","淚順著雨","封心锁爱","暈“噠120","苍天有井自然空","命定浮沉","慧极必伤","刹那芳华","路易絲","灬情丶落轩","清酒暖心","与情无染","情难自控","X凄凉菂羙","有飘影更自信","南巷孤貓","烈酒醉人","沦陷的痛","夜的第七章","星逝破晓","一尾流莺","北城孤人","若如初见","简单","风恋绝尘","特别的人η","一指流砂","温柔散尽","彻底完败","揍跪了丶好么","月寒影对","特别的梦η","烟花寂凉","ˉ罗密欧","沟沟有深度","绽放情花","梦暖情双","新不了情","Θ“肮脏_矜持”","你的菊花真美","墨染诗水","刺痛命脉","野性难改","內傷無法治愈","最短不过善变","青絲繞手","樱花年华","十夏之风","负心人","举杯邀月","已然情深","情字繞口","徒增伤悲","ㄨ雨℡逝ㄚ","床单一片红","清歡相伴","何惧缘浅","一拉拉","扭曲旳黑暗”","转角遇到墙","竖萧而奏","溫酒相隨","似水柔情","贱人·滚之","细雨微醺","北軌陽葵","抚琴而唱","旧事重提","ω带刺╮男淫","紫丶星河","烟过是云","南岸青梔","撕心裂肺","伸手难辨","中指的邂逅","萧暗寒剑","雨过你在","忠贞罘渝","极速ω堕落","眼兮的温柔","北港初晴","青梅落影","落荒而逃","不服来嘛","双手成就你的梦","寡人寡巷","南岸末阴","从不服输","１切都昰命▂","吟唱寒荒","凉城以北","孤人孤街","半夏时光","説不岀旳疼╮","撸自身哥哥","南館瀟湘","空城旧梦","黑白年代","∑幼稚鬼","信基哥原地复活","鱼忘七秒#","壹席青城","十言九妄","不在乎的在乎ゝ","溪舔取精","南人旧心","人忘七年#","独守空城","撕裂的天堂","今天干我儿","灯为谁点","北人久情","事与愿违","初见钟情","潇潇暮雨","彼此相爱゛","脂为谁添","南熙寒笙","師傅.別念了","蝶梦恋花","发酵的恋","っ遮遮掩掩゛","夏末染殇","地心侵略者","风泊天","琴瑟在御","茹梦初醒","沐风朝朝","炫。枫少","寒风笑雪夜","葬我以风","凤凰于飞","鱼巷猫归","抱你到天亮.","浅唱呐忧伤","闹市海港","赐你以梦","深秋无痕","╮麻辣","百合大队长","人走茶凉","旧城窄巷","回眸的笑","ε择日","一寸光阴","北葵向暖","曲终人散","少钩鈏我","为了你","一寸精","暖阳今夏","南栀倾寒","满城灯火","烈酒i","夜凉如水","这季悲凉","冷月昨秋","醉生梦死","极度深寒","淡丿子枫","深如大海i","|回身诉说","葑鈊ご独爱","各自生欢","梦冥光","追忆年华","深海溺心 i","复制回忆","在为止的路上狂奔","苏秋辰","听一首歌丶","笑叹如梦","时光不复","ω永别","碎泪","任憑風吹","念一个人丶","人亦已歌","咎由自取","幹杯清茶","不準妳走","初衷是你","阴月下的墓碑","渔舟唱晚","續杯烈酒","邀月对影","风吹屁丫爽","夜寒影对","彼岸灯火","今夕何夕","沦陷′2009","夏末ζ烟雨","傲ち冷","ㄣポ叶","一梦两三年","守⒈份坚持","≈是你瞎了眼","繁华已逝去","不必那么矫情","人瘦衣宽颜非昨","╭ァ拖油瓶","_____小颖ノ","雨下的樱花","多为我想想","长恨春迟水长东","傲ち高","呐撕心裂肺⌒","爱情故事L°","℡壹世繁華","狂妄称帝","绣浪漫","唯爱年华ぺ灬babyル","江水又为竭","っ落叶终归根","离殇心荡漾","秒杀feelゼ","年少殊途","斧虐英豪","点也卟坚强丶","寒塘冷月[由Www.QunZou.Com整理]","゛厌丗沉淪ゝ","花开馥郁","大大的拥抱","悲魂曲","无妄之森","與鬼共粲","心悸花落无比","树屿牧歌","雪落纷纷","弑神eastwest","红色娘子军^","爱你不是以往","冒险岛","空荡荡的街道","≮夜半寂静≯","一顾倾人城","Noble默","骄傲如初","鬼寐﹏孤寂","ζo纳谁","ャ最爱你情动","陌上青苔","提拉米苏╮","≮活得比天狂≯","逝水无痕","夜知冷暖","秋风落叶╮","凉雨初夏","拔刀总裁","故事未完","街头篮球","十九岁一场梦","清歌不尽","此事不关风月","只手遮天","袅袅烟云","青梅竹马意","℡泚ㄝ￡哆凊","九封至尊","剑断青丝","我把整颗心给你，你却嫌腥","不常在线","墨落画卷","一向很安静","一向不忘i","遗失谁主沉浮","血腥ㄨ持枪者","浅夏〆忆汐","笑靥↘如尘","你的回牟一笑","幸福时光","NHCH欢","Sept↘轩雨寒","我素E控~","﹏④葉草","山川湖海","无爱一身轻╮","需要一个依靠","笑蓝☆安容","摇滚枷锁","心境不美丽~","泡泡龙","妖娆╬═ⅷ宅男","毁于一瞬之间","═☆空恋々殇","秋季忆往如故","诉写纳→诺言","鹿霸","氧气萌主","傲╃义薄云天","怎样了不爱了","啪啪三国","那情遥不可及","染色的温柔‖","我是爸爸的心跳！","开╬端","南风草木香","浮梦i久伴我i","一只猫的告白","蓝色的海洋","殇之木奶伊","落寞式繁华","甭跟他废话╮","世当戮灭","≮梦幻★星空≯","女人是会变的","╰冷月残星べ","温文尔雅°你不配ベ","叮当猫↘恋猪","°是梦终醒","Sean﹌初告白°","▉微笑浅浅","习惯你呵护","凉人暖颜凉","私欲乱人心c","几欲逢花","魔境仙踪","乄ヤ灬落幕","凄凉的花等开","君为伊人","做个魅力女王","静候轮回","初恋未满","皇族刀剑梦","晨曦怒风","此生白头恋","蓝色鸢尾╮","高姿态女人","复仇焰魂","_蓝莓咘丁_","千城墨白","〓铁拳★战士〓","举悲到凌尘ゅ","爱Д卜单荇ね","无双剑皇","早安梦里的人","愚叆ゞζiΠg","浅蓝色的思念","傲血狂沙","ㄜ嗟叹红颜泪","寻沫雨悠扬","喜欢半夜销魂","受够了沵旳虚假","莲李雨荷","未成年リ疤痕","爱世界也要爱自我。","万魂之主","演绎的花瓣雨","↘夕嗳oO","深秋无痕","sē寒冰","нo獨一нo無二","浮生醉清风","英雄脸萌","姐统领守护","痴木狂崩","支离破碎-BROK","临渊羡鱼","时光伴我久","探险家","ぢ分不清的伤","廡─※ぺ┭極","南巷清风","时光°Moon","孤傲一世的神","时光不会停滞不前-","举火焚天","不成魔不快活`Ψ","与君共赏城头月","光环刀客","||丶至尊↘少年﹌","切尸红人魔","魔法世界","抬眉见雪","①止狠颓废","等待你归来い","血红","心思若女儿","一心欲醉","青花易碎","纯粗粮▓小姐","枯叶蝶的未来","孤芳自赏","超级红地毯","甜蜜情调","狼群军刀","浮生夢凉","格式化丶過去","灬妖魅之夜灬","再战江湖","βèn苯小孩","梦里花","一纸荒年","会不会有以后","馨雨瑗琴","旧琴破碎","以往我们的爱","混沌盗魂者","A刊凯子","泪痕ˇtears","←丿战丨逍遥丶→","七情↘六欲","血葬③界","笙歌君独幽","≮天香百合≯","我本男孩子","一朝风月","永世的虚伪","妖中的那个美","花不败","忍不住想沵ら","指尖上的泪","枝上绵蛮","执着掩饰自我","我二我欢乐╮","人情眼泪最卑微","风霜莫蚀颜","旧事如影","淡影╬无痕","紛島花音","我太过温柔","丿①个亽灬戰伇","战壕★之狼","山川情诗","神妖","^^笑著活下去","Love╭ァ专属x","孤单的星际","彼岸星光","﹏颜若惜〆","绝对的真心","应对现实把。","℡玩玩你而已。","^星期㈧姐","默然等待","葑訫☆","呐谁咱耐倪","君已陌路","魂斗罗","最爱你的朋友","爆破鬼才","叙说beloved","我爱你而已╮","丹青点墨","音频怪物㏒","遗失的约定","上善若水","一齐战天下","青灯佛前","╰ゞ姐独占天下℡","蹲街卖汽水","唇舌间的纠缠","棠梨煎雪","老⑥堂㊣堂主","尐女杀人魔","偲想拋棄靈魂","落幕的笑靥","☆ヾ枫叶","∞静静的消逝","地狱天使咆哮","预约结局","∝那一场邂逅","夜亡者Seventee","DΑìsㄚ","别碰我男人∝","一阵鹿风","赫赫╮无名","対你ヽ动ろ情","金蛇舞娘","不后悔","№→吖吖★僮","风定犹闻","PoP灬道具家族","欲盖弥章°","醉后的柔情**","平平淡淡の１７年","古青▌EO","琼窗梦回","全是敷衍⑴","蝶舞╬浪天涯","雨恨云愁","翠竹春芳","陌上花歌","南巷清风","卸下头具的脸","一杯清酒当人生","孤海未蓝","╰辉煌童年ゞ","秋水怡人","疏狂几曾","灵魂交融瞬间","入你眼i","帝王觉醒","浪漫梦魇","女Sir与悍匪","阵风茫茫","⑩ハ歲尐哖輕","吾王起灵思天真°","微雨斜风夹","流水恋落花","単裑Dê⑦タづ","不稀罕的情","红尘醉陌相思","断了的线","盼得纱碧柳如烟","一小下丶阳光","落月成孤倚","佳期遥似梦","深入骨zI里ゝ","選萚↘躱避嗳","靓丽小梦","暮凉ヽ浅","猫忘了鱼尾纱","泪殇_陌小熏","一世倾城泪","￡Hero★滴答滴﹋","换我追你i","暮烟疏雨","▍一物降一物","烟·陪伴↘哥","魅影丨时尚灬","帝王挥剑指天下","跑跑卡丁车","森旅迷了鹿","┍杀犸特の_","北港初晴","斗魂如焚","梦回旧景","爆米花薯片","液闯げ红灯区","浮生远离","金戈铁马","花开ㄣ纯粹","゛给我你的爱","い男人不狠灬","訁巟暗匴迣鎅","超神战士","泪眼看世界","变形金刚","灬潇尐爺ご","没有爱怎样过","战火无址境。","〆﹏与我无关","らPrinceゝ勇士","天橙党丫°丶","鞋纸虽美，但不合脚ㄋ〞","黑白式船长","偷梦者","樱落~嫣笑","￡魂战╃阿修罗彡","三朝元老i","含情脉脉づ","刀锋战神","我依然在那里","时间和距离","╮ωǒㄖ勹惢乚","龙龙じ★ve","残傷记憶","仲夏冰桐","玫瑰之约","彩色叠想","ミ弑桖龙鯎","我女神我骄傲i","爱尔兰不是梦","青衫烟雨","≮蓝色夏天≯","缠绵夜夜笙歌","幽泉清风","╰★よ偙づ僸区ヴ","白雪飘扬","埖幵耒苾葒","秋夜雨寒","zんí筆抒情","威尼斯假面","萨普莱斯","郁彼北林","甜蜜草莓恋°","℡泚ㄝ￡哆凊","安静的眉眼","碎花裙的优雅","爱已成殇","￡战魂↘英雄劫ぃ","清风烈酒","迟夏饮冰","凉月流沐","洪福齐天","缺扣衬衫","世俗旳恶心","素人花裟","空大萌妹","阳光天使","离别的聚","夜幕下赏花","柬埔寨·農民","浅唱尔的爱","浪轩羽楠","~⑨ч囸囲囚","爱了能怎样","那年盛夏っ","那一片森林╮","⒉点半的思绪","乄嘿︶ㄣ你挡","偌克萨斯之手","暧昧错当爱情`","背影伴你","qq炫舞","僮哖d囘憶§☆","南鸢北筏","仅有一颗心","嗜血的存在","Lovely熙こ","总是被猜疑","暗影之拳","*失心疯女人","魔爵★假面","烟花巷陌","可望不可即","我是火影","堇墨浮华","一舞定情╮","樱雪之城","笑著说々恨你","江山寒色远","卡通农场","ぶ牛仔↘酷","氣質哥","天上↘云","尘烟梦雨如墨染","玫瑰色天空","人海孤鸿修","花落半歌","半盏流年","の命运之抡","Royal╬筱恋","ご战神★霸主彡","霸气爷们灬拳","我是你老爸","几许柔情","爵士少年﹌‖","硝烟冉冉","拥抱的问号","大侠传","都是涐犯贱","六月五瓣雪","￡魔龙★祭天彡","孤的王朝","忆他月下扬眉","殘夏一棵草","猩红女神","绿水染清风","避孕治脚气≠","枝上绵蛮","傻瓜","暮光小偷","—我是另类的。","火星人","做自信女人","暗夜猎手","乄枫☆葬ヾ","哥有四多兰","格斗冒险岛","烟雨寒","ˇ丛林猛虎","-ī種依賴-ī種依靠","虚空行者","素手挽清风","守望幸福","独孤求败◇","╰胭脂俗粉゛","≮巅峰★寂寞≯","撑伞的手","玻璃无心╮","妄自菲薄丶","我不是壞女孩","浮生未歇","素染倾城色","承诺谁来给","落叶纷飞","Hero滴答滴","生性似王","￣￣￣蠢蠢蠢蠢蠢ˊ纯洁゜","傲视情缘","洛洛别吃了","画江湖","麻辣兔头","酒到微醺","北疆雨寒","刀哥","糖贩子","鬼尊真的菜","觅览少女","清欢","战神寻欢","一梦十年","封刀","念慈悲度众生","王不留情","千哥","King","山一程雪一更","神无敌","辰司","朵朵","柚子","少年人","人间大炮","龙生龙","三刀结束","哼哈二将","三毛先生","繁华宛似浮云","Louise゛","月寒影对","特别的梦","罗密欧","沟沟有深度","十夏之风","负心人","举杯邀月","徒增伤悲","何惧缘浅","一拉拉","扭曲旳黑暗”","眼兮的温柔","双手成就你的梦","地心侵略者","碎泪","一梦两三年","拖油瓶","小颖儿","King","长恨春迟水长东","傲高","江水又为竭","心悸花落无比","爱你不是以往","最爱你情动","秋风扫落叶","拔刀总裁","十九岁一场梦","清歌不尽","此事不关风月","遗失谁主沉浮","泡泡龙","秋季忆往如故","鹿霸","氧气萌主","血色佣兵","看月亮数星星","金属大师"}
		local 模型 = {"飞燕女","英女侠","巫蛮儿","逍遥生","剑侠客","狐美人","骨精灵","杀破狼","巨魔王","虎头怪","舞天姬","羽灵神","神天兵","龙太子","偃无师","鬼潇潇","桃夭夭","玄彩娥"}
		if fun.文件是否存在(程序目录..[[data/]]..账号)==false then
			os.execute("md "..[[data\]]..账号)
			local file =io.open([[data\]]..账号..[[\信息.txt]],"w")
			file:write([[do local ret={} return ret end]])
			file:close()
			写出文件([[data/]]..账号..[[/消费记录.txt]],"日志创建")
			写出文件([[data/]]..账号..[[/账号信息.txt]],"账号配置")
			local file =io.open([[data\]]..账号..[[\账号信息.txt]],"w")
		 	-- f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","密码",密码)
		 	-- f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","管理","0")
		 	f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","仙玉","0")
		 	f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","点卡","0")
		 	f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","安全码","0")
		 	f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","创建时间",时间转换(os.time()))
		 	f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","创建ip",ip)
		 	-- f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","体验状态","0")





		end
			-- local 假人起始id = 11000
			local 假人起始id = 全局角色id+1000
				for i=1,服务端参数.假人数量 do
					假人起始id = 假人起始id+1
					临时角色=角色处理类.创建()
					local 名称 = self.取随机中文姓名()
					临时角色:创建角色(nil,账号,模型[取随机数(1,#模型)],名称,"1.1.1.1",0,假人起始id)
					假人id[#假人id+1]= 临时角色.数字id
					临时角色=nil
				end
end


function 假人事件类:更新()
	print("正在更新------------看到我就说明出了问题")
	for i=1,#self.待更新事件 do
		if self.待更新事件[i].时间 == 0 then
			if self.待更新事件[i].事件 == "摆摊" then
				self:摆摊(self.待更新事件[i].数字id)
				table.remove(self.待更新事件,i)
				break
			end
		else
			self.待更新事件[i].时间 =self.待更新事件[i].时间 -1
		end
	end
end

function 假人事件类:循环移动事件(数字id)---真id
		local sjsz=取随机数(1,100)
		if sjsz > 80 then
			return
		elseif sjsz <= 80 and sjsz > 20 then
			self:挂机(数字id)
		elseif sjsz <= 20 and sjsz > 10 then
			self:抓鬼(数字id)
		elseif sjsz <= 10 then
			self:打怪(数字id)
		end

end

-- function 假人事件类:假人带队(数字id)
-- 		if 假人队伍判断==0 then
-- 		队伍处理类:创建队伍(数字id,{id=数字id})
-- 		队伍处理类:同意假人入队(数字id,{数字id=11132})
-- 		假人队伍判断=假人队伍判断+1
-- 		end
-- 		地图处理类:假人移动坐标刷新("假人",数字id)

-- end

-- function 假人事件类:假人带队(id)---非真id   ----假人带队 暂时封存
-- 		self.假人id[id].标记 = self.标记[取随机数(1,#self.标记)]
-- 		-- 队伍处理类:创建队伍(self.假人id[id].数字id,{id=self.假人id[id].数字id})
-- 		for i = 1,服务端参数.假人数量 do
-- 			local 数字id=self.假人id[i].数字id
-- 		if self.假人id[i].标记 == "队长" then
-- 			队伍处理类:创建队伍(数字id,{id=数字id})
-- 		end
-- 		if self.假人id[i].标记 == "队员" then
-- 			队伍处理类:同意假人入队(数字id,{数字id=self.假人id[i].数字id})
-- 		end
-- 		end

-- end




----假人带队 暂时封存----假人带队 暂时封存----假人带队 暂时封存----假人带队 暂时封存----假人带队 暂时封存----假人带队 暂时封存
function 假人事件类:循环事件(id)---此id是次数 有多少个假人id就=多少次  循环11.lua里控制速率
	-- self:更新()
	if self.摆摊总数 < 80 then
		self.假人id[id].事件 = "摆摊"
		self.摆摊总数 = self.摆摊总数 +1
		self:摆摊执行中(self.假人id[id].数字id)
	elseif self.假人id[id].事件~="摆摊" then
		 self.假人id[id].事件 = self.随机事件[取随机数(1,#self.随机事件)]
		 self:循环移动事件(self.假人id[id].数字id)

		 -- self:假人带队(id)
	end






end

function 假人事件类:重置摆摊总数()
		if self.摆摊总数~=0 then
			self.摆摊总数 = 0
		end
end

function 假人事件类:登录()
	local 随机颜色 = {"天蓝灰","番茄红","青色","青绿色","森林绿","金黄","淡紫色"}--"黑色",
	if 假人登录==false then
		for i=1,服务端参数.假人数量 do
			系统处理类:进入游戏("假人",服务端参数.假人账号,假人id[i]+0,"1.1.1.1","假人")
			self.假人id[i]={数字id = 假人id[i]+0,事件= nil}
		--	玩家数据[假人id[i]+0].角色.当前称谓 ="威震三界"
			玩家数据[假人id[i]+0].角色.假人 = true
			local 武器基数 = 取随机数(1,16)
			local 武器序列=角色武器类型[玩家数据[假人id[i]+0].角色.模型][取随机数(1,#角色武器类型[玩家数据[假人id[i]+0].角色.模型])]
			local 武器名称=装备处理类.打造物品[武器序列][武器基数]
			地图处理类:加入玩家(假人id[i]+0,玩家数据[假人id[i]+0].角色.地图数据.编号,玩家数据[假人id[i]+0].角色.地图数据.x,玩家数据[假人id[i]+0].角色.地图数据.y)
            if 取随机数()< 50 then
            玩家数据[假人id[i]+0].角色.锦衣[1] = self.锦衣列表[玩家数据[假人id[i]+0].角色.性别][取随机数(1,#self.锦衣列表[玩家数据[假人id[i]+0].角色.性别])]
            end
			玩家数据[假人id[i]+0].角色.门派 = 取随机门派(玩家数据[假人id[i]+0].角色.种族..玩家数据[假人id[i]+0].角色.性别)
			玩家数据[假人id[i]+0].角色.等级 = math.random(69,175)
			self:全员进图(假人id[i]+0)
			-- 地图处理类:更新锦衣(数字id,玩家数据[数字id].角色.锦衣[1],1)---不会一直更新
		end
	假人登录 = true
	end
end

-- function 假人事件类:打怪(数字id)
-- 	local wp= {"高级魔兽要诀","超级金柳露","修炼果","青龙石","神兜兜","无级别宝珠","召唤兽内丹","灵兜兜","玄武石","月亮石","舍利子","光芒石","附魔宝珠","特效宝珠","百炼精铁","制造指南书","摇钱树苗","白虎石","星辉石","特赦令牌"}
-- 	local mc={"知了大王","地煞星","巡山小妖","知了统领","天罡星","知了小王","世界BOSS","乌鸡国","水陆大会","车迟斗法","雁塔地宫","真假美猴王","通天塔","一斛珠","五更寒","十八妖王"}
-- 	if 取随机数(1,100) < 2 then--打怪消息
-- 	广播消息({内容=format("#R/%s#Y经过一番激烈的战斗，最终战胜了#R%s#Y，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,mc[取随机数(1,#mc)],wp[取随机数(1,#wp)]),频道="xt"})
-- 	end
-- end
-- function 假人事件类:抓鬼(数字id)
-- 	-- local mx = {"野鬼","牛头","马面","骷髅怪"}
-- 	-- local 银子=取随机数(50000,100000)
-- 	-- 广播消息({内容=format("#P(自动抓鬼)#W/玩家%s#Y在捉鬼任务中成功保护了#W%s#Y因此获得了其赠送的#G/%s#Y两银子".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,"善良的"..mx[取随机数(1,#mx)],银子),频道="xt"})
-- 	local 名称,数量,参数=生成产出(产出物品计算(HDPZ["自动抓鬼"].ITEM),"自动抓鬼")
-- 	广播消息({内容=(format("#P(抓鬼任务)#W玩家#Y%s#W帮助钟馗追击鬼魂有功，钟馗送出一个#G["..名称.."]#W作为奖励！#80",玩家数据[数字id].角色.名称)),频道="hd"})

-- end
--------------------------================
function 假人事件类:抓鬼(数字id)
	local 名称,数量,参数=生成产出(产出物品计算(HDPZ["抓鬼"].ITEM),"抓鬼")
	if 数量== 9999 then --环
	else
		if 取随机数() <= 3 then
	    	广播消息({内容=format("#P(钟馗抓鬼)#W玩家#G%s#W抓鬼有功，钟馗送出一个#Y%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,名称),频道="xt"})
		end
	end

end

function 假人事件类:打怪(数字id)
    类型 = self.活动内容[取随机数(1,#self.活动内容)]

    if 类型=="一斛珠" and 取随机数() <= 1 then
	    local wp= {"金柳露","超级金柳露","召唤兽内丹","魔兽要诀","五宝盒","修炼果","九转金丹","未激活的符石","高级魔兽要诀","神兜兜"}
		    广播消息({内容=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的#Y%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
    -- elseif 类型=="双城记"  and 取随机数() <= 1 then
	    -- local wp= {"金柳露","超级金柳露","召唤兽内丹","魔兽要诀","五宝盒","修炼果","九转金丹","未激活的符石","高级魔兽要诀","神兜兜"}
	    -- if 取随机数()<=12 then
		    -- 广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y击败了黑衣人并意外获得了其慌忙逃走时丢下的#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=23 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y打坏了训练木人，意外的获得了藏于其中的#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=34 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y武艺卓越，获得了武教头的奖赏#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=45 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y击败了凌云瀚，意外的获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=56 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y解开了沙盘之中的算筹子之秘,获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=67 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y终于解开了沙盘之谜，找到了宁州地下城入口，并意外的获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=78 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y击败了宁州地下城中拦路的嗜血恶兽，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=89 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y击败了宁州地下城中拦路的邪影僵尸，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=100 then
		--     广播消息({内容=format("#S(奇谭-双城记)#G/%s#Y打开了宝库之门，地下城再也承受不住崩塌了，但意外的获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
        -- end
    -- elseif  类型=="五更寒"  and 取随机数() <= 2 then
  --   	local wp= {"金柳露","超级金柳露","召唤兽内丹","魔兽要诀","五宝盒","修炼果","九转金丹","未激活的符石","高级魔兽要诀","神兜兜"}
	 --    if 取随机数()<=12 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y在慧明长老处求得一个上上签，惊喜获得#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=23 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y成功解救小鱼儿，获得一份#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=34 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y正义凛然，打的魔化村民落荒而逃，并缴获#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=45 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y正义凛然，打的魔化村民落荒而逃，并缴获#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=56 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y正义凛然，打的魔化村民落荒而逃，并缴获#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=67 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y在解救被魔化的村长中，跌跌撞撞竟得到了珍贵的#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=78 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y正义凛然，打的八足海妖满地找牙，并缴获#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=89 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y成功解救被魔化的村长，获得一份#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		-- elseif 取随机数()<=100 then
		--     广播消息({内容=format("#S(奇谭-五更寒)#G/%s#Y在解救被魔化的村长中，跌跌撞撞竟得到了珍贵的#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
  --       end
    elseif  类型=="乌鸡国"  and 取随机数() <= 2 then
    	if 取随机数()<=90 then
    	local wp= {"金柳露","超级金柳露","召唤兽内丹","魔兽要诀","五宝盒","修炼果","九转金丹","未激活的符石","神兜兜"}
    		广播消息({内容=format("#S(乌鸡国副本)#Y乌鸡国的妖怪被#G/%s#Y打的抱头鼠窜，慌乱中遗落一个#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
        else
        	local wp= {"金柳露","超级金柳露","召唤兽内丹","魔兽要诀","五宝盒","修炼果","九转金丹","未激活的符石","神兜兜"}
    		广播消息({内容=format("#S(乌鸡国副本)#Y祝贺#G/%s#Y成功解救出乌鸡国王！喜获#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
        end
    elseif  类型=="通天河"  and 取随机数() <= 1 then
        local wp= {"金柳露","超级金柳露","召唤兽内丹","魔兽要诀","五宝盒","修炼果","九转金丹","未激活的符石","高级魔兽要诀","神兜兜"}
        if 取随机数()<=8 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y击败了灵感分身，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=16 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y险胜善财童子，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=24 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y打败了竹精，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=32 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y击败了灵感手下的金鱼将军，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=40 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y超度了婴灵，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=48 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y超度了冤魂，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=56 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y解放了孩童之心，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=64 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y超度了孩童之肝，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
		elseif 取随机数()<=72 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y超度了孩童之肾，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
	    elseif 取随机数()<=80 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y超度了孩童之脾，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
	    elseif 取随机数()<=88 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y超度了孩童之肺，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
	    elseif 取随机数()<=100 then
		    广播消息({内容=format("#S(通天河)#G/%s#Y击败了灵感大王，获得了#G%s".."#"..取随机数(1,110),玩家数据[数字id].角色.名称,wp[取随机数(1,#wp)]),频道="xt"})
        end
    end
end
--------=============================================

function 假人事件类:收摊(数字id)
	玩家数据[数字id].道具:收摊处理("假人",数字id)
end

function 假人事件类:摆摊执行中(数字id)----只执行一次了
	if 玩家数据[数字id].摊位数据==nil then
 	local sjs = self.摆摊地图[取随机数(1,#self.摆摊地图)]--取到摆摊的地图
	if self.摆摊数据[sjs][1] == nil then
		return
	end
	local sjs2 = 取随机数(1,#self.摆摊数据[sjs])---取到摆摊的随机坐标
	local sjs3 = {地图=sjs,x=self.摆摊数据[sjs][sjs2].x,y=self.摆摊数据[sjs][sjs2].y}--取到摆摊地图+坐标打包在一起
	for i=1,#self.飞行传送点 do
		if self.飞行传送点[i][1] == sjs3.地图 then----如果飞行传送点表中的表第1个值=摆摊地图号
			地图处理类:跳转地图(数字id,self.飞行传送点[i][1],self.飞行传送点[i][2],self.飞行传送点[i][3])
		end
	end
	地图处理类:移动请求("假人",sjs3,数字id)
	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y = sjs3.x*20,sjs3.y*20
	table.remove(self.摆摊数据[sjs],sjs2)
	-- self.待更新事件[#self.待更新事件+1] = {时间=10,事件 = "摆摊",数字id = 数字id}
	self:摆摊(数字id)
	end
end

function 假人事件类:摆摊(数字id)
	玩家数据[数字id].道具:索要摊位数据("假人",数字id,3515)
	self:摊位上架(数字id)
end

function 假人事件类:刷新摊位()
	for i = 1,服务端参数.假人数量 do
	local 数字id=self.假人id[i].数字id
		if self.假人id[i].事件 == "摆摊" then
			self:摆摊(数字id)
		end
	end
end


function 假人事件类:摊位上架(数字id)

	local 名称 = self.摊位名称[取随机数(1,#self.摊位名称)]
	玩家数据[数字id].摊位数据.名称 = 名称
	for i=1,20 do
		if 名称 =="未鉴定军火" then
			local 等级范围={14,15,16}
			local 等级=等级范围[取随机数(1,#等级范围)]----=15或16
			local 名称=取真随机装备名称(等级)
			-- wpsj4=物品类()
			-- wpsj4:置对象(名称)
			-- local 临时数据=table.loadstring(table.tostring(wpsj4))
			玩家数据[数字id].摊位数据.道具[i]=table.copy(装备处理类:生成打造装备假人(数字id,等级*10,取装备序列1(名称),名称,"强化打造",玩家数据[数字id].角色.名称.."打造",nil,nil,nil,nil,1))
			玩家数据[数字id].摊位数据.道具[i].价格=(等级*10)^2*6500*取随机数(95,105)/1000
		elseif 名称 =="未鉴定灵饰" then
			local 部位=随机灵饰[取随机数(1,#随机灵饰)]
			local 名称=制造装备[部位][等级]
			玩家数据[数字id].摊位数据.道具[i] = 玩家数据[数字id].道具:灵饰处理(数字id,名称,等级,3,部位)
			玩家数据[数字id].摊位数据.道具[i].制造者=玩家数据[数字id].角色.名称.."强化打造"
			价格=math.floor(等级^2*9500*math.random(95,105)/1000)
			玩家数据[数字id].摊位数据.道具[i].价格=价格
		elseif 名称 =="未鉴定灵饰" then
			local 等级范围={100,120,140}
			local 等级=等级范围[取随机数(1,#等级范围)]
			local 部位=随机灵饰[取随机数(1,#随机灵饰)]
			local 名称=制造装备[部位][等级]
			玩家数据[数字id].摊位数据.道具[i] = 玩家数据[数字id].道具:灵饰处理(数字id,名称,等级,3,部位)
			玩家数据[数字id].摊位数据.道具[i].制造者=玩家数据[数字id].角色.名称.."强化打造"
			价格=math.floor(等级^2*9500*math.random(95,105)/1000)
			玩家数据[数字id].摊位数据.道具[i].价格=价格
		else
			local wpsj={}
			wpsj[1]={"特赦令牌*2500000","海马*80000","金银锦盒*150000","圣兽丹*300000","彩果*600000","分解符*80000","上古锻造图策*1","炼妖石*1","九眼天珠*1"}
			wpsj[2]={"烤肉*110000","醉生梦死*200000","蛇胆酒*180000","百味酒*150000","梅花酒*110000","长寿面*110000",
					"翡翠豆腐*110000","桂花丸*110000","秘制绿芦羹*150000","秘制红罗羹*150000","珍露酒*150000","豆斋果*110000",
					"臭豆腐*110000","佛跳墙*110000","烤鸭*110000","虎骨酒*110000","女儿红*110000"}
			wpsj[3]={"金香玉*180000","小还丹*180000","千年保心丹*180000","风水混元丹*180000","定神香*180000","金创药*4000","蛇蝎美人*180000",
					"九转回魂丹*180000","佛光舍利子*180000","十香返生丸*180000","金创药*4000","五龙丹*180000"}
			wpsj[4]={"鹿茸*5000","仙狐涎*5000","地狱灵芝*5000","六道轮回*5000","紫石英*5000","龙之心屑*10000","孔雀红*10000","餐风饮露*20000",
					"天不老*5000","血色茶花*5000","凤凰尾*10000","硫磺草*5000","龙之心屑*10000","火凤之睛*10000","月星子*5000","丁香水*5000",
					"血珊瑚*5000","白露为霜*5000","天龙水*5000"}
			wpsj[5]={"强化符*85000"}

			wpsj[6]={"青龙石*75000","玄武石*75000","朱雀石*75000","白虎石*75000","钨金*78000","陨铁*200000"}--,"附魔宝珠*1200000","战魄*1200000"
			wpsj[7]={"仙露小丸子*3500000","神兽涎*3500000","清灵净瓶*188000",
					"水晶糕*300000","芝麻沁香元宵*100000","桂花酒酿元宵*100000","细磨豆沙元宵*100000","蜜糖腰果元宵*100000","山楂拔丝元宵*100000",
					"滑玉莲蓉元宵*100000","炼兽真经*1660000"}
			wpsj[8]={"制造指南书*1","百炼精铁*1","灵饰指南书*1","元灵晶石*1"}

			if 名称 =="二药专卖" then
				sjs = 4
			elseif 名称 =="秘方三药" then
				sjs = 3
			elseif 名称 =="秘方烹饪" then
				sjs = 2
			elseif 名称 =="下线不掉FFF" then
				sjs = 5
			elseif 名称 =="杂货清仓" then
				sjs = 1
			elseif 名称 =="强化石钨金陨铁" then
				sjs = 6
			elseif 名称 =="元宵真经" then
				sjs = 7
			elseif 名称 =="书铁大全" then
				sjs = 8
			else
			 	-- if 取随机数() < 50 then
					sjs = 2
				-- else
					-- sjs = 5
				-- end
			end

			local wpsj2 = wpsj[sjs][取随机数(1,#wpsj[sjs])]
			local wpsj3 = 分割文本(wpsj2,"*")
			wpsj4=物品类()
			wpsj4:置对象(wpsj3[1])
			local 价格=wpsj3[2]+0
			玩家数据[数字id].摊位数据.道具[i]=table.loadstring(table.tostring(wpsj4))
			玩家数据[数字id].摊位数据.道具[i].价格=math.floor(    价格*math.random(95,105)/100    )
			if sjs == 2 or sjs == 3 then
				玩家数据[数字id].摊位数据.道具[i].阶品  = math.random(140,220)
				local 药品名={"金香玉","千年保心丹","九转回魂丹","蛇蝎美人","五龙丹"}
				if 玩家数据[数字id].摊位数据.道具[i].名称== "金香玉" or 玩家数据[数字id].摊位数据.道具[i].名称== "千年保心丹" or 玩家数据[数字id].摊位数据.道具[i].名称== "九转回魂丹" or 玩家数据[数字id].摊位数据.道具[i].名称== "蛇蝎美人" or 玩家数据[数字id].摊位数据.道具[i].名称== "五龙丹" then
					local 概率=取随机数()
					if 概率 >= 40 and 概率 < 80 then
					玩家数据[数字id].摊位数据.道具[i].附加技能 = "倍愈"
					elseif 概率 >= 80 then
					玩家数据[数字id].摊位数据.道具[i].附加技能 = "藏神"
					else
					end
				end
			-- elseif sjs==4 then
			-- 	玩家数据[数字id].摊位数据.道具[i].数量  = math.random(10,99)
			else
				if wpsj3[1] == "强化符" then
					local lsb = {"嗜血","轻如鸿毛","拈花妙指","盘丝舞","一气化三清","浩然正气","龙附","神兵护法","魔王护持","莲华妙法","神力无穷","尸气漫天","担山赶月","神木呓语","元阳护体","穿云破空"}
					local mc = lsb[取随机数(1,#lsb)]
					local 分类 = 取强化符分类(mc)
					玩家数据[数字id].摊位数据.道具[i].技能 = mc
					玩家数据[数字id].摊位数据.道具[i].等级 = 186
					玩家数据[数字id].摊位数据.道具[i].分类 = 分类
				elseif wpsj3[1] == "月华露" then
					玩家数据[数字id].摊位数据.道具[i].阶品  = 500
					玩家数据[数字id].摊位数据.道具[i].可叠加=true
					玩家数据[数字id].摊位数据.道具[i].数量=math.random(20,99)
				elseif wpsj3[1] == "制造指南书" then
					local 书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
					玩家数据[数字id].摊位数据.道具[i].子类=math.random(14,15)*10
					玩家数据[数字id].摊位数据.道具[i].特效=取随机数(1,#书铁范围)
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor(玩家数据[数字id].摊位数据.道具[i].子类^2*300*math.random(95,105)/100)
				elseif wpsj3[1] == "百炼精铁" then
					玩家数据[数字id].摊位数据.道具[i].子类=math.random(14,15)*10
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor(玩家数据[数字id].摊位数据.道具[i].子类^2*100*math.random(95,105)/100)
				elseif wpsj3[1] == "灵饰指南书" then
					玩家数据[数字id].摊位数据.道具[i].子类=(math.random(1,5)*2+4)*10
					玩家数据[数字id].摊位数据.道具[i].特效=随机灵饰[取随机数(1,#随机灵饰)]
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor(玩家数据[数字id].摊位数据.道具[i].子类^2*400*math.random(95,105)/100)
				elseif wpsj3[1] == "元灵晶石" then
					玩家数据[数字id].摊位数据.道具[i].子类=(math.random(1,5)*2+4)*10
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor(玩家数据[数字id].摊位数据.道具[i].子类^2*200*math.random(95,105)/100)
				elseif wpsj3[1] == "钨金" or wpsj3[1] == "陨铁"  then--战魄" or wpsj3[1] == "" or wpsj3[1] == "附魔宝珠
					玩家数据[数字id].摊位数据.道具[i].等级=160
					玩家数据[数字id].摊位数据.道具[i].可叠加=true
					玩家数据[数字id].摊位数据.道具[i].数量=math.random(20,99)
				elseif wpsj3[1] == "上古锻造图策" then
					local 部位={"护腕","项圈","铠甲"}
					玩家数据[数字id].摊位数据.道具[i].级别限制=取随机数(7,15)*10 +5
					玩家数据[数字id].摊位数据.道具[i].种类=部位[取随机数(1,#部位)]
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor( 玩家数据[数字id].摊位数据.道具[i].级别限制*10000*取随机数(95,105)/100 )
				elseif wpsj3[1] == "炼妖石"  then
					玩家数据[数字id].摊位数据.道具[i].级别限制=取随机数(7,15)*10 +5
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor( 玩家数据[数字id].摊位数据.道具[i].级别限制*1500*取随机数(95,105)/100 )
				elseif wpsj3[1] == "九眼天珠"  then
					玩家数据[数字id].摊位数据.道具[i].级别限制=取随机数(7,15)*10 +5
					玩家数据[数字id].摊位数据.道具[i].灵气=取随机数(60,100)
					玩家数据[数字id].摊位数据.道具[i].价格=math.floor( 玩家数据[数字id].摊位数据.道具[i].级别限制*200*玩家数据[数字id].摊位数据.道具[i].灵气*取随机数(95,105)/100 )
				elseif wpsj3[1] == "神兵图鉴" or  wpsj3[1] == "灵宝图鉴"  or wpsj3[1] == "灵饰图鉴" then
					玩家数据[数字id].摊位数据.道具[i].子类=160
				elseif wpsj3[1] == "XXX" then
					玩家数据[数字id].摊位数据.道具[i].可叠加=true

				elseif  玩家数据[数字id].摊位数据.道具[i].可叠加 then
					玩家数据[数字id].摊位数据.道具[i].数量=math.random(20,99)
				end
			end
		end
	end


	模型=取所有宝宝名称 -----在宝宝.lua里

		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"变异",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)
		随机模型=模型[math.random(1,#模型)]
		玩家数据[数字id].召唤兽:添加召唤兽(随机模型,随机模型,"宝宝",属性,30,染色方案,技能组,资质组,成长,参战等级,属性表)


		local 变异加成=1
		local 稀有加成=1
		for i=1,8 do
		玩家数据[数字id].摊位数据.bb[i]=table.loadstring(table.tostring(玩家数据[数字id].召唤兽.数据[i]))
		if 玩家数据[数字id].摊位数据.bb[i].种类 =="变异" then
			变异加成=1.5
		else
		    变异加成=1
		end
		if 玩家数据[数字id].摊位数据.bb[i].模型=="持国巡守" or
			玩家数据[数字id].摊位数据.bb[i].模型=="大力金刚" or
			玩家数据[数字id].摊位数据.bb[i].模型=="律法女娲" or
			玩家数据[数字id].摊位数据.bb[i].模型=="雷龙" or
			玩家数据[数字id].摊位数据.bb[i].模型=="夜罗刹" or
			玩家数据[数字id].摊位数据.bb[i].模型=="妙华天女" or
			玩家数据[数字id].摊位数据.bb[i].模型=="般若天女" or
			玩家数据[数字id].摊位数据.bb[i].模型=="广目巡守" or
			玩家数据[数字id].摊位数据.bb[i].模型=="增长巡守" or
			玩家数据[数字id].摊位数据.bb[i].模型=="谛听" or
			玩家数据[数字id].摊位数据.bb[i].模型=="龙龟" then 稀有加成=2 end

		玩家数据[数字id].摊位数据.bb[i].价格=math.floor( 稀有加成*  ( 10000 + (#玩家数据[数字id].摊位数据.bb[i].技能)*((玩家数据[数字id].摊位数据.bb[i].参战等级+10)/2)*3000 )*变异加成 *math.random(95,105)/100)
		-- 玩家数据[数字id].摊位数据.bb[i].价格=math.floor(   ( 300000 + 玩家数据[数字id].摊位数据.bb[i].参战等级*50000 + (#玩家数据[数字id].摊位数据.bb[i].技能)*1000000  )  *math.random(95,105)/100)
		end
	地图处理类:设置玩家摊位(数字id,名称)
end

function 假人事件类:挂机(数字id)
	local xy=地图处理类.地图坐标[玩家数据[数字id].角色.地图数据.编号]:取随机点()
		地图处理类:移动请求("假人",xy,数字id)
		玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y,玩家数据[数字id].角色.地图数据.方向 = xy.x*20,xy.y*20,取随机数(0,7)
end


-- function 假人事件类:全员进图(数字id)---不好
-- 	local sjs = self.全员地图[取随机数(1,#self.全员地图)]
-- 	local xy=地图处理类.地图坐标[sjs]:取随机点()
-- 	地图处理类:跳转地图(数字id,sjs,xy.x,xy.y)
-- 	地图处理类:移动请求("假人",xy,数字id)
-- 	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y,玩家数据[数字id].角色.地图数据.方向= xy.x*20,xy.y*20,取随机数(0,7)
-- end

function 假人事件类:全员进图(数字id)------含摆摊的
	local sjs = self.全员地图[取随机数(1,#self.全员地图)]
	local xy=地图处理类.地图坐标[sjs]:取随机点()
	地图处理类:跳转地图(数字id,sjs,xy.x,xy.y)
	地图处理类:移动请求("假人",xy,数字id)
	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y,玩家数据[数字id].角色.地图数据.方向= xy.x*20,xy.y*20,取随机数(0,7)
end



-- function 假人事件类:执行闲逛(数字id)
-- 	local xy=地图处理类.地图坐标[玩家数据[数字id].角色.地图数据.编号]:取随机点()
-- 	地图处理类:移动请求("假人",xy,数字id)
-- 	玩家数据[数字id].角色.地图数据.x,玩家数据[数字id].角色.地图数据.y,玩家数据[数字id].角色.地图数据.方向= xy.x*20,xy.y*20,取随机数(0,7)
-- end
local 姓库 = {
    '赵',
    '钱',
    '孙',
    '李',
    '周',
    '吴',
    '郑',
    '王',
    '冯',
    '陈',
    '褚',
    '卫',
    '蒋',
    '沈',
    '韩',
    '杨',
    '朱',
    '秦',
    '尤',
    '许',
    '何',
    '吕',
    '施',
    '张',
    '孔',
    '曹',
    '严',
    '华',
    '金',
    '魏',
    '陶',
    '姜',
    '戚',
    '谢',
    '邹',
    '喻',
    '柏',
    '水',
    '窦',
    '章',
    '云',
    '苏',
    '潘',
    '葛',
    '奚',
    '范',
    '彭',
    '郎',
    '鲁',
    '韦',
    '昌',
    '马',
    '苗',
    '凤',
    '花',
    '方',
    '俞',
    '任',
    '袁',
    '柳',
    '邓',
    '鲍',
    '史',
    '唐',
    '费',
    '廉',
    '岑',
    '薛',
    '雷',
    '贺',
    '倪',
    '汤',
    '藤',
    '殷',
    '罗',
    '毕',
    '郝',
    '邬',
    '安',
    '常',
    '乐',
    '于',
    '时',
    '付',
    '皮',
    '卞',
    '齐',
    '康',
    '伍',
    '余',
    '元',
    '卜',
    '顾',
    '孟',
    '平',
    '黄',
    '和',
    '穆',
    '肖',
    '尹',
    '姚',
    '邵',
    '湛',
    '汪',
    '祁',
    '毛',
    '禹',
    '狄',
    '米',
    '贝',
    '明',
    '藏',
    '计',
    '伏',
    '成',
    '戴',
    '谈',
    '宋',
    '茅',
    '庞',
    '熊',
    '纪',
    '舒',
    '屈',
    '项',
    '祝',
    '董',
    '梁',
    '杜',
    '阮',
    '伏',
    '蓝',
    '闵',
    '席',
    '季',
    '麻',
    '强',
    '贾',
    '路',
    '娄',
    '危',
    '江',
    '童',
    '颜',
    '郭',
    '梅',
    '盛',
    '林',
    '刁',
    '钟',
    '徐',
    '邱',
    '骆',
    '高',
    '夏',
    '蔡',
    '田',
    '樊',
    '胡',
    '凌',
    '霍',
    '虞',
    '万',
    '支',
    '柯',
    '昝',
    '管',
    '卢',
    '莫',
    '经',
    '房',
    '裘',
    '缪',
    '干',
    '解',
    '应',
    '宗',
    '丁',
    '宣',
    '贲',
    '郁',
    '单',
    '杭',
    '洪',
    '包',
    '诸',
    '左',
    '石',
    '崔',
    '吉',
    '钮',
    '龚',
    '程',
    '嵇',
    '邢',
    '滑',
    '裴',
    '陆',
    '荣',
    '翁',
    '荀',
    '羊',
    '惠',
    '甄',
    '上官',
    '欧阳',
    '夏候',
    '诸葛',
    '闻人',
    '东方',
    '赫连',
    '皇甫',
    '尉迟',
    '公羊',
    '澹台',
    '公冶',
    '宗政',
    '濮阳',
    '淳于',
    '单于',
    '太叔',
    '申屠',
    '公孙',
    '仲孙',
    '轩辕',
    '令狐',
    '钟离',
    '宇文',
    '长孙',
    '慕容',
    '鲜于',
    '闾丘',
    '司徒',
    '司空',
    '亓官',
    '司寇',
    '仉督',
    '子车',
    '颛孙',
    '端木',
    '巫马',
    '公西',
    '漆雕',
    '乐正',
    '壤驷',
    '公良',
    '拓拔',
    '夹谷',
    '宰父',
    '谷梁',
    '南宫',
    '百里',
    '段干',
    '东郭',
    '南门',
    '呼延',
    '归海',
    '羊舌',
    '微生',
    '梁丘',
    '左丘',
    '东门',
    '西门',
    '楚',
    '晋',
    '闫',
    '法',
    '汝',
    '鄢',
    '涂',
    '钦',
    '岳',
    '帅',
    '缑',
    '亢',
    '况',
    '有',
    '琴',
    '商',
    '牟',
    '佘',
    '耳',
    '伯',
    '赏',
    '墨',
    '哈',
    '年',
    '爱',
    '阳',
    '佟',
    '言',
    '福',
    '曲',
    '家',
    '封',
    '芮',
    '羿',
    '储',
    '靳',
    '汲',
    '邴',
    '糜',
    '松',
    '祖',
    '井',
    '刘',
    '段',
    '富',
    '巫',
    '叶',
    '乌',
    '焦',
    '巴',
    '弓',
    '牧',
    '隗',
    '山',
    '谷',
    '车',
    '侯',
    '全',
    '蓬',
    '景',
    '郗',
    '班',
    '仰',
    '秋',
    '仲',
    '伊',
    '宫',
    '宁',
    '仇',
    '栾',
    '暴',
    '甘',
    '钭',
    '厉',
    '戎',
    '武',
    '符',
    '从',
    '詹',
    '束',
    '龙',
    '幸',
    '司',
    '韶',
    '郜',
    '黎',
    '蓟',
    '薄',
    '印',
    '宿',
    '白',
    '怀',
    '武',
    '蒲',
    '邰',
    '鄂',
    '索',
    '咸',
    '籍',
    '赖',
    '卓',
    '蔺',
    '屠',
    '蒙',
    '池',
    '乔',
    '阴',
    '胥',
    '能',
    '苍',
    '双',
    '闻',
    '莘',
    '党',
    '翟',
    '谭',
    '贡',
    '劳',
    '逄',
    '姬',
    '申',
    '扶',
    '堵',
    '冉',
    '宰',
    '郦',
    '雍',
    '隙',
    '璩',
    '桑',
    '桂',
    '濮',
    '牛',
    '寿',
    '通',
    '边',
    '扈',
    '燕',
    '冀',
    '郏',
    '浦',
    '尚',
    '农',
    '温',
    '别',
    '庄',
    '晏',
    '柴',
    '瞿',
    '阎',
    '充',
    '慕',
    '连',
    '茹',
    '习',
    '宦',
    '艾',
    '鱼',
    '容',
    '向',
    '古',
    '易',
    '慎',
    '戈',
    '廖',
    '庾',
    '终',
    '暨',
    '居',
    '衡',
    '步',
    '都',
    '耿',
    '满',
    '弘',
    '匡',
    '文',
    '国',
    '寇',
    '广',
    '禄',
    '东',
    '欧',
    '殳',
    '沃',
    '利',
    '蔚',
    '越',
    '隆',
    '师',
    '巩',
    '聂',
    '晁',
    '勾',
    '敖',
    '融',
    '訾',
    '冷',
    '辛',
    '那',
    '简',
    '饶',
    '空',
    '曾',
    '沙',
    '养',
    '鞠',
    '须',
    '丰',
    '关',
    '相',
    '查',
    '后',
    '荆',
    '红',
    '游',
    '竺',
    '权',
    '盖',
    '益',
    '桓',
    '公',
}

local 单字 = {
    '天',
    '夜',
    '晴',
    '瑜',
    '飞',
    '文',
    '弘',
    '松',
    '晓',
    '智',
    '云',
    '易',
    '远',
    '航',
    '笑',
    '白',
    '映',
    '波',
    '代',
    '桃',
    '泽',
    '啸',
    '宸',
    '博',
    '靖',
    '琪',
    '十',
    '君',
    '浩',
    '绍',
    '辉',
    '冷',
    '安',
    '盼',
    '旋',
    '秋',
    '瑾',
    '宇',
    '黎',
    '杰',
    '辉',
    '德',
    '邪',
    '默',
    '磊',
    '豪',
    '寒',
    '瀚',
    '哲',
    '阳',
    '风',
    '皓',
    '世',
    '轩',
    '思',
    '鸿',
    '涛',
    '煜',
    '雄',
    '英',
    '诗',
    '展',
    '聪',
    '俊',
    '海',
    '彤',
    '珍',
    '雨',
    '琴',
    '玉',
    '鹏',
    '祺',
    '命',
    '成',
    '先',
    '忘',
    '幽',
    '威',
    '秀',
    '凡',
    '渊',
    '熙',
    '胜',
    '鸣',
    '姿',
    '芷',
    '芝',
    '筝',
    '真',
    '贞',
    '婴',
    '雯',
    '纹',
    '菀',
    '莞',
    '宛',
    '桐',
    '愫',
    '素',
    '涑',
    '姝',
    '弱',
    '若',
    '蓉',
    '清',
    '青',
    '茗',
    '敏',
    '萍',
    '蓝',
    '兰',
    '莺',
    '萤',
    '弱',
    '怡',
    '紫',
    '芯',
    '雁',
    '嫣',
    '荠',
    '嵩',
    '卿',
    '裘',
    '阁',
    '康',
    '城',
    '焱',
    '穆',
    '枫',
    '翼',
    '鹤',
    '乾'
}

local 双字 = {
    '之玉',
    '越泽',
    '锦程',
    '修杰',
    '烨伟',
    '尔曼',
    '立辉',
    '致远',
    '天思',
    '友绿',
    '聪健',
    '修洁',
    '访琴',
    '初彤',
    '谷雪',
    '平灵',
    '源智',
    '申屠',
    '振家',
    '越彬',
    '子轩',
    '伟宸',
    '晋鹏',
    '觅松',
    '海亦',
    '雨珍',
    '浩宇',
    '嘉熙',
    '志泽',
    '苑博',
    '念波',
    '峻熙',
    '俊驰',
    '子车',
    '南松',
    '聪展',
    '问旋',
    '黎昕',
    '谷波',
    '凝海',
    '靖易',
    '芷烟',
    '渊思',
    '煜祺',
    '乐驹',
    '风华',
    '睿渊',
    '博超',
    '天磊',
    '夜白',
    '初晴',
    '瑾瑜',
    '鹏飞',
    '弘文',
    '伟泽',
    '迎松',
    '雨泽',
    '鹏笑',
    '诗云',
    '大官人',
    '大诗人',
    '白易'

}
function 假人事件类:取随机中文姓名()
  local 名称 = ''
  local 姓 = 姓库[取随机数(1,#姓库)]
  if math.random(100) <= 55 then
      名称 = 姓 .. 双字[取随机数(1,#双字)]
  elseif math.random(100) <= 70 then
      名称 = 姓 .. 单字[取随机数(1,#单字)]
  else
      名称 = 姓 .. 单字[取随机数(1,#单字)] .. 单字[取随机数(1,#单字)]
  end
  return 名称
end

return 假人事件类
