-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-09 15:08:40
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-19 11:35:05
local 管理工具类 = class()
function 管理工具类:初始化() end

function 管理工具类:数据处理(id,序号,数据)
  local 玩家id = 数据.id+0
  local 账号 = nil
  local 类型
  local 发送信息={}
  local 管理日志=""
  local 充值日志=""
  if 玩家数据[id] == nil then
      return
  end
  if 玩家id == 0 then
    local 玩家名称 = 数据.名称
    for i=1,#名称数据 do
      if 名称数据[i].名称 ~= nil and 名称数据[i].名称 == 玩家名称 then
        if 名称数据[i].id == nil then
          return
        else
          玩家id = 名称数据[i].id
          break
        end
      end
    end
  end
  if 玩家id ~= 0 and 玩家id ~= 1 and 玩家数据[玩家id] == nil and 序号 ~= 7204 then
    常规提示(id,"#Y/玩家不在线,或者id输入错误")
    return
  elseif 玩家id ~= 0 and 玩家id ~= 1 and 玩家数据[玩家id] == nil and 序号 == 7204 and 数据.类型 ~= "封禁账号" and 数据.类型 ~= "封禁ip" and 数据.类型 ~= "解封账号"  and 数据.类型 ~= "解封ip" then
    常规提示(id,"#Y/玩家不在线,或者id输入错误")
    return
  elseif 玩家id == 0 then
    常规提示(id,"#Y/id输入错误或者玩家名输入错误")
    return
  end
  if 序号 >= 7201 and 序号 < 7206 then
    if 序号 == 7204 and (数据.类型 == "封禁账号" or 数据.类型 == "封禁ip" or 数据.类型 == "解封账号"  or 数据.类型 == "解封ip" ) then
      if  玩家数据[玩家id] == nil then
        for i=1,#名称数据 do
          if 名称数据[i].id ~= nil and 名称数据[i].账号 ~= nil and 名称数据[i].id == 玩家id then
            账号 = 名称数据[i].账号
          end
        end
      else
        账号 = 玩家数据[玩家id].账号
      end
    else
      账号 = 玩家数据[玩家id].账号
    end
  end
  if 序号 == 7201 then -- 充值系统
    local 充值类型=""
    local 充值数额 = 数据.数值+0
    类型 = 数据.类型
    --权限 = 数据.权限
    if 类型 == "点卡数额" then
      充值类型="点卡"
      if 玩家数据[玩家id].角色.点卡==nil then
        玩家数据[玩家id].角色.点卡=0
      end
      玩家数据[玩家id].角色:添加点卡(充值数额,账号,玩家id,"GM工具充值")
    elseif 类型 == "银子数额" then
      充值类型="银子"
      玩家数据[玩家id].角色:添加银子(充值数额,"GM工具充值")
    elseif 类型 == "储备数额" then
      充值类型="储备"
      玩家数据[玩家id].角色:添加储备(充值数额,"GM工具充值")
    elseif 类型 == "门贡数额" then
      充值类型="门贡"
      玩家数据[玩家id].角色:添加门贡(充值数额)
    elseif 类型 == "经验数额" then
      充值类型="经验"
      -- if 权限==1 then
      --   --self:添加经验(id,充值数额)
      -- elseif  权限==2 then
        self:添加经验(玩家id,充值数额)
     -- end
    elseif 类型 == "抽奖积分" then
      充值类型="抽奖积分"
      --if  权限==2 then
        玩家数据[玩家id].角色:添加抽奖积分(充值数额)
      -- else
      --   常规提示(id,"#Y/当前权限不足")
      -- end

    elseif 类型 == "充值等级" then
      --[[充值类型="等级"
      玩家数据[玩家id].角色:添加等级(充值数额)--]]
    elseif 类型 == "副本积分" then
      充值类型="副本积分"
     -- if  权限==2 then
        玩家数据[玩家id].角色:添加副本积分(充值数额)
      -- else
      --   常规提示(id,"#Y/当前权限不足")
      -- end

    end
   -- if 权限==1 then
        --常规提示(id,"#Y/你获得了"..充值数额..充值类型)
      --elseif  权限==2 then
        常规提示(玩家id,"#Y/你获得了"..充值数额..充值类型)
     -- end

    常规提示(id,"#Y/充值"..充值类型.."成功！")
    --发送数据(玩家数据[id].连接id,8)
  elseif 序号 == 7202 then --获取角色信息
    if 玩家id ~= 0 then
      发送信息.账号 = 玩家数据[玩家id].账号
      发送信息.名称 = 玩家数据[玩家id].角色.名称
      发送信息.ID = 玩家id
      发送信息.等级 = 玩家数据[玩家id].角色.等级
      发送信息.造型 = 玩家数据[玩家id].角色.造型
      发送信息.点卡 = 玩家数据[玩家id].角色.点卡
      发送信息.银子 = 玩家数据[玩家id].角色.银子
      发送信息.储备 = 玩家数据[玩家id].角色.储备
      发送信息.存银 = 玩家数据[玩家id].角色.存银
      发送信息.连接IP = 数据.ip
      发送信息.抽奖积分 = 玩家数据[玩家id].角色.抽奖积分
      发送信息.副本积分 = 玩家数据[玩家id].角色.副本积分
      发送信息.经验 = 玩家数据[玩家id].角色.当前经验
      发送信息.武器 = 玩家数据[玩家id].角色.武器数据.名称
      发送信息.门派 = 玩家数据[玩家id].角色.门派
      发送信息.帮派 = 玩家数据[玩家id].角色.帮派
      发送信息.人物修炼 =   {}
      for i,v in pairs(玩家数据[玩家id].角色.修炼) do
        if i ~= "当前" and i ~= "猎术修炼" then
          发送信息.人物修炼[i] = 玩家数据[玩家id].角色.修炼[i][1]
        end
      end
      发送信息.召唤兽修炼 = {}
      for i,v in pairs(玩家数据[玩家id].角色.bb修炼) do
        if i ~= "当前" then
          发送信息.召唤兽修炼[i] = 玩家数据[玩家id].角色.bb修炼[i][1]
        end
      end
      for i=1,#玩家数据[玩家id].角色.辅助技能 do
        if 玩家数据[玩家id].角色.辅助技能[i].名称 == "强身术" then
          发送信息.强身等级 = 玩家数据[玩家id].角色.辅助技能[i].等级
        elseif 玩家数据[玩家id].角色.辅助技能[i].名称 == "冥想" then
          发送信息.冥想等级 = 玩家数据[玩家id].角色.辅助技能[i].等级
        end
      end
      发送数据(玩家数据[id].连接id,208.1,发送信息)
      发送信息=nil
    end
  elseif 序号 == 7203 then --获取角色充值信息
    发送数据(玩家数据[id].连接id,209.1,充值日志)
  elseif 序号 == 7204 then --封禁账号
    if 账号 == nil  then
      常规提示(id,"#Y/id输入错误或者玩家名输入错误")
      return
    end
    if 数据.类型 == "封禁账号" then
      -- f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","封禁","1")
      -- self.临时文件=table.loadstring(读入文件([[data/]]..账号..[[/信息.txt]]))
      -- for n=1,#self.临时文件 do
      --   local 临时id=self.临时文件[n]+0
      --   if 玩家数据[临时id]~=nil then
      --     发送数据(玩家数据[临时id].连接id,999,"您的账号已经被封禁,如有疑问请与管理员联系")
      --     系统处理类:断开游戏(临时id)
      --   end
      -- end
      -- 常规提示(id,"#Y/封禁"..账号.."成功！相关在线id已经被强制下线")
      -- return
    elseif 数据.类型 == "封禁ip" then --封禁IP
      -- local 封禁临时ip = f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","创建ip")
      -- f函数.写配置(程序目录..[[ip封禁.ini]],"ip",封禁临时ip,"1")
      -- self.临时文件=table.loadstring(读入文件([[data/]]..账号..[[/信息.txt]]))
      -- for n=1,#self.临时文件 do
      --   local 临时id=self.临时文件[n]+0
      --   if 玩家数据[临时id]~=nil then
      --     发送数据(玩家数据[临时id].连接id,999,"您的IP已经被封禁,如有疑问请与管理员联系")
      --     系统处理类:断开游戏(临时id)
      --   end
      -- end
      -- local 封禁机器码 = f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","机器码")
      -- f函数.写配置(程序目录..[[机器码封禁.ini]],"机器码",封禁机器码,"1")
      -- return
    elseif 数据.类型 == "解封账号" then --解封账号
      -- f函数.写配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","封禁","0")
      -- 常规提示(id,"#Y/解封"..账号.."成功！")
    elseif 数据.类型 == "解封ip" then --解封ip
      -- local 封禁临时ip = f函数.读配置(程序目录..[[data\]]..账号..[[\账号信息.txt]],"账号配置","创建ip")
      -- f函数.写配置(程序目录..[[ip封禁.ini]],"ip",封禁临时ip,"0")
      -- 常规提示(id,"#Y/解封"..账号.."IP成功！")
    elseif 数据.类型 == "踢出战斗" then --踢出战斗
      if 玩家数据[玩家id].战斗~=0 and 战斗准备类.战斗盒子[玩家数据[玩家id].战斗]~=nil then
        if 玩家数据[玩家id].队伍~=0 and 玩家数据[玩家id].队长 and 战斗准备类.战斗盒子[玩家数据[玩家id].战斗].执行等待<0 then
          战斗准备类.战斗盒子[玩家数据[玩家id].战斗]:结束战斗(0,玩家数据[玩家id].队伍,1)
          常规提示(id,"#Y/强制结束战斗成功！")
        else
          战斗准备类.战斗盒子[玩家数据[玩家id].战斗]:结束战斗(0,玩家id,1)
          常规提示(id,"#Y/强制结束战斗成功！")
        end
      else
        常规提示(id,"#Y/该玩家未在战斗！")
      end
    elseif 数据.类型 == "强制下线" then --强制下线
      发送数据(玩家数据[玩家id].连接id,998,"你已经被管理员强制下线")
      常规提示(id,"#Y/强制下线玩家:"..玩家id.."成功！")
    end
  elseif 序号 == 7205 then
    for i,v in pairs(数据) do
      if tonumber(v) ~= nil then
        if i == "法术修炼" or i == "防御修炼" or i == "抗法修炼" or i == "攻击修炼" then
          --玩家数据[玩家id].角色.修炼[i][1] = v+0
        elseif i == "防御控制" or i == "攻击控制" or i == "法术控制" or i == "抗法控制" then
          --玩家数据[玩家id].角色.bb修炼[i.."力"][1] = v+0
        --elseif i == "冥想等级" or i == "强身等级" then
          --[[if i == "强身等级" then
            for i=1,#玩家数据[玩家id].角色.辅助技能 do
              if 玩家数据[玩家id].角色.辅助技能[i].名称 == "强身术" then
                玩家数据[玩家id].角色.辅助技能[i].等级 = v+0
              end
            end
          elseif i == "冥想等级" then
            for i=1,#玩家数据[玩家id].角色.辅助技能 do
              if 玩家数据[玩家id].角色.辅助技能[i].名称 == "冥想" then
                玩家数据[玩家id].角色.辅助技能[i].等级 = v+0
              end
            end
          end--]]
        end
      end
    end
    玩家数据[玩家id].角色:刷新信息(1)
    发送数据(玩家数据[玩家id].连接id,31,玩家数据[玩家id].角色:取总数据())
    常规提示(id,"#Y/修改玩家信息成功！")
  elseif 序号 == 7206 then
    local 给予成功 = false
    local 临时格子 = 玩家数据[玩家id].角色:取道具格子()
    if 临时格子 == 0 then
      常规提示(id,"#Y/对方背包已满！")
      return
    end
    local 道具编号 = 玩家数据[玩家id].道具:取新编号()
    玩家数据[玩家id].道具[道具编号]=物品类()
    玩家数据[玩家id].角色.道具[临时格子]=道具编号
    local 内容 = {[1]=数据.内容}
    local 物品类型
    if 数据.类型 == "给予道具" then
      物品类型 =取物品数据(内容[1])
      内容[2]=数据.内容1
      内容[3]=数据.内容2
      内容[4]=数据.内容3
      内容[5]=数据.内容4
      if 物品类型 ~= "" and 物品类型 ~=nil then
        if 内容[1]=="制造指南书" then
          local 书铁范围=self:取指南书序号(内容[3])
          内容[3]=书铁范围
        end
        if 内容[1]=="灵饰指南书" then
           if 内容[2]==60 then
            内容[2]={6,6}
          elseif 内容[2]==80 then
            内容[2]={8,8}
          elseif 内容[2]==100 then
            内容[2]={10,10}
          elseif 内容[2]==120 then
            内容[2]={12,12}
          elseif 内容[2]==140 then
            内容[2]={14,14}
           end
        end
        if 内容[1]=="九转金丹" then
          if 内容[2]>=300 then
            内容[2]=300
           end
        end
        if 内容[1]=="制造指南书" or 内容[1]=="百炼精铁"  then
          if 内容[2]>=150 then
            内容[2]=150
           end
        end
        if 内容[1]=="12技能法宠" or 内容[1]=="12技能攻宠" or 内容[1]=="24技能攻宠"  then
           return
        end
        print(内容[1],内容[2],内容[3],内容[4],内容[5])
        玩家数据[玩家id].道具:给予道具(玩家id,内容[1],内容[2],内容[3],内容[4],内容[5])
      else
        常规提示(id,"物品数据错误----"..内容[1])
      end


    elseif 数据.类型 == '给予坐骑' then
        玩家数据[玩家id].角色:增加种族坐骑(玩家id)
        给予成功 = true
        玩家数据[玩家id].道具[道具编号]=nil
        玩家数据[玩家id].角色.道具[临时格子]=nil
    elseif 数据.类型 == '给予称谓' then
      玩家数据[玩家id].角色:添加称谓(内容[1])
      给予成功 = true
      玩家数据[玩家id].道具[道具编号]=nil
      玩家数据[玩家id].角色.道具[临时格子]=nil
    elseif 数据.类型 == '给予宝石' then
      内容[2]=数据.内容1
      内容[3]=数据.内容2
      if 内容[2]>内容[3] then
        内容[3]=内容[2]
      end
      if tonumber(内容[2]) == nil or tonumber(内容[3]) == nil then
        玩家数据[玩家id].道具[道具编号]=nil
        玩家数据[玩家id].角色.道具[临时格子]=nil
        return
      end
      if 内容[1]== "红玛瑙" or 内容[1]=="太阳石" or 内容[1]=="舍利子" or 内容[1]=="黑宝石" or 内容[1]=="月亮石" or 内容[1]=="光芒石" or 内容[1]=="翡翠石" or 内容[1]=="星辉石" then
        for n=内容[2],内容[3] do
          玩家数据[玩家id].道具:给予道具(玩家id,内容[1],n)
        end
      end
    elseif 数据.类型 == "宝宝装备" then
      for i=1,9 do
        内容[i+1] = 数据["内容"..i]
      end
      if 内容[1] ~="护腕" and 内容[1] ~= "铠甲" and 内容[1] ~= "项圈" then
        玩家数据[玩家id].道具[道具编号]=nil
        玩家数据[玩家id].角色.道具[临时格子]=nil
        return
      end
      local 常规参数 = {"命中","速度","防御","伤害","魔法","灵力","气血"}
      local 检测通过 = 0
      for i=1,# 常规参数 do
        if 内容[3] == 常规参数[i] then
          检测通过 = 检测通过 +1
        end
        if 内容[5] == 常规参数[i] then
          检测通过 = 检测通过 +1
        end
      end
      if 检测通过 < 2 then
        常规提示(id,"#Y/请检查主副输入的参数是否有误。命中、速度、防御、伤害、魔法、灵力、气血！")
        玩家数据[玩家id].道具[道具编号]=nil
        玩家数据[玩家id].角色.道具[临时格子]=nil
        return
      end
      常规参数 = {"敏捷","体质","力量","耐力","魔力"}
      检测通过 = 0
      for i=1,# 常规参数 do
        if 内容[7] == 常规参数[i] then
          检测通过 = 检测通过 +1
        end
        if 内容[9] == 常规参数[i] then
          检测通过 = 检测通过 +1
        end
      end
      if 检测通过 < 2 then
        常规提示(id,"#Y/请检查附加参数是否有误。体质、魔力、力量、耐力、敏捷！")
        玩家数据[玩家id].道具[道具编号]=nil
        玩家数据[玩家id].角色.道具[临时格子]=nil
        return
      end
      local 打造物品=绑定等级物品()
      local 类型序列=0
      if 内容[1]=="护腕" then
        类型序列=24
      elseif 内容[1]=="项圈" then
        类型序列=25
      elseif 内容[1]=="铠甲" then
        类型序列=26
      end
      if 内容[2]+0 >=155 then 内容[2]=155
        elseif 内容[2]+0 >=145 then 内容[2]=145
        elseif 内容[2]+0 >=135 then 内容[2]=135
        elseif 内容[2]+0 >=125 then 内容[2]=125
        elseif 内容[2]+0 >=115 then 内容[2]=115
        elseif 内容[2]+0 >=105 then 内容[2]=105
        elseif 内容[2]+0 >=95 then 内容[2]=95
        elseif 内容[2]+0 >=85 then 内容[2]=85
        elseif 内容[2]+0 >=75 then 内容[2]=75
        elseif 内容[2]+0 >=65 then 内容[2]=65
        elseif 内容[2]+0 >=55 then 内容[2]=55
        elseif 内容[2]+0 >=45 then 内容[2]=45
        elseif 内容[2]+0 >=35 then 内容[2]=35
        elseif 内容[2]+0 >=25 then 内容[2]=25
        elseif 内容[2]+0 >=15 then 内容[2]=15
        else 内容[2]=5
      end
      local 临时序列=math.floor((内容[2]+5)/10)
      local 临时名称=打造物品[类型序列][临时序列]
      local 道具 = 物品类()
      道具:置对象(临时名称)
      道具.级别限制 = 内容[2]
      道具.耐久=500
      道具.召唤兽装备 = true
      道具.制造者 = "良心老G强化打造"
      道具[内容[3]] =内容[4]+0
      道具[内容[5]] =内容[6]+0
      道具[内容[7]] =内容[8]+0
      道具[内容[9]] =内容[10]+0
      玩家数据[玩家id].道具:给予道具(玩家id,nil,nil,nil,nil,nil,道具)
      道具刷新(玩家id)
      常规提示(id,"#Y/发放成功！")
    end
    if 给予成功 == false then
      玩家数据[玩家id].道具[道具编号]=nil
      玩家数据[玩家id].角色.道具[临时格子]=nil
    else
      道具刷新(玩家id)
      常规提示(id,"#Y/发放成功！")
    end
  elseif 序号 == 7207 then
    local 临时格子 = 玩家数据[玩家id].角色:取道具格子()
    if 临时格子 == 0 then
      常规提示(id,"#Y/对方背包已满！")
      return
    end
    local 幻化类型 = {"健步如飞","血气方刚","回春之术","锐不可当","通真达灵","气壮山河"}
    local 检测通过 = false
    for i=1,#幻化类型 do
      if 幻化类型[i] == 数据.内容 then
        检测通过 = true
        break
      end
    end
    if 检测通过 and 钟灵石定制 then
      玩家数据[玩家id].道具:给予道具(玩家id,"钟灵石",nil,数据.内容)
      常规提示(id,"#Y/发放成功！")
    else
      常规提示(id,"#Y/请检查输入的特性是否正确！")
    end
    ----------------------------------------------------------------------------------------------------------
  elseif 序号 == 7208 then
    发送数据(玩家数据[id].连接id,210.1,玩家数据[玩家id].角色.模型)
  elseif 序号 == 7209 then
    local 临时格子 = 玩家数据[玩家id].角色:取道具格子()
    if 临时格子 == 0 then
      常规提示(id,"#Y/对方背包已满！")
      return
    end
    local 分割=分割文本(数据.上下限,"/")
    if 分割[2] == nil or tonumber(分割[2])==nil or tonumber(分割[1])==nil then
      常规提示(id,"#Y/请正确输入装备上下限格式【 2/3 】！")
      return
    end
    local 上限 = 分割[2]+0
    local 下限 = 分割[1]+0
    if 下限 > 上限 then
      上限 = 下限
    end
    local 双加属性 = {"体质","力量","耐力","魔力","敏捷"}
    local 检测通过 = false
    local 检测通过1 = false
    if 数据.类型 == "武器" or 数据.类型 == "女衣" or 数据.类型 == "男衣" then
      if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        for i=1,5 do
          if 数据.双加属性1 == 双加属性[i] then
            检测通过 = true
            break
          end
        end
      else
        检测通过 = true
      end
      if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
        for i=1,5 do
          if 数据.双加属性2 == 双加属性[i] then
            检测通过1 = true
            break
          end
        end
      else
        检测通过1 = true
      end
    else
      检测通过 = true
      检测通过1 = true
    end
    if 检测通过 == false or 检测通过1 == false then
      常规提示(id,"#Y/双加属性只能为体质、力量、耐力、魔力、敏捷！")
      return
    end
    if 数据.附加特技 ~= "" and type(数据.附加特技) == 'string' then
      检测通过= false
      local 通用特技 = {"气疗术","心疗术","命疗术","凝气诀","凝神诀","气归术","命归术","琴音三叠","四海升平","回魂咒","起死回生","水清诀","冰清诀","玉清诀","晶清诀","弱点击破","冥王爆杀","放下屠刀","河东狮吼","碎甲术","破甲术","破血狂攻","罗汉金钟","慈航普渡","太极护法","光辉之甲","圣灵之甲","野兽之力","魔兽之印"}
      for i=1,#通用特技 do
        if 数据.附加特技 == 通用特技[i] then
          检测通过 = true
          break
          end
      end
      if 检测通过 == false  then
        常规提示(id,"#Y/请检查输入的特技是否正确！")
        return
      end
    end
    if 数据.附加特效1 ~= "" and type(数据.附加特效1) == 'string' then
      检测通过= false
      local 通用特效 = {"无级别限制","神佑","珍宝","必中","神农","简易","绝杀","专注","精致","再生","愤怒","暴怒"}
      for i=1,#通用特效 do
        if 数据.附加特效1 == 通用特效[i] then
          检测通过 = true
          break
          end
      end
      if 检测通过 == false  then
        常规提示(id,"#Y/请检查输入的特效是否正确！")
        return
      end
    end
    local 类型 = 数据.类型
    local 临时等级 = 数据.装备等级
    local 武器序列,武器名称
    local 临时特效=0
    if 临时等级+0 >=160 then 临时等级=16
    elseif 临时等级+0 >=150 then 临时等级=15
    elseif 临时等级+0 >=140 then 临时等级=14
    elseif 临时等级+0 >=130 then 临时等级=13
    elseif 临时等级+0 >=120 then 临时等级=12
    elseif 临时等级+0 >=110 then 临时等级=11
    elseif 临时等级+0 >=100 then 临时等级=10
    elseif 临时等级+0 >=90 then 临时等级=9
    elseif 临时等级+0 >=80 then 临时等级=8
    elseif 临时等级+0 >=70 then 临时等级=7
    elseif 临时等级+0 >=60 then 临时等级=6
    elseif 临时等级+0 >=50 then 临时等级=5
    elseif 临时等级+0 >=40 then 临时等级=4
    elseif 临时等级+0 >=30 then 临时等级=3
    elseif 临时等级+0 >=20 then 临时等级=2
    else 临时等级=1
    end
    local 武器序列,武器名称
      if 类型 =="武器" then
        武器序列=角色武器类型[玩家数据[玩家id].角色.造型][取随机数(1,#角色武器类型[玩家数据[玩家id].角色.造型])]
        武器名称=装备处理类.打造物品[武器序列][临时等级+1]
        if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        双加=数据.双加属性1.."@"..数据.双加数值1
        if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
          双加=数据.双加属性1.."@"..数据.双加数值1.."@"..数据.双加属性2.."@"..数据.双加数值2.."@"
        end
        end
      end
      if 类型 =="衣服" then
        local 衣服类型=2
        if 玩家数据[玩家id].角色.性别=="女" then
          衣服类型=1
        end
        武器序列=21
        武器名称= 装备处理类.打造物品[武器序列][临时等级+1][衣服类型]
        if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        双加=数据.双加属性1.."@"..数据.双加数值1
        if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
          双加=数据.双加属性1.."@"..数据.双加数值1.."@"..数据.双加属性2.."@"..数据.双加数值2.."@"
        end
      end
    end
      if 类型 =="头盔" then
        local 头盔类型=1
        if 玩家数据[玩家id].角色.性别=="女" then
          头盔类型=2
        end
        武器序列=19
        武器名称= 装备处理类.打造物品[武器序列][临时等级+1][头盔类型]
        if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        双加=nil--数据.双加属性1.."@"..数据.双加数值1
        if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
          双加=nil--数据.双加属性1.."@"..数据.双加数值1.."@"..数据.双加属性2.."@"..数据.双加数值2.."@"
        end
      end
    end
      if 类型 =="项链" then
        武器序列=20
        武器名称= 装备处理类.打造物品[武器序列][临时等级+1][取随机数(1,2)]
        if type(装备处理类.打造物品[武器序列][临时等级+1])=="table" then
          武器名称= 装备处理类.打造物品[武器序列][临时等级+1][取随机数(1,2)]
        else
          武器名称= 装备处理类.打造物品[武器序列][临时等级+1]
        end
        if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        双加=nil--数据.双加属性1.."@"..数据.双加数值1
        if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
          双加=nil--数据.双加属性1.."@"..数据.双加数值1.."@"..数据.双加属性2.."@"..数据.双加数值2.."@"
        end
      end
    end
      if 类型 =="腰带" then
        武器序列=22
        武器名称= 装备处理类.打造物品[武器序列][临时等级+1][取随机数(1,2)]
        if type(装备处理类.打造物品[武器序列][临时等级+1])=="table" then
          武器名称= 装备处理类.打造物品[武器序列][临时等级+1][取随机数(1,2)]
        else
          武器名称= 装备处理类.打造物品[武器序列][临时等级+1]
        end
        if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        双加=nil--数据.双加属性1.."@"..数据.双加数值1
        if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
          双加=nil--数据.双加属性1.."@"..数据.双加数值1.."@"..数据.双加属性2.."@"..数据.双加数值2.."@"
        end
      end
    end
      if 类型 =="鞋子" then
        武器序列=23
        武器名称= 装备处理类.打造物品[武器序列][临时等级+1]
        if type(数据.双加属性1) == "string" and 数据.双加属性1 ~= "" then
        双加=nil--数据.双加属性1.."@"..数据.双加数值1
        if type(数据.双加属性2) == "string" and 数据.双加属性2 ~= "" then
          双加=nil--数据.双加属性1.."@"..数据.双加数值1.."@"..数据.双加属性2.."@"..数据.双加数值2.."@"
        end
      end
      end
      -------------------------------------------------------------------------
      if type(数据.附加特技) == "string" and 数据.附加特技 ~= "" then
      特技 = 数据.附加特技
    end
    if type(数据.附加特效1) == "string" and 数据.附加特效1 ~= "" then
       特效 = 数据.附加特效1
    end
      -----------------------------------------------------------------------
      local 套装效果={
        附加状态={"金刚护法","金刚护体","生命之泉","炼气化神","普渡众生","定心术","碎星诀","变身","极度疯狂","盘丝阵","逆鳞","魔王回首","幽冥鬼眼","楚楚可怜","修罗隐身","杀气诀","一苇渡江"}
        ,追加法术={"知己知彼","满天花雨","唧唧歪歪","龙卷雨击","尘土刃","荆棘舞","冰川怒","夺命咒","夺魄令","浪涌","裂石","落叶萧萧","龙腾","龙吟","五雷咒","飞砂走石","三昧真火","姐妹同心","阎罗令","判官令","紧箍咒","日光华","靛沧海","巨岩破","苍茫树","地裂火","尸腐毒","勾魂","摄魄","百万神兵","魔音摄魂","镇妖","含情脉脉","似玉生香","后发制人","横扫千军","日月乾坤","威慑","催眠符","失心符","落魄符","定身符","神针撼海","当头一棒","雷击","落岩","水攻","烈火","奔雷咒","泰山压顶","水漫金山","地狱烈火",}
        ,变身法术={"强盗","海毛虫","蛤蟆精","老虎","马面","天将","地狱战神","巡游天神","鬼将","夜罗刹","噬天虎","狂豹人形","巨力神猿","修罗傀儡鬼",
  "大海龟","树怪","山贼","野猪","黑熊","野鬼","龟丞相","黑熊精","僵尸","白熊","黑山老妖","大力金刚","踏云兽","机关兽","金身罗汉",
  "藤蔓妖花","巨蛙","花妖","小龙女","蜘蛛精","蝴蝶仙子","古代瑞兽","蛟龙","雨师","如意仙子","星灵仙子","净瓶女娲","灵符女娲","灵鹤",
  "炎魔神","葫芦宝贝","混沌兽","长眉灵猴","蜃气妖","护卫","羊头怪","牛妖","蟹将","牛头","天兵","芙蓉仙子","律法女娲",
  "幽萤娃娃","红萼仙子","龙龟","连弩车","蝎子精","曼珠沙华","赌徒","大蝙蝠","骷髅怪","狐狸精","狼","虾兵","兔子怪","雷鸟人","风伯",
  "凤凰","幽灵","吸血鬼","画魂","雾中仙","机关鸟","巴蛇","猫灵人形","修罗傀儡妖"}}
    local 附加类型=""
    if 数据.点化效果 ~= nil and 数据.点化效果 ~= "" and tonumber(数据.点化效果) == nil then
      for i=1,#套装效果.附加状态 do
        if 套装效果.附加状态[i] == 数据.点化效果 then
          附加类型 = 2
          break
        end
      end
      if 附加类型 == "" then
        for i=1,#套装效果.追加法术 do
          if 套装效果.追加法术[i] == 数据.点化效果 then
            附加类型 = 1
            break
          end
        end
      end
      if 附加类型 == "" then
        for i=1,#套装效果.变身法术 do
          if 套装效果.变身法术[i] == 数据.点化效果 then
            附加类型 = 3
            break
          end
        end
      end
    end
    if 数据.是否专用 ~= nil and 数据.是否专用 ~= "" then
      专用=玩家id
    end
    local 倍率=取随机数(下限,上限)
      -----------------------------------------------------------------------
      装备处理类:发送定制装备(玩家id,临时等级*10,武器序列,武器名称,"定制装备",nil,true,专用,特效,nil,倍率,特技,双加,附加类型,数据.点化效果)
      ------------------------(玩家id,级别,种类,名称,生产方式,制造者,是否鉴定,专用,无级别,玩家id,倍率,特技,双加,套装类型,套装效果)
  elseif 序号 == 7210 then
    local 临时格子 = 玩家数据[玩家id].角色:取道具格子()
    if 临时格子 == 0 then
      常规提示(id,"#Y/对方背包已满！")
      return
    end

    if type(数据.主属类型) ~= "string" or tonumber(数据.主属数值)==nil or tonumber(数据.主属数值)==0    then
      常规提示(id,"#Y/类型不能为数字！")
      return
    end
    if  not 数据.类型 then
        数据.类型="戒指"
    end
    if  not 数据.灵饰等级 then
        数据.灵饰等级=60
    end

    local 属性检查 =false
    for i=1,#灵饰属性[数据.类型].主属性 do
      if 灵饰属性[数据.类型].主属性[i] == 数据.主属类型 then
        属性检查 = true
      end
    end
    if 属性检查 == false then
      常规提示(id,"#Y/请检查主属性的类型是否正确！")
      return
    end

    属性检查 =false
    -- for i=1,4 do
    --     if  数据["附加类型"..i]~=nil and 数据["附加类型"..i]~=""  then
    --        if type(数据["附加类型"..i]) ~= "string"  or 灵饰属性[数据.类型].副属性[i] == 数据["附加类型"..i] then
    --           属性检查 = true
    --        end
    --        for i= 1,#灵饰属性[数据.类型].副属性 do
    --        end
    --     else
    --        属性检查 = true
    --     end
    -- end

      for i=1,4 do

        if  数据["附加类型"..i]~=nil and 数据["附加类型"..i]~="" then
           for n= 1,#灵饰属性[数据.类型].副属性 do
               if 灵饰属性[数据.类型].副属性[n]==数据["附加类型"..i] and tonumber(数据["附加数额"..i])~=nil and tonumber(数据["附加数额"..i])~=0   then
                  属性检查 = true
               end
           end
        else
            属性检查 = true
            数据["附加数额"..i] = nil
        end
    end


    if 属性检查 == false then
      常规提示(id,"#Y/请检查副属性的类型是否正确！")
      return
    end
    local 临时等级 = 数据.灵饰等级+0
    if  临时等级<=60  then
        临时等级=60
    elseif 临时等级>60 and 临时等级<=80 then
        临时等级=80
    elseif 临时等级>80 and 临时等级<=100 then
        临时等级=100
    elseif 临时等级>100 and 临时等级<=120 then
        临时等级=120
    elseif 临时等级>120 and 临时等级<=140 then
        临时等级=140
    else
        临时等级=160
    end

    local 临时名称 = 制造装备[数据.类型][临时等级]
    local 道具id=玩家数据[玩家id].道具:取新编号()
    local 道具 = 物品类()
    道具:置对象(临时名称)
    道具.幻化属性={基础={类型=数据.主属类型,数值=tonumber(数据.主属数值),强化=0},附加={}}
    for i=1,4 do
        if 数据["附加类型"..i]~=nil and 数据["附加类型"..i]~="" and tonumber(数据["附加数额"..i])~=nil and tonumber(数据["附加数额"..i])~=0  then
          道具.幻化属性.附加[#道具.幻化属性.附加+1]={类型=数据["附加类型"..i],数值=tonumber(数据["附加数额"..i]),强化=0}
        end
    end
    if 数据.灵饰专用~=nil and 数据.灵饰专用~="" then
        道具.专用=玩家id
    end
    道具.级别限制=临时等级
    道具.幻化等级=0
    道具.部位类型=数据.类型
    道具.灵饰=true
    道具.耐久=1000
    道具.鉴定=true
    道具.制造者=玩家数据[玩家id].角色.名称.."强化打造"
    玩家数据[玩家id].角色.道具[临时格子]=道具id
    玩家数据[玩家id].道具.数据[道具id]= 道具
    玩家数据[玩家id].道具.数据[道具id].识别码=玩家id.."_"..os.time().."_"..取随机数(111111,999999999)
    道具刷新(玩家id)
    常规提示(id,"#Y/你获得了！")
    常规提示(id,"#Y/发放定制装备成功！")
  elseif 序号 == 7211 then
    发送数据(玩家数据[id].连接id,211.1, 玩家数据[玩家id].召唤兽:取存档数据())
  elseif 序号 == 7212 then
    local 编号 =数据.编号
    if 玩家数据[玩家id].召唤兽.数据[编号] == nil then
      常规提示(id,"#Y/操作的该召唤兽不存在请重新获取信息！")
      return
    end
    if tonumber(数据.宠物等级) ~= nil then
      if 数据.宠物等级+0 > 玩家数据[玩家id].召唤兽.数据[编号].等级 then
        local 等级差 = 数据.宠物等级 - 玩家数据[玩家id].召唤兽.数据[编号].等级
        玩家数据[玩家id].召唤兽.数据[编号].等级 = 数据.宠物等级+0
        玩家数据[玩家id].召唤兽.数据[编号].潜力 = 等级差*5
        玩家数据[玩家id].召唤兽.数据[编号].体质 = 玩家数据[玩家id].召唤兽.数据[编号].体质 + 等级差
        玩家数据[玩家id].召唤兽.数据[编号].魔力 = 玩家数据[玩家id].召唤兽.数据[编号].魔力 + 等级差
        玩家数据[玩家id].召唤兽.数据[编号].力量 = 玩家数据[玩家id].召唤兽.数据[编号].力量 + 等级差
        玩家数据[玩家id].召唤兽.数据[编号].耐力 = 玩家数据[玩家id].召唤兽.数据[编号].耐力 + 等级差
        玩家数据[玩家id].召唤兽.数据[编号].敏捷 = 玩家数据[玩家id].召唤兽.数据[编号].敏捷 + 等级差
      elseif 玩家数据[玩家id].召唤兽:是否有装备(编号) == false and 玩家数据[玩家id].召唤兽.数据[编号].种类 ~= nil and 玩家数据[玩家id].召唤兽.数据[编号].种类 ~= "野怪" then
          local 等级差 = 玩家数据[玩家id].召唤兽.数据[编号].等级 - 数据.宠物等级
          --降级(等级差,编号)
      end
    end
    if tonumber(数据.宠物成长) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].成长 = 数据.宠物成长+0
    end
    if tonumber(数据.宠物寿命) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].寿命 = 数据.宠物寿命+0
    end
    if tonumber(数据.内丹上限) ~= nil then
      local 增加内丹 = 数据.内丹上限 - 玩家数据[玩家id].召唤兽.数据[编号].内丹.内丹上限
      玩家数据[玩家id].召唤兽.数据[编号].内丹.内丹上限 = 数据.内丹上限+0
      玩家数据[玩家id].召唤兽.数据[编号].内丹.可用内丹 = 玩家数据[玩家id].召唤兽.数据[编号].内丹.可用内丹+增加内丹
    end
    if tonumber(数据.攻击资质) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].攻击资质 = 数据.攻击资质+0
    end
    if tonumber(数据.防御资质) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].防御资质 = 数据.防御资质+0
    end
    if tonumber(数据.体力资质) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].体力资质 = 数据.体力资质+0
    end
    if tonumber(数据.法力资质) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].法力资质 = 数据.法力资质+0
    end
    if tonumber(数据.速度资质) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].速度资质 = 数据.速度资质+0
    end
    if tonumber(数据.躲闪资质) ~= nil then
      玩家数据[玩家id].召唤兽.数据[编号].躲闪资质 = 数据.躲闪资质+0
    end
    if 数据.宠物种类 ~= '' and (数据.宠物种类 == "宝宝" or 数据.宠物种类 == "变异" or 数据.宠物种类 == "神兽" or 数据.宠物种类 == "野怪") then
      玩家数据[玩家id].召唤兽.数据[编号].种类 = 数据.宠物种类
    end

    --[[if 数据.宠物造型 ~= '' and (取神兽资质(数据.宠物造型)[1] ~= nil or 取宝宝(数据.宠物造型)[1] ~= nil ) then
      玩家数据[玩家id].召唤兽.数据[编号].模型 = 数据.宠物造型
      if 玩家数据[玩家id].召唤兽.数据[编号].进阶 then
          玩家数据[玩家id].召唤兽.数据[编号].进阶=false
      end
    end--]]
    常规提示(id,"#Y/修改召唤兽资质属性成功！")
  elseif 序号 == 7213 then
    local 编号 = 数据.编号
    if 玩家数据[玩家id].召唤兽:是否有装备(编号) then
          常规提示(玩家id,"请先卸下召唤兽所穿戴的装备")
          return
        elseif 玩家数据[玩家id].召唤兽.数据[编号].统御 ~= nil then
          常规提示(玩家id,"该召唤兽处于统御状态，请解除统御后再进行此操作")
          return
        elseif 玩家数据[玩家id].召唤兽.数据[编号].种类 == "野怪" then
          常规提示(玩家id,"野怪无法洗点。")
          return
        end
        玩家数据[玩家id].召唤兽:重置等级(0,编号)
        玩家数据[玩家id].召唤兽.数据[编号].当前经验=0
        常规提示(id,"#Y/重置召唤兽属性成功！")
  elseif 序号 == 7214 then
    local 编号 = 数据.编号
    for i=1,#数据.技能 do
      玩家数据[玩家id].召唤兽.数据[编号].技能[i]=数据.技能[i]
    end
    玩家数据[玩家id].召唤兽.数据[编号].技能=删除重复(玩家数据[玩家id].召唤兽.数据[编号].技能)
    常规提示(id,"#Y/修改召唤兽技能成功！")
  elseif 序号 == 7215 then
    local 类型 = 数据.类型
    if 类型 == "修改经验" then
      服务端参数.经验获得率=数据.内容+0
      f函数.写配置(程序目录.."配置文件.ini","主要配置","经验",数据.内容)
      广播消息({内容="#S(GM在线调整)#R/当前经验倍率为"..服务端参数.经验获得率,频道="xt"})
      常规提示(id,"#Y/修改经验倍数成功,当前经验倍数！"..服务端参数.经验获得率.."倍")
    elseif 类型 == "修改银子" then
      服务端参数.银子获得率 = 数据.内容+0
      f函数.写配置(程序目录.."配置文件.ini","主要配置","银子",数据.内容)
      常规提示(id,"#Y/修改银子倍数成功！"..服务端参数.银子获得率)
    elseif 类型 == "发送公告" then
      发送公告("#G"..数据.内容)
      常规提示(id,"#Y/发送公告成功！")
    elseif 类型 == "清空排行" then
     排行榜数据={玩家伤害排行={}, 玩家速度排行={},玩家气血排行={},玩家财富排行={},玩家等级排行={},玩家仙玉排行={},玩家防御排行={},玩家灵力排行={}}
               写出文件([[sql/排行榜.txt]],table.tostring(排行榜数据))
               常规提示(id,"#Y/更新排行榜成功！")
    ----------------------------------------------------------
    elseif 类型 == "天罡" then--开启比武
      天罡星:刷新资源()
      常规提示(id,"#Y/天罡活动已开启")
    elseif 类型 == "地煞" then
      地煞星:刷新资源()
      常规提示(id,"#Y/地煞活动已开启")
    elseif 类型 == "知了统领" then
      自写活动:知了统领()
    elseif 类型 == "知了先锋" then
       知了先锋:开启()
      常规提示(id,"#Y/知了先锋已刷出")
    elseif 类型 == "龙族" then
       龙族:开启()
      常规提示(id,"#Y/龙族已刷出")
    elseif 类型 == "千年知了王" then
        自写活动:千年知了王()
        常规提示(id,"#Y/千年知了王已刷出")
    elseif 类型 == "封妖" then
      常规提示(id,"#Y/封妖活动已开启")
    elseif 类型 == "妖王" then
      设置任务205(id)
      常规提示(id,"#Y/妖王活动已开启")
    elseif 类型 == "夜叉" then
      梦魇夜叉:开启(id)
      常规提示(id,"#Y/夜叉活动已开启")
     elseif 类型 == "裂风兽" then
      自写活动:裂风兽()
      常规提示(id,"#Y/裂风兽已开启")
    elseif 类型 == "黑神话" then
      黑神话:刷出怪物()
    常规提示(id,"#Y/黑神话已开启")
      ----------------------------------------------------------
    elseif 类型 == "帮战报名" then
    elseif 类型 == "帮战入场" then
      帮派PK:正式开始帮战()
      常规提示(id,"#Y/正式开始帮战")
    elseif 类型 == "结束帮战" then
      帮派PK:关闭活动()
      常规提示(id,"#Y/已结束帮派竞赛")
    elseif 类型 == "新手活动怪" then
      新手活动怪:开启()
      常规提示(id,"#Y/新手活动怪已刷出")
    elseif 类型 == "六星天罡" then
      自写活动:六星天罡()
      常规提示(id,"#Y/六星天罡已刷出")
    elseif 类型 == "知了大王" then
      自写活动:知了大王()
      常规提示(id,"#Y/知了大王已刷出")
    elseif 类型 == "知了小王" then
        自写活动:知了小王()
        常规提示(id,"#Y/知了小王已刷出")
    elseif 类型 == "沉默分身" then
         沉默分身类:刷出沉默分身()
         常规提示(id,"#Y/沉默分身已刷出")
    elseif 类型 == "世界BOSS" then
         自写活动:世界boss(id)
         常规提示(id,"#Y/世界boss已刷出")
    elseif 类型=="剑会天下" then
        剑会天下:开启活动()
   end
  end
end

function 管理工具类:取装备(类型)
  local 物品表 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
  for i=1,#物品表 do
    if 物品表[i] == 类型 then
      return i
    end
  end
  return 0
end
function 管理工具类:取符石(名称)
  local 符石={}
  符石 = {"冰符石","土符石","雷符石","电符石","风符石","炎符石","火符石"}
  for i=1,#符石 do
    if 符石[i]==名称 then
      return 1
    end
  end
  符石 = {"碧玉符石","金光符石","天神符石","飘渺符石","天仙符石","霞光符石","逍遥符石"}
  for i=1,#符石 do
    if 符石[i]==名称 then
      return 2
    end
  end
  符石 = {"虹珀符石","陌影符石","北冥符石","灵月符石","锦瑟符石","银光符石","清心符石","星辰符石","雪月符石","玄魂符石","乾坤符石","珍珀符石",
  "银竹符石","神川符石","玲珑符石","暮影符石","天珍符石","九影符石","百冥符石","莫念符石","醉魂符石","玄羽符石","霸风符石","无相符石",
  "无极符石","紫晶符石","圣火符石","昔光符石","子蚀符石","流风符石","地炎符石","素影符石","燕灵符石","降龙符石","苍玉符石","流魂符石",
  "九凤符石","墨陀符石","南夕符石","引幽符石","波涛符石","铃星符石","狂念符石","乱花符石","幽月符石","两仪符石","七情符石","召影符石"}
  for i=1,#符石 do
    if 符石[i]==名称 then
      return 3
    end
  end
  return 0
end
function 管理工具类:取阵法(名称)
  local 阵法信息={
    [4]="风扬阵",
    [5]="虎翼阵",
    [6]="天覆阵",
    [7]="云垂阵",
    [8]="鸟翔阵",
    [9]="地载阵",
    [10]="龙飞阵",
    [11]="蛇蟠阵",
    [12]="鹰啸阵",
    [13]="雷绝阵",
  }
  for i=4,13 do
    if 阵法信息[i] == 名称 then
      return true
    end
  end
  return false
end
function 管理工具类:取变身卡(名称)
  local 变身卡数据={
    [1]={"大海龟","巨蛙","海毛虫","护卫","树怪","大蝙蝠","山贼","强盗","野猪"}--,"超级泡泡"
    ,[2]={"骷髅怪","羊头怪","蛤蟆精","狐狸精","老虎","黑熊","花妖"}
    ,[3]={"牛妖","小龙女","野鬼","狼","虾兵","蟹将"}
    ,[4]={"龟丞相","蜘蛛精","黑熊精","僵尸","牛头","马面"}
    ,[5]={"雷鸟人","蝴蝶仙子","古代瑞兽","白熊","黑山老妖"}
    ,[6]={"天兵","天将","地狱战神","风伯","凤凰","蛟龙"}
    ,[7]={"如意仙子","巡游天神","星灵仙子","芙蓉仙子"}
    ,[8]={"幽灵","吸血鬼","鬼将","雾中仙","灵鹤","夜罗刹","炎魔神","噬天虎","净瓶女娲","律法女娲","灵符女娲","大力金刚"}
  }
  for i=1,8 do
    for n=1,#变身卡数据[i] do
        if 变身卡数据[i][n] == 名称 then
          return i
        end
    end
  end
  return 0
end

function 管理工具类:添加经验(id,数额)
  local 倍率 = 服务端参数.经验获得率
  local 之前银子 = 玩家数据[id].角色.当前经验
  local 经验 = math.floor(数额 * 倍率)
  玩家数据[id].角色.当前经验 = math.floor(玩家数据[id].角色.当前经验 + 经验)
  if 玩家数据[id].角色.等级<20 then
     玩家数据[id].角色:自动升级处理()
  end
  if 玩家数据[id].角色.参战信息~=nil then
    玩家数据[id].召唤兽:获得经验(玩家数据[id].角色.参战宝宝.认证码,math.floor(经验*0.4),id,类型)
  end
end
function 管理工具类:取内丹(名称)
  local 普通内丹 = {"迅敏","狂怒","阴伤","静岳","擅咒","灵身","矫健","深思","钢化","坚甲","慧心","撞击","无畏","愤恨","淬毒","狙刺","连环","圣洁","灵光"}
  local 高级内丹 ={ "神机步","腾挪劲","玄武躯","龙胄铠","玉砥柱","碎甲刃","阴阳护","凛冽气","舍身击","电魂闪","通灵法","双星爆","催心浪","隐匿击","生死决","血债偿"}
  local 类型 = ""
  for i=1,#普通内丹 do
    if 普通内丹[i] == 名称 then
      类型 = "召唤兽内丹"
    end
  end
  for i=1,#高级内丹 do
    if 高级内丹[i] == 名称 then
      类型 = "高级召唤兽内丹"
    end
  end
  return 类型
end

function 管理工具类:取要诀(名称)
  local 类型 = ""
  local ms = {"反震","吸血","反击","连击","飞行","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝"}
  for i=1,#ms do
      if ms[i]==名称 then
        类型="魔兽要诀"
      end
  end
  local ms1 = {
"超级必杀","超级连击","超级偷袭","超级吸血","超级强力","超级反震","超级防御","超级夜战",
"超级感知","超级法术连击","超级法术暴击","超级法术波动","超级魔之心","超级驱鬼","高级反震","超级必杀","高级吸血","高级反击","高级连击","高级飞行","高级夜战","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级法术抵抗","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","奔雷咒","泰山压顶","水漫金山","地狱烈火","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
  for i=1,#ms1 do
      if ms1[i]==名称 then
        类型="高级魔兽要诀"
      end
  end
  local ms2 = {"善恶有报","扶摇万里","须弥真言","力劈华山","惊心一剑","上古灵符","嗜血追击","剑荡四方","月光","壁垒击破","夜舞倾城","苍鸾怒击","死亡召唤","法术防御","灵能激发","八凶法阵","从天而降","大快朵颐","浮云神马","灵山禅语","龙魂","千钧一怒","天降灵葫","叱咤风云","理直气壮","净台妙谛","观照万象"}
  for i=1,#ms2 do
      if ms2[i]==名称 then
        类型="高级魔兽要诀"
      end
  end
  return 类型
end
function 管理工具类:取指南书序号(shux)
  local 序号=1
  if shux=="枪矛" then
    序号=1
  elseif shux=="斧钺" then
    序号=2
  elseif shux=="剑" then
    序号=3
  elseif shux=="双短剑" then
    序号=4
  elseif shux=="飘带" then
    序号=5
  elseif shux=="爪刺" then
    序号=6
  elseif shux=="扇" then
    序号=7
  elseif shux=="魔棒" then
    序号=8
  elseif shux=="锤" then
    序号=9
  elseif shux=="鞭" then
    序号=10
  elseif shux=="环圈" then
    序号=11
  elseif shux=="刀" then
    序号=12
  elseif shux=="法杖" then
    序号=13
  elseif shux=="弓弩" then
    序号=14
  elseif shux=="宝珠" then
    序号=15
  elseif shux=="巨剑" then
    序号=16
  elseif shux=="伞" then
    序号=17
  elseif shux=="灯笼" then
    序号=18
  elseif shux=="头盔" then
    序号=19
  elseif shux=="发钗" then
    序号=20
  elseif shux=="项链" then
    序号=21
  elseif shux=="女衣" then
    序号=22
  elseif shux=="男衣" then
    序号=23
  elseif shux=="腰带" then
    序号=24
  elseif shux=="鞋子" then
    序号=25
  end
  return 序号
end

function 管理工具类:取日志数量(账号,id)
  local 读取文件=读入文件([[data/]]..账号..[[/]]..id..[[/角色.txt]])
  local 还原数据=table.loadstring(读取文件)
  return 还原数据.日志编号
end
function 管理工具类:更新(dt) end

function 管理工具类:显示(x,y) end

return 管理工具类