-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-09-09 21:43:25
function 取门派巡逻地图(m,地图)
 local cs
	if m == "方寸山" then
		cs = {1135,1137}
	elseif m == "女儿村" then
		cs = {1142,1143}
	elseif m == "神木林" then
		cs = {1138,1154}
	elseif m == "大唐官府" then
		cs = {1198,1054}
	elseif m == "化生寺" then
		cs = {1002,1528,1043}
	elseif m == "阴曹地府" then
		cs = {1122,1123,102}
	elseif m == "盘丝洞" then
		cs = {1513,1144}
	elseif m == "无底洞" then
		cs = {1139,1156}
	elseif m == "狮驼岭" then
		cs = {1131,1134}
	elseif m == "魔王寨" then
		cs = {1512,1145}
	elseif m == "普陀山" then
		cs = {1140,1141}
	elseif m == "天宫" then
		cs = {1111,1112}
	elseif m == "凌波城" then
		cs = {1150}
	elseif m == "五庄观" then
		cs = {1146,1147}
	elseif m == "龙宫" then
		cs = {1116,1117}
	elseif m == "花果山" then
	    cs = {1251}
	elseif m == "九黎城" then
	    cs = {1580}
	end
	for n=1,#cs do
		if cs[n]==地图 then
			return true
		end
	end
	return false
end

function 取随机门派(sj)
	local 可入门派={
	仙男={"天宫","龙宫","五庄观","凌波城","花果山"},
	仙女={"天宫","龙宫","普陀山","凌波城","花果山"},
	魔男={"魔王寨","阴曹地府","狮驼岭","无底洞"},
	魔女={"魔王寨","阴曹地府","盘丝洞","无底洞"},
	人男={"大唐官府","方寸山","化生寺","神木林"},
	人女={"大唐官府","方寸山","女儿村","神木林"}
	}
	return 可入门派[sj][取随机数(1,4)]
end

function 取门派地图(m)
	local cs
	if m == "方寸山" then
		cs = {1135,72,63}
	elseif m == "女儿村" then
		cs = {1142,37,37}
	elseif m == "神木林" then
		cs = {1138,46,121}
	elseif m == "大唐官府" then
		cs = {1198,131,82}
	elseif m == "化生寺" then
		cs = {1002,7,88}
	elseif m == "阴曹地府" then
		cs = {1122,101,102}
	elseif m == "盘丝洞" then
		cs = {1513,174,31}
	elseif m == "无底洞" then
		cs = {1139,61,125}
	elseif m == "狮驼岭" then
		cs = {1131,109,77}
	elseif m == "魔王寨" then
		cs = {1512,76,29}
	elseif m == "普陀山" then
		cs = {1140,20,18}
	elseif m == "天宫" then
		cs = {1111,175,122}
	elseif m == "凌波城" then
		cs = {1150,33,67}
	elseif m == "五庄观" then
		cs = {1146,26,55}
	elseif m == "龙宫" then
		cs = {1116,71,77}
	end
	return cs
end

function 取坐标师傅(ID,名称)
	local 师门 = nil
	if ID == 1043 and 名称 == "空度禅师" then
		师门 = "化生寺"
	elseif ID == 1054 and 名称 == "程咬金" then
		师门 = "大唐官府"
	elseif ID == 1117 and 名称 == "东海龙王" then
		师门 = "龙宫"
	elseif ID == 1137 and 名称 == "菩提老祖" then
		师门 = "方寸山"
	elseif ID == 1124 and 名称 == "地藏王" then
		师门 = "阴曹地府"
	elseif ID == 1112 and 名称 == "李靖" then
		师门 = "天宫"
	elseif ID == 1145 and 名称 == "牛魔王" then
		师门 = "魔王寨"
	elseif ID == 1141 and 名称 == "观音姐姐" then
		师门 = "普陀山"
	elseif ID == 1147 and 名称 == "镇元子" then
		师门 = "五庄观"
	elseif ID == 1134 and 名称 == "大大王" then
		师门 = "狮驼岭"
	elseif ID == 1144 and 名称 == "白晶晶" then
		师门 = "盘丝洞"
	elseif ID == 1150 and 名称 == "二郎神" then
		师门 = "凌波城"
	elseif ID == 1154 and 名称 == "巫奎虎" then
		师门 = "神木林"
	elseif ID == 1156 and 名称 == "地涌夫人" then
		师门 = "无底洞"
	elseif ID == 1143 and 名称 == "孙婆婆" then
		师门 = "女儿村"
	elseif ID == 1251 and 名称 == "齐天大圣" then
		师门 = "花果山"
		elseif ID == 1580 and 名称 == "蚩尤幻影" then
		师门 = "九黎城"
	end
	return 师门
end

function 取门派师父名称(门派)
	local 师父 = "空度禅师"
	if 门派 == "化生寺" then
		师父 = "男人_老和尚"
	elseif 门派 == "大唐官府" then
		师父 = "男人_程咬金"
	elseif 门派 == "龙宫" then
		师父 = "男人_东海龙王"
	elseif 门派 == "方寸山" then
		师父 = "菩提老祖"
	elseif 门派 == "阴曹地府" then
		师父 = "地藏王"
	elseif 门派 == "天宫" then
		师父 = "李靖"
	elseif 门派 == "魔王寨" then
		师父 = "牛魔王"
	elseif 门派 == "普陀山" then
		师父 = "观音姐姐"
	elseif 门派 == "五庄观" then
		师父 = "镇元子"
	elseif 门派 == "狮驼岭" then
		师父 = "大大王"
	elseif 门派 == "盘丝洞" then
		师父 = "白晶晶"
	elseif 门派 == "凌波城"then
		师父 = "二郎神"
	elseif 门派 == "神木林" then
		师父 = "巫奎虎"
	elseif 门派 == "无底洞" then
		师父 = "地涌夫人"
	elseif 门派 == "女儿村" then
		师父 = "孙婆婆"
	elseif 门派 == "九黎城" then
		师父 = "蚩尤幻影"

	end
	return 师父
end

function 取师傅地图(名称)
	local ID = nil
	if  名称 == "化生寺" then
		ID = 1043
	elseif  名称 == "大唐官府" then
		ID = 1054
	elseif  名称 == "龙宫" then
		ID = 1117
	elseif 名称 == "方寸山" then
		 ID = 1137
	elseif 名称 == "阴曹地府" then
		ID = 1124
	elseif 名称 == "天宫" then
		ID = 1112
	elseif 名称 == "魔王寨" then
		ID = 1145
	elseif 名称 == "普陀山" then
		ID = 1141
	elseif 名称 == "五庄观" then
		ID = 1147
	elseif  名称 == "狮驼岭" then
		ID = 1134
	elseif  名称 == "盘丝洞" then
		ID = 1144
	elseif  名称 == "凌波城" then
		ID = 1150
	elseif  名称 == "神木林" then
		ID = 1154
	elseif  名称 == "无底洞" then
		ID = 1156
	elseif  名称 == "女儿村" then
		ID = 1143
	elseif  名称 == "花果山" then
		ID = 1251
	elseif  名称 == "九黎城" then
	 	ID = 1580
	end
	return ID
end

function 取经脉流派(mp)
	local xx = {
		大唐官府={"浴血豪侠","无双战神","虎贲上将",当前流派="浴血豪侠"},
		神木林 = {"通天法王","巫影祭司","灵木神侍",当前流派="通天法王"},
		化生寺 = {"杏林妙手","护法金刚","无量尊者",当前流派="杏林妙手"},
		女儿村 = {"绝代妖娆","花雨伊人","花间美人",当前流派="绝代妖娆"},
		方寸山 = {"拘灵散修","伏魔天师","五雷正宗",当前流派="拘灵散修"},
		狮驼岭 = {"嗜血狂魔","万兽之王","狂怒斗兽",当前流派="嗜血狂魔"},
		魔王寨 = {"平天大圣","盖世魔君","风火妖王",当前流派="平天大圣"},
		阴曹地府 = {"勾魂阎罗","六道魍魉","诛刑毒师",当前流派="勾魂阎罗"},
		盘丝洞 = {"风华舞圣","迷情妖姬","百媚魔姝",当前流派="风华舞圣"},
		无底洞 = {"妙谛金莲","摄魂迷影","幽冥巫煞",当前流派="妙谛金莲"},
		凌波城 = {"九天武圣","灵霄斗士","风云战将",当前流派="九天武圣"},
		天宫 = {"镇妖神使","踏雷天尊","霹雳真君",当前流派="镇妖神使"},
		普陀山 = {"莲台仙子","五行咒师","落伽神女",当前流派="莲台仙子"},
		龙宫 = {"海中蛟虬","云龙真身","沧海潜龙",当前流派="海中蛟虬"},
		五庄观 = {"清心羽客","乾坤力士","万寿真仙",当前流派="清心羽客"},
		花果山 = {"齐天武圣","斗战真神","通天行者",当前流派="齐天武圣"},
		九黎城 = {'铁火战魔','铁火战魔','铁火战魔',当前流派 = '铁火战魔'}
	}
    return  xx[mp]
end

function 取门派招式特效(mp)
	local lssj = {
		大唐官府 = {"横扫千军","后发制人","破釜沉舟"},
		化生寺 = {"唧唧歪歪","金刚护法","推气过宫","我佛慈悲","活血","救死扶伤","舍生取义","金刚护体"},
		女儿村 = {"楚楚可怜","满天花雨","莲步轻舞","如花解语","似玉生香","娉婷袅娜","一笑倾城"},
		方寸山 = {"落魄符","碎甲术","失心符","五雷咒","催眠符","失忆符","失魂符","定身符","分身术"},
		天宫 = {"天雷斩","五雷轰顶","雷霆万钧","镇妖","错乱","百万神兵"},
		普陀山 = {"普渡众生","巨岩破","靛沧海","地裂火","苍茫树","日光华","紧箍咒","灵动九天","自在心法"},
		龙宫 = {"龙卷雨击","龙腾","龙吟","二龙戏珠"},
		五庄观 = {"日月乾坤","炼气化神","生命之泉","烟雨剑法","飘渺式"},
		狮驼岭 = {"象形","狮搏","鹰击","变身","连环击"},
		魔王寨 = {"飞砂走石","三昧真火","牛劲"},
		阴曹地府 = {"阎罗令","判官令","尸腐毒","黄泉之息","锢魂术","魂飞魄散"},
		盘丝洞 = {"勾魂","摄魄","魔音摄魂","含情脉脉","姐妹同心","瘴气"},
		神木林 = {"落叶萧萧","尘土刃","荆棘舞","冰川怒","雾杀","炎护","血雨"},
		凌波城 = {"裂石","断岳势","天崩地裂","浪涌","惊涛怒","翻江搅海","腾雷","不动如山"},
		无底洞 = {"地涌金莲","惊魂掌","煞气决","夺魄令","摧心术","夺命咒"},
		花果山 = {nil},
		九黎城 = {}
	}
	local fhsj = {}
	if lssj[mp] ~= nil then
		for i=1,#lssj[mp] do
			fhsj[lssj[mp][i]] = false
		end
	end
	return fhsj
end

function 删除指定模型召唤兽(id,模型)
	for n=1,#玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].模型==模型 then
			玩家数据[id].召唤兽:删除处理(id,n)
			return true
		end
	end
	return false
end

function 判断师门召唤兽选项(id,事件)
	local 任务id=玩家数据[id].角色:取任务(111)
	if 任务数据[任务id]==nil or 任务数据[任务id].分类~=3 then
		return
	end
	local 选项={}
	local 模型=任务数据[任务id].bb
	local 需求表 = {"力量","魔力","体质","耐力","敏捷"}
	local 要求
	if 任务数据[任务id].要求=="武艺超群" then
		要求="力量"
	elseif 任务数据[任务id].要求=="法力高深" then
		要求="魔力"
	elseif 任务数据[任务id].要求=="身强体壮" then
		要求="体质"
	elseif 任务数据[任务id].要求=="刀枪不入" then
		要求="耐力"
	elseif 任务数据[任务id].要求=="身手敏捷" then
		要求="敏捷"
	end
	for n=1,#玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].模型==模型 then
			if 要求==nil then
				选项[#选项+1]={对话=format("%s,等级:%s",玩家数据[id].召唤兽.数据[n].名称,玩家数据[id].召唤兽.数据[n].等级),编号=n}
			else
				local 通过 = true
				for i=1,#需求表 do
					if 玩家数据[id].召唤兽.数据[n][要求] < 玩家数据[id].召唤兽.数据[n][需求表[i]]  then
						通过 = false
					end
				end
				if 通过 then
					选项[#选项+1]={对话=format("%s,等级:%s",玩家数据[id].召唤兽.数据[n].名称,玩家数据[id].召唤兽.数据[n].等级),编号=n}
				end
			end
		end
	end
	for n=1,#选项 do
		if 选项[n].对话==事件 then
			玩家数据[id].召唤兽:删除处理(id,选项[n].编号)
			完成任务_111(id,3)
			return
		end
	end
	添加最后对话(id,"你所选的这只召唤兽并不是对方想要的")
end

function 取符合师门召唤兽选项(id)
	local 任务id=玩家数据[id].角色:取任务(111)
	if 任务数据[任务id]==nil or 任务数据[任务id].分类~=3 then
		return
	end
	local 选项={}
	local 模型=任务数据[任务id].bb
	local 需求表 = {"力量","魔力","体质","耐力","敏捷"}
	local 要求
	if 任务数据[任务id].要求=="武艺超群" then
		要求="力量"
	elseif 任务数据[任务id].要求=="法力高深" then
		要求="魔力"
	elseif 任务数据[任务id].要求=="身强体壮" then
		要求="体质"
	elseif 任务数据[任务id].要求=="刀枪不入" then
		要求="耐力"
	elseif 任务数据[任务id].要求=="身手敏捷" then
		要求="敏捷"
	end
	for n=1,#玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].模型==模型 then
			if 要求==nil then
				选项[#选项+1]=format("%s,等级:%s",玩家数据[id].召唤兽.数据[n].名称,玩家数据[id].召唤兽.数据[n].等级)
			else
				local 通过 = true
				for i=1,#需求表 do
					if 玩家数据[id].召唤兽.数据[n][要求] < 玩家数据[id].召唤兽.数据[n][需求表[i]]  then
						通过 = false
					end
				end
				if 通过 then
					选项[#选项+1]=format("%s,等级:%s",玩家数据[id].召唤兽.数据[n].名称,玩家数据[id].召唤兽.数据[n].等级)
				end
			end
		end
	end
	return 选项
end

function 取符合献上神兽选项(id)
	local 选项={}
	for n=1,#玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].种类=="神兽" then
			选项[#选项+1]=format("%s,等级:%s",玩家数据[id].召唤兽.数据[n].名称..n,玩家数据[id].召唤兽.数据[n].等级)
		end
	end
	return 选项
end

function 判断献上神兽选项(id,事件)
	local 选项={}
	for n=1,#玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].种类=="神兽" then
			选项[#选项+1]={对话=format("%s,等级:%s",玩家数据[id].召唤兽.数据[n].名称..n,玩家数据[id].召唤兽.数据[n].等级),编号=n}
		end
	end
	for n=1,#选项 do
		if 选项[n].对话==事件 then
			if 玩家数据[id].召唤兽:删除处理(id,选项[n].编号) then
			    玩家数据[id].道具:给予道具(id,"神兜兜",40)
			end
			return
		end
	end
	添加最后对话(id,"你所选的这只召唤兽并不是对方想要的")
end

Q_闯关数据={
	大唐官府={名称="剑侠客",模型="剑侠客",武器={名称="四法青云",等级=120},x=139,y=46,方向=1,弟子={"护卫"}}
	,化生寺={名称="逍遥生",模型="逍遥生",武器={名称="秋水人家",等级=120},x=34,y=74,方向=1,弟子={"古代瑞兽","大力金刚"}}
	,方寸山={名称="飞燕女",模型="飞燕女",武器={名称="九天金线",等级=120},x=46,y=125,方向=1,弟子={"僵尸","野鬼"}}
	,女儿村={名称="英女侠",模型="英女侠",武器={名称="金龙双剪",等级=120},x=81,y=80,方向=1,弟子={"如意仙子","星灵仙子"}}
	,神木林={名称="巫蛮儿",模型="巫蛮儿",武器={名称="紫金葫芦",等级=120},x=42,y=161,方向=0,弟子={"小龙女","白熊"}}
	,盘丝洞={名称="狐美人",模型="狐美人",武器={名称="游龙惊鸿",等级=120},x=145,y=106,方向=0,弟子={"花妖","狐狸精"}}
	,魔王寨={名称="巨魔王",模型="巨魔王",武器={名称="晓风残月",等级=120},x=32,y=43,方向=0,弟子={"牛妖","白熊"}}
	,狮驼岭={名称="虎头怪",模型="虎头怪",武器={名称="元神禁锢",等级=120},x=90,y=5,方向=0,弟子={"蝴蝶仙子","雷鸟人"}}
	,阴曹地府={名称="骨精灵",模型="骨精灵",武器={名称="九阴勾魂",等级=120},x=62,y=79,方向=0,弟子={"幽灵","吸血鬼"}}
	,无底洞={名称="杀破狼",模型="杀破狼",武器={名称="冥火薄天",等级=120},x=58,y=86,方向=2,弟子={"老虎","黑熊"}}
	,天宫={名称="舞天姬",模型="舞天姬",武器={名称="此最相思",等级=120},x=195,y=132,方向=0,弟子={"芙蓉仙子","灵鹤"}}
	,普陀山={名称="玄彩娥",模型="玄彩娥",武器={名称="青藤玉树",等级=120},x=70,y=50,方向=0,弟子={"雾中仙","净瓶女娲"}}
	,凌波城={名称="羽灵神",模型="羽灵神",武器={名称="庄周梦蝶",等级=120},x=44,y=79,方向=1,弟子={"凤凰","蛟龙"}}
	,五庄观={名称="神天兵",模型="神天兵",武器={名称="九瓣莲花",等级=120},x=39,y=32,方向=0,弟子={"天将","天兵"}}
	,龙宫={名称="龙太子",模型="龙太子",武器={名称="飞龙在天",等级=120},x=71,y=78,方向=1,弟子={"小龙女","龟丞相"}}
}

Q_门派法术={
	大唐官府={"横扫千军","后发制人"}
	,化生寺={"唧唧歪歪","推气过宫","金刚护体"}
	,方寸山={"落雷符","五雷咒","催眠符","失心符","失魂符","定身符"}
	,女儿村={"雨落寒沙","似玉生香","莲步轻舞","如花解语"}
	,神木林={"落叶萧萧","荆棘舞","雾杀","星月之惠","蜜润"}
	,盘丝洞={"盘丝阵","天罗地网","含情脉脉","勾魂","摄魄"}
	,魔王寨={"飞砂走石","三昧真火"}
	,狮驼岭={"狮搏","威慑","象形","鹰击","连环击"}
	,阴曹地府={"阎罗令","判官令","尸腐毒"}
	,无底洞={"夺魄令","煞气诀","夺命咒","明光宝烛","地涌金莲"}
	,天宫={"天雷斩","五雷轰顶","错乱","百万神兵"}
	,普陀山={"靛沧海","日光华","地裂火","苍茫树","紧箍咒","普渡众生"}
	,凌波城={"裂石","断岳势","浪涌","惊涛怒","天崩地裂","翻江搅海","碎星诀"}
	,五庄观={"飘渺式","日月乾坤","烟雨剑法","生命之泉"}
	,龙宫={"龙卷雨击","龙腾","龙吟"}
}
Q_门派法术9={
大唐官府={"横扫千军"}
,化生寺={"唧唧歪歪","推气过宫"}
,方寸山={"落雷符","五雷咒","催眠符","失心符","失魂符","定身符"}
,女儿村={"雨落寒沙","似玉生香","莲步轻舞","如花解语"}
,神木林={"落叶萧萧","荆棘舞","雾杀","星月之惠","蜜润"}
,盘丝洞={"盘丝阵","天罗地网","含情脉脉","勾魂","摄魄"}
,魔王寨={"飞砂走石","三昧真火","牛劲","魔王回首"}
,狮驼岭={"狮搏","威慑","象形","鹰击","连环击"}
,阴曹地府={"阎罗令","判官令","尸腐毒"}
,无底洞={"夺魄令","煞气诀","夺命咒","明光宝烛","地涌金莲"}
,天宫={"天雷斩","五雷轰顶","错乱","百万神兵"}
,普陀山={"靛沧海","日光华","地裂火","苍茫树","紧箍咒","普渡众生"}
,凌波城={"裂石","断岳势","浪涌","惊涛怒","天崩地裂","翻江搅海","碎星诀"}
,五庄观={"飘渺式","日月乾坤","烟雨剑法","生命之泉"}
,龙宫={"龙卷雨击","龙腾","龙吟"}

}
Q_门派编号={"大唐官府","化生寺","方寸山","女儿村","神木林","龙宫","五庄观","凌波城","普陀山","天宫","无底洞","阴曹地府","狮驼岭","魔王寨","盘丝洞"}
function 取随机法术(数量)
	local 法术={"荆棘舞","水攻","雷击","烈火","落岩","奔雷咒","碎星诀","推气过宫","金刚护体","落叶萧萧","裂石","地涌金莲","推拿","夺魄令","地涌金莲","催眠符","失心符","含情脉脉","似玉生香","横扫千军","唧唧歪歪","金刚护法","五雷咒","龙卷雨击","浪涌","龙吟","龙腾","天雷斩","烟雨剑法","五雷轰顶","飞砂走石","三昧真火","狮搏","鹰击","连环击","反间之计"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end

function 取随机物理法术(数量)
	local 法术={"裂石","横扫千军","浪涌","天雷斩","烟雨剑法","满天花雨"}
	local 返回组={}
	for n=1,数量 do
		返回组[n]=法术[取随机数(1,#法术)]
	end
	return 返回组
end
function 取动物套概率(名称,件数)
  local 动物套数据 = {}
  --力量套
  动物套数据["强盗"] = {33,100}
  动物套数据["海毛虫"] = {33,100}
  动物套数据["蛤蟆精"] = {17,50}
  动物套数据["老虎"] = {17,50}
  动物套数据["马面"] = {8,25}
  动物套数据["天将"] = {5,15}
  动物套数据["地狱战神"] = {5,15}
  动物套数据["巡游天神"] = {3,10}
  动物套数据["鬼将"] = {3,10}
  动物套数据["夜罗刹"] = {3,10}
  动物套数据["噬天虎"] = {3,10}
  动物套数据["狂豹人形"] = {3,10}
  动物套数据["巨力神猿"] = {3,10}
  动物套数据["修罗傀儡鬼"] = {3,10}
  --体质套
  动物套数据["大海龟"] = {33,100}
  动物套数据["树怪"] = {33,100}
  动物套数据["山贼"] = {33,100}
  动物套数据["野猪"] = {33,100}
  动物套数据["黑熊"] = {17,50}
  动物套数据["野鬼"] = {10,30}
  动物套数据["龟丞相"] = {8,25}
  动物套数据["黑熊精"] = {8,25}
  动物套数据["僵尸"] = {8,25}
  动物套数据["白熊"] = {7,20}
  动物套数据["黑山老妖"] = {7,20}
  动物套数据["大力金刚"] = {3,10}
  动物套数据["踏云兽"] = {3,10}
  动物套数据["机关兽"] = {3,10}
  动物套数据["金身罗汉"] = {3,10}
  动物套数据["藤蔓妖花"] = {3,10}
  --魔力套
  动物套数据["巨蛙"] = {33,100}
  动物套数据["花妖"] = {17,50}
  动物套数据["小龙女"] = {10,30}
  动物套数据["蜘蛛精"] = {8,25}
  动物套数据["蝴蝶仙子"] = {7,20}
  动物套数据["古代瑞兽"] = {7,20}
  动物套数据["蛟龙"] = {5,15}
  动物套数据["雨师"] = {5,15}
  动物套数据["如意仙子"] = {3,10}
  动物套数据["星灵仙子"] = {3,10}
  动物套数据["净瓶女娲"] = {3,10}
  动物套数据["灵符女娲"] = {3,10}
  动物套数据["灵鹤"] = {3,10}
  动物套数据["炎魔神"] = {3,10}
  动物套数据["葫芦宝贝"] = {3,10}
  动物套数据["混沌兽"] = {3,10}
  动物套数据["长眉灵猴"] = {3,10}
  动物套数据["蜃气妖"] = {3,10}
  --耐力套
  动物套数据["护卫"] ={33,100}
  动物套数据["羊头怪"] ={17,50}
  动物套数据["牛妖"] ={10,30}
  动物套数据["蟹将"] ={10,30}
  动物套数据["牛头"] ={8,25}
  动物套数据["天兵"] ={5,15}
  动物套数据["芙蓉仙子"] ={3,10}
  动物套数据["律法女娲"] ={3,10}
  动物套数据["幽萤娃娃"] ={3,10}
  动物套数据["红萼仙子"] ={3,10}
  动物套数据["龙龟"] ={3,10}
  动物套数据["连弩车"] ={3,10}
  动物套数据["蝎子精"] ={3,10}
  动物套数据["曼珠沙华"] ={3,10}
  --敏捷套
  动物套数据["赌徒"] = {33,100}
  动物套数据["大蝙蝠"] = {33,100}
  动物套数据["骷髅怪"] = {17,50}
  动物套数据["狐狸精"] = {17,50}
  动物套数据["狼"] = {10,30}
  动物套数据["虾兵"] = {10,30}
  动物套数据["兔子怪"] = {8,25}
  动物套数据["雷鸟人"] = {7,20}
  动物套数据["风伯"] = {5,15}
  动物套数据["凤凰"] = {3,10}
  动物套数据["幽灵"] = {3,10}
  动物套数据["吸血鬼"] = {3,10}
  动物套数据["画魂"] = {3,10}
  动物套数据["雾中仙"] = {3,10}
  动物套数据["机关鸟"] = {3,10}
  动物套数据["巴蛇"] = {3,10}
  动物套数据["猫灵人形"] = {3,10}
  动物套数据["修罗傀儡妖"] = {3,10}
  if 件数>=3 and 件数<5 then
      return 动物套数据[名称][1]
  elseif 件数>=5 then
    return 动物套数据[名称][2]
  end
end

取所有动物套 = {
  "强盗","海毛虫","蛤蟆精","老虎","马面","天将","地狱战神","巡游天神","鬼将","夜罗刹","噬天虎","狂豹人形","巨力神猿","修罗傀儡鬼",
  "大海龟","树怪","山贼","野猪","黑熊","野鬼","龟丞相","黑熊精","僵尸","白熊","黑山老妖","大力金刚","踏云兽","机关兽","金身罗汉",
  "藤蔓妖花","巨蛙","花妖","小龙女","蜘蛛精","蝴蝶仙子","古代瑞兽","蛟龙","雨师","如意仙子","星灵仙子","净瓶女娲","灵符女娲","灵鹤",
  "炎魔神","葫芦宝贝","混沌兽","长眉灵猴","蜃气妖","护卫","羊头怪","牛妖","蟹将","牛头","天兵","芙蓉仙子","律法女娲",
  "幽萤娃娃","红萼仙子","龙龟","连弩车","蝎子精","曼珠沙华","赌徒","大蝙蝠","骷髅怪","狐狸精","狼","虾兵","兔子怪","雷鸟人","风伯",
  "凤凰","幽灵","吸血鬼","画魂","雾中仙","机关鸟","巴蛇","猫灵人形","修罗傀儡妖"
}

function 取动物套加成(名称,等级)
  local 动物套数据 = {}
  --力量套
  动物套数据["强盗"] = {类型="力量",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["海毛虫"] = {类型="力量",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["蛤蟆精"] = {类型="力量",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["老虎"] = {类型="力量",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["马面"] = {类型="力量",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["天将"] = {类型="力量",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["地狱战神"] = {类型="力量",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["巡游天神"] = {类型="力量",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["鬼将"] = {类型="力量",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["夜罗刹"] = {类型="力量",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["噬天虎"] = {类型="力量",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["狂豹人形"] = {类型="力量",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["巨力神猿"] = {类型="力量",属性=math.floor(等级/3),件数={5,15}}
  动物套数据["修罗傀儡鬼"] = {类型="力量",属性=math.floor(等级/3),件数={5,15}}
  --体质套
  动物套数据["大海龟"] = {类型="体质",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["树怪"] = {类型="体质",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["山贼"] = {类型="体质",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["野猪"] = {类型="体质",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["黑熊"] = {类型="体质",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["野鬼"] = {类型="体质",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["龟丞相"] = {类型="体质",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["黑熊精"] = {类型="体质",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["僵尸"] = {类型="体质",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["白熊"] = {类型="体质",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["黑山老妖"] = {类型="体质",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["大力金刚"] = {类型="体质",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["踏云兽"] = {类型="体质",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["机关兽"] = {类型="体质",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["金身罗汉"] = {类型="体质",属性=math.floor(等级/3),件数={5,15}}
  动物套数据["藤蔓妖花"] = {类型="体质",属性=math.floor(等级/3),件数={5,15}}
  --魔力套
  动物套数据["巨蛙"] = {类型="魔力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["花妖"] = {类型="魔力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["小龙女"] = {类型="魔力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["蜘蛛精"] = {类型="魔力",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["蝴蝶仙子"] = {类型="魔力",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["古代瑞兽"] = {类型="魔力",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["蛟龙"] = {类型="魔力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["雨师"] = {类型="魔力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["如意仙子"] = {类型="魔力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["星灵仙子"] = {类型="魔力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["净瓶女娲"] = {类型="魔力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["灵符女娲"] = {类型="魔力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["灵鹤"] = {类型="魔力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["炎魔神"] = {类型="魔力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["葫芦宝贝"] = {类型="魔力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["混沌兽"] = {类型="魔力",属性=math.floor(等级/3),件数={5,15}}
  动物套数据["长眉灵猴"] = {类型="魔力",属性=math.floor(等级/3),件数={5,15}}
  动物套数据["蜃气妖"] = {类型="魔力",属性=math.floor(等级/3),件数={5,15}}
  --耐力套
  动物套数据["护卫"] = {类型="耐力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["羊头怪"] = {类型="耐力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["牛妖"] = {类型="耐力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["蟹将"] = {类型="耐力",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["牛头"] = {类型="耐力",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["天兵"] = {类型="耐力",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["芙蓉仙子"] = {类型="耐力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["律法女娲"] = {类型="耐力",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["幽萤娃娃"] = {类型="耐力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["红萼仙子"] = {类型="耐力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["龙龟"] = {类型="耐力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["连弩车"] = {类型="耐力",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["蝎子精"] = {类型="耐力",属性=math.floor(等级/3),件数={5,15}}
  动物套数据["曼珠沙华"] = {类型="耐力",属性=math.floor(等级/3),件数={5,15}}
  --敏捷套
  动物套数据["赌徒"] = {类型="敏捷",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["大蝙蝠"] = {类型="敏捷",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["骷髅怪"] = {类型="敏捷",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["狐狸精"] = {类型="敏捷",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["狼"] = {类型="敏捷",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["虾兵"] = {类型="敏捷",属性=math.floor(等级/6),件数={5,10}}
  动物套数据["兔子怪"] = {类型="敏捷",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["雷鸟人"] = {类型="敏捷",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["风伯"] = {类型="敏捷",属性=math.floor(等级/5),件数={10,15}}
  动物套数据["凤凰"] = {类型="敏捷",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["幽灵"] = {类型="敏捷",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["吸血鬼"] = {类型="敏捷",属性=math.floor(等级/4),件数={10,15}}
  动物套数据["画魂"] = {类型="敏捷",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["雾中仙"] = {类型="敏捷",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["机关鸟"] = {类型="敏捷",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["巴蛇"] = {类型="敏捷",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["猫灵人形"] = {类型="敏捷",属性=math.floor(等级/4),件数={15,25}}
  动物套数据["修罗傀儡妖"] = {类型="敏捷",属性=math.floor(等级/3),件数={5,15}}
  return 动物套数据[名称]
end