-- @Author: baidwwy
-- @Date:   2024-10-20 02:54:08
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-12 03:09:03
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-10-21 21:54:18
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-18 18:58:18

function 取技能是否有高级(bb,jn) --该技能是否在bb身上有高级的，有就返回高级否则返回低级
	if bb==nil and jn==nil then return end
	local ssy=false
	if bb==nil then return jn,ssy end
	for kn,vn in pairs(bb.技能) do
		local gjjn = "高级" ..jn
		if vn == jn or vn.名称 == jn then
			ssy=true
		end
		if vn == gjjn or vn.名称 == gjjn then
			ssy=true
			return gjjn,ssy
		end
	end
	return jn,ssy
end

function 取丸子技能是否符合(wzjn,cjjn)
	local fh=false
	for k,v in pairs(wzjn) do
		  local ab = "超级" ..v
		  local bgj="高级" ..v
		  if ab == cjjn then
		  	fh=true
		  	break
		  end
	end
	return fh
end
------------------------------------
function 取特色兽诀()
	local ms =  {"特色善恶有报"}
	return ms[取随机数(1,#ms)]
end
function 取低级要诀() ---未有道具
	local ms = {"反震","吸血","反击","连击","飞行","驱鬼","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝"}
	return ms[取随机数(1,#ms)]
end
function 取高级要诀() ---未有道具
	local ms =  {"高级夜战","高级反震","高级吸血","嗜血追击","高级反击","高级连击","高级飞行","高级驱鬼","高级隐身","高级感知","高级再生","高级冥思","高级慧根","高级必杀","高级幸运","高级神迹","高级招架","高级永恒","高级敏捷","高级强力","高级防御","高级偷袭","高级毒","高级驱鬼","高级鬼魂术","高级魔之心","高级神佑复生","高级精神集中","高级否定信仰","高级合纵","高级独行","奔雷咒","泰山压顶","水漫金山","地狱烈火","高级法术连击","高级法术暴击","高级法术波动","高级雷属性吸收","高级土属性吸收","高级火属性吸收","高级水属性吸收"}
	return ms[取随机数(1,#ms)]
end
function 取超级要诀()
	local ms = {"超级必杀","超级毒","超级法术暴击","超级法术波动","超级法术连击","超级反击","超级反震","超级防御","超级飞行","超级否定信仰","超级感知","超级慧根",
							"超级火属性吸收","超级进击必杀","超级精神集中","超级雷属性吸收","超级连击","超级敏捷","超级冥思","超级魔之心","超级强力","超级驱鬼","超级神迹",
							"超级水属性吸收","超级偷袭","超级土属性吸收","超级吸血","超级幸运","超级夜战","超级遗志","超级隐身","超级永恒","超级再生","超级招架",
							"超级合纵","超级进击法暴","超级水漫金山","超级奔雷咒","超级泰山压顶","超级地狱烈火","超级壁垒击破"
						}
  return ms[取随机数(1,#ms)]
end

function 法系高级兽诀() ---未有道具
	local ms =  {"高级魔之心","高级法术连击","高级法术暴击","高级法术波动","须弥真言","桀骜自恃"}
	return ms[取随机数(1,#ms)]
end
function 物理高级兽诀() ---未有道具
	local ms =  {"高级强力","高级夜战","高级吸血","高级连击","高级必杀","高级偷袭","高级进击必杀","死亡召唤","剑荡四方","善恶有报","壁垒击破","力劈华山",}
	return ms[取随机数(1,#ms)]
end
function 被动高级兽诀() ---未有道具
	local ms =  {"高级反击","高级反震","高级神迹","高级招架","高级永恒","高级防御","高级幸运","高级神佑复生","高级感知","高级飞行","高级隐身","高级独行","高级遗志",}
	return ms[取随机数(1,#ms)]
end
function 取特殊要诀() ---未有道具
	local ms =  {"龙魂","出其不意","从天而降","苍鸾怒击","浮云神马","上古灵符","凝光炼彩","超级神柚复生","净台妙谛","灵山禅语","超级三昧真火","桀骜自恃","力劈华山","善恶有报","壁垒击破","惊心一剑","法术防御","死亡召唤"}
	return ms[取随机数(1,#ms)]
end

function 打开特殊要诀()---稀有兽决礼盒
	local ms =  {"观照万象","扶摇万里","叱咤风云","善恶有报","力劈华山","无上正真","圣婴大王","须弥真言","苍鸾怒击","净台妙谛","理直气壮","大快朵颐",
								"风起龙游","乘胜追击","凭风借力","桀骜自恃","虎虎生风","柳暗花明","气贯长虹","义薄云天","与生俱来"}
	return ms[取随机数(1,#ms)]
end

function 取碎片特殊要诀()
	local ms = {"凭风借力","气贯长虹","乘胜追击","义薄云天","与生俱来","柳暗花明","无上正真","桀骜自恃","圣婴大王","超级神柚复生","虎虎生风",
  						"上古灵符","月光","天降灵葫","八凶法阵","扶摇万里","叱咤风云","流沙轻音","食指大动","观照万象",
  						"善恶有报","壁垒击破","惊心一剑","力劈华山","剑荡四方","死亡召唤","超级三昧真火","夜舞倾城","灵能激发","法术防御","无畏布施",
  						"须弥真言","苍鸾怒击","灵山禅语","净台妙谛","理直气壮","从天而降","大快朵颐","千钧一怒","浮云神马","神出鬼没","溜之大吉",
  						"龙魂","逍遥游","津津有味","昼伏夜出","凝光炼彩","风起龙游","出其不意","欣欣向荣","水击三千","北冥之渊"}


	return ms[取随机数(1,#ms)]
end
function 取碎片超级要诀()
	local ms = {"超级必杀","超级毒","超级法术暴击","超级法术波动","超级法术连击","超级反击","超级反震","超级防御","超级飞行","超级否定信仰","超级感知","超级慧根","超级火属性吸收",
           "超级精神集中","超级雷属性吸收","超级连击","超级敏捷","超级冥思","超级魔之心","超级强力","超级驱鬼","超级神迹","超级水属性吸收","超级偷袭","超级土属性吸收","超级吸血","超级幸运","超级夜战","超级隐身","超级永恒","超级再生","超级招架"}
	return ms[取随机数(1,#ms)]
end
function 兑换特殊要诀()---特殊兽诀礼盒
	local ms = {"凭风借力","气贯长虹","乘胜追击","义薄云天","与生俱来","柳暗花明","无上正真","桀骜自恃","圣婴大王","超级神柚复生","虎虎生风",
  						"上古灵符","月光","天降灵葫","八凶法阵","扶摇万里","叱咤风云","流沙轻音","食指大动","观照万象",
  						"善恶有报","壁垒击破","惊心一剑","力劈华山","剑荡四方","死亡召唤","超级三昧真火","夜舞倾城","灵能激发","法术防御","无畏布施",
  						"须弥真言","苍鸾怒击","灵山禅语","净台妙谛","理直气壮","从天而降","大快朵颐","千钧一怒","浮云神马","神出鬼没","溜之大吉",
  						"龙魂","逍遥游","津津有味","昼伏夜出","凝光炼彩","风起龙游","出其不意","欣欣向荣","水击三千","北冥之渊"}

	return ms[取随机数(1,#ms)]
end
function 取内丹(类型)
	if 类型 == "高级" then
		local 高级内丹 ={ "神机步","腾挪劲","玄武躯","龙胄铠","玉砥柱","碎甲刃","阴阳护","凛冽气","舍身击","电魂闪","通灵法","双星爆","催心浪","隐匿击","生死决","血债偿"}
		return 高级内丹[取随机数(1,#高级内丹)]
	else
		local 普通内丹 = {"迅敏","狂怒","阴伤","静岳","擅咒","灵身","矫健","深思","钢化","坚甲","慧心","撞击","无畏","愤恨","淬毒","狙刺","连环","圣洁","灵光"}
		return 普通内丹[取随机数(1,#普通内丹)]
	end
end

function 取宝宝装备()
	if 取随机数()<=70 then
				return "炼妖石"
	else
		return "上古锻造图策"
	end
end

function 宝宝特性属性(等级,特性)
	local aa
	local bb
	if 特性=="力破" then
		aa={-20,0,20,40,60}
		return  aa[取随机数(1,5)]+等级 , 取随机数(4,8) --a="#Y/忽略人物角色#G/"..xa[1].."#Y/防御力".."减少对召唤兽的伤害结果#R"..xa[2].."#Y。对NPC无效果"
	elseif 特性=="巧劲" then
		aa={5,10,15,20,25}
		return  aa[取随机数(1,5)] , 取随机数(10,20) --a="#Y/普通攻击增加伤害结果"..xa[1].."受到的所有伤害增加"..xa[2]
	elseif 特性=="识药" then
		aa={10,14,15,20,20}
		return  aa[取随机数(1,5)] , 取随机数(10,20) --a="#Y/药物效果提高"..xa[1].."受到的所有伤害增加"..xa[2]
	elseif 特性=="抗物" then
		return  取随机数(5,30) , 取随机数(10,22) --a="#Y/在场时，我方所有单位物理防御增加"..xa[1].."，自身受到法术伤害增加"..xa[2]
	elseif 特性=="抗法" then
		return  取随机数(5,30) , 取随机数(10,22) --a="#Y/在场时，我方所有单位法术防御增加"..xa[1].."，自身受到物理伤害增加"..xa[2]
	elseif 特性=="复仇" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(5,10) --a="#Y/主人被击倒时，有"..xa[1].."概率向敌方单位发动一次攻击，最多生效3次。减少所有防御力"..xa[2]
	elseif 特性=="自恋" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	elseif 特性=="灵刃" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="灵法" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="预知" then
		aa={10,16,21,26,32}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	elseif 特性=="灵动" then
		aa={10,16,21,26,32}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	elseif 特性=="瞬击" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="瞬法" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="阳护" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(15,30)
	elseif 特性=="识物" then
		aa={5,8,10,13,16}
		return  aa[取随机数(1,5)], 取随机数(4,8) --a="#Y/召唤兽套装附带的技能为法术技能时，触发概率提高"..xa[1].."全属性降低"..xa[2]
	elseif 特性=="护佑" then
		return  取随机数(20,50), 取随机数(5,10) --a="#Y/第2回合进场，我方百分比最低的单位受到的伤害降低"..xa[1].."持续2回合，法术伤害力降低#R/"..xa[2]
	elseif 特性=="洞察" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(4,8) --a="#Y/PVP战斗中行动时有"..xa[1].."概率发现什么，全属性降低"..xa[2]
	elseif 特性=="弑神" then
		aa={60,90,120,150,180}
		bb={20,30,40}
		return  aa[取随机数(1,5)], bb[取随机数(1,3)] --a="#Y/对已经神佑过的召唤兽法术伤害增加"..xa[1].."，普通攻击命中率下降"..xa[2]
	elseif 特性=="御风" then
		aa={7,10,14,17,21,30}
		return  aa[取随机数(1,6)], 取随机数(10,20)
	elseif 特性=="顺势" then
		aa={60,90,120,150,180}
		bb={90,90,90,120,150,180}
		return  aa[取随机数(1,5)], bb[取随机数(1,6)]
	elseif 特性=="怒吼" then
		aa={30,50,60,70,90}
		return  aa[取随机数(1,5)]+等级, 取随机数(5,10) --"#Y/第二回合以后进场时，我方伤害最高的单位提高"..xa[1].."伤害力，持续2回合，法术伤害力降低"..xa[2]
	elseif 特性=="逆境" then
		aa={33,50,60,80,100}
		bb={15,15,20,30}
		return  aa[取随机数(1,5)], bb[取随机数(1,4)]
	elseif 特性=="吮魔" then
		return  取随机数(1,5), 取随机数(15,25) --(普通物理攻击时，吸取对方损失气血的魔法；对当前魔法超过50%的单位伤害结果减少)
	elseif 特性=="争锋" then
		aa={6,10,13,16,20}
		return  aa[取随机数(1,5)], 取随机数(40,110) --a="#Y/对召唤兽物理伤害结果增加"..xa[1].."对人物伤害结果减少"..xa[2]
	elseif 特性=="灵断" then
		aa={33,50,60,80,100}
		return  aa[取随机数(1,5)], 取随机数(5,10)
	elseif 特性=="乖巧" then
		aa={20,30,40,50,50}
		return  aa[取随机数(1,5)], 取随机数(4,8)
	end
end

function 取冲突技能(技能)
	if 技能=="高级必杀" then
		return {"合纵","高级合纵"}
	elseif 技能=="合纵" then
		return {"招架","法波"}
	elseif 技能=="高级法术暴击" then
		return {"高级幸运"}
	elseif 技能=="高级幸运" then
		return {"永恒"}
	elseif 技能=="高级法术波动" then
		return {"敏捷","高级精神集中"}
	elseif 技能=="高级招架" then
		return {"魔之心"}
	elseif 技能=="高级永恒" then
		return {"偷袭"}
	elseif 技能=="高级敏捷" then
		return {"雷击"}
	elseif 技能=="死亡召唤" then
		return {"水攻"}
	elseif 技能=="惊心一剑" then
		return {"落岩","高级火属性吸收"}
	elseif 技能=="烈火" then
		return {"高级偷袭"}
	elseif 技能=="高级魔之心" then
		return {"水攻"}
	elseif 技能=="善恶有报" then
		return {"雷属性吸收","奔雷咒"}
	elseif 技能=="火属性吸收" then
		return {"夜战"}
	elseif 技能=="地狱烈火" then
		return {"夜战"}
	elseif 技能=="高级火属性吸收" then
		return {"高级夜战"}
	elseif 技能=="强力" then
		return {"反击"}
	elseif 技能=="防御" then
		return {"反震"}
	elseif 技能=="反震" then
		return {"法术抵抗"}
	elseif 技能=="高级夜战" then
		return {"连击"}
	elseif 技能=="高级强力" then
		return {"高级反击","法术抵抗","飞行"}
	elseif 技能=="高级反击" then
		return {"飞行"}
	elseif 技能=="法术抵抗" then
		return {"高级防御"}
	elseif 技能=="高级反震" then
		return {"高级防御","壁垒击破","隐身","高级法术抵抗"}
	elseif 技能=="高级防御" then
		return {"壁垒击破","隐身"}
	elseif 技能=="隐身" then
		return {"法术连击"}
	elseif 技能=="高级吸血" then
		return {"盾气","感知","嗜血追击"}
	elseif 技能=="感知" then
		return {"嗜血追击"}
	elseif 技能=="高级独行" then
		return {"高级法术连击"}
	elseif 技能=="嗜血追击" then
		return {"高级连击"}
	elseif 技能=="高级连击" then
		return {"高级盾气","再生"}
	elseif 技能=="高级盾气" then
		return {"须弥真言","再生"}
	elseif 技能=="须弥真言" then
		return {"再生","法术暴击"}
	elseif 技能=="再生" then
		return {"剑荡四方"}
	elseif 技能=="高级飞行" then
		return {"冥思","弱点土"}
	elseif 技能=="高级隐身" then
		return {"弱点水","神佑复生"}
	elseif 技能=="冥思" then
		return {"弱点土"}
	elseif 技能=="观照万象" then
		return {"鬼魂术"}
	elseif 技能=="出其不意" then
		return {"高级感知"}
	elseif 技能=="遗志" then
		return {"鬼魂术"}
	elseif 技能=="神佑复生" then
		return {"高级冥思","毒"}
	elseif 技能=="高级感知" then
		return {"鬼魂术"}
	elseif 技能=="高级再生" then
		return {"驱鬼"}
	elseif 技能=="高级冥思" then
		return {"毒"}
	elseif 技能=="慧根" then
		return {"力劈华山","高级神佑复生","高级遗志","法术暴击","神迹"}
	elseif 技能=="力劈华山" then
		return {"高级神佑复生"}
	elseif 技能=="高级神佑复生" then
		return {"高级遗志"}
	elseif 技能=="必杀" then
		return {"高级鬼魂术"}
	elseif 技能=="高级驱鬼" then
		return {"幸运","高级法术连击"}
	elseif 技能=="幸运" then
		return {"高级法术连击"}
	elseif 技能=="法术连击" then
		return {"精神集中"}
	elseif 技能=="高级毒" then
		return {"法术连击","精神集中"}
	elseif 技能=="高级进击法暴" then
		return {"神佑复生"}
	elseif 技能=="高级夜战" then
		return {"净台妙谛"}
	elseif 技能=="高级进击必杀" then
		return {"高级飞行"}
	elseif 技能=="法术暴击" then
		return {"神迹"}
		elseif 技能=="桀骜自恃" then
	return {"神迹"}
	end
	return 0
end


超级技能状态名称={}

超级技能状态名称[1]="超级赐福·元吉"
超级技能状态名称[2]="超级赐福·双喜"
超级技能状态名称[3]="超级赐福·三和"
超级技能状态名称[4]="超级赐福·四季"
超级技能状态名称[5]="超级赐福·五福"
超级技能状态名称[6]="超级赐福·六祥"
超级技能状态名称[7]="超级赐福·七瑞"
超级技能状态名称[8]="超级赐福·八荒"
超级技能状态名称[9]="超级赐福·九州"
超级技能状态名称[10]="超级赐福·十全"
function 取饰品表(sj)
	local lb = {"野猪","羊头怪","牛头","马面","雷鸟人","进阶雷鸟人","进阶蝴蝶仙子","古代瑞兽","进阶古代瑞兽","白熊","进阶白熊","进阶黑山老妖",
	"天兵","进阶天兵","进阶天将","地狱战神","进阶地狱战神","进阶风伯","凤凰","进阶凤凰","蛟龙","进阶蛟龙","雨师","进阶雨师","进阶如意仙子","芙蓉仙子","进阶芙蓉仙子",
	"巡游天神","进阶巡游天神","星灵仙子","进阶星灵仙子","幽灵","进阶幽灵","鬼将","进阶鬼将","吸血鬼","进阶吸血鬼","净瓶女娲","进阶净瓶女娲","司雪","进阶司雪",
	"律法女娲","进阶律法女娲","灵符女娲","进阶灵符女娲","律法女娲","进阶律法女娲","灵符女娲","进阶灵符女娲","大力金刚","进阶大力金刚","雾中仙",
	"进阶雾中仙","灵鹤","进阶灵鹤","夜罗刹","进阶夜罗刹","进阶炎魔神","噬天虎","进阶噬天虎","进阶野猪精","鼠先锋","进阶鼠先锋","百足将军","进阶百足将军",
	"红萼仙子","龙龟","进阶龙龟","进阶阴阳伞","机关兽","进阶机关兽","机关鸟","进阶机关鸟","机关人人形","进阶机关人人形","进阶连弩车","巴蛇",
	"进阶巴蛇","进阶蚌精","鲛人","进阶鲛人","碧水夜叉","进阶碧水夜叉","锦毛貂精","进阶锦毛貂精","进阶千年蛇魅","犀牛将军人形","进阶犀牛将军人形","犀牛将军兽形","进阶犀牛将军兽形",
	"机关人车","葫芦宝贝","进阶葫芦宝贝","猫灵人形","进阶猫灵人形","猫灵兽形","进阶猫灵兽形","狂豹兽形","进阶狂豹兽形","狂豹人形","进阶狂豹人形","蝎子精",
	"进阶蝎子精","混沌兽","进阶混沌兽","画魂","进阶画魂","长眉灵猴","进阶长眉灵猴","巨力神猿","进阶巨力神猿","修罗傀儡鬼","进阶修罗傀儡鬼","藤蔓妖花",
	"进阶藤蔓妖花","蜃气妖","进阶蜃气妖","修罗傀儡妖","进阶修罗傀儡妖","金身罗汉","进阶金身罗汉","曼珠沙华","进阶曼珠沙华","善财童子","进阶善财童子","执音","进阶执音",
	"进阶小毛头","进阶小丫丫","进阶小仙灵","进阶小仙女","进阶小精灵","进阶小魔头","泡泡","章鱼","狸","海星","幽萤娃娃","进阶幽萤娃娃","持国巡守","觉醒涂山雪","进阶涂山雪","涂山雪",
	"进阶持国巡守","毗舍童子","进阶毗舍童子","真陀护法","进阶真陀护法","泪妖","进阶泪妖","镜妖","进阶镜妖","琴仙","进阶琴仙","金铙僧","进阶金铙僧","进阶金翼","金翼","进阶觉醒涂山雪",
	"增长巡守","进阶增长巡守","灵灯侍者","进阶灵灯侍者","般若天女","进阶般若天女","涂山瞳","进阶涂山瞳","进阶幻姬","幻姬","月魅","进阶月魅","谛听","进阶谛听","雷龙","进阶雷龙","虬龙","进阶虬龙",
  "有苏鸩","进阶有苏鸩","自在心猿","进阶自在心猿","魔化毗舍童子","进阶魔化毗舍童子","司雨","进阶司雨","司辰侍者(未来)","进阶司辰侍者(未来)","炼丹童子","进阶炼丹童子","司辰侍者(过去)","进阶司辰侍者(过去)"}
	local fhz = false
	for i=1,#lb do
		if lb[i] == sj then
		  fhz = true
		end
	end
	return fhz
end

function 取饰品表1(sj)
	local lb = {"野猪饰品","羊头怪饰品","牛头饰品","马面饰品","雷鸟人饰品","进阶雷鸟人饰品","进阶蝴蝶仙子饰品","古代瑞兽饰品","进阶古代瑞兽饰品","白熊饰品","进阶白熊饰品","进阶黑山老妖饰品",
	"天兵饰品","进阶天兵饰品","进阶天将饰品","地狱战神饰品","进阶地狱战神饰品","进阶风伯饰品","凤凰饰品","进阶凤凰饰品","蛟龙饰品","进阶蛟龙饰品","雨师饰品","进阶雨师饰品","进阶如意仙子饰品","芙蓉仙子饰品","进阶芙蓉仙子饰品",
	"巡游天神饰品","进阶巡游天神饰品","星灵仙子饰品","进阶星灵仙子饰品","幽灵饰品","进阶幽灵饰品","鬼将饰品","进阶鬼将饰品","吸血鬼饰品","进阶吸血鬼饰品","净瓶女娲饰品","进阶净瓶女娲饰品",
	"律法女娲饰品","进阶律法女娲饰品","灵符女娲饰品","进阶灵符女娲饰品","大力金刚饰品","进阶大力金刚饰品","雾中仙饰品","涂山瞳饰品","进阶涂山瞳饰品","司辰侍者(未来)饰品","进阶司辰侍者(未来)饰品",
	"进阶雾中仙饰品","灵鹤饰品","进阶灵鹤饰品","夜罗刹饰品","进阶夜罗刹饰品","进阶炎魔神饰品","噬天虎饰品","进阶噬天虎饰品","进阶野猪精饰品","鼠先锋饰品","进阶鼠先锋饰品","百足将军饰品","进阶百足将军饰品",
	"红萼仙子饰品","龙龟饰品","进阶龙龟饰品","进阶阴阳伞饰品","机关兽饰品","进阶机关兽饰品","机关人人形饰品","进阶机关人人形饰品","进阶连弩车饰品","巴蛇饰品","司雨饰品","进阶司雨饰品","炼丹童子饰品","进阶炼丹童子饰品",
	"进阶巴蛇饰品","进阶蚌精饰品","鲛人饰品","进阶鲛人饰品","碧水夜叉饰品","进阶碧水夜叉饰品","锦毛貂精饰品","进阶锦毛貂精饰品","进阶千年蛇魅饰品","犀牛将军人形饰品","进阶犀牛将军人形饰品","犀牛将军兽形饰品","进阶犀牛将军兽形饰品",
	"机关人车饰品","葫芦宝贝饰品","进阶葫芦宝贝饰品","猫灵人形饰品","进阶猫灵人形饰品","猫灵兽形饰品","进阶猫灵兽形饰品","狂豹兽形饰品","进阶狂豹兽形饰品","狂豹人形饰品","进阶狂豹人形饰品","蝎子精饰品",
	"进阶蝎子精饰品","混沌兽饰品","进阶混沌兽饰品","画魂饰品","进阶画魂饰品","长眉灵猴饰品","进阶长眉灵猴饰品","巨力神猿饰品","进阶巨力神猿饰品","修罗傀儡鬼饰品","进阶修罗傀儡鬼饰品","藤蔓妖花饰品",
	"进阶藤蔓妖花饰品","蜃气妖饰品","进阶蜃气妖饰品","修罗傀儡妖饰品","进阶修罗傀儡妖饰品","金身罗汉饰品","进阶金身罗汉饰品","曼珠沙华饰品","进阶曼珠沙华饰品","善财童子饰品","进阶善财童子饰品",
	"进阶小毛头饰品","进阶小丫丫饰品","进阶小仙灵饰品","进阶小仙女饰品","进阶小精灵饰品","进阶小魔头饰品","泡泡饰品","章鱼饰品","狸饰品","海星饰品","幽萤娃娃饰品","进阶幽萤娃娃饰品","持国巡守饰品",
	"进阶持国巡守饰品","毗舍童子饰品","进阶毗舍童子饰品","真陀护法饰品","进阶真陀护法饰品","泪妖饰品","进阶泪妖饰品","镜妖饰品","进阶镜妖饰品","琴仙饰品","进阶琴仙饰品","金铙僧饰品","进阶金铙僧饰品",
	"增长巡守饰品","进阶增长巡守饰品","灵灯侍者饰品","进阶灵灯侍者饰品","般若天女饰品","进阶般若天女饰品","金翼饰品","进阶金翼饰品","进阶觉醒涂山雪饰品","觉醒涂山雪饰品","进阶涂山雪饰品","涂山雪饰品","进阶幻姬饰品","幻姬饰品",
  "月魅饰品","进阶月魅饰品","谛听饰品","进阶谛听饰品","雷龙饰品","进阶雷龙饰品","虬龙饰品","进阶虬龙饰品","有苏鸩饰品","进阶有苏鸩饰品","自在心猿饰品","进阶自在心猿饰品","魔化毗舍童子饰品","进阶魔化毗舍童子饰品",
  "司辰侍者(过去)饰品","进阶司辰侍者(过去)饰品","司雪饰品","进阶司雪饰品","执音饰品","进阶执音饰品"}
	local fhz = false
	for i=1,#lb do
		if lb[i] == sj then
		  fhz = true
		end
	end
	return fhz
end

function 取进阶表(sj)
  local lb = {"进阶雷鸟人","进阶蝴蝶仙子","进阶古代瑞兽","进阶白熊","进阶黑山老妖","进阶天兵","进阶天将","进阶地狱战神","进阶风伯","进阶凤凰","进阶蛟龙","进阶鼠先锋","进阶百足将军",
  "进阶雨师","进阶如意仙子","进阶芙蓉仙子","进阶巡游天神","进阶星灵仙子","进阶幽灵","进阶鬼将","进阶吸血鬼","进阶净瓶女娲","进阶律法女娲","进阶灵符女娲","进阶大力金刚","进阶雾中仙",
  "进阶龙龟","进阶阴阳伞","进阶机关兽","进阶机关鸟","进阶机关人人形","进阶连弩车","进阶巴蛇","进阶蚌精","进阶鲛人","进阶碧水夜叉","进阶锦毛貂精","进阶千年蛇魅","进阶灵鹤",
  "进阶犀牛将军人形","进阶犀牛将军兽形","进阶葫芦宝贝","进阶猫灵人形","进阶猫灵兽形","进阶狂豹兽形","进阶狂豹人形","进阶蝎子精","进阶混沌兽","进阶画魂","进阶噬天虎","进阶野猪精",
  "进阶长眉灵猴","进阶巨力神猿","进阶修罗傀儡鬼","进阶藤蔓妖花","进阶蜃气妖","进阶修罗傀儡妖","进阶金身罗汉","进阶曼珠沙华","进阶善财童子","进阶幽萤娃娃","进阶夜罗刹","进阶炎魔神",
  "进阶持国巡守","进阶毗舍童子","进阶真陀护法","进阶泪妖","进阶镜妖","进阶琴仙","进阶金铙僧","进阶增长巡守","进阶灵灯侍者","进阶般若天女","进阶涂山雪","进阶超级神虎","进阶司辰侍者(未来)",
  "进阶狐不归","进阶花铃","进阶月魅","进阶月影仙","进阶云游火","进阶超级玉兔","进阶超级土地公公","进阶超级神鸡","进阶超级神猴","进阶超级神狗","进阶超级神猪","进阶超级神牛",
  "进阶超级神鼠","进阶超级猪小戒","进阶超级小白龙","进阶超级神兔","进阶超级神龙","进阶超级腾蛇","进阶超级孔雀","进阶超级海豚","进阶超级神虎","进阶超级海豚", "进阶超级筋斗云","进阶自在心猿",
  "进阶超级飞天","进阶超级人参娃娃","进阶超级泡泡","进阶超级大熊猫","进阶超级金猴","进阶超级大象","进阶超级白泽","进阶超级灵鹿","进阶超级赤焰兽","进阶超级大鹏","进阶司雨","进阶司风","进阶雷龙",
  "进阶超级灵狐","进阶超级神蛇","进阶超级神马","进阶超级青鸾","进阶超级麒麟","进阶超级神羊","进阶超级六耳猕猴","进阶超级鲲鹏","进阶超级飞廉","进阶超级红孩儿","进阶超级神柚","进阶金翼","进阶觉醒涂山雪",
  "进阶涂山瞳","进阶幻姬","进阶谛听","进阶虬龙","进阶有苏鸩","进阶魔化毗舍童子","进阶炼丹童子","进阶司辰侍者(过去)","进阶多闻巡守","进阶司雪","进阶执音"}
 local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
		fhz = true
	end
  end
  return fhz
end
function 取进阶子女表(sj)
  local lb = {"进阶小毛头","进阶小丫丫","进阶小仙灵","进阶小仙女","进阶小精灵","进阶小魔头",}
  local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
	  fhz = true
	end
  end
 return fhz
end

function 取进阶神兽表(sj)
  local lb = {"进阶超级玉兔","进阶超级土地公公","进阶超级神鸡","进阶超级神猴","进阶超级神狗","进阶超级神猪","进阶超级神鼠","进阶超级猪小戒","进阶超级小白龙",
  "进阶超级飞天","进阶超级人参娃娃","进阶超级泡泡","进阶超级大熊猫","进阶超级金猴","进阶超级大象","进阶超级白泽","进阶超级灵鹿","进阶超级赤焰兽","进阶超级大鹏",
  "进阶超级筋斗云","进阶超级神牛","进阶超级神虎","进阶超级海豚","进阶超级神虎","进阶超级海豚","进阶超级神兔","进阶超级神龙","进阶超级腾蛇","进阶超级孔雀",
  "进阶超级灵狐","进阶超级神蛇","进阶超级神马","进阶超级青鸾","进阶超级麒麟","进阶超级神羊","进阶超级六耳猕猴","进阶超级鲲鹏","进阶超级飞廉","进阶超级红孩儿","进阶超级神柚"}
  local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
	  fhz = true
	end
  end
  return fhz
end

function 取神兽表(sj)
  local lb = {"超级玉兔","超级土地公公","超级神鸡","超级神猴","超级神狗","超级神猪","超级神鼠","超级猪小戒","超级小白龙","超级飞天","超级人参娃娃","超级泡泡","超级大熊猫",
  "超级金猴","超级大象","超级白泽","超级灵鹿","超级赤焰兽","超级大鹏","超级筋斗云","超级神牛","超级神虎","超级海豚","超级神虎","超级海豚","超级神兔","超级神龙",
  "超级腾蛇","超级孔雀","超级灵狐","超级神蛇","超级神马","超级青鸾","超级麒麟","超级神羊","超级六耳猕猴","超级鲲鹏","超级飞廉","超级红孩儿","超级神柚"}
  local fhz = false
  for i=1,#lb do
	if lb[i] == sj then
	  fhz = true
	end
  end
  return fhz
end

function 取随机普通神兽()
	local 随机神兽 = {"超级六耳猕猴","超级神龙","超级青鸾","超级玉兔","超级白泽","超级泡泡","超级赤焰兽","超级神牛","超级神虎","超级海豚","超级人参娃娃","超级大熊猫","超级金猴",
		"超级大象","超级灵鹿","超级大鹏","超级筋斗云","超级神兔","超级灵狐","超级神蛇","超级神马","超级麒麟","超级飞天","超级神羊","超级孔雀","超级神猴","超级神鸡","超级小白龙","超级土地公公","超级飞廉","超级红孩儿","超级神柚"}
	return 随机神兽[取随机数(1,#随机神兽)]
end


-- function 取内丹数量(lv)
-- 	-- print(lv)
-- 	if not lv then
-- 	    --do
-- 	end
-- 	if lv<35 then
-- 		return 1
-- 	elseif lv>=35 and lv<75 then
-- 		return 2
-- 	elseif lv>=75 and lv<105 then
-- 		return 3
-- 	elseif lv>=105 and lv<145 then
-- 		return 4
-- 	elseif lv>=145 and lv<175 then
-- 		return 5
-- 	else
-- 		return 6
-- 	end
-- end



function 取内丹数量(lv)--因参战等级没有修改与官方一致,暂时全6
	if not lv then
	end
	if lv>=0 then
		return 6
	end
end


function 取神兽技能(bb,物法,dingzhi)
	local fh
	if 物法=="物理型（单点爆伤）" then
		if bb=="超级神牛" then
			fh = {"力劈华山","高级幸运","高级招架","高级必杀","高级强力"}
		elseif bb=="超级神虎" then
			fh = {"高级感知","嗜血追击","高级夜战","高级连击","高级强力"}
		elseif bb=="超级神兔" then
			fh = {"高级连击","高级偷袭","高级敏捷","高级夜战","高级幸运"}
		elseif bb=="超级神龙" then
			fh = {"高级必杀","高级驱鬼","高级夜战","高级幸运","高级强力"}
		elseif bb=="超级神蛇" then
			fh = {"高级连击","高级毒","高级夜战","高级偷袭","高级敏捷"}
		elseif bb=="超级泡泡" then
			fh = {"高级神佑复生","高级必杀","高级感知","高级夜战","高级飞行"}
		elseif bb=="超级大熊猫" then
			fh = {"高级连击","高级防御","高级感知","高级夜战","高级强力"}
		elseif bb=="超级大象" then
			fh = {"高级强力","高级反震","高级再生","高级夜战","高级必杀"}
		elseif bb=="超级金猴" then
			fh = {"高级偷袭","高级敏捷","高级幸运","高级夜战","高级连击"}
		elseif bb=="超级灵鹿" then
			fh = {"善恶有报","高级冥思","高级再生","高级永恒","高级偷袭"}
		elseif bb=="超级白泽" then
			fh = {"高级必杀","高级敏捷","高级夜战","高级感知","高级幸运"}
		elseif bb=="超级赤焰兽" then
			fh = {"高级必杀","高级反击","高级感知","高级毒","高级幸运"}
		elseif bb=="超级神猴" then
			fh = {"高级神佑复生","高级吸血","大快朵颐","必杀","连击"}
		elseif bb=="超级神鸡" then
			fh = {"高级神佑复生","高级强力","从天而降","高级夜战","高级必杀"}
		elseif bb=="超级神狗" then
			fh = {"高级独行","高级神佑复生","理直气壮","高级强力","高级再生"}
		elseif bb=="超级神猪" then
			fh = {"高级神佑复生","高级防御","津津有味","高级幸运","高级再生"}
		elseif bb=="超级麒麟" then
			fh = {"高级合纵","高级连击","高级幸运","高级偷袭","高级夜战"}
		elseif bb=="超级青鸾" then
			fh = {"苍鸾怒击","高级夜战","高级飞行","高级反震","高级连击"}
		elseif bb=="超级筋斗云" then
			fh = {"高级神佑复生","高级偷袭","高级敏捷","高级强力","高级夜战"}
		elseif bb=="超级六耳猕猴" then
			fh = {"高级连击","高级敏捷","高级招架","高级幸运","高级偷袭"}
		elseif bb=="超级灵狐" then
			fh = {"惊心一剑","高级敏捷","高级必杀","高级夜战","高级偷袭"}
		elseif bb=="超级土地公公" then
			fh = {"高级敏捷","高级必杀","高级神佑复生","高级夜战","高级连击"}
		elseif bb=="超级海豚" then
			fh = {"剑荡四方","高级必杀","高级偷袭","高级夜战","高级幸运"}
		elseif bb=="超级人参娃娃" then
			fh = {"壁垒击破","高级必杀","高级强力","高级幸运","高级驱鬼"}
		elseif bb=="超级大鹏" then
			fh = {"高级飞行","高级敏捷","高级神佑复生","高级必杀","高级偷袭"}
		elseif bb=="超级玉兔" then
			fh = {"高级夜战","高级敏捷","高级偷袭","高级连击","高级感知"}
		elseif bb=="超级猪小戒" then
			fh = {"高级必杀","高级强力","高级防御","高级偷袭","高级反击"}
  --  elseif bb=="超级飞廉" then
	--		fh = {"高级偷袭","高级敏捷","高级必杀","夜战","迅风出击"}
		elseif bb=="超级飞廉" then
			fh = {"高级偷袭","高级敏捷","高级必杀","高级夜战","净台妙谛"}
		elseif bb=="超级红孩儿" then
			fh = {"高级必杀","高级连击","高级神迹","高级感知","高级夜战"}
		elseif bb=="超级孔雀" then
			fh = {"高级飞行","高级偷袭","高级再生","高级必杀","高级连击"}
		elseif bb=="超级小白龙" then
			fh = {"高级必杀","高级反击","高级再生","高级感知","高级夜战"}
		elseif bb=="超级神鼠" then
			fh = {"昼伏夜出","神出鬼没","溜之大吉","高级偷袭","高级吸血"}
		elseif bb=="超级鲲鹏" then
			fh = {"北冥之渊","水击三千","高级必杀","高级偷袭","高级神佑复生","逍遥游","高级夜战","高级再生","高级防御"}
		elseif bb=="超级神马" then
			fh = {"高级连击","高级神佑复生","浮云神马","高级幸运","高级神迹"}
		elseif bb=="超级神羊" then
			fh = {"高级必杀","高级连击","千钧一怒","高级反震","高级感知"}
		elseif bb=="超级腾蛇" then
			fh = {"高级连击","高级毒","高级夜战","高级偷袭","高级敏捷"}
		elseif bb=="超级神柚" then
			fh = {"超级神柚复生","高级必杀","高级偷袭","高级夜战","高级连击"}
		elseif bb=="超级飞天" then
			fh = {"高级连击","高级飞行","高级敏捷","高级夜战","高级神佑复生"}
		end

	else--if 物法=="法术型（秒伤）" then
		if bb=="超级神牛" then
			fh = {"高级法术波动","高级法术连击","奔雷咒","高级冥思","高级魔之心"}
		elseif bb=="超级神虎" then
			fh = {"高级法术暴击","高级驱鬼","地狱烈火","高级法术波动","高级魔之心"}
		elseif bb=="超级神兔" then
			fh = {"高级法术连击","高级反震","奔雷咒","高级魔之心","高级感知"}
		elseif bb=="超级神龙" then
			fh = {"高级法术波动","龙魂","奔雷咒","高级魔之心","高级再生"}
		elseif bb=="超级神蛇" then
			fh = {"灵能激发","地狱烈火","高级法术波动","高级魔之心","高级永恒"}
		elseif bb=="超级泡泡" then
			fh = {"高级慧根","高级魔之心","奔雷咒","高级法术波动","高级感知"}
		elseif bb=="超级大熊猫" then
			fh = {"高级冥思","高级魔之心","奔雷咒","高级法术波动","高级法术连击"}
		elseif bb=="超级大象" then
			fh = {"高级神迹","高级魔之心","奔雷咒","高级法术波动","高级法术连击"}
		elseif bb=="超级金猴" then
			fh = {"高级精神集中","高级魔之心","奔雷咒","高级法术波动","高级法术连击"}
		elseif bb=="超级灵鹿" then
			fh = {"泰山压顶","高级法术连击","高级法术暴击","上古灵符","高级再生"}
		elseif bb=="超级白泽" then
			fh = {"水漫金山","高级魔之心","高级法术暴击","上古灵符","高级反震"}
		elseif bb=="超级赤焰兽" then
			fh = {"地狱烈火","高级冥思","八凶法阵","高级魔之心","高级法术暴击"}
		elseif bb=="超级神羊" then
			fh = {"奔雷咒","高级法术波动","高级魔之心","高级法术暴击","高级驱鬼"}
		elseif bb=="超级神猴" then
			fh = {"奔雷咒","高级法术波动","高级法术连击","高级魔之心","高级法术暴击"}
		elseif bb=="超级神鸡" then
			fh = {"地狱烈火","高级法术波动","高级感知","高级招架","高级魔之心"}
		elseif bb=="超级神狗" then
			fh = {"地狱烈火","高级招架","高级防御","高级法术暴击","高级魔之心"}
		elseif bb=="超级神猪" then
			fh = {"地狱烈火","高级魔之心","高级法术暴击","高级招架","高级驱鬼"}
		elseif bb=="超级麒麟" then
			fh = {"泰山压顶","高级魔之心","高级驱鬼","高级感知","高级法术连击"}
		elseif bb=="超级青鸾" then
			fh = {"高级幸运","奔雷咒","高级魔之心","高级法术暴击","高级神佑复生"}
		elseif bb=="超级筋斗云" then
			fh = {"高级法术连击","高级感知","高级反震","奔雷咒","高级魔之心"}
		elseif bb=="超级六耳猕猴" then
			fh = {"须弥真言","上古灵符","高级法术连击","高级永恒","高级法术暴击"}
		elseif bb=="超级灵狐" then
			fh = {"高级法术暴击","高级感知","奔雷咒","高级法术连击","高级魔之心"}
		elseif bb=="超级土地公公" then
			fh = {"天降灵葫","高级法术连击","高级神佑复生","高级招架","高级魔之心"}
		elseif bb=="超级海豚" then
			fh = {"水漫金山","高级法术暴击","高级魔之心","高级慧根","高级感知"}
		elseif bb=="超级人参娃娃" then
			fh = {"泰山压顶","高级法术波动","高级冥思","高级魔之心","高级法术连击"}
		elseif bb=="超级大鹏" then
			fh = {"奔雷咒","高级法术波动","高级法术暴击","高级冥思","高级招架"}
		elseif bb=="超级玉兔" then
			fh = {"月光","高级法术暴击","高级法术波动","高级驱鬼","高级神佑复生"}
		elseif bb=="超级猪小戒" then
			fh = {"食指大动","高级魔之心","高级感知","高级法术连击","法术波动"}
		elseif bb=="超级孔雀" then
			fh = {"高级魔之心","高级神佑复生","奔雷咒","高级幸运","高级法术暴击"}
		elseif bb=="超级小白龙" then
			fh = {"高级法术连击","高级法术暴击","叱咤风云","高级永恒","高级神佑复生"}
		elseif bb=="超级神鼠" then
			fh = {"奔雷咒","高级慧根","高级再生","高级魔之心","高级法术波动"}
		elseif bb=="超级飞廉" then
			fh = {"高级法术暴击","高级法术连击","奔雷咒","高级法术波动","高级慧根"}
		elseif bb=="超级红孩儿" then
			fh = {"高级魔之心","超级三昧真火","桀骜自恃","圣婴大王","高级敏捷"}
    elseif bb=="超级神柚" then
			fh = {"高级魔之心","水漫金山","高级法术波动","高级法术暴击","高级神佑复生"}
		elseif bb=="超级鲲鹏" then
			fh = {"北冥之渊","扶摇万里","高级魔之心","高级法术暴击","高级神佑复生","逍遥游","高级精神集中","高级法术波动","高级法术连击"}
		elseif bb=="超级神马" then
			fh = {"高级魔之心","高级法术连击","奔雷咒","高级法术暴击","高级慧根"}
		elseif bb=="超级腾蛇" then
			fh = {"灵能激发","地狱烈火","高级法术波动","高级魔之心","高级永恒"}
		elseif bb=="超级神柚" then
			fh = {"超级神柚复生","水漫金山","高级魔之心","高级法术波动","高级法术暴击"}
		elseif bb=="超级飞天" then
			fh = {"流沙轻音","净台妙谛","高级法术暴击","高级幸运","高级法术波动"}
		end
	end
	return fh
end

Qubaobao={}
Qubaobao["老虎"]={
      bbs_1 = 15
    ,bbs_2 = 1380
    ,bbs_3 = 1080
    ,bbs_4 = 3600
    ,bbs_5 = 1380
    ,bbs_6 = 1200
    ,bbs_7 = 1080
    ,bbs_8 = {1.004,1.014,1.025,1.135,1.145}
    ,bbs_9 = {"连击","驱鬼","幸运","强力"}
    }
Qubaobao["白熊"]={
      bbs_1 = 45
    ,bbs_2 = 1320
    ,bbs_3 = 1320
    ,bbs_4 = 5280
    ,bbs_5 = 1800
    ,bbs_6 = 960
    ,bbs_7 = 1380
    ,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
    ,bbs_9 = {"迟钝","强力","防御","高级反击","高级必杀"}
    }
  Qubaobao["虾兵"]={
      bbs_1 = 25
    ,bbs_2 = 1200
    ,bbs_3 = 1380
    ,bbs_4 = 4800
    ,bbs_5 = 2400
    ,bbs_6 = 1080
    ,bbs_7 = 1440
    ,bbs_8 = {1.014,1.024,1.035,1.045,1.055}
    ,bbs_9 = {"高级反击","高级必杀","驱鬼","水属性吸收"}
    }
    Qubaobao["狼"]={
      bbs_1 = 25
    ,bbs_2 = 1440
    ,bbs_3 = 960
    ,bbs_4 = 3600
    ,bbs_5 = 1200
    ,bbs_6 = 1500
    ,bbs_7 = 1464
    ,bbs_8 = {0.999,1.009,1.02,1.03,1.04}
    ,bbs_9 = {"高级连击","驱鬼","连击","偷袭","夜战"}
    }
  Qubaobao["噬天虎"]={
      bbs_1 = 125
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 2400
    ,bbs_6 = 1500
    ,bbs_7 = 1560
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级连击","驱鬼","幸运","高级强力"}
    }
  Qubaobao["雨师"]={
      bbs_1 = 65
    ,bbs_2 = 1200
    ,bbs_3 = 1380
    ,bbs_4 = 4200
    ,bbs_5 = 3000
    ,bbs_6 = 1440
    ,bbs_7 = 1620
    ,bbs_8 = {1.156,1.168,1.18,1.191,1.203}
    ,bbs_9 = {"水攻","高级雷属性吸收","高级水属性吸收","高级土属性吸收","高级火属性吸收"}
    }
  Qubaobao["牛头"]={
      bbs_1 = 35
    ,bbs_2 = 1320
    ,bbs_3 = 1320
    ,bbs_4 = 3600
    ,bbs_5 = 1800
    ,bbs_6 = 1440
    ,bbs_7 = 1200
    ,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
    ,bbs_9 = {"驱鬼","高级必杀","招架","高级鬼魂术","夜战"}
    }
  Qubaobao["骷髅怪"]={
      bbs_1 = 15
    ,bbs_2 = 1200
    ,bbs_3 = 1200
    ,bbs_4 = 3000
    ,bbs_5 = 1200
    ,bbs_6 = 1200
    ,bbs_7 = 1500
    ,bbs_8 = {1.009,1.019,1.03,1.040,1.05}
    ,bbs_9 = {"土属性吸收","弱点雷","鬼魂术","夜战"}
    }
  Qubaobao["修罗傀儡鬼"]={
      bbs_1 = 155
    ,bbs_2 = 1524
    ,bbs_3 = 1380
    ,bbs_4 = 5040
    ,bbs_5 = 2400
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"高级夜战","反震","高级必杀","强力","嗜血追击"}
    }
  Qubaobao["树怪"]={
      bbs_1 = 5
    ,bbs_2 = 1320
    ,bbs_3 = 1320
    ,bbs_4 = 3300
    ,bbs_5 = 1320
    ,bbs_6 = 900
    ,bbs_7 = 960
    ,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
    ,bbs_9 = {"反击","感知","驱鬼","再生","弱点火","迟钝"}
    }
  Qubaobao["羊头怪"]={
      bbs_1 = 15
    ,bbs_2 = 1260
    ,bbs_3 = 1380
    ,bbs_4 = 3360
    ,bbs_5 = 1320
    ,bbs_6 = 1200
    ,bbs_7 = 1200
    ,bbs_8 = {1.004,1.014,1.025,1.035,1.045}
    ,bbs_9 = {"连击","必杀","幸运","永恒"}
    }
  Qubaobao["海毛虫"]={
      bbs_1 = 5
    ,bbs_2 = 1440
    ,bbs_3 = 900
    ,bbs_4 = 2400
    ,bbs_5 = 1200
    ,bbs_6 = 1320
    ,bbs_7 = 1200
    ,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
    ,bbs_9 = {"毒","高级反震","必杀","夜战","弱点火"}
    }
  Qubaobao["野猪"]={
      bbs_1 = 5
    ,bbs_2 = 1140
    ,bbs_3 = 1140
    ,bbs_4 = 3840
    ,bbs_5 = 1260
    ,bbs_6 = 1140
    ,bbs_7 = 1200
    ,bbs_8 = {0.999,1.009,1.02,1.03,1.04}
    ,bbs_9 = {"感知","高级感知","高级幸运","强力","弱点土","弱点火"}
    }
  Qubaobao["天兵"]={
      bbs_1 = 55
    ,bbs_2 = 1320
    ,bbs_3 = 1500
    ,bbs_4 = 5100
    ,bbs_5 = 2220
    ,bbs_6 = 1320
    ,bbs_7 = 1320
    ,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
    ,bbs_9 = {"高级防御","高级感知","必杀","高级驱鬼"}
     ,bbs_10 = {"必杀"}
    }
  Qubaobao["野猪精"]={
      bbs_1 = 85
    ,bbs_2 = 1464
    ,bbs_3 = 1560
    ,bbs_4 = 4800
    ,bbs_5 = 2400
    ,bbs_6 = 1200
    ,bbs_7 = 1320
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"反击","感知","弱点水","高级强力"}
    }
  Qubaobao["灵灯侍者"]={
      bbs_1 = 175
    ,bbs_2 = 1404
    ,bbs_3 = 1524
    ,bbs_4 = 5760
    ,bbs_5 = 2760
    ,bbs_6 = 1536
    ,bbs_7 = 1440
    ,bbs_8 = {1.264,1.277,1.29,1.3,1.31}
    ,bbs_9 = {"无畏布施","防御","雷击","高级慧根","高级雷属性吸收"}
    }
  Qubaobao["赌徒"]={
      bbs_1 = 5
    ,bbs_2 = 1020
    ,bbs_3 = 1140
    ,bbs_4 = 3000
    ,bbs_5 = 1440
    ,bbs_6 = 1440
    ,bbs_7 = 1380
    ,bbs_8 = {0.931,0.94,0.95,0.959,0.969}
    ,bbs_9 = {}
  	}
  Qubaobao["野鬼"]={
      bbs_1 = 35
    ,bbs_2 = 1320
    ,bbs_3 = 1320
    ,bbs_4 = 4200
    ,bbs_5 = 1200
    ,bbs_6 = 1140
    ,bbs_7 = 1260
    ,bbs_8 = {0.994,1.004,1.015,1.025,1.035}
    ,bbs_9 = {"落岩","土属性吸收","鬼魂术","夜战"}
    }
  Qubaobao["修罗傀儡妖"]={
      bbs_1 = 165
    ,bbs_2 = 1536
    ,bbs_3 = 1380
    ,bbs_4 = 4800
    ,bbs_5 = 2400
    ,bbs_6 = 1500
    ,bbs_7 = 1440
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"合纵","感知","高级幸运","高级连击"}
    }
  Qubaobao["连弩车"]={
      bbs_1 = 145
    ,bbs_2 = 1500
    ,bbs_3 = 1560
    ,bbs_4 = 5400
    ,bbs_5 = 2400
    ,bbs_6 = 1200
    ,bbs_7 = 1320
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级强力","防御","连击","迟钝"}
    }
  Qubaobao["黑熊精"]={
      bbs_1 = 35
    ,bbs_2 = 1380
    ,bbs_3 = 1260
    ,bbs_4 = 5040
    ,bbs_5 = 2160
    ,bbs_6 = 1020
    ,bbs_7 = 1320
    ,bbs_8 = {1.024,1.034,1.045,1.055,1.065}
    ,bbs_9 = {"反震","必杀","高级强力","弱点雷"}
    }
  Qubaobao["金身罗汉"]={
      bbs_1 = 165
    ,bbs_2 = 1380
    ,bbs_3 = 1500
    ,bbs_4 = 5400
    ,bbs_5 = 2400
    ,bbs_6 = 1560
    ,bbs_7 = 1440
    ,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
    ,bbs_9 = {"永恒","高级反震","神佑复生","盾气","高级敏捷"}
    }
  Qubaobao["犀牛将军人形"]={
      bbs_1 = 75
    ,bbs_2 = 1440
    ,bbs_3 = 1464
    ,bbs_4 = 4800
    ,bbs_5 = 2520
    ,bbs_6 = 1200
    ,bbs_7 = 1140
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"高级强力","高级幸运","剑荡四方","再生"}
    }
  Qubaobao["大海龟"]={
      bbs_1 = 0
    ,bbs_2 = 960
    ,bbs_3 = 960
    ,bbs_4 = 3600
    ,bbs_5 = 1200
    ,bbs_6 = 840
    ,bbs_7 = 1320
    ,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
    ,bbs_9 = {"反震","慧根","幸运","水属性吸收","防御"}
    }
  Qubaobao["曼珠沙华"]={
      bbs_1 = 165
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 2640
    ,bbs_6 = 1500
    ,bbs_7 = 1440
    ,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
    ,bbs_9 = {"高级招架","招架","反震","高级法术抵抗","高级再生"}
    }
  Qubaobao["长眉灵猴"]={
      bbs_1 = 155
    ,bbs_2 = 1440
    ,bbs_3 = 1500
    ,bbs_4 = 5640
    ,bbs_5 = 3240
    ,bbs_6 = 1200
    ,bbs_7 = 1560
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"奔雷咒","高级法术暴击","冥思","高级再生"}
    }
  Qubaobao["护卫"]={
      bbs_1 = 0
    ,bbs_2 = 1140
    ,bbs_3 = 1020
    ,bbs_4 = 2700
    ,bbs_5 = 1800
    ,bbs_6 = 1200
    ,bbs_7 = 1200
    ,bbs_8 = {0.931,0.94,0.95,0.959,0.969}
    ,bbs_9 = {"反击","必杀","强力"}
    }
  Qubaobao["巨力神猿"]={
      bbs_1 = 155
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 2640
    ,bbs_6 = 1500
    ,bbs_7 = 1560
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"敏捷","高级盾气","高级连击","强力","高级驱鬼"}
    }
  Qubaobao["章鱼"]={
      bbs_1 = 0
    ,bbs_2 = 1440
    ,bbs_3 = 840
    ,bbs_4 = 2400
    ,bbs_5 = 1200
    ,bbs_6 = 1320
    ,bbs_7 = 1200
    ,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
    ,bbs_9 = {"连击","毒","吸血","水属性吸收","弱点火"}
    }
  Qubaobao["藤蔓妖花"]={
      bbs_1 = 155
    ,bbs_2 = 1464
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 3120
    ,bbs_6 = 1200
    ,bbs_7 = 1440
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"灵能激发","落岩","高级招架","高级法术连击"}
    }
  Qubaobao["金铙僧"]={
      bbs_1 = 125
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 5040
    ,bbs_5 = 2280
    ,bbs_6 = 1440
    ,bbs_7 = 1560
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"再生","必杀","招架","偷袭","高级雷属性吸收"}
    }
  Qubaobao["大力金刚"]={
      bbs_1 = 125
    ,bbs_2 = 1548
    ,bbs_3 = 1334
    ,bbs_4 = 6000
    ,bbs_5 = 2640
    ,bbs_6 = 1200
    ,bbs_7 = 1320
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级强力","泰山压顶","力劈华山","高级永恒"}
    }
  Qubaobao["花妖"]={
      bbs_1 = 15
    ,bbs_2 = 1020
    ,bbs_3 = 1440
    ,bbs_4 = 3780
    ,bbs_5 = 1440
    ,bbs_6 = 1140
    ,bbs_7 = 1140
    ,bbs_8 = {1.029,1.039,1.05,1.06,1.071}
    ,bbs_9 = {"感知","慧根","落岩","防御","水属性吸收"}
    }
  Qubaobao["蜃气妖"]={
      bbs_1 = 155
    ,bbs_2 = 1464
    ,bbs_3 = 1440
    ,bbs_4 = 5040
    ,bbs_5 = 3240
    ,bbs_6 = 1320
    ,bbs_7 = 1440
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"高级法术连击","雷击","法术暴击","上古灵符"}
    }
  Qubaobao["猫灵人形"]={
      bbs_1 = 155
    ,bbs_2 = 1524
    ,bbs_3 = 1464
    ,bbs_4 = 4560
    ,bbs_5 = 2640
    ,bbs_6 = 1500
    ,bbs_7 = 1680
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"必杀","高级幸运","高级偷袭","反击","敏捷"}
    ,bbs_10 = {"必杀","反击","敏捷"}
    }
  Qubaobao["蚌精"]={
      bbs_1 = 65
    ,bbs_2 = 1200
    ,bbs_3 = 1500
    ,bbs_4 = 3840
    ,bbs_5 = 2880
    ,bbs_6 = 1200
    ,bbs_7 = 1140
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
    ,bbs_9 = {"水攻","慧根","高级水属性吸收","神迹","冥思"}
    }
  Qubaobao["机关兽"]={
      bbs_1 = 145
    ,bbs_2 = 1440
    ,bbs_3 = 1500
    ,bbs_4 = 5280
    ,bbs_5 = 2880
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"魔之心","高级法术连击","土属性吸收","烈火"}
    }
  Qubaobao["机关人人形"]={
      bbs_1 = 145
    ,bbs_2 = 1440
    ,bbs_3 = 1500
    ,bbs_4 = 5280
    ,bbs_5 = 2880
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"魔之心","高级法术连击","土属性吸收","烈火"}
    }
  Qubaobao["机关人车形"]={
      bbs_1 = 145
    ,bbs_2 = 1440
    ,bbs_3 = 1500
    ,bbs_4 = 5280
    ,bbs_5 = 2880
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"魔之心","高级法术连击","土属性吸收","烈火"}
    }
  Qubaobao["阴阳伞"]={
      bbs_1 = 95
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 3000
    ,bbs_6 = 1500
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"上古灵符","驱鬼","剑荡四方","高级飞行"}
    }
  Qubaobao["混沌兽"]={
      bbs_1 = 155
    ,bbs_2 = 1440
    ,bbs_3 = 1476
    ,bbs_4 = 5400
    ,bbs_5 = 3240
    ,bbs_6 = 1320
    ,bbs_7 = 1560
    ,bbs_8 = {1.244,1.257,1.27,1.282,1.295}
    ,bbs_9 = {"再生","高级慧根","高级永恒","高级魔之心","奔雷咒"}
    }
  Qubaobao["古代瑞兽"]={
      bbs_1 = 45
    ,bbs_2 = 1140
    ,bbs_3 = 1260
    ,bbs_4 = 3600
    ,bbs_5 = 2400
    ,bbs_6 = 1380
    ,bbs_7 = 1200
    ,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
    ,bbs_9 = {"高级神迹","高级反震","泰山压顶","高级驱鬼"}
    }
  Qubaobao["蛟龙"]={
      bbs_1 = 65
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 3000
    ,bbs_6 = 1200
    ,bbs_7 = 1320
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
    ,bbs_9 = {"水漫金山","感知","高级永恒","高级水属性吸收"}
    }
  Qubaobao["葫芦宝贝"]={
      bbs_1 = 135
    ,bbs_2 = 1440
    ,bbs_3 = 1500
    ,bbs_4 = 4800
    ,bbs_5 = 2760
    ,bbs_6 = 1320
    ,bbs_7 = 1800
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级冥思","上古灵符","反震","魔之心"}
    }
  Qubaobao["踏云兽"]={
      bbs_1 = 135
    ,bbs_2 = 1524
    ,bbs_3 = 1440
    ,bbs_4 = 5400
    ,bbs_5 = 1800
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级招架","高级必杀","高级强力","弱点土"}
    }
  Qubaobao["鬼将"]={
      bbs_1 = 105
    ,bbs_2 = 1524
    ,bbs_3 = 1380
    ,bbs_4 = 5040
    ,bbs_5 = 1440
    ,bbs_6 = 1320
    ,bbs_7 = 1320
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"惊心一剑","高级必杀","冥思","鬼魂术"}
    ,bbs_10 = {"冥思","鬼魂术"}
    }
  Qubaobao["狸"]={
      bbs_1 = 5
    ,bbs_2 = 1440
    ,bbs_3 = 900
    ,bbs_4 = 2880
    ,bbs_5 = 1200
    ,bbs_6 = 1380
    ,bbs_7 = 1320
    ,bbs_8 = {0.999,1.009,1.02,1.03,1.04}
    ,bbs_9 = {"招架","土属性吸收","幸运","敏捷"}
    }
  Qubaobao["狐狸精"]={
      bbs_1 = 15
    ,bbs_2 = 1320
    ,bbs_3 = 1260
    ,bbs_4 = 3000
    ,bbs_5 = 1440
    ,bbs_6 = 1320
    ,bbs_7 = 1200
    ,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
    ,bbs_9 = {"夜战","高级感知","慧根","高级慧根","弱点雷"}
    }
  Qubaobao["巨蛙"]={
      bbs_1 = 0
    ,bbs_2 = 1080
    ,bbs_3 = 840
    ,bbs_4 = 2700
    ,bbs_5 = 1200
    ,bbs_6 = 1320
    ,bbs_7 = 1020
    ,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
    ,bbs_9 = {"慧根","幸运","水攻","弱点火"}
    ,bbs_10 = {"弱点火"}
    }
  Qubaobao["山贼"]={
      bbs_1 = 5
    ,bbs_2 = 1080
    ,bbs_3 = 1200
    ,bbs_4 = 3600
    ,bbs_5 = 1200
    ,bbs_6 = 1200
    ,bbs_7 = 1320
    ,bbs_8 = {0.994,1.004,1.01,1.025,1.035}
    ,bbs_9 = {"招架","偷袭","强力","高级否定信仰"}
    }
  Qubaobao["海星"]={
      bbs_1 = 0
    ,bbs_2 = 1080
    ,bbs_3 = 1140
    ,bbs_4 = 2400
    ,bbs_5 = 1440
    ,bbs_6 = 1200
    ,bbs_7 = 1020
    ,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
    ,bbs_9 = {"水属性吸收","弱点火","慧根","高级反震","水攻"}
    }
  Qubaobao["小龙女"]={
      bbs_1 = 25
    ,bbs_2 = 1140
    ,bbs_3 = 1380
    ,bbs_4 = 3840
    ,bbs_5 = 1800
    ,bbs_6 = 1440
    ,bbs_7 = 1080
    ,bbs_8 = {1.043,1.054,1.065,1.075,1.086}
    ,bbs_9 = {"神佑复生","高级驱鬼","慧根","水攻","高级水属性吸收"}
    }
  Qubaobao["红萼仙子"]={
      bbs_1 = 135
    ,bbs_2 = 1500
    ,bbs_3 = 1500
    ,bbs_4 = 5400
    ,bbs_5 = 3000
    ,bbs_6 = 960
    ,bbs_7 = 1800
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"上古灵符","高级飞行","高级冥思","奔雷咒"}
    }
  Qubaobao["狸"]={
      bbs_1 = 5
    ,bbs_2 = 1440
    ,bbs_3 = 900
    ,bbs_4 = 2880
    ,bbs_5 = 1200
    ,bbs_6 = 1380
    ,bbs_7 = 1320
    ,bbs_8 = {0.999,1.009,1.02,1.03,1.04}
    ,bbs_9 = {"幸运","偷袭","必杀","招架"}
    }
  Qubaobao["风伯"]={
      bbs_1 = 55
    ,bbs_2 = 1380
    ,bbs_3 = 1392
    ,bbs_4 = 4200
    ,bbs_5 = 2220
    ,bbs_6 = 1500
    ,bbs_7 = 1440
    ,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
    ,bbs_9 = {"高级敏捷","奔雷咒","高级雷属性吸收","高级飞行"}
    }
  Qubaobao["大蝙蝠"]={
      bbs_1 = 5
    ,bbs_2 = 1080
    ,bbs_3 = 1140
    ,bbs_4 = 2520
    ,bbs_5 = 1800
    ,bbs_6 = 1500
    ,bbs_7 = 1500
    ,bbs_8 = {1.058,1.069,1.08,1.09,1.101}
    ,bbs_9 = {"吸血","高级感知","高级驱鬼","飞行","高级夜战","弱点水"}
    }
  Qubaobao["幽萤娃娃"]={
      bbs_1 = 105
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4200
    ,bbs_5 = 2640
    ,bbs_6 = 1536
    ,bbs_7 = 1560
    ,bbs_8 = {1.216,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级鬼魂术","高级防御","敏捷","高级法术抵抗"}
    }
  Qubaobao["强盗"]={
      bbs_1 = 5
    ,bbs_2 = 1260
    ,bbs_3 = 1260
    ,bbs_4 = 3300
    ,bbs_5 = 1380
    ,bbs_6 = 1200
    ,bbs_7 = 1200
    ,bbs_8 = {0.989,0.999,1.01,1.02,1.03}
    ,bbs_9 = {"连击","烈火","强力","否定信仰"}
    }
  Qubaobao["巴蛇"]={
      bbs_1 = 145
    ,bbs_2 = 1524
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 1560
    ,bbs_6 = 1560
    ,bbs_7 = 1560
    ,bbs_8 = {1.234,1.247,1.26,1.273,1.285}
    ,bbs_9 = {"敏捷","嗜血追击","感知","毒","再生"}
    }
  Qubaobao["机关鸟"]={
      bbs_1 = 145
    ,bbs_2 = 1500
    ,bbs_3 = 1344
    ,bbs_4 = 4800
    ,bbs_5 = 2520
    ,bbs_6 = 1560
    ,bbs_7 = 1560
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级偷袭","高级再生","否定信仰","飞行"}
    ,bbs_10 = {"飞行"}
    }
  Qubaobao["律法女娲"]={
      bbs_1 = 95
    ,bbs_2 = 1440
    ,bbs_3 = 1560
    ,bbs_4 = 4400
    ,bbs_5 = 2400
    ,bbs_6 = 1440
    ,bbs_7 = 1800
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"善恶有报","敏捷","再生","高级反击"}
    ,bbs_10 = {"再生"}
    }
  Qubaobao["猫灵兽形"]={
      bbs_1 = 135
    ,bbs_2 = 1464
    ,bbs_3 = 1464
    ,bbs_4 = 4080
    ,bbs_5 = 2400
    ,bbs_6 = 1560
    ,bbs_7 = 1680
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"必杀","敏捷","高级偷袭","弱点水"}
    }
  Qubaobao["镜妖"]={
      bbs_1 = 85
    ,bbs_2 = 1460
    ,bbs_3 = 1320
    ,bbs_4 = 3840
    ,bbs_5 = 2400
    ,bbs_6 = 1560
    ,bbs_7 = 1440
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"反震","高级感知","鬼魂术","雷击"}
    }
  Qubaobao["龙龟"]={
      bbs_1 = 135
    ,bbs_2 = 1440
    ,bbs_3 = 1560
    ,bbs_4 = 5760
    ,bbs_5 = 3000
    ,bbs_6 = 1200
    ,bbs_7 = 1560
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"水属性吸收","反震","高级防御","法术防御","水攻"}
    }

  Qubaobao["吸血鬼"]={
      bbs_1 = 95
    ,bbs_2 = 1440
    ,bbs_3 = 1320
    ,bbs_4 = 3600
    ,bbs_5 = 2400
    ,bbs_6 = 1320
    ,bbs_7 = 1800
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"偷袭","吸血","鬼魂术","驱鬼","弱点水"}
     ,bbs_10 = {"鬼魂术","驱鬼","弱点水"}
    }
  Qubaobao["地狱战神"]={
      bbs_1 = 55
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 4500
    ,bbs_5 = 1800
    ,bbs_6 = 1080
    ,bbs_7 = 1500
    ,bbs_8 = {1.107,1.118,1.13,1.141,1.152}
    ,bbs_9 = {"泰山压顶","高级连击","高级魔之心","高级反震"}
    }
  Qubaobao["琴仙"]={
      bbs_1 = 125
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 3240
    ,bbs_6 = 1380
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"泰山压顶","感知","神佑复生","再生","敏捷"}
    ,bbs_10 = {"敏捷","再生"}
    }
  Qubaobao["蛤蟆精"]={
      bbs_1 = 15
    ,bbs_2 = 1380
    ,bbs_3 = 1140
    ,bbs_4 = 3300
    ,bbs_5 = 1200
    ,bbs_6 = 1320
    ,bbs_7 = 1320
    ,bbs_8 = {1.009,1.019,1.03,1.04,1.05}
    ,bbs_9 = {"毒","必杀"}
    }
  Qubaobao["如意仙子"]={
      bbs_1 = 75
    ,bbs_2 = 1200
    ,bbs_3 = 1416
    ,bbs_4 = 4378
    ,bbs_5 = 2700
    ,bbs_6 = 1400
    ,bbs_7 = 1380
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"奔雷咒","地狱烈火","泰山压顶","烈火","弱点水"}
    }
  Qubaobao["锦毛貂精"]={
      bbs_1 = 75
    ,bbs_2 = 1200
    ,bbs_3 = 1260
    ,bbs_4 = 4200
    ,bbs_5 = 2711
    ,bbs_6 = 1560
    ,bbs_7 = 1680
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"冥思","泰山压顶","法术连击","敏捷"}
    }
  Qubaobao["雾中仙"]={
      bbs_1 = 125
    ,bbs_2 = 1440
    ,bbs_3 = 1500
    ,bbs_4 = 5400
    ,bbs_5 = 3000
    ,bbs_6 = 1320
    ,bbs_7 = 1800
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级神佑复生","高级感知","法术连击","敏捷"}
    ,bbs_10 = {"敏捷","法术连击"}
    }
  Qubaobao["灵鹤"]={
      bbs_1 = 125
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 2760
    ,bbs_6 = 1560
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级永恒","高级驱鬼","高级再生","高级慧根","飞行"}
    }
  Qubaobao["百足将军"]={
      bbs_1 = 85
    ,bbs_2 = 1440
    ,bbs_3 = 1320
    ,bbs_4 = 4560
    ,bbs_5 = 2640
    ,bbs_6 = 1560
    ,bbs_7 = 1320
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"毒","落岩","高级夜战","弱点水"}
    }
  Qubaobao["牛妖"]={
      bbs_1 = 25
    ,bbs_2 = 1500
    ,bbs_3 = 1020
    ,bbs_4 = 3000
    ,bbs_5 = 1140
    ,bbs_6 = 1320
    ,bbs_7 = 960
    ,bbs_8 = {1.078,1.089,1.1,1.111,1.122}
    ,bbs_9 = {"高级反击","高级慧根","高级防御","烈火"}
    }
  Qubaobao["黑山老妖"]={
      bbs_1 = 45
    ,bbs_2 = 1140
    ,bbs_3 = 1440
    ,bbs_4 = 6000
    ,bbs_5 = 2400
    ,bbs_6 = 960
    ,bbs_7 = 1320
    ,bbs_8 = {1.107,1.118,1.13,1.141,1.152}
    ,bbs_9 = {"高级偷袭","高级吸血","高级精神集中"}
    }
  Qubaobao["雷鸟人"]={
      bbs_1 = 45
    ,bbs_2 = 1200
    ,bbs_3 = 1200
    ,bbs_4 = 4200
    ,bbs_5 = 1920
    ,bbs_6 = 1440
    ,bbs_7 = 1140
    ,bbs_8 = {1.127,1.138,1.15,1.161,1.173}
    ,bbs_9 = {"高级雷属性吸收","奔雷咒","飞行","弱点土","雷击"}
    ,bbs_10 = {"飞行","弱点土","雷击"}
    }
  Qubaobao["芙蓉仙子"]={
      bbs_1 = 75
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 2400
    ,bbs_6 = 1380
    ,bbs_7 = 1440
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"高级再生","高级飞行","高级幸运"}
    ,bbs_10 = {"高级再生"}
    }
  Qubaobao["凤凰"]={
      bbs_1 = 65
    ,bbs_2 = 1200
    ,bbs_3 = 1440
    ,bbs_4 = 4200
    ,bbs_5 = 2400
    ,bbs_6 = 1560
    ,bbs_7 = 1320
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
    ,bbs_9 = {"地狱烈火","高级神佑复生","高级火属性吸收","飞行","薪火相传"}
    }
  Qubaobao["千年蛇魅"]={
      bbs_1 = 75
    ,bbs_2 = 1380
    ,bbs_3 = 1320
    ,bbs_4 = 4380
    ,bbs_5 = 2640
    ,bbs_6 = 1440
    ,bbs_7 = 1500
    ,bbs_8 = {1.195,1.207,1.22,1.232,1.244}
    ,bbs_9 = {"敏捷","毒","偷袭","高级吸血"}
    }
  Qubaobao["巡游天神"]={
      bbs_1 = 75
    ,bbs_2 = 1380
    ,bbs_3 = 1380
    ,bbs_4 = 5400
    ,bbs_5 = 2640
    ,bbs_6 = 1200
    ,bbs_7 = 1680
    ,bbs_8 = {1.195,1.207,1.22,1.232,1.244}
    ,bbs_9 = {"泰山压顶","地狱烈火","高级招架","高级必杀"}
    ,bbs_10 = {"高级招架"}
    }
  Qubaobao["兔子怪"]={
      bbs_1 = 35
    ,bbs_2 = 1320
    ,bbs_3 = 1140
    ,bbs_4 = 4200
    ,bbs_5 = 2400
    ,bbs_6 = 1440
    ,bbs_7 = 1140
    ,bbs_8 = {1.097,1.108,1.12,1.131,1.142}
    ,bbs_9 = {"高级感知","高级冥思","高级驱鬼","高级幸运","高级永恒","高级敏捷","弱点土"}
    }
  Qubaobao["黑熊"]={
      bbs_1 = 15
    ,bbs_2 = 1140
    ,bbs_3 = 1320
    ,bbs_4 = 4200
    ,bbs_5 = 1320
    ,bbs_6 = 1080
    ,bbs_7 = 1320
    ,bbs_8 = {1.004,1.014,1.025,1.135,1.045}
    ,bbs_9 = {"反击","必杀","强力","防御","迟钝"}
    }
  Qubaobao["狂豹兽形"]={
      bbs_1 = 135
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 2160
    ,bbs_6 = 1320
    ,bbs_7 = 1560
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级强力","夜战","高级飞行","偷袭"}
    }
  Qubaobao["灵符女娲"]={
      bbs_1 = 95
    ,bbs_2 = 1320
    ,bbs_3 = 1560
    ,bbs_4 = 4800
    ,bbs_5 = 3000
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"上古灵符","高级冥思","地狱烈火","落岩"}
    ,bbs_10 = {"落岩"}
    }
  Qubaobao["泡泡"]={
      bbs_1 = 0
    ,bbs_2 = 1320
    ,bbs_3 = 1380
    ,bbs_4 = 4200
    ,bbs_5 = 2160
    ,bbs_6 = 1320
    ,bbs_7 = 1320
    ,bbs_8 = {1.078,1.089,1.1,1.111,1.122}
    ,bbs_9 = {"高级防御","高级幸运","连击","精神集中","再生"}
    }
  Qubaobao["幽灵"]={
      bbs_1 = 95
    ,bbs_2 = 1476
    ,bbs_3 = 1440
    ,bbs_4 = 4200
    ,bbs_5 = 2640
    ,bbs_6 = 1320
    ,bbs_7 = 1680
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"高级反击","高级飞行","死亡召唤","鬼魂术"}
    }
  Qubaobao["泪妖"]={
      bbs_1 = 85
    ,bbs_2 = 1200
    ,bbs_3 = 1200
    ,bbs_4 = 3600
    ,bbs_5 = 2400
    ,bbs_6 = 1200
    ,bbs_7 = 1560
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
    ,bbs_9 = {"冥思","高级魔之心","法术暴击","弱点土","水攻"}
    ,bbs_10 = {"冥思","弱点土","水攻"}
    }
  Qubaobao["炎魔神"]={
      bbs_1 = 125
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 3000
    ,bbs_6 = 1440
    ,bbs_7 = 1320
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级必杀","高级火属性吸收","烈火","地狱烈火"}
    }
  Qubaobao["鼠先锋"]={
      bbs_1 = 85
    ,bbs_2 = 1200
    ,bbs_3 = 1440
    ,bbs_4 = 4440
    ,bbs_5 = 2880
    ,bbs_6 = 1560
    ,bbs_7 = 1560
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"驱鬼","冥思","泰山压顶","敏捷"}
    ,bbs_10 = {"敏捷"}
    }
  Qubaobao["夜罗刹"]={
      bbs_1 = 125
    ,bbs_2 = 1500
    ,bbs_3 = 1440
    ,bbs_4 = 5760
    ,bbs_5 = 2880
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"必杀","高级敏捷","高级魔之心","夜舞倾城"}
    }
  Qubaobao["星灵仙子"]={
      bbs_1 = 75
    ,bbs_2 = 1200
    ,bbs_3 = 1416
    ,bbs_4 = 4380
    ,bbs_5 = 2700
    ,bbs_6 = 1440
    ,bbs_7 = 1380
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"雷击","奔雷咒","水漫金山","高级慧根"}
    ,bbs_10 = {"雷击"}
    }
  Qubaobao["蜘蛛精"]={
      bbs_1 = 35
    ,bbs_2 = 1140
    ,bbs_3 = 1355
    ,bbs_4 = 4980
    ,bbs_5 = 2580
    ,bbs_6 = 1080
    ,bbs_7 = 1200
    ,bbs_8 = {1.068,1.079,1.09,1.1,1.111}
    ,bbs_9 = {"吸血","高级感知","高级毒","弱点土"}
    }
  Qubaobao["净瓶女娲"]={
      bbs_1 = 105
    ,bbs_2 = 1464
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 2880
    ,bbs_6 = 1560
    ,bbs_7 = 1560
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"上古灵符","奔雷咒","高级慧根"}
     ,bbs_10 = {"高级慧根"}
    }
  Qubaobao["鲛人"]={
      bbs_1 = 65
    ,bbs_2 = 1440
    ,bbs_3 = 1440
    ,bbs_4 = 4560
    ,bbs_5 = 1920
    ,bbs_6 = 1380
    ,bbs_7 = 1440
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
    ,bbs_9 = {"连击","高级水属性吸收","移花接木","敏捷"}
    }
  Qubaobao["天将"]={
      bbs_1 = 55
    ,bbs_2 = 1380
    ,bbs_3 = 1140
    ,bbs_4 = 4800
    ,bbs_5 = 2340
    ,bbs_6 = 1380
    ,bbs_7 = 1200
    ,bbs_8 = {1.136,1.148,1.16,1.171,1.183}
    ,bbs_9 = {"高级强力","驱鬼","连击","幸运"}
     ,bbs_10 = {"幸运"}
    }
  Qubaobao["龟丞相"]={
      bbs_1 = 35
    ,bbs_2 = 1020
    ,bbs_3 = 1440
    ,bbs_4 = 5820
    ,bbs_5 = 1980
    ,bbs_6 = 900
    ,bbs_7 = 1140
    ,bbs_8 = {1.038,1.049,1.06,1.07,1.081}
    ,bbs_9 = {"冥思","驱鬼","防御","水漫金山","水属性吸收","水攻"}
    }
  Qubaobao["蝎子精"]={
      bbs_1 = 135
    ,bbs_2 = 1464
    ,bbs_3 = 1464
    ,bbs_4 = 6240
    ,bbs_5 = 2880
    ,bbs_6 = 1320
    ,bbs_7 = 1800
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"高级反震","招架","高级再生","毒"}
    }
  Qubaobao["犀牛将军兽形"]={
      bbs_1 = 75
    ,bbs_2 = 1440
    ,bbs_3 = 1464
    ,bbs_4 = 4800
    ,bbs_5 = 2520
    ,bbs_6 = 1200
    ,bbs_7 = 1140
    ,bbs_8 = {1.205,1.217,1.23,1.242,1.254}
    ,bbs_9 = {"法术暴击","土属性吸收","法术波动","落岩"}
    }
  Qubaobao["僵尸"]={
      bbs_1 = 35
    ,bbs_2 = 1440
    ,bbs_3 = 1080
    ,bbs_4 = 4320
    ,bbs_5 = 2400
    ,bbs_6 = 1200
    ,bbs_7 = 1380
    ,bbs_8 = {1.048,1.059,1.07,1.08,1.091}
    ,bbs_9 = {"土属性吸收","弱点雷","防御","鬼魂术","夜战"}
    }
  Qubaobao["蝴蝶仙子"]={
      bbs_1 = 45
    ,bbs_2 = 1320
    ,bbs_3 = 1140
    ,bbs_4 = 3000
    ,bbs_5 = 3000
    ,bbs_6 = 1440
    ,bbs_7 = 1440
    ,bbs_8 = {1.078,1.089,1.1,1.111,1.122}
    ,bbs_9 = {"神迹","高级魔之心","高级敏捷","飞行"}
    }
  Qubaobao["马面"]={
      bbs_1 = 35
    ,bbs_2 = 1320
    ,bbs_3 = 1320
    ,bbs_4 = 3600
    ,bbs_5 = 1800
    ,bbs_6 = 1440
    ,bbs_7 = 1200
    ,bbs_8 = {1.048,1.059,1.07,1.08,1.091}
    ,bbs_9 = {"驱鬼","高级必杀","强力","高级鬼魂术","夜战"}
    }
  Qubaobao["蟹将"]={
      bbs_1 = 25
    ,bbs_2 = 1320
    ,bbs_3 = 1200
    ,bbs_4 = 5100
    ,bbs_5 = 2280
    ,bbs_6 = 1200
    ,bbs_7 = 1200
    ,bbs_8 = {1.025,1.035,1.046,1.056,1.066}
    ,bbs_9 = {"高级连击","精神集中","招架","水属性吸收"}
    }
  Qubaobao["画魂"]={
      bbs_1 = 105
    ,bbs_2 = 1380
    ,bbs_3 = 1440
    ,bbs_4 = 4320
    ,bbs_5 = 2880
    ,bbs_6 = 1320
    ,bbs_7 = 1440
    ,bbs_8 = {1.215,1.227,1.24,1.252,1.264}
    ,bbs_9 = {"高级鬼魂术","地狱烈火","幸运","高级魔之心"}
    ,bbs_10 = {"幸运"}
    }
  Qubaobao["碧水夜叉"]={
      bbs_1 = 65
    ,bbs_2 = 1380
    ,bbs_3 = 1320
    ,bbs_4 = 4200
    ,bbs_5 = 2760
    ,bbs_6 = 1440
    ,bbs_7 = 1800
    ,bbs_8 = {1.186,1.198,1.21,1.222,1.234}
    ,bbs_9 = {"高级反震","奔雷咒","强力","壁垒击破"}
    }
  Qubaobao["狂豹人形"]={
      bbs_1 = 155
    ,bbs_2 = 1536
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 2280
    ,bbs_6 = 1440
    ,bbs_7 = 1560
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"夜战","高级飞行","高级强力","偷袭","吸血"}
    ,bbs_10 = {"夜战","偷袭"}
    }
  Qubaobao["白豹"]={
      bbs_1 = 155
    ,bbs_2 = 1536
    ,bbs_3 = 1440
    ,bbs_4 = 4800
    ,bbs_5 = 2280
    ,bbs_6 = 1440
    ,bbs_7 = 1560
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"夜战","高级飞行","高级强力","偷袭","吸血"}
    }

  Qubaobao["小毛头"]={
      bbs_1 = 0
    ,bbs_2 = 960
    ,bbs_3 = 960
    ,bbs_4 = 3600
    ,bbs_5 = 1200
    ,bbs_6 = 840
    ,bbs_7 = 1320
    ,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
    ,bbs_9 = {"高级连击","高级防御","高级夜战","高级偷袭"}
    }
  Qubaobao["小丫丫"]={
      bbs_1 = 0
    ,bbs_2 = 960
    ,bbs_3 = 960
    ,bbs_4 = 3600
    ,bbs_5 = 1200
    ,bbs_6 = 840
    ,bbs_7 = 1320
    ,bbs_8 = {0.882,0.891,0.9,0.909,0.918}
    ,bbs_9 = {"高级连击","高级防御","高级夜战","高级偷袭"}
    }
  Qubaobao["毗舍童子"]={
      bbs_1 = 175
    ,bbs_2 = 1560
    ,bbs_3 = 1428
    ,bbs_4 = 4200
    ,bbs_5 = 2160
    ,bbs_6 = 1440
    ,bbs_7 = 1620
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}
    ,bbs_9 = {"高级合纵","敏捷","高级法术抵抗","连击","神迹"}
    ,bbs_10 = {"神迹","连击"}
    }

  Qubaobao["增长巡守"]={
      bbs_1 = 175
    ,bbs_2 = 1500
    ,bbs_3 = 1380
    ,bbs_4 = 6000
    ,bbs_5 = 2760
    ,bbs_6 = 1200
    ,bbs_7 = 960
    ,bbs_8 = {1.265,1.27,1.275,1.28,1.285}
    ,bbs_9 = {"灵山禅语","高级招架","驱鬼","神佑复生"}
    }
  Qubaobao["真陀护法"]={
      bbs_1 = 175
    ,bbs_2 = 1536
    ,bbs_3 = 1440
    ,bbs_4 = 5040
    ,bbs_5 = 2400
    ,bbs_6 = 1380
    ,bbs_7 = 1560
    ,bbs_8 = {1.226,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"高级精神集中","必杀","偷袭","吸血","连击"}
    }
  Qubaobao["般若天女"]={
      bbs_1 = 175
    ,bbs_2 = 1459
    ,bbs_3 = 1459
    ,bbs_4 = 5521
    ,bbs_5 = 3301
    ,bbs_6 = 1471
    ,bbs_7 = 1567
    ,bbs_8 = {1.226,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"高级飞行","高级幸运","敏捷","魔之心","高级慧根","上古灵符"}
    ,bbs_10 = {"敏捷","魔之心"}
    }
  Qubaobao["持国巡守"]={
      bbs_1 = 175
    ,bbs_2 = 1440
    ,bbs_3 = 1380
    ,bbs_4 = 6000
    ,bbs_5 = 3000
    ,bbs_6 = 1200
    ,bbs_7 = 960
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}
    ,bbs_9 = {"须弥真言","再生","奔雷咒","神佑复生"}
    ,bbs_10 = {"神佑复生","再生"}
    }
  --夜光修改 添加宝宝属性
  Qubaobao["谛听"]={
    bbs_1 = 175
    ,bbs_2 = 1464--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 6000--体资
    ,bbs_5 = 3240--法资
    ,bbs_6 = 1416--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}--成长组
    ,bbs_9 = {"高级驱鬼","泰山压顶","观照万象","落岩"}
    }--技能组
  Qubaobao["狐不归"]={
    bbs_1 = 105
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 2400--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"招架","冥思","敏捷","进击必杀","高级水属性吸收"}
    ,bbs_10 = {"招架","冥思"}
    }--技能组
  Qubaobao["花铃"]={
    bbs_1 = 55
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4560--体资
    ,bbs_5 = 3000--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}--成长组
    ,bbs_9 = {"高级防御","敏捷","高级幸运","地狱烈火"}
    ,bbs_10 = {"敏捷"}
    }--技能组
  Qubaobao["涂山雪"]={
    bbs_1 = 175
    ,bbs_2 = 1512--攻资
    ,bbs_3 = 1416--防资
    ,bbs_4 = 5040--体资
    ,bbs_5 = 2880--法资
    ,bbs_6 = 1380--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"冥思","高级防御","高级反震","高级神佑复生"}
    ,bbs_10 = {"冥思"}
    }--技能组
    Qubaobao["涂山瞳"]={
    bbs_1 = 175
    ,bbs_2 = 1512--攻资
    ,bbs_3 = 1416--防资
    ,bbs_4 = 5040--体资
    ,bbs_5 = 2880--法资
    ,bbs_6 = 1380--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"冥思","高级防御","高级反震","高级神佑复生"}
    ,bbs_10 = {"冥思"}
    }--技能组
       Qubaobao["进阶涂山瞳"]={
    bbs_1 = 175
    ,bbs_2 = 1512--攻资
    ,bbs_3 = 1416--防资
    ,bbs_4 = 5040--体资
    ,bbs_5 = 2880--法资
    ,bbs_6 = 1380--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"冥思","高级防御","高级反震","高级神佑复生"}
    }--技能组
  Qubaobao["月魅"]={
    bbs_1 = 125
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 5760--体资
    ,bbs_5 = 3000--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.214,1.226,1.239,1.251,1.263}--成长组
    ,bbs_9 = {"法术暴击","水攻","高级招架","法术连击","偷袭"}
    ,bbs_10 = {"水攻"}
    }--技能组
  Qubaobao["云游火"]={
    bbs_1 = 105
    ,bbs_2 = 1452--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 4440--体资
    ,bbs_5 = 2280--法资
    ,bbs_6 = 1320--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"高级合纵","敏捷","连击","否定信仰"}
    }--技能组
  Qubaobao["超级鲲鹏"]={
    bbs_1 = 0
    ,bbs_2 = 1550--攻资
    ,bbs_3 = 1482--防资
    ,bbs_4 = 6000--体资
    ,bbs_5 = 2027--法资
    ,bbs_6 = 1343--速资
    ,bbs_7 = 1396--躲避
    ,bbs_8 = {1.235,1.2475,1.26,1.2725,1.285}--成长组
    ,bbs_9 = {"扶摇万里","高级魔之心","高级法术暴击","高级神佑复生","逍遥游"}
    }--技能组

  Qubaobao["魔化毗舍童子"]={
    bbs_1 = 175
    ,bbs_2 = 1560--攻资
    ,bbs_3 = 1550--防资
    ,bbs_4 = 6000--体资
    ,bbs_5 = 3000--法资
    ,bbs_6 = 1500--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.235,1.2475,1.26,1.2725,1.285}--成长组
    ,bbs_9 = {"再生","连击","高级合纵","敏捷","高级法术抵抗"}
     ,bbs_10 = {"再生","连击"}
    }--技能组
  Qubaobao["雷龙"]={
    bbs_1 = 175
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1500--防资
    ,bbs_4 = 5040--体资
    ,bbs_5 = 2600--法资
    ,bbs_6 = 1200--速资
    ,bbs_7 = 1200--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"风起龙游","连击","驱鬼","高级反震","高级神迹"}
    }--技能组
  Qubaobao["执音"]={
    bbs_1 = 155
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1500--防资
    ,bbs_4 = 5400--体资
    ,bbs_5 = 3240--法资
    ,bbs_6 = 1320--速资
    ,bbs_7 = 1200--躲闪
    ,bbs_8 = {1.243,1.256,1.269,1.281,1.294}--成长组
    ,bbs_9 = {"飞行","地狱烈火","高级法术暴击","薪火相传","永恒"}
    ,bbs_10 = {"飞行","永恒"}
    }--技能组
  Qubaobao["妙华天女"]={
    bbs_1 = 175
    ,bbs_2 = 1423--攻资
    ,bbs_3 = 1423--防资
    ,bbs_4 = 5449--体资
    ,bbs_5 = 3433--法资
    ,bbs_6 = 1471--速资
    ,bbs_7 = 1567--躲资
    ,bbs_8 = {1.285,1.2875,1.29,1.2925,1.297}--成长组
    ,bbs_9 = {"凝光炼彩","高级永恒","冥思","再生"}
    ,bbs_10 = {"冥思","再生"}
    }--技能组
  Qubaobao["日游神"]={
    bbs_1 = 85
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1260--防资
    ,bbs_4 = 4200--体资
    ,bbs_5 = 2400--法资
    ,bbs_6 = 1380--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.185,1.197,1.21,1.222,1.234}--成长组
    ,bbs_9 = {"高级感知","强力","神迹","反击","盾气"}
    }--技能组
  Qubaobao["无常鬼差(白)"]={
    bbs_1 = 155
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 2880--法资
    ,bbs_6 = 1476--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"鬼魂术","敏捷","高级飞行","高级遗志"}
    }--技能组
  Qubaobao["无常鬼差(黑)"]={
    bbs_1 = 155
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 2880--法资
    ,bbs_6 = 1476--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"高级遗志","偷袭","毒","神佑复生"}
    }--技能组
  Qubaobao["玄珠灵仙"]={
    bbs_1 = 105
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 4320--体资
    ,bbs_5 = 2940--法资
    ,bbs_6 = 1464--速资
    ,bbs_7 = 1680--躲闪
    ,bbs_8 = {1.214,1.226,1.239,1.251,1.263}--成长组
    ,bbs_9 = {"高级魔之心","永恒","神佑复生","法术暴击","烈火"}
    ,bbs_10 = {"永恒","神佑复生"}
    }--技能组
  Qubaobao["夜游神"]={
    bbs_1 = 125
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4560--体资
    ,bbs_5 = 3000--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.214,1.226,1.239,1.251,1.263}--成长组
    ,bbs_9 = {"驱鬼","高级魔之心","神佑复生","法术暴击","烈火"}
     ,bbs_10 = {"驱鬼","神佑复生","法术暴击","烈火"}
    }--技能组
  Qubaobao["月灵"]={
    bbs_1 = 65
    ,bbs_2 = 1500 --攻资
    ,bbs_3 = 1500 --防资
    ,bbs_4 = 5500 --体资
    ,bbs_5 = 3000 --法资
    ,bbs_6 = 1500 --速资
    ,bbs_7 = 1500 --躲避
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"泰山压顶","夜舞倾城","高级魔之心","高级神佑复生"}
    }--技能组
  Qubaobao["独角鬼王"]={
    bbs_1 = 65
    ,bbs_2 = 1380--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4200--体资
    ,bbs_5 = 2760--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.155,1.167,1.179,1.19,1.202}--成长组
    ,bbs_9 = {"地狱烈火","驱鬼","法术暴击","盾气","鬼魂术"}
    }--技能组
  Qubaobao["沙暴"]={
    bbs_1 = 175
    ,bbs_2 = 1404--攻资
    ,bbs_3 = 1400--防资
    ,bbs_4 = 4200--体资
    ,bbs_5 = 2160--法资
    ,bbs_6 = 1380--速资
    ,bbs_7 = 1500--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"盾气","高级防御","招架","反击","法术抵抗"}
    }--技能组
  Qubaobao["超级恶魔泡泡"]={
    bbs_1 = 0
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1500--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 2000--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"高级偷袭","连击","高级吸血","必杀"}
    }--技能组
  Qubaobao["自在心猿"]={
    bbs_1 = 175
    ,bbs_2 = 1584--攻资
    ,bbs_3 = 1464--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 2160--法资
    ,bbs_6 = 1500--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}--成长组
    ,bbs_9 = {"驱鬼","高级敏捷","高级否定信仰","必杀","永恒"}
    }--技能组
  Qubaobao["觉醒涂山雪"]={
    bbs_1 = 175
    ,bbs_2 = 1519--攻资
    ,bbs_3 = 1419--防资
    ,bbs_4 = 5049--体资
    ,bbs_5 = 2889--法资
    ,bbs_6 = 1389--速资
    ,bbs_7 = 1329--躲闪
    ,bbs_8 = {1.238,1.251,1.264,1.276,1.289}--成长组
    ,bbs_9 = {"冥思","防御","高级否定信仰","高级精神集中"}
    }--技能组
  Qubaobao["有苏鸩"]={
    bbs_1 = 155
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3240--法资
    ,bbs_6 = 1320--速资
    ,bbs_7 = 1560--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"否定信仰","欣欣向荣","魔之心","高级毒"}
    ,bbs_10 = {"魔之心"}
    }--技能组
  Qubaobao["虬龙"]={
    bbs_1 = 105
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1400--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 1600--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1200--躲闪
    ,bbs_8 = {1.213,1.225,1.238,1.25,1.262}--成长组
    ,bbs_9 = {"嗜血追击","高级必杀","偷袭","高级反击"}
    ,bbs_10 = {"偷袭"}
    }--技能组
  Qubaobao["司雪"]={
    bbs_1 = 175
    ,bbs_2 = 1404--攻资
    ,bbs_3 = 1400--防资
    ,bbs_4 = 4080--体资
    ,bbs_5 = 2160--法资
    ,bbs_6 = 1200--速资
    ,bbs_7 = 1320--躲闪
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"水漫金山","高级法术连击","幸运","永恒"}
    ,bbs_10 = {"幸运","永恒"}
    }--技能组
  Qubaobao["幻姬"]={
    bbs_1 = 125
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 2160--法资
    ,bbs_6 = 1560--速资
    ,bbs_7 = 1440--躲闪
    ,bbs_8 = {1.213,1.225,1.238,1.25,1.262}--成长组
    ,bbs_9 = {"高级魔之心","高级冥思","飞行","薪火相传","鬼魂术"}
    ,bbs_10 = {"幸运","鬼魂术"}
    }--技能组
  -- Qubaobao["嘲风"]={
  --   bbs_1 = 65
  --   ,bbs_2 = 1500 --攻资
  --   ,bbs_3 = 1500 --防资
  --   ,bbs_4 = 5500 --体资
  --   ,bbs_5 = 3000 --法资
  --   ,bbs_6 = 1500 --速资
  --   ,bbs_7 = 1500 --躲避
  --   ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
  --   ,bbs_9 = {"高级永恒","高级冥思","反震","高级防御"}
  --   }--技能组

  Qubaobao["泡泡灵仙·剑侠客"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.3,1.3,1.3,1.3,1.3}--成长组
    ,bbs_9 = {"高级连击","偷袭","招架"}
    }--技能组
  Qubaobao["泡泡灵仙·骨精灵"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.3,1.3,1.3,1.3,1.3}--成长组
    ,bbs_9 = {"泰山压顶","法术波动","幸运"}
    }--技能组
  Qubaobao["泡泡灵仙·羽灵神"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.3,1.3,1.3,1.3,1.3}--成长组
    ,bbs_9 = {"高级必杀","强力","防御","凭风借力"}
    }--技能组
  Qubaobao["泡泡灵仙·神天兵"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.3,1.3,1.3,1.3,1.3}--成长组
    ,bbs_9 = {"高级偷袭","连击","强力","气贯长虹"}
    }--技能组
  Qubaobao["泡泡灵仙·巫蛮儿"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.249,1.262,1.275,1.287,1.3}--成长组
    ,bbs_9 = {"泰山压顶","魔之心","法术连击","柳暗花明"}
    }--技能组
  Qubaobao["泡泡灵仙·杀破狼"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.249,1.262,1.275,1.287,1.3}--成长组
    ,bbs_9 = {"高级幸运","再生","防御","与生俱来"}
    }--技能组
  Qubaobao["泡泡灵仙·飞燕女"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.249,1.262,1.275,1.287,1.3}--成长组
    ,bbs_9 = {"水漫金山","魔之心","冥思"}
    }--技能组
  Qubaobao["泡泡灵仙·龙太子"]={
    bbs_1 = 0
    ,bbs_2 = 1600--攻资
    ,bbs_3 = 1600--防资
    ,bbs_4 = 5500--体资
    ,bbs_5 = 3500--法资
    ,bbs_6 = 1400--速资
    ,bbs_7 = 1400--躲闪
    ,bbs_8 = {1.249,1.262,1.275,1.287,1.3}--成长组
    ,bbs_9 = {"水漫金山","魔之心","神佑复生","义薄云天"}
    }--技能组
  Qubaobao["超级红孩儿"]={
    bbs_1 = 0
    ,bbs_2 = 1500 --攻资
    ,bbs_3 = 1500 --防资
    ,bbs_4 = 5500 --体资
    ,bbs_5 = 3000 --法资
    ,bbs_6 = 1500 --速资
    ,bbs_7 = 1500 --躲避
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"超级三昧真火","魔之心","敏捷","法术连击","法术暴击"}
    }--技能组
  Qubaobao["超级飞廉"]={
    bbs_1 = 0
    ,bbs_2 = 1500 --攻资
    ,bbs_3 = 1500 --防资
    ,bbs_4 = 5500 --体资
    ,bbs_5 = 3000 --法资
    ,bbs_6 = 1500 --速资
    ,bbs_7 = 1500 --躲避
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"高级幸运","高级偷袭","高级敏捷"}
    }--技能组
  Qubaobao["超级离火兽"]={
    bbs_1 = 0
    ,bbs_2 = 1500 --攻资
    ,bbs_3 = 1500 --防资
    ,bbs_4 = 5500 --体资
    ,bbs_5 = 3000 --法资
    ,bbs_6 = 1500 --速资
    ,bbs_7 = 1500 --躲避
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"高级偷袭","高级飞行","高级毒","力劈华山"}
    }--技能组
  Qubaobao["超级神柚"]={
    bbs_1 = 0
    ,bbs_2 = 1500 --攻资
    ,bbs_3 = 1500 --防资
    ,bbs_4 = 5500 --体资
    ,bbs_5 = 3000 --法资
    ,bbs_6 = 1500 --速资
    ,bbs_7 = 1500 --躲避
    ,bbs_8 = {1.204,1.216,1.229,1.241,1.253}--成长组
    ,bbs_9 = {"超级神柚复生","高级驱鬼","高级连击","高级精神集中"}
    }--技能组
  Qubaobao["长乐灵仙"]={
    bbs_1 = 175
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 4080--体资
    ,bbs_5 = 2160--法资
    ,bbs_6 = 1440--速资
    ,bbs_7 = 1620--躲闪
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}--成长组
    ,bbs_9 = {"幸运","高级飞行","神佑复生","再生"}
    ,bbs_10 = {"幸运","再生","神佑复生"}
    }--技能组
  Qubaobao["司辰侍者(未来)"]={
    bbs_1 = 155
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1500--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 3240--法资
    ,bbs_7 = 1680--躲资
    ,bbs_6 = 1560--速资
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}--成长组
    ,bbs_9 = {"高级永恒","再生","飞行","慧根"}
    ,bbs_10 = {"再生","飞行","慧根"}
    }--技能组
  Qubaobao["司辰侍者(过去)"]={
    bbs_1 = 155
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1500--防资
    ,bbs_4 = 4800--体资
    ,bbs_5 = 3240--法资
    ,bbs_7 = 1680--躲资
    ,bbs_6 = 1560--速资
    ,bbs_8 = {1.234,1.247,1.26,1.272,1.285}--成长组
    ,bbs_9 = {"高级永恒","再生","飞行","慧根"}
    ,bbs_10 = {"再生","飞行","慧根"}
    }--技能组
  Qubaobao["司雨"]={
    bbs_1 = 175
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 4200--体资
    ,bbs_5 = 2160--法资
    ,bbs_7 = 1440--躲资
    ,bbs_6 = 1200--速资
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"偷袭","必杀","高级再生","强力"}
    ,bbs_10 = {"偷袭","必杀","强力"}
    }--技能组
  Qubaobao["司风"]={
    bbs_1 = 175
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 4080--体资
    ,bbs_5 = 2160--法资
    ,bbs_7 = 1500--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"敏捷","连击","高级飞行","高级强力"}
    ,bbs_10 = {"敏捷","连击"}
    }--技能组
  Qubaobao["多闻巡守"]={
    bbs_1 = 175
    ,bbs_2 = 1536--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 6000--体资
    ,bbs_5 = 2640--法资
    ,bbs_7 = 960--躲资
    ,bbs_6 = 1380--速资
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"无上正真","高级幸运","感知","神佑复生"}
    }--技能组
  Qubaobao["天机虫"]={
    bbs_1 = 0
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1200--防资
    ,bbs_4 = 2700--体资
    ,bbs_5 = 2100--法资
    ,bbs_7 = 1200--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {0.93,0.94,0.95,0.959,0.969}--成长组
    ,bbs_9 = {"高级否定信仰","偷袭","防御","夜战"}
    }--技能组

  Qubaobao["广目巡守"]={
    bbs_1 = 175
    ,bbs_2 = 1440--攻资
    ,bbs_3 = 1380--防资
    ,bbs_4 = 6240--体资
    ,bbs_5 = 2640--法资
    ,bbs_7 = 960--躲资
    ,bbs_6 = 1380--速资
    ,bbs_8 = {1.225,1.237,1.25,1.262,1.275}--成长组
    ,bbs_9 = {"净台妙谛","高级敏捷","防御","神佑复生"}
    ,bbs_10 = {"防御","神佑复生"}
    }--技能组
  Qubaobao["月光虫"]={
    bbs_1 = 35
    ,bbs_2 = 960--攻资
    ,bbs_3 = 900--防资
    ,bbs_4 = 2700--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1200--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {1.013,1.023,1.034,1.044,1.054}--成长组
    ,bbs_9 = {"慧根","冥思","精神集中"}
    }--技能组
  Qubaobao["月光金乌虫"]={
    bbs_1 = 35
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1080--防资
    ,bbs_4 = 3600--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1020--躲资
    ,bbs_6 = 1080--速资
    ,bbs_8 = {1.013,1.023,1.034,1.044,1.054}--成长组
    ,bbs_9 = {"欣欣向荣","慧根","冥思","精神集中"}

    }--技能组
  Qubaobao["月光雪蛙"]={
    bbs_1 = 35
    ,bbs_2 = 1080--攻资
    ,bbs_3 = 1080--防资
    ,bbs_4 = 3000--体资
    ,bbs_5 = 1500--法资
    ,bbs_7 = 1020--躲资
    ,bbs_6 = 1200--速资
    ,bbs_8 = {1.127,1.138,1.15,1.161,1.172}--成长组
    ,bbs_9 = {"法术连击","法术连击","水属性吸收","弱点火"}
    ,bbs_10 = {"法术连击","弱点火"}
    }--技能组
  Qubaobao["望月蛙"]={
    bbs_1 = 15
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1080--防资
    ,bbs_4 = 3600--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1020--躲资
    ,bbs_6 = 1080--速资
    ,bbs_8 = {1.013,1.023,1.034,1.044,1.054}--成长组
    ,bbs_9 = {"慧根","冥思","高级精神集中"}
      ,bbs_10 = {"慧根","冥思"}
    }--技能组

  Qubaobao["沙虫"]={
    bbs_1 = 25
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 900--防资
    ,bbs_4 = 2400--体资
    ,bbs_5 = 1200--法资
    ,bbs_7 = 1200--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {0.989,0.999,1.01,1.02,1.03}--成长组
    ,bbs_9 = {"盾气","连击"}
    }--技能组


  Qubaobao["火月蛙"]={
    bbs_1 = 35
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1080--防资
    ,bbs_4 = 3600--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1020--躲资
    ,bbs_6 = 1080--速资
    ,bbs_8 = {1.154,1.166,1.178,1.189,1.201}--成长组
    ,bbs_9 = {"慧根","冥思","高级精神集中"}
    }--技能组
    Qubaobao["雪月蛙"]={
    bbs_1 = 35
    ,bbs_2 = 1080--攻资
    ,bbs_3 = 1080--防资
    ,bbs_4 = 3000--体资
    ,bbs_5 = 1500--法资
    ,bbs_7 = 1020--躲资
    ,bbs_6 = 1200--速资
    ,bbs_8 = {1.127,1.138,1.15,1.161,1.172}--成长组
    ,bbs_9 = {"法术连击","法术波动","水属性吸收","弱点火"}
    }--技能组

  Qubaobao["炼丹童子"]={
    bbs_1 = 65
    ,bbs_2 = 1416--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 4440--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1380--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {1.176,1.188,1.2,1.212,1.224}--成长组
    ,bbs_9 = {"高级驱鬼","慧根","神迹","神佑复生"}
    }--技能组--"妙手灵丹",
  Qubaobao["金乌月光虫"]={
    bbs_1 = 35
    ,bbs_2 = 1320--攻资
    ,bbs_3 = 1080--防资
    ,bbs_4 = 3600--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1020--躲资
    ,bbs_6 = 1080--速资
    ,bbs_8 = {1.013,1.023,1.034,1.044,1.054}--成长组
    ,bbs_9 = {"欣欣向荣","慧根","冥思","精神集中"}
    }--技能组
  Qubaobao["金乌火虫"]={
    bbs_1 = 35
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 900--防资
    ,bbs_4 = 2700--体资
    ,bbs_5 = 1800--法资
    ,bbs_7 = 1200--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {1.154,1.166,1.178,1.189,1.201}--成长组
    ,bbs_9 = {"法术暴击","驱鬼","慧根"}
    }--技能组
  Qubaobao["金乌虫"]={---无
    bbs_1 = 35
    ,bbs_2 = 1500--攻资
    ,bbs_3 = 900--防资
    ,bbs_4 = 2700--体资
    ,bbs_5 = 1800--法资
    ,bbs_7 = 1200--躲资
    ,bbs_6 = 1320--速资
    ,bbs_8 = {1.013,1.023,1.034,1.044,1.054}--成长组
    ,bbs_9 = {"法术暴击","烈火","反击"}
    }--技能组
  Qubaobao["金翼"]={
    bbs_1 = 85
    ,bbs_2 = 1100--攻资
    ,bbs_3 = 1440--防资
    ,bbs_4 = 3600--体资
    ,bbs_5 = 3000--法资
    ,bbs_7 = 1320--躲资
    ,bbs_6 = 1380--速资
    ,bbs_8 = {1.203,1.215,1.228,1.24,1.252}--成长组
    ,bbs_9 = {"薪火相传","高级神佑复生","烈火","飞行"}
    }--技能组


	Qubaobao["食魂虫(日)"]={
	bbs_1 = 35
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2160
	,bbs_6 = 1440
	,bbs_7 = 1560
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"夜战","强力","毒","高级防御"}
		}
	Qubaobao["食魂虫(夜)"]={
	bbs_1 = 35
	,bbs_2 = 1500
	,bbs_3 = 1440
	,bbs_4 = 4800
	,bbs_5 = 2160
	,bbs_6 = 1440
	,bbs_7 = 1560
	,bbs_8 = {1.176,1.188,1.2,1.212,1.224}
	,bbs_9 = {"夜战","强力","毒","高级防御"}
		}


-----------------------加宝宝别忘在这里加个名字,假人摆摊的召唤兽要随机卖这些名称的召唤兽
取所有宝宝名称  = {----取消沙暴
"老虎","白熊","虾兵","狼","噬天虎","雨师","牛头","骷髅怪","修罗傀儡鬼","树怪","羊头怪","海毛虫","野猪","天兵","野猪精","灵灯侍者","赌徒","野鬼","修罗傀儡妖",
"连弩车","黑熊精","金身罗汉","犀牛将军人形","大海龟","曼珠沙华","长眉灵猴","护卫","巨力神猿","章鱼","藤蔓妖花","金铙僧","大力金刚","花妖","蜃气妖","猫灵人形",
"蚌精","机关兽","机关人人形","机关人车形","阴阳伞","混沌兽","古代瑞兽","蛟龙","葫芦宝贝","踏云兽","鬼将","狸","狐狸精","巨蛙","山贼","海星","小龙女","红萼仙子",
"狸","风伯","大蝙蝠","幽萤娃娃","强盗","巴蛇","机关鸟","律法女娲","猫灵兽形","镜妖","龙龟","吸血鬼","地狱战神","琴仙","蛤蟆精","如意仙子","锦毛貂精",
"雾中仙","灵鹤","百足将军","牛妖","黑山老妖","雷鸟人","芙蓉仙子","凤凰","千年蛇魅","巡游天神","兔子怪","黑熊","狂豹兽形","灵符女娲","泡泡","幽灵","泪妖","炎魔神"
,"鼠先锋","夜罗刹","星灵仙子","蜘蛛精","净瓶女娲","鲛人","天将","龟丞相","蝎子精","犀牛将军兽形","僵尸","蝴蝶仙子","马面","蟹将","画魂","碧水夜叉","狂豹人形",
"白豹","毗舍童子","增长巡守","真陀护法","般若天女","持国巡守","谛听","狐不归","花铃","涂山雪","月魅","云游火","魔化毗舍童子","雷龙",
"执音","妙华天女","自在心猿","觉醒涂山雪","有苏鸩","虬龙","司雪",
"幻姬","长乐灵仙","司辰侍者(未来)","司辰侍者(过去)","司雨","多闻巡守","天机虫","广目巡守",
"火月蛙","炼丹童子","金乌月光虫","金乌火虫","金翼","食魂虫(日)","食魂虫(夜)","雪月蛙"

}

function 取宝宝(bb,类型,物法,dingzhi)
	local bbs = {}
	if 类型=="神兽" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 4000
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {1.3,1.3,1.3,1.3,1.3}
		bbs[9] = 取神兽技能(bb,物法,dingzhi)
		return bbs
	end

	if Qubaobao[bb] then
		for i=1,10 do
			if Qubaobao[bb]["bbs_"..i] then
				bbs[i]=Qubaobao[bb]["bbs_"..i]
			end
		end
	end
	return table.copy(bbs)
end