-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-28 16:02:10
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-29 14:36:40

function 活动怪物处理(序号,任务id,玩家id)
	if 序号 == 101001 then --门派首席
		local bh = 取编号(玩家数据[玩家id].角色.门派)
  		return {门派首席处理(首席数据[bh].名称,首席数据[bh].模型,玩家数据[玩家id].角色.门派,玩家数据[玩家id].角色.等级,首席数据[bh],玩家id)}
	end
	local hdsj = 活动数据[序号+0]
	local 等级 = 0
	local 数量 = 0
	local 主怪序号 = 0
	local 喽啰编号
	local fhsj = {}
	if hdsj.等级是否变动=="是" then --这个移植到  取队伍平均等级函数里面 那么就可以删  （）等级是否变动 最低等级 最高等级（）
		local fhz=qz(取队伍平均等级(玩家数据[玩家id].队伍,玩家id)/10)*10
		if fhz<hdsj.最低等级 then
			等级 = hdsj.最低等级
		elseif fhz>hdsj.最高等级 then
			等级 = hdsj.最高等级
		else
		  	等级 = fhz
		end
	else
    	等级 = hdsj.最高等级
	end
	if hdsj.是否变动喽啰数=="是" then
		local fhz=取队伍人数(玩家id)
		if fhz ==1 then
			数量 =  hdsj.最小喽啰数
		else
			数量 =  hdsj.最小喽啰数 +(fhz*2-2)
		end
		if 数量 > hdsj.最大喽啰数  then
			数量 =  hdsj.最大喽啰数
		end
	else
		数量 =  hdsj.最大喽啰数
	end
	if type(hdsj.喽啰编号) == "table" then
		喽啰编号 = hdsj.喽啰编号
	else
    	喽啰编号={hdsj.喽啰编号}
	end
	local 循环基数 = 0
	for i=1,数量 do
		local sj
		fhsj[i]={}
		if i == 1 then
			if type(hdsj.主怪编号) == "table" then
				for i=1,#hdsj.主怪编号 do
					if 任务数据[任务id].模型 == 怪物数据[hdsj.主怪编号[i]].模型 then
						sj=怪物数据[hdsj.主怪编号[i]]
						主怪序号=i
					end
				end
			else
				sj =怪物数据[hdsj.主怪编号]
			end
			fhsj[i].等级=qz((等级-hdsj.主怪等级差)/10)*10
		else
			if hdsj.喽啰规则 == 1 then
				sj =怪物数据[喽啰编号[取随机数(1,#喽啰编号)]]
			elseif hdsj.喽啰规则 == 2 then
				if i < 6 then
					循环基数 = 循环基数 +1
					sj =怪物数据[喽啰编号[循环基数]]
					if 循环基数 == #喽啰编号-1 then
						循环基数 =0
					end
				else
			    	sj =怪物数据[喽啰编号[#喽啰编号]]
				end
			elseif hdsj.喽啰规则 == 3 then
				循环基数 = 循环基数 +1
				sj =怪物数据[喽啰编号[循环基数]]
				if 循环基数 == #喽啰编号 then
					循环基数 =0
				end
			elseif hdsj.喽啰规则 == 4 then
				sj =怪物数据[喽啰编号[主怪序号]]
			end
			if hdsj.几率 ~= nil and i == 数量 and 取随机数() < hdsj.几率  then
				sj =怪物数据[hdsj.喽啰编号2]
			end
			fhsj[i].等级=qz((等级-hdsj.喽啰等级差)/10)*10
		end
		if fhsj[i].等级 < 0 then
			fhsj[i].等级 = 0
		end
		if  type(sj.模型) == "table" then
			fhsj[i].模型 = sj.模型[取随机数(1,#sj.模型)]
		else
	    	if sj.模型 =="取等级怪" then
		    	local 临时信息=取等级怪(取随机数(等级))
  				local 临时模型=取敌人信息(临时信息[取随机数(1,#临时信息)])
  				fhsj[i].模型 = 临时模型[2]
  			elseif sj.模型 =="取随机怪" then
  				fhsj[i].模型 = 取随机怪(1,等级)[2]
  			elseif sj.模型 =="取种族敌对" then
  				fhsj[i].模型=取种族敌对(玩家id)
  			elseif sj.名称方式 == 2 then
  				fhsj[i].模型 = 任务数据[任务id].模型
  			else
  				fhsj[i].模型 =sj.模型
  			end
		end
		if sj.名称方式 == 1 then
			if  type(sj.名称) == "table" then
				fhsj[i].名称 = sj.名称[取随机数(1,#sj.名称)]
			else
				fhsj[i].名称 = sj.名称
			end
		elseif sj.名称方式 == 2 then
			fhsj[i].名称 = 任务数据[任务id].名称
		elseif sj.名称方式 == 3 then
			fhsj[i].名称 = fhsj[i].模型..sj.名称
		elseif sj.名称方式 == 4 then
			fhsj[i].名称 = sj.名称..fhsj[i].模型
		end

		if sj.角色 ~= nil then
			fhsj[i].角色 = sj.角色
			if sj.武器名称 ~= nil then
				if sj.武器名称=="取任务" and sj.武器等级 =="取任务" then
					fhsj[i].武器 = 取武器数据(任务数据[任务id].武器,任务数据[任务id].武器等级)
				else
					fhsj[i].武器 = 取武器数据(sj.武器名称,sj.武器等级 )
				end
			end
		end
		fhsj[i].伤害=qz(阶段属性[fhsj[i].等级].伤害*sj.伤害加成*hdsj.系数)
		if sj.血量加成 > 100 then
			fhsj[i].气血 =sj.血量加成
		else
	    	fhsj[i].气血=qz(阶段属性[fhsj[i].等级].气血*sj.血量加成*hdsj.系数)
		end
		fhsj[i].灵力=qz(阶段属性[fhsj[i].等级].灵力*hdsj.系数)
		fhsj[i].速度=qz(阶段属性[fhsj[i].等级].速度*sj.速度加成*hdsj.系数)
		fhsj[i].防御=qz(阶段属性[fhsj[i].等级].防御*sj.防御加成*hdsj.系数)
		fhsj[i].法防=qz(阶段属性[fhsj[i].等级].法防*sj.法防加成*hdsj.系数)
		fhsj[i].法伤=qz(阶段属性[fhsj[i].等级].法伤*sj.法伤加成*hdsj.系数)
		fhsj[i].魔法=qz(阶段属性[fhsj[i].等级].魔法*hdsj.系数)
		fhsj[i].体质=qz(阶段属性[fhsj[i].等级].体质*hdsj.系数)
		fhsj[i].魔力=qz(阶段属性[fhsj[i].等级].魔力*hdsj.系数)
		fhsj[i].力量=qz(阶段属性[fhsj[i].等级].力量*hdsj.系数)
		fhsj[i].耐力=qz(阶段属性[fhsj[i].等级].耐力*hdsj.系数)
		fhsj[i].敏捷=qz(阶段属性[fhsj[i].等级].敏捷*hdsj.系数)
		fhsj[i].躲避=qz(阶段属性[fhsj[i].等级].速度*sj.速度加成*hdsj.系数)
		fhsj[i].抵抗封印等级=sj.抵抗封印等级
		fhsj[i].封印命中等级=sj.封印命中等级
		fhsj[i].变异=sj.变异 or nil
		fhsj[i].可捕捉=sj.可捕捉 or nil
		fhsj[i].特殊变异=sj.特殊变异 or nil
		fhsj[i].技能目标数=sj.技能目标数 or nil
		fhsj[i].主怪=sj.主怪 or nil
		fhsj[i].招式特效=sj.招式特效 or nil
		fhsj[i].饰品显示=sj.饰品显示 or nil
		fhsj[i].饰品颜色=sj.饰品颜色 or nil
		fhsj[i].变身数据 = sj.变身数据 or nil
		fhsj[i].附加阵法 = sj.附加阵法 or nil
		if sj.炫彩 ~= nil then
			if sj.炫彩 == "取任务" then
				fhsj[i].炫彩=任务数据[任务id].炫彩
			else
				fhsj[i].炫彩=取染色id(sj.炫彩)
			end
		end
		if sj.炫彩组 ~= nil then
			if sj.炫彩 == "取任务" then
				fhsj[i].炫彩组=任务数据[任务id].炫彩组
			else
				fhsj[i].炫彩组=取炫彩染色(sj.炫彩组)
			end
		end

		fhsj[i].主动技能={}
		fhsj[i].被动技能={}
		fhsj[i].法宝技能={}
		fhsj[i].法宝佩戴={}
		fhsj[i].技能={}
		if sj.门派 ~= nil then
			local 门派
			if  type(sj.门派) == "table" then
				门派  = sj.门派[取随机数(1,#sj.门派)]
			else
				if sj.门派 == "取任务" then
					门派  = 任务数据[任务id].门派
				else
					门派  = sj.门派
		    	end
			end
			if 门派 then
				fhsj[i].门派=门派
				fhsj[i].AI战斗 = {AI=true}
			end
		end
		if sj.主动技能 ~= nil then
			if  type(sj.主动技能) == "table" then
				for s=1,#sj.主动技能 do
					fhsj[i].主动技能[#fhsj[i].主动技能+1] =sj.主动技能[s]
				end
			else
				fhsj[i].主动技能[#fhsj[i].主动技能+1] =sj.主动技能
			end
		end
		if sj.特技 ~= nil then
			if  type(sj.特技) == "table" then
				for s=1,#sj.特技 do
					fhsj[i].主动技能[#fhsj[i].主动技能+1] =sj.特技[s]
				end
			else
				fhsj[i].主动技能[#fhsj[i].主动技能+1] =sj.特技
			end
		end
		if sj.法宝技能 ~= nil then
			if  type(sj.法宝技能) == "table" then
				for s=1,#sj.法宝技能 do
					fhsj[i].法宝技能[#fhsj[i].法宝技能+1] =sj.法宝技能[s]
				end
			else
				fhsj[i].法宝技能[#fhsj[i].法宝技能+1] =sj.法宝技能
			end
		end
		if sj.法宝佩戴 ~= nil then
			if  type(sj.法宝佩戴) == "table" then
				for s=1,#sj.法宝佩戴 do
					fhsj[i].法宝佩戴[#fhsj[i].法宝佩戴+1] ={名称=sj.法宝佩戴[s],境界=15}
				end
			else
				fhsj[i].法宝佩戴[#fhsj[i].法宝佩戴+1] ={名称=sj.法宝佩戴,境界=15}
			end
		end
		if sj.技能 ~= nil then
			if  type(sj.技能) == "table" then
				for s=1,#sj.技能 do
					fhsj[i].技能[#fhsj[i].技能+1] =sj.技能[s]
				end
			else
				if sj.技能 == "取宝宝" then
					local 临时技能=取宝宝(fhsj[i].模型)
					for n=1,#临时技能[9] do
					    	if 取随机数()<=50 then
					     		fhsj[i].技能[#fhsj[i].技能+1]=临时技能[9][n]
					    	end
					end
				else
					fhsj[i].技能[#fhsj[i].技能+1] =sj.技能
				end
			end
		end
	end
	return fhsj
end

 function 活动掉落(id,编号,任务id)
 	if 玩家数据[id] then
 		local 掉落编号 = nil
 		for i=1,5 do
 			local js = 6-i
 			if  掉落列表[编号]["掉落"..js] and not 掉落编号 then
 				if type(掉落列表[编号]["掉落"..js]) == "table" then
 					if 掉落列表[编号]["爆率"..js] > 取随机数(1,掉落列表[编号]["上限"..js] ) then
 						掉落编号 = 掉落列表[编号]["掉落"..js][取随机数(1,#掉落列表[编号]["掉落"..js])]
 					end
 				elseif type(掉落列表[编号]["掉落"..js]) == "number" then
 					if 掉落列表[编号]["爆率"..js] > 取随机数(1,掉落列表[编号]["上限"..js] ) then
 						掉落编号 = 掉落列表[编号]["掉落"..js]
 					end
 				end
 			end
 		end
 		local 文本 = ""
 		local 提示判定 = false
 		local 提示 = nil
 		for i=1,3 do
 			if 掉落列表[编号]["广播"..i] then
 				local 附加 = ""
 				if 掉落列表[编号]["广播调用"..i] then
 					if 掉落列表[编号]["广播调用"..i] =="角色名称" then
 						附加=玩家数据[id].角色.名称
 					elseif 掉落列表[编号]["广播调用"..i] =="任务名称" and 任务数据[任务id] then
 					 	附加=任务数据[任务id].名称
 					end
 				end
 				文本 = 文本..掉落列表[编号]["广播"..i]..附加
 				if not 提示判定 then 提示判定 = true end
 			end
 		end
 		if 提示判定 then
 			提示 = {提示=文本,结尾=掉落列表[编号].结尾,频道=掉落列表[编号].频道}
 		end
 		if  掉落编号 then
 			local 数量 = nil
 			if 掉落数据[掉落编号].数量  then 数量= 掉落数据[掉落编号].数量 end
 			local 名称 = 掉落数据[掉落编号].名称
 			local 附加 = nil
 			local 奖励类型 = "给予道具"
 			if 名称== "取宝石" then
 				名称 = 取宝石()
 			elseif 名称== "取五宝" then
 				名称 = 取五宝()
 			elseif 名称== "取强化石" then
 				名称 = 取强化石()
 			elseif 名称== "高级召唤兽内丹" and not 附加 then
 				附加 = 取内丹("高级")
 			elseif 名称== "召唤兽内丹" and not 附加 then
 				附加 = 取内丹("低级")
 			elseif 名称== "取掉落法宝材料" then
 				名称=取掉落法宝材料()
 			elseif 名称== "制造指南书" or  名称== "百炼精铁" then
 				数量={数量,数量}
 			elseif 名称== "上古锻造图策" or  名称== "炼妖石" then
 				数量={数量,数量}
 			elseif 名称== "灵饰指南书" or  名称== "元灵晶石" then
 				数量={数量,数量}
 			elseif 名称== "世界积分" or 名称== "元宵积分" then
 				奖励类型 = "积分"
 			end
 			if 奖励类型 == "给予道具" then
 				玩家数据[id].道具:给予道具(id,名称,数量,附加,nil,nil,nil,nil,nil,nil,提示)
 			elseif 奖励类型 == "积分" then
 				玩家数据[id].角色[名称]=玩家数据[id].角色[名称]+数量
 				常规提示(id,"#Y/你获得了#G"..数量.."#Y点#G"..名称)
 				if 提示 then
 					local 文本 = 提示.提示.."#G"..名称.."#W"..提示.结尾
 					广播消息({内容=文本,频道=提示.频道})
 				end
 			end

 		end
 	end
 end

Q_乾坤袋={
	人={"中原一点红","草上飞前帽","水上飘李达","无影神偷刘欢"}
	,魔={"千年老妖","南海不死怪","百年小妖","魔眼吸精妖"}
	,仙={"无上真人","通广上仙","紫金洞大仙","南部大仙"}
}

Q_取押镖={
	{地图=1150,名称="二郎神"}
	,{地图=1141,名称="观音姐姐"}
	,{地图=1124,名称="地藏王"}
	,{地图=1117,名称="东海龙王"}
	,{地图=1054,名称="程咬金"}
	,{地图=1043,名称="空度禅师"}
	,{地图=1143,名称="孙婆婆"}
	,{地图=1137,名称="菩提老祖"}
	,{地图=1112,名称="李靖"}
	,{地图=1145,名称="牛魔王"}
	,{地图=1147,名称="镇元子"}
	,{地图=1134,名称="大大王"}
	,{地图=1154,名称="巫奎虎"}
	,{地图=1156,名称="地涌夫人"}
}

--------------------------剑会天下
Q_小怪模型 ={"画魂","雾中仙","吸血鬼","夜罗刹","毗舍童子","雷龙","虬龙","涂山瞳","涂山雪","月魅","司雪","泡泡灵仙·剑侠客","泡泡灵仙·羽灵神","泡泡灵仙·飞燕女",
  "曼珠沙华","猫灵人形","猫灵兽形","藤蔓妖花","蝎子精","修罗傀儡鬼","修罗傀儡妖","蜃气妖","般若天女","火月蛙","冰月蛙","幻姬","泡泡灵仙·巫蛮儿","泡泡灵仙·杀破狼"
      }
-------------------------

Q_随机人物={
{地图=1001,人物={"陈员外","张老财","刘副将","御林军右统领",}},
{地图=1033,人物={"罗百万","陈妈妈","小桃红"}},
{地图=1070,人物={"海老先生","许姑娘","钟书生","蝴蝶女","慧觉和尚",}},
{地图=1135,人物={"觉明","灵儿",}},
{地图=1208,人物={"朱紫校尉","端木娘子","紫阳药师","朱紫侍卫"}},
{地图=1173,人物={"山贼头子","牛将军","白衣人","云游僧","姚太尉","阿紫","玉面狐狸","白鹿精","野猪王","冤魂","偷尸鬼","李彪","刘洪",}},
{地图=1513,人物={"女妖","金琉璃","栗栗儿",}},
{地图=1092,人物={"蝴蝶妹妹",}},
{地图=1093,人物={"慕容先生",}},
{地图=1506,人物={"楚恋依",}},
{地图=1116,人物={"万圣公主","龟太尉","虾将军","蛤蟆勇士","龟千岁","小龙女",}},
{地图=1142,人物={"柳飞絮","栗栗娘","绿儿","翠花",}},
{地图=1174,人物={"青琉璃","莽汉","龙女妹妹",}},
{地图=1111,人物={"守门天兵","顺风耳","天牢守卫","水军统领",}},
{地图=1110,人物={"山神","白琉璃","者释和尚","业释和尚","海释和尚","虾兵",}},
{地图=1122,人物={"孟婆","追梦鬼","马面",}},
{地图=1127,人物={"幽冥鬼",}},
{地图=1173,人物={"山贼头子","牛将军","白衣人","云游僧","姚太尉","阿紫","玉面狐狸","白鹿精","野猪王","冤魂","偷尸鬼","李彪","刘洪",}},
{地图=1110,人物={"山神","白琉璃","者释和尚","业释和尚","海释和尚","虾兵",}},
{地图=1116,人物={"万圣公主","龟太尉","虾将军","蛤蟆勇士","龟千岁","小龙女",}},
{地图=1114,人物={"吴刚","康太尉",}},
}

function 取香飘飘NPC()
	local lsb = {
	{地图=1001,人物="怜儿姑娘"},
	{地图=1070,人物="许大娘"},
	{地图=1070,人物="蝴蝶女"},
	{地图=1070,人物="许姑娘"},
	{地图=1070,人物="凤凰姑娘"},
	{地图=1501,人物="教书先生"},
	{地图=1501,人物="马全有"},
	{地图=1208,人物="药店伙计"},
	{地图=1208,人物="紫阳药师"},
	{地图=1208,人物="端木娘子"},
	{地图=1208,人物="申太公"},
	{地图=1208,人物="豆蔻囡囡"},
	{地图=1208,人物="小囝囝"},
	}
	return lsb[取随机数(1,#lsb)]
end

function 取暗号()
	local fhb = {}
	local lsb = {"桃子","I服了YOU","午时三刻","田鼠","香蕉","芝麻开门","牛头","马面","明月","灵鹤","鸭梨山大","好哈有"}
	for i=1,4 do
		local bh= 取随机数(1,#lsb)
		table.insert(fhb,lsb[bh])
		table.remove(lsb, bh)
	end
	return fhb
end

function 取随机NPC( )
	local lsb={
	{地图=1001,人物={"陈员外","张老财","刘副将","御林军右统领","老花农"}},
	{地图=1501,人物={"吹牛王","飞儿","王大嫂","老孙头","陈长寿","罗招弟","牛大胆","赵捕头"}},
	{地图=1092,人物={"渔夫","船夫","蝴蝶妹妹","九头精怪","偷偷怪","金毛猿"}},
	{地图=1070,人物={"慧觉和尚","陆萧然","太白金星","海老先生","钟书生","许姑娘","蕴子仙","许大娘","凤凰姑娘"}},
	}
	local lsbh = 取随机数(1,#lsb)
	return {地图=lsb[lsbh].地图,人物=lsb[lsbh].人物[取随机数(1,#lsb[lsbh].人物)]}
end
Q_随机模型={"剑侠客","逍遥生","飞燕女","英女侠","巫蛮儿","神天兵","龙太子","舞天姬","玄彩娥","桃夭夭","虎头怪","巨魔王","狐美人","骨精灵","杀破狼"}
Q_随机模型1={
	铁血无双={"律法女娲","幽灵","夜罗刹","大力金刚"},
	玄法无边={"灵符女娲","炎魔神","灵鹤","混沌兽"},
	神封无量={"雾中仙","风伯","鼠先锋","兔子怪"},
	长生无界={"古代瑞兽","雨师","龟丞相"},
	乾坤无行={"吸血鬼"},
}
Q_随机名称1={"初出茅庐地兽星","初出茅庐地灵星","初出茅庐地佑星","初出茅庐地猛星"}
Q_随机名称2={"小有所成地文星","小有所成地正星","小有所成地辟星","小有所成地奇星"}
Q_随机名称3={"伏虎斩妖地彗星","伏虎斩妖地微星","伏虎斩妖地暴星","伏虎斩妖地英星"}
Q_随机名称4={"御风神行地兽星","御风神行地强星","御风神行地暗星","御风神行地威星"}
Q_随机名称5={"履水吐焰地阖星","履水吐焰地会星","履水吐焰地辅星"}
Q_随机名称6={"履水吐焰地猖星","履水吐焰地狂星","履水吐焰地默星","履水吐焰地杰星","履水吐焰地雄星"}
Q_随机名称7={"天猖星","天狂星","天默星","天杰星","天雄星"}
Q_随机武器={
	剑侠客={"游龙剑","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"},
	逍遥生={"神火扇","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"},
	飞燕女={"蛇形月","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"},
	英女侠={"赤焰双剑","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"},
	巫蛮儿={"游龙剑","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"},
	神天兵={"游龙剑","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"},
	龙太子={"游龙剑","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"},
	舞天姬={"游龙剑","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"},
	玄彩娥={"游龙剑","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"},
	桃夭夭={"游龙剑","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"},
	虎头怪={"游龙剑","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"},
	巨魔王={"游龙剑","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"},
	狐美人={"游龙剑","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"},
	骨精灵={"游龙剑","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"},
	杀破狼={"游龙剑","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"},
	羽灵神={"游龙剑","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"},
	偃无师={"游龙剑","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"},
	鬼潇潇={"游龙剑","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"},
}
Q_阵法名 = {"天覆阵","风扬阵","虎翼阵","云垂阵","鸟翔阵","地载阵","龙飞阵","鹰啸阵","雷绝阵","雷绝阵"}

----------------------------------比武
Q_取单字 = {
'天','夜','晴','瑜','飞','文','弘','松','晓','智','云','易','远','航','笑','白','映','波','代','桃','泽','啸','宸','博','靖','琪','十','君','浩','绍','辉','冷','安','盼','旋','秋','瑾',
'宇','黎','杰','辉','德','邪','默','磊','豪','寒','瀚','哲','阳','风','皓','世','轩','思','鸿','涛','煜','雄','英','诗','展','聪','俊','海','彤','珍','雨','琴','玉','鹏','祺','命','成',
'先','忘','幽','威','秀','凡','渊','熙','胜','鸣','姿','芷','芝','筝','真','贞','婴','雯','纹','菀','莞','宛','桐','愫','素','涑','姝','弱','若','蓉','清','青','茗','敏','萍','蓝','兰',
'莺','萤','弱','怡','紫','芯','雁','嫣','荠','嵩','卿','裘','阁','康','城','焱','穆','枫','翼','鹤','乾'
}
----------------------------------
Q_武神坛角色属性={
		大唐官府={伤害=3702,气血=12019,灵力=1318,速度=1337,防御=2153,法防=0,躲闪=900,法伤=280,魔法=2951,体质=238,魔力=200,力量=1564,耐力=200,敏捷=333},
		化生寺={伤害=1968,气血=22094,灵力=1487,速度=1360,防御=2916,法防=0,躲闪=900,法伤=60,魔法=3211,体质=1012,魔力=203,力量=201,耐力=749,敏捷=406},
		方寸山={伤害=2079,气血=15175,灵力=1210,速度=1823,防御=2501,法防=0,躲闪=900,法伤=0,魔法=3221,体质=489,魔力=208,力量=208,耐力=459,敏捷=1227},
		女儿村={伤害=1811,气血=15009,灵力=1171,速度=2336,防御=2375,法防=0,躲闪=900,法伤=189,魔法=3130,体质=372,魔力=208,力量=208,耐力=415,敏捷=1430},
		神木林={伤害=1912,气血=9880,灵力=1982,速度=649,防御=2121,法防=0,躲闪=900,法伤=610,魔法=2000,体质=230,魔力=1594,力量=205,耐力=277,敏捷=261},
		盘丝洞={伤害=2005,气血=13039,灵力=1357,速度=1501,防御=2508,法防=0,躲闪=900,法伤=680,魔法=2823,体质=591,魔力=202,力量=202,耐力=605,敏捷=976},
		魔王寨={伤害=2033,气血=11177,灵力=2012,速度=766,防御=2304,法防=0,躲闪=900,法伤=690,魔法=11401,体质=314,魔力=1534,力量=202,耐力=258,敏捷=262},
		狮驼岭={伤害=3175,气血=14622,灵力=1410,速度=1069,防御=2600,法防=0,躲闪=900,法伤=240,魔法=2841,体质=255,魔力=230,力量=1374,耐力=200,敏捷=290},
		阴曹地府={伤害=1931,气血=18285,灵力=1571,速度=1491,防御=1571,法防=0,躲闪=900,法伤=0,魔法=2904,体质=794,魔力=201,力量=201,耐力=648,敏捷=704},
		无底洞={伤害=1700,气血=9696,灵力=1210,速度=1269,防御=2191,法防=0,躲闪=900,法伤=110,魔法=1970,体质=514,魔力=191,力量=188,耐力=459,敏捷=867},
		天宫={伤害=1945,气血=12239,灵力=1724,速度=703,防御=1898,法防=0,躲闪=900,法伤=1010,魔法=14866,体质=205,魔力=1558,力量=202,耐力=265,敏捷=264},
		普陀山={伤害=2030,气血=13642,灵力=1275,速度=1239,防御=3454,法防=0,躲闪=900,法伤=135,魔法=3437,体质=285,魔力=195,力量=201,耐力=897,敏捷=992},
		凌波城={伤害=3581,气血=9199,灵力=1405,速度=854,防御=1861,法防=0,躲闪=900,法伤=260,魔法=2381,体质=240,魔力=200,力量=1455,耐力=208,敏捷=277},
		五庄观={伤害=3081,气血=9856,灵力=1239,速度=1012,防御=2009,法防=0,躲闪=210,法伤=0,魔法=3395,体质=271,魔力=206,力量=900,耐力=569,敏捷=567},
		龙宫={伤害=1953,气血=9230,灵力=1920,速度=652,防御=2196,法防=0,躲闪=900,法伤=557,魔法=14461,体质=239,魔力=1520,力量=207,耐力=272,敏捷=268},
} --剑会天下  剑会假人

Q_武神坛门派法术={
	大唐官府={"横扫千军",}
	,化生寺={"推气过宫",}
	,方寸山={"失心符","失魂符","定身符"}
	,女儿村={"似玉生香"}
	,神木林={"落叶萧萧"}
	,盘丝洞={"含情脉脉",}
	,魔王寨={"飞砂走石","三昧真火"}
	,狮驼岭={"鹰击","连环击"}
	,阴曹地府={"尸腐毒"}
	,无底洞={"地涌金莲"}
	,天宫={"雷霆万钧"}
	,普陀山={"杨柳甘露","普渡众生"}
	,凌波城={"裂石","断岳势","浪涌","惊涛怒","天崩地裂","翻江搅海","碎星诀"}
	,五庄观={"烟雨剑法"}
	,龙宫={"龙卷雨击","龙腾"}
}

-- Q_武神坛角色属性={
-- 		大唐官府={伤害=3702,气血=12019,灵力=1318,速度=1337,防御=2153,法防=0,躲闪=900,法伤=280,魔法=2951,体质=238,魔力=200,力量=1564,耐力=200,敏捷=333},
-- 		化生寺={伤害=1968,气血=22094,灵力=1487,速度=1360,防御=2916,法防=0,躲闪=900,法伤=60,魔法=3211,体质=1012,魔力=203,力量=201,耐力=749,敏捷=406},
-- 		方寸山={伤害=2079,气血=15175,灵力=1210,速度=1823,防御=2501,法防=0,躲闪=900,法伤=0,魔法=3221,体质=489,魔力=208,力量=208,耐力=459,敏捷=1227},
-- 		女儿村={伤害=1811,气血=15009,灵力=1171,速度=2336,防御=2375,法防=0,躲闪=900,法伤=189,魔法=3130,体质=372,魔力=208,力量=208,耐力=415,敏捷=1430},
-- 		神木林={伤害=1912,气血=9880,灵力=1982,速度=649,防御=2121,法防=0,躲闪=900,法伤=610,魔法=2000,体质=230,魔力=1594,力量=205,耐力=277,敏捷=261},
-- 		盘丝洞={伤害=2005,气血=13039,灵力=1357,速度=1501,防御=2508,法防=0,躲闪=900,法伤=680,魔法=2823,体质=591,魔力=202,力量=202,耐力=605,敏捷=976},
-- 		魔王寨={伤害=2033,气血=11177,灵力=2012,速度=766,防御=2304,法防=0,躲闪=900,法伤=690,魔法=11401,体质=314,魔力=1534,力量=202,耐力=258,敏捷=262},
-- 		狮驼岭={伤害=3175,气血=14622,灵力=1410,速度=1069,防御=2600,法防=0,躲闪=900,法伤=240,魔法=2841,体质=255,魔力=230,力量=1374,耐力=200,敏捷=290},
-- 		阴曹地府={伤害=1931,气血=18285,灵力=1571,速度=1491,防御=1571,法防=0,躲闪=900,法伤=0,魔法=2904,体质=794,魔力=201,力量=201,耐力=648,敏捷=704},
-- 		无底洞={伤害=1700,气血=9696,灵力=1210,速度=1269,防御=2191,法防=0,躲闪=900,法伤=110,魔法=1970,体质=514,魔力=191,力量=188,耐力=459,敏捷=867},
-- 		天宫={伤害=1945,气血=12239,灵力=1724,速度=703,防御=1898,法防=0,躲闪=900,法伤=1010,魔法=14866,体质=205,魔力=1558,力量=202,耐力=265,敏捷=264},
-- 		普陀山={伤害=2030,气血=13642,灵力=1275,速度=1239,防御=3454,法防=0,躲闪=900,法伤=135,魔法=3437,体质=285,魔力=195,力量=201,耐力=897,敏捷=992},
-- 		凌波城={伤害=3581,气血=9199,灵力=1405,速度=854,防御=1861,法防=0,躲闪=900,法伤=260,魔法=2381,体质=240,魔力=200,力量=1455,耐力=208,敏捷=277},
-- 		五庄观={伤害=3081,气血=9856,灵力=1239,速度=1012,防御=2009,法防=0,躲闪=210,法伤=0,魔法=3395,体质=271,魔力=206,力量=900,耐力=569,敏捷=567},
-- 		龙宫={伤害=1953,气血=9230,灵力=1920,速度=652,防御=2196,法防=0,躲闪=900,法伤=557,魔法=14461,体质=239,魔力=1520,力量=207,耐力=272,敏捷=268},
-- }

Q_武神坛角色佩戴法宝 = {
	大唐官府={{名称="金甲仙衣",境界=9},{名称="降魔斗篷",境界=12},{名称="风带",境界=9},{名称="风带",境界=9}},
	化生寺={{名称="碧玉葫芦",境界=9},{名称="七宝玲珑灯",境界=15},{名称="慈悲",境界=15},{名称="凌波仙符",境界=18}},
	方寸山={{名称="救命毫毛",境界=15},{名称="七宝玲珑灯",境界=15},{名称="河图洛书",境界=18},{名称="蟠龙玉璧",境界=18}},
	女儿村={{名称="织女扇",境界=9},{名称="河图洛书",境界=18},{名称="七宝玲珑灯",境界=15},{名称="蟠龙玉璧",境界=18}},
	神木林={{名称="金甲仙衣",境界=9},{名称="月影",境界=12},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	盘丝洞={{名称="金甲仙衣",境界=9},{名称="忘情",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	魔王寨={{名称="金甲仙衣",境界=9},{名称="五火神焰印",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	狮驼岭={{名称="金甲仙衣",境界=9},{名称="失心钹",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	阴曹地府={{名称="金甲仙衣",境界=9},{名称="九幽",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	无底洞={{名称="金甲仙衣",境界=9},{名称="七宝玲珑灯",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	天宫={{名称="金甲仙衣",境界=9},{名称="伏魔天书",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	普陀山={{名称="金甲仙衣",境界=9},{名称="普渡",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	凌波城={{名称="金甲仙衣",境界=9},{名称="斩魔",境界=12},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	五庄观={{名称="金甲仙衣",境界=9},{名称="七宝玲珑灯",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
	龙宫={{名称="金甲仙衣",境界=9},{名称="镇海珠",境界=15},{名称="凌波仙符",境界=18},{名称="蟠龙玉璧",境界=18}},
}

Q_武神坛特技={
	大唐官府={"破血狂攻"}
	,化生寺={"罗汉金钟"}
	,方寸山={"笑里藏刀","晶清诀","水清诀"}
	,女儿村={"笑里藏刀","玉清诀","水清诀"}
	,神木林={"罗汉金钟","晶清诀"}
	,盘丝洞={"笑里藏刀","晶清诀","水清诀"}
	,魔王寨={"罗汉金钟"}
	,狮驼岭={"破血狂攻"}
	,阴曹地府={"罗汉金钟"}
	,无底洞={"笑里藏刀","玉清诀","水清诀"}
	,天宫={"罗汉金钟"}
	,普陀山={"罗汉金钟"}
	,凌波城={"破血狂攻"}
	,五庄观={"破血狂攻"}
	,龙宫={"罗汉金钟"}
}

Q_武神坛法宝={
	大唐官府={"干将莫邪"}
	,化生寺={"苍白纸人","无魂傀儡"}
	,方寸山={"苍白纸人","无魂傀儡"}
	,女儿村={"苍白纸人","无魂傀儡"}
	,神木林={"苍白纸人","无魂傀儡"}
	,盘丝洞={"苍白纸人","无魂傀儡"}
	,魔王寨={"苍白纸人","无魂傀儡"}
	,狮驼岭={"苍白纸人","无魂傀儡"}
	,阴曹地府={"苍白纸人","无魂傀儡"}
	,无底洞={"苍白纸人","无魂傀儡"}
	,天宫={"苍白纸人","无魂傀儡"}
	,普陀山={"苍白纸人","无魂傀儡"}
	,凌波城={"苍白纸人","无魂傀儡"}
	,五庄观={"苍白纸人","无魂傀儡"}
	,龙宫={"苍白纸人","无魂傀儡"}
}

Q_武神坛宠物类型 = {"攻宠","血宠","血耐","血攻","法宠","法血","敏宠"}

Q_武神坛召唤兽技能={
	攻宠={"高级必杀","高级连击","高级夜战","高级吸血","高级偷袭","高级敏捷","高级神佑复生","高级幸运","高级强力","浮云神马"},
	血宠={"高级幸运","高级防御","高级神佑复生","高级土属性吸收","高级火属性吸收","高级水属性吸收","高级雷属性吸收","高级神迹","浮云神马"},
	血耐={"高级幸运","高级防御","高级神佑复生","高级土属性吸收","高级火属性吸收","高级水属性吸收","高级雷属性吸收","高级必杀","高级连击","高级夜战","浮云神马"},
	血攻={"高级必杀","高级连击","高级夜战","高级吸血","高级偷袭","高级敏捷","高级神佑复生","高级幸运","高级强力","浮云神马"},
	法宠={"高级法术暴击","高级法术连击","高级法术波动","高级防御","高级幸运","须弥真言","高级神佑复生","高级神迹","浮云神马"},
	法血={"高级法术暴击","高级法术连击","高级法术波动","高级防御","高级幸运","须弥真言","高级神佑复生","高级神迹","浮云神马"},
	敏宠={"高级幸运","高级防御","高级神佑复生","高级土属性吸收","高级火属性吸收","高级水属性吸收","高级雷属性吸收","高级神迹","高级敏捷","浮云神马"},
}

Q_武神坛召唤兽主动技能={
	攻宠={"力劈华山"},
	血宠={"死亡召唤","法术防御"},
	血耐={"壁垒击破"},
	血攻={"壁垒击破"},
	法宠={"奔雷咒","水漫金山","泰山压顶","地狱烈火"},
	法血={"奔雷咒","水漫金山","泰山压顶","地狱烈火"},
	敏宠={"法术防御"},
}

Q_武神坛召唤兽属性={
	  攻宠={伤害=2848,气血=14294,灵力=936,速度=390,防御=1085,法防=500,躲闪=597,法伤=0,魔法=1042,体质=400,魔力=199,力量=860,耐力=195,敏捷=190},
		血宠={伤害=1001,气血=20101,灵力=910,速度=401,防御=1314,法防=500,躲闪=597,法伤=0,魔法=1042,体质=1037,魔力=195,力量=321,耐力=195,敏捷=195},
		血耐={伤害=1834,气血=12637,灵力=750,速度=597,防御=2080,法防=500,躲闪=597,法伤=0,魔法=1704,体质=577,魔力=194,力量=204,耐力=638,敏捷=366},
		血攻={伤害=1932,气血=15109,灵力=821,速度=408,防御=1005,法防=500,躲闪=597,法伤=0,魔法=1520,体质=860,魔力=199,力量=400,耐力=195,敏捷=190},
		法宠={伤害=1076,气血=9181,灵力=1501,速度=375,防御=901,法防=500,躲闪=597,法伤=0,魔法=5026,体质=298,魔力=1037,力量=195,耐力=195,敏捷=190},
		法血={伤害=1200,气血=12196,灵力=1210,速度=345,防御=2028,法防=500,躲闪=597,法伤=0,魔法=2150,体质=631,魔力=298,力量=216,耐力=656,敏捷=190},
	  敏宠={伤害=1051,气血=14294,灵力=899,速度=1511,防御=1550,法防=500,躲闪=597,法伤=0,魔法=1042,体质=298,魔力=195,力量=195,耐力=195,敏捷=1037},
}

武器表 = {
	枪矛 = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"},
	斧钺 = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"},
	剑 = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"},
	双短剑 = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"},
	飘带 = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"},
	爪刺 = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"},
	扇 = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"},
	魔棒 = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"},
	锤 = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"},
	鞭 = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"},
	环圈 = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"},
	刀 = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"},
	法杖 = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"},
	弓弩 = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"},
	宝珠 = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"},
	巨剑 = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"},
	灯笼 = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"},
	伞 = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"},
	双斧乾 = {"顽石双斧(乾)","镔铁双斧(乾)","黑曜双斧(乾)","枭首双斧(乾)","破军双斧(乾)","隳城双戚(乾)","飞头蛮(乾)","竹叶青(乾)","鲛煞(乾)","啖月(乾)","义战(乾)","恶来(乾)","烬世野火(乾)","九州海沸(乾)","八狱末劫(乾)","罗喉计都(乾)","非天(乾)"},
 	双斧坤 = {"顽石双斧(坤)","镔铁双斧(坤)","黑曜双斧(坤)","枭首双斧(坤)","破军双斧(坤)","隳城双戚(坤)","飞头蛮(坤)","竹叶青(坤)","鲛煞(坤)","啖月(坤)","义战(坤)","恶来(坤)","烬世野火(坤)","九州海沸(坤)","八狱末劫(坤)","罗喉计都(坤)","非天(坤)"}

}

Qu武器数据={}
Qu武器数据["剑侠客"]={}
Qu武器数据["剑侠客"][160]={擒龙=3,鸣鸿=12} --剑，刀
Qu武器数据["剑侠客"][150]={霜冷九州=3,业火三灾=12}
Qu武器数据["剑侠客"][120]={魏武青虹=3,灵犀神剑=3,四法青云=3,偃月青龙=12,晓风残月=12,斩妖泣血=12}
Qu武器数据["剑侠客"][90]={鱼肠=3,湛卢=3,倚天=3,冷月=12,屠龙=12,血刃=12}

Qu武器数据["逍遥生"]={}
Qu武器数据["逍遥生"][160]={星瀚=7,擒龙=3} --扇子，剑
Qu武器数据["逍遥生"][150]={浩气长舒=7,霜冷九州=3}
Qu武器数据["逍遥生"][120]={画龙点睛=7,秋水人家=7,逍遥江湖=7,魏武青虹=3,灵犀神剑=3,四法青云=3}
Qu武器数据["逍遥生"][90]={太极=7,玉龙=7,秋风=7,鱼肠=3,倚天=3,湛卢=3}

Qu武器数据["飞燕女"]={}
Qu武器数据["飞燕女"][160]={浮犀=4,朝夕=11} --双短剑 环圈
Qu武器数据["飞燕女"][150]={紫电青霜=4,无关风月=11}
Qu武器数据["飞燕女"][120]={金龙双剪=4,连理双树=4,祖龙对剑=4,别情离恨=11,金玉双环=11,九天金线=11}
Qu武器数据["飞燕女"][90]={阴阳=4,月光双环=11}

Qu武器数据["英女侠"]={}
Qu武器数据["英女侠"][160]={浮犀=4,霜陨=10} --双短剑 鞭子
Qu武器数据["英女侠"][150]={紫电青霜=4,牧云清歌=10}
Qu武器数据["英女侠"][120]={祖龙对剑=4,仙人指路=10}
Qu武器数据["英女侠"][90]={阴阳=4,吹雪=10}

Qu武器数据["巫蛮儿"]={}
Qu武器数据["巫蛮儿"][160]={弦月=13,赤明=15} --法杖、宝珠
Qu武器数据["巫蛮儿"][150]={碧海潮生=13,云雷万里=15}
Qu武器数据["巫蛮儿"][120]={庄周梦蝶=13,凤翼流珠=13,雪蟒霜寒=13,紫金葫芦=15,裂云啸日=15,云雷万里=15}
Qu武器数据["巫蛮儿"][90]={业焰=13,玉辉=13,鹿鸣=13,离火=15,飞星=15,月华=15}

Qu武器数据["狐美人"]={}
Qu武器数据["狐美人"][160]={离钩=6,霜陨=9} --爪 鞭
Qu武器数据["狐美人"][150]={忘川三途=6,牧云清歌=9}
Qu武器数据["狐美人"][120]={九阴勾魂=6,雪蚕之刺=6,贵霜之牙=6,游龙惊鸿=9,仙人指路=9,血之刺藤=9}
Qu武器数据["狐美人"][90]={撕天=6,毒牙=6,胭脂=6,龙筋=9,百花=9,吹雪=9}

Qu武器数据["巨魔王"]={}
Qu武器数据["巨魔王"][160]={裂天=2,鸣鸿=12} -- 斧 刀
Qu武器数据["巨魔王"][150]={碧血干戚=2,业火三灾=12}
Qu武器数据["巨魔王"][120]={五丁开山=2,元神禁锢=2,护法灭魔=2,偃月青龙=12,晓风残月=12,斩妖泣血=12}
Qu武器数据["巨魔王"][90]={破魄=2,肃魂=2,无敌=2,冷月=12,屠龙=12,血刃=12}

Qu武器数据["虎头怪"]={}
Qu武器数据["虎头怪"][160]={裂天=2,碎寂=9} -- 斧 锤
Qu武器数据["虎头怪"][150]={碧血干戚=2,狂澜碎岳=9}
Qu武器数据["虎头怪"][120]={五丁开山=2,元神禁锢=2,护法灭魔=2,混元金锤=9,九瓣莲花=9,鬼王蚀日=9}
Qu武器数据["虎头怪"][90]={破魄=2,肃魂=2,无敌=2,八卦=9,鬼牙=9,雷神=9}

Qu武器数据["骨精灵"]={}
Qu武器数据["骨精灵"][160]={离钩=6,醍醐=8} --爪 棒
Qu武器数据["骨精灵"][150]={忘川三途=6,丝萝乔木=8}
Qu武器数据["骨精灵"][120]={九阴勾魂=6,雪蚕之刺=6,贵霜之牙=6,降魔玉杵=8,青藤玉树=8,墨玉骷髅=8}
Qu武器数据["骨精灵"][90]={撕天=6,毒牙=6,胭脂=6,沧海=8,红莲=8,盘龙=8}

Qu武器数据["杀破狼"]={}
Qu武器数据["杀破狼"][160]={若木=14,赤明=15} --弓  宝珠
Qu武器数据["杀破狼"][150]={九霄风雷=14,云雷万里=15}
Qu武器数据["杀破狼"][120]={冥火薄天=14,龙鸣寒水=14,太极流光=14,回风舞雪=15,紫金葫芦=15,裂云啸日=15}
Qu武器数据["杀破狼"][90]={非攻=14,幽篁=14,百鬼=14,离火=15,飞星=15,月华=15}

Qu武器数据["舞天姬"]={}
Qu武器数据["舞天姬"][160]={朝夕=11,九霄=5} --环 飘带
Qu武器数据["舞天姬"][150]={无关风月=11,揽月摘星=5}
Qu武器数据["舞天姬"][120]={别情离恨=11,金玉双环=11,九天金线=11,秋水落霞=5,晃金仙绳=5,此最相思=5}
Qu武器数据["舞天姬"][90]={如意=11,如意=11,乾坤=11,彩虹=5,流云=5,碧波=5}

Qu武器数据["玄彩娥"]={}
Qu武器数据["玄彩娥"][160]={醍醐=8,九霄=5} --棒 飘带
Qu武器数据["玄彩娥"][150]={丝萝乔木=8,揽月摘星=5}
Qu武器数据["玄彩娥"][120]={降魔玉杵=8,青藤玉树=8,墨玉骷髅=8,秋水落霞=5,晃金仙绳=5,此最相思=5}
Qu武器数据["玄彩娥"][90]={沧海=8,红莲=8,盘龙=8,彩虹=5,流云=5,碧波=5}

Qu武器数据["羽灵神"]={}
Qu武器数据["羽灵神"][160]={若木=14,弦月=13} --弓、法杖
Qu武器数据["羽灵神"][150]={九霄风雷=14,碧海潮生=13}
Qu武器数据["羽灵神"][120]={冥火薄天=14,龙鸣寒水=14,太极流光=14,庄周梦蝶=13,凤翼流珠=13,雪蟒霜寒=13}
Qu武器数据["羽灵神"][90]={非攻=14,幽篁=14,百鬼=14,业焰=13,玉辉=13,鹿鸣=13}

Qu武器数据["神天兵"]={}
Qu武器数据["神天兵"][160]={弑皇=1,碎寂=9} --枪 锤
Qu武器数据["神天兵"][150]={天龙破城=1,狂澜碎岳=9}
Qu武器数据["神天兵"][120]={刑天之逆=1,五虎断魂=1,飞龙在天=1,混元金锤=9,九瓣莲花=9,鬼王蚀日=9}
Qu武器数据["神天兵"][90]={暗夜=1,梨花=1,霹雳=1,八卦=9,鬼牙=9,雷神=9}

Qu武器数据["龙太子"]={}
Qu武器数据["龙太子"][160]={弑皇=1,星瀚=7} --枪 扇
Qu武器数据["龙太子"][150]={天龙破城=1,浩气长舒=7}
Qu武器数据["龙太子"][120]={刑天之逆=1,五虎断魂=1,飞龙在天=1,画龙点睛=7,秋水人家=7,逍遥江湖=7}
Qu武器数据["龙太子"][90]={暗夜=1,梨花=1,霹雳=1,太极=7,玉龙=7,秋风=7}

Qu武器数据["鬼潇潇"]={}
Qu武器数据["鬼潇潇"][160]={晴雪=17,离钩=6} --伞、爪刺
Qu武器数据["鬼潇潇"][150]={浮生归梦=17,忘川三途=6}
Qu武器数据["鬼潇潇"][120]={碧火琉璃=17,雪羽穿云=17,月影星痕=17,九阴勾魂=6,雪蚕之刺=6,贵霜之牙=6}
Qu武器数据["鬼潇潇"][90]={鬼骨=17,云梦=17,枕霞=17,撕天=6,毒牙=6,胭脂=6}

Qu武器数据["桃夭夭"]={}
Qu武器数据["桃夭夭"][160]={荒尘=18} --灯笼
Qu武器数据["桃夭夭"][150]={夭桃秾李=18}
Qu武器数据["桃夭夭"][120]={金风玉露=18}
Qu武器数据["桃夭夭"][90]={风荷=18}

Qu武器数据["偃无师"]={}
Qu武器数据["偃无师"][160]={擒龙=3,长息=16} --剑、巨剑
Qu武器数据["偃无师"][150]={霜冷九州=3,百辟镇魂=16}
Qu武器数据["偃无师"][120]={魏武青虹=3,灵犀神剑=3,四法青云=3,墨骨枯麟=16,腾蛇郁刃=16,秋水澄流=16}
Qu武器数据["偃无师"][90]={鱼肠=3,倚天=3,湛卢=3,鸦九=16,昆吾=16,弦歌=16}

function 取角色等级武器(模型,等级)
	local 序列 = 1
	if  等级 <= 20 then
		序列 = 1
	elseif 等级 <= 50 then
		序列 = 4
	elseif 等级<= 80 then
		序列 = 7
	elseif 等级<= 110 then
		序列 = 取随机数(10,12)
	elseif 等级<= 140 then
		序列 = 取随机数(13,15)
	elseif 等级<= 150 then
		序列 = 16
	else
    	序列 = 17
	end
	local 角色表 = {飞燕女 = {"双短剑","环圈"},英女侠 = {"双短剑","鞭"},巫蛮儿 = {"宝珠","法杖"},偃无师 = {"巨剑","剑"},逍遥生 = {"剑","扇"},剑侠客 = {"剑","刀"},狐美人= {"爪刺","鞭"},骨精灵 = {"爪刺","魔棒"},鬼潇潇= {"伞","爪刺"},杀破狼 = {"弓弩","宝珠"},巨魔王 = {"斧钺","刀"},虎头怪 = {"斧钺","锤"},舞天姬 = {"飘带","环圈"},玄彩娥 = {"飘带","魔棒"},桃夭夭 = {"灯笼","飘带"},羽灵神 = {"弓弩","法杖"},神天兵 = {"枪矛","锤"},龙太子 = {"枪矛","扇"},}
	return 武器表[角色表[模型][取随机数(1,2)]][序列] --返回的是武器名称
end

function 取140武器造型(角色)
  local 武器={}
  武器["剑侠客"]={武器="四法青云",级别=140}
  武器["逍遥生"]={武器="秋水人家",级别=140}
  武器["飞燕女"]={武器="九天金线",级别=140}
  武器["英女侠"]={武器="祖龙对剑",级别=140}
  武器["巫蛮儿"]={武器="紫金葫芦",级别=140}
  武器["狐美人"]={武器="游龙惊鸿",级别=140}
  武器["巨魔王"]={武器="护法灭魔",级别=140}
  武器["虎头怪"]={武器="元神禁锢",级别=140}
  武器["骨精灵"]={武器="九阴勾魂",级别=140}
  武器["杀破狼"]={武器="冥火薄天",级别=140}
  武器["舞天姬"]={武器="此最相思",级别=140}
  武器["玄彩娥"]={武器="青藤玉树",级别=140}
  武器["羽灵神"]={武器="庄周梦蝶",级别=140}
  武器["神天兵"]={武器="九瓣莲花",级别=140}
  武器["龙太子"]={武器="飞龙在天",级别=140}
  武器["鬼潇潇"]={武器="月影星痕",级别=140}
  武器["桃夭夭"]={武器="月露清愁",级别=140}
  武器["偃无师"]={武器="秋水澄流",级别=140}
  return 武器[角色]
end

function 门派首席处理(名称,模型,门派,等级,sj,玩家id)
	local fhsj = {
	名称 = 名称,
	模型 = 模型,
	武器 = 取武器数据(sj.武器,160),
	技能={},
	等级=等级,
	气血=玩家数据[玩家id].角色.气血,
	魔法=玩家数据[玩家id].角色.魔法,
	伤害=玩家数据[玩家id].角色.伤害,
	灵力=玩家数据[玩家id].角色.灵力,
	速度=玩家数据[玩家id].角色.速度,
	防御=玩家数据[玩家id].角色.防御,
	法防=玩家数据[玩家id].角色.法防,
	法伤=玩家数据[玩家id].角色.法伤,
	躲闪=玩家数据[玩家id].角色.速度,
	体质=玩家数据[玩家id].角色.体质,
	魔力=玩家数据[玩家id].角色.魔力,
	力量=玩家数据[玩家id].角色.力量,
	耐力=玩家数据[玩家id].角色.耐力,
	敏捷=玩家数据[玩家id].角色.敏捷,
	躲闪=玩家数据[玩家id].角色.躲闪,
	物伤减少=1,
	法伤减少=1,
	抵抗封印等级=0,
	封印命中等级=0,
	变身数据 = 变身,
	门派 = 门派,
	附加阵法 = 阵法,
	角色=true,
	}

	fhsj.主动技能={}
	fhsj.被动技能={}
	fhsj.法宝技能={}
	-- local fhz = 取门派技能(fhsj.门派)
	fhsj.AI战斗 = {AI=true}
	-- for s=1,#fhz do
	-- 	fhsj.被动技能[#fhsj.被动技能+1] =fhz[s]
	-- 	local fhz1 = 取包含技能(fhz[s])
	-- 	for n=1,#fhz1 do
	-- 		fhsj.主动技能[#fhsj.主动技能+1] =fhz1[n]
	-- 	end
	-- end
	fhz = Q_武神坛特技[fhsj.门派]
	for i=1,#fhz do
		fhsj.主动技能[#fhsj.主动技能+1] =fhz[i]
	end
	return fhsj
end

function 提取奇经八脉(mp)
	if mp == "方寸山" then
		return {"苦缠", "雷动", "奔雷", "黄粱", "不舍", "鬼怮", "补缺", "不倦", "不灭", "化身", "集中", "批亢", "斗法", "吐纳", "飞符炼魂", "鬼念", "碎甲", "摧心", "顺势而为", "额外能力", "钟馗论道"}
	elseif mp == "女儿村" then
		return {"自矜", "暗伤", "杏花", "花舞", "倩影", "淬芒", "傲娇", "花护", "天香", "国色", "鸿影", "轻霜", "机巧", "毒引", "毒雾", "嫣然", "磐石", "花殇", "碎玉弄影", "额外能力", "鸿渐于陆"}
	elseif mp == "神木林" then
		return {"风灵", "法身", "咒术", "灵压", "咒法", "蔓延", "鞭挞", "月影", "不侵", "风魂", "冰锥", "血契", "滋养", "纯净", "破杀", "追击", "灵能", "寄生", "风卷残云", "额外能力", "凋零之歌"}
	elseif mp == "化生寺" then
		return {"止戈", "销武", "佛屠", "佛誉", "仁心", "聚气", "佛显", "心韧", "归气", "天照", "舍利", "感念", "慈针", "佛性", "妙悟", "慈心", "映法", "流刚", "渡劫金身", "额外能力", "诸天看护"}
	elseif mp == "大唐官府" then
		return {"目空", "风刃", "扶阵", "翩鸿一击", "勇武", "长驱直入", "杀意", "念心", "静岳", "干将", "勇念", "神凝", "狂狷", "不惊", "突进", "破空", "历战", "连破", "无敌", "额外能力", "破军"}
	elseif mp == "阴曹地府" then
		return {"判官", "回旋", "夜行", "入骨", "聚魂", "六道无量", "索魂", "伤魂", "百炼", "黄泉", "毒印", "百爪狂杀", "幽光", "泉爆", "鬼火", "魂飞", "汲魂", "击破", "魑魅缠身", "额外能力", "夜之王者"}
	elseif mp == "盘丝洞" then
		return {"鼓乐", "妖气", "怜心", "迷瘴", "粘附", "意乱", "绝殇", "安抚", "忘忧", "忘川", "迷梦", "倾情", "情劫", "脱壳", "迷意", "结阵", "媚态", "利刃", "落花成泥", "额外能力", "偷龙转凤"}
	elseif mp == "无底洞" then
		return {"金莲", "追魂", "回敬", "由己渡人", "自愈", "陷阱", "化莲", "风墙", "御兽", "精进", "救人", "灵身", "持戒", "内伤", "反先", "忍辱", "暗潮", "噬魂", "同舟共济", "额外能力", "妖风四起"}
	elseif mp == "魔王寨" then
		return {"充沛", "炙烤", "震怒", "蚀天", "敛恨", "赤暖", "火神", "震天", "神焰", "神炎", "返火", "崩摧", "魔冥", "燃魂", "狂月", "威吓", "连营", "魔心", "魔焰滔天", "额外能力", "烈焰真诀"}
	elseif mp == "狮驼岭" then
		return {"爪印", "翼展", "驭兽", "化血", "宁息", "兽王", "狮吼", "怒象", "鹰啸", "乱破", "魔息", "威慑", "狂袭", "失心", "羁绊", "死地", "乱击", "悲恸", "背水一战", "额外能力", "肝胆相照"}
	elseif mp == "天宫" then
		return {"威吓", "疾雷", "轰鸣", "趁虚", "余韵", "驭意", "震慑", "神念", "伏魔", "苏醒", "护佑", "电芒", "月桂", "怒火", "灵光", "神律", "洞察", "雷波", "画地为牢", "额外能力", "风雷韵动"}
	elseif mp == "普陀山" then
		return {"化戈", "推衍", "借灵", "莲花心音", "生克", "默诵", "劳心", "普渡", "化怨", "甘露", "法印", "秘术", "灵动", "雨润", "莲心剑意", "玉帛", "道衍", "法咒", "波澜不惊", "额外能力", "五行制化"}
	elseif mp == "凌波城" then
		return {"山破", "战诀", "抗击", "聚气", "神诀", "魂聚", "神躯", "斩魔", "不动", "力战", "破击", "怒涛", "海沸", "怒火", "煞气", "强袭", "雷附", "再战", "天神怒斩", "额外能力", "真君显灵"}
	elseif mp == "五庄观" then
		return {"体恤", "锤炼", "神附", "心浪", "养生", "强击", "归本", "修心", "混元", "修身", "同辉", "雨杀", "乾坤", "意境", "傲视", "陌宝", "心随意动", "致命", "清风望月", "额外能力", "天命剑法"}
	elseif mp == "龙宫" then
		return {"波涛", "破浪", "云霄", "逐浪", "踏涛", "清吟", "天龙", "龙珠", "龙骇", "龙慑", "傲翔", "飞龙", "戏珠", "回魔", "月魂", "汹涌", "龙魄", "摧意", "亢龙归海", "额外能力", "雷浪穿云"}
	elseif mp == "女魃墓" then
		return {"腐蚀", "引魂", "咒怨", "不共戴天", "灵诅", "噬魔", "异兆", "不灭", "灵威", "余烬", "遗世", "怒火", "凋零", "血泉", "俱灭", "焕然", "伤蚀", "狂焰", "觉醒", "额外能力", "无相诛戮"}
	elseif mp == "天机城" then
		return {"锐志", "精奇", "善工", "玄机", "催锋", "巧偃", "连枷", "断矶", "纯青", "无痕", "奇肱", "攻云", "造化", "天匠", "穷变", "鲸甲", "天机神迹", "不厌", "铜山铁壁", "额外能力", "所向披靡"}
	elseif mp == "花果山" then
		return {"顽心", "逐胜", "愈勇", "斗志", "忘形", "贪天", "显圣", "锤炼", "火眼", "闹天", "铁骨", "搅海", "伏妖", "豪胆", "压邪", "战魄", "不坏", "荡魔", "战神", "额外能力", "齐天神通"}
	end
end

function 取门派主技能(门派)
	if 门派 == "大唐官府" then
		return "为官之道"
	elseif 门派 == "方寸山" then
		return "黄庭经"
	elseif 门派 == "化生寺" then
		return "小乘佛法"
	elseif 门派 == "女儿村" then
		return "毒经"
	elseif 门派 == "阴曹地府" then
		return "灵通术"
	elseif 门派 == "魔王寨" then
		return "牛逼神功"
	elseif 门派 == "狮驼岭" then
		return "魔兽神功"
	elseif 门派 == "盘丝洞" then
		return "蛛丝阵法"
	elseif 门派 == "天宫" then
		return "天罡气"
	elseif 门派 == "五庄观" then
		return "周易学"
	elseif 门派 == "龙宫" then
		return "九龙诀"
	elseif 门派 == "普陀山" then
		return "灵性"
	elseif 门派 == "神木林" then
		return "瞬息万变"
	elseif 门派 == "凌波城" then
		return "天地无极"
	elseif 门派 == "无底洞" then
		return "枯骨心法"
	elseif 门派 == "女魃墓" then
		return "天火献誓"
	elseif 门派 == "天机城" then
		return "神工无形"
	elseif 门派 == "花果山" then
		return "神通广大"
	end
	return "无门派主技能"
end

function 取门派技能(门派)
	local n = {}
	if 门派 == "大唐官府" then
		return {"为官之道", "无双一击", "神兵鉴赏", "疾风步", "十方无敌", "紫薇之术", "文韬武略"}
	elseif 门派 == "方寸山" then
		return {"黄庭经", "磐龙灭法", "霹雳咒", "符之术", "归元心法", "神道无念", "斜月步"}
	elseif 门派 == "化生寺" then
		return {"小乘佛法", "金刚伏魔", "诵经", "佛光普照", "大慈大悲", "歧黄之术", "渡世步"}
	elseif 门派 == "女儿村" then
		return {"毒经", "倾国倾城", "沉鱼落雁", "闭月羞花", "香飘兰麝", "玉质冰肌", "清歌妙舞"}
	elseif 门派 == "阴曹地府" then
		return {"灵通术", "六道轮回", "幽冥术", "拘魂诀", "九幽阴魂", "尸腐恶", "无常步"}
	elseif 门派 == "魔王寨" then
		return {"牛逼神功", "震天诀", "火云术", "火牛阵", "牛虱阵", "回身击", "裂石步"}
	elseif 门派 == "狮驼岭" then
		return {"魔兽神功", "生死搏", "训兽诀", "阴阳二气诀", "狂兽诀", "大鹏展翅", "魔兽反噬"}
	elseif 门派 == "盘丝洞" then
		return {"蛛丝阵法", "迷情大法", "秋波暗送", "天外魔音", "盘丝大法", "盘丝步", "姊妹相随"}
	elseif 门派 == "天宫" then
		return {"天罡气", "傲世诀", "清明自在", "宁气诀", "乾坤塔", "混天术", "云霄步"}
	elseif 门派 == "五庄观" then
		return {"周易学", "潇湘仙雨", "乾坤袖", "修仙术", "混元道果", "明性修身", "七星遁"}
	elseif 门派 == "龙宫" then
		return {"九龙诀", "破浪诀", "呼风唤雨", "龙腾术", "逆鳞术", "游龙术", "龙附术"}
	elseif 门派 == "普陀山" then
		return {"灵性", "护法金刚", "观音咒", "五行学说", "金刚经", "五行扭转", "莲花宝座"}
	elseif 门派 == "神木林" then
		return {"瞬息万变", "万灵诸念", "巫咒", "万物轮转", "天人庇护", "神木恩泽", "驭灵咒"}
	elseif 门派 == "凌波城" then
		return {"天地无极", "九转玄功", "武神显圣", "啸傲", "气吞山河", "诛魔", "法天象地"}
	elseif 门派 == "无底洞" then
		return {"枯骨心法", "阴风绝章", "鬼蛊灵蕴", "燃灯灵宝", "地冥妙法", "混元神功", "秘影迷踪"}
	elseif 门派 == "花果山" then
	 	return {"神通广大", "如意金箍", "齐天逞胜", "金刚之躯", "灵猴九窍", "七十二变", "腾云驾霧"}
	end
end

function 取包含技能(名称)
	local 技能 = {
		--大唐官府
		为官之道 = {"杀气诀","翩鸿一击"},
		无双一击 = {"后发制人"},
		神兵鉴赏 = {},
		疾风步 = {},
		十方无敌 = {"横扫千军", "破釜沉舟"},
		紫薇之术 = {"斩龙诀"},
		文韬武略 = {"反间之计", "安神诀","其疾如风", "其徐如林", "侵掠如火", "岿然如山"},
		--化生四
		小乘佛法 = {"紫气东来"},
		金刚伏魔 = {"佛法无边", "醍醐灌顶"},
		诵经 = {"唧唧歪歪"},
		佛光普照 = {"达摩护体", "金刚护法", "韦陀护法", "金刚护体", "一苇渡江"},
		大慈大悲 = {"我佛慈悲"},
		歧黄之术 = {"推拿", "活血", "推气过宫", "妙手回春", "救死扶伤", "解毒", "舍生取义"},
		渡世步 = {},
		--女儿村
		毒经 = {},
		倾国倾城 = {"红袖添香", "楚楚可怜", "一笑倾城"},
		沉鱼落雁 = {"满天花雨", "情天恨海", "雨落寒沙"},
		闭月羞花 = {"莲步轻舞", "如花解语", "似玉生香", "娉婷袅娜"},
		香飘兰麝 = {"月下霓裳"},
		玉质冰肌 = {"百毒不侵"},
		清歌妙舞 = {"飞花摘叶"},
		--方寸山
		黄庭经 = {"三星灭魔", "否极泰来"},
		磐龙灭法 = {},
		霹雳咒 = {"五雷咒"},
		符之术 = {"飞行符", "兵解符", "催眠符", "失心符", "落魄符", "失忆符", "追魂符", "离魂符", "失魂符", "定身符", "碎甲符", "落雷符"},
		归元心法 = {"归元咒", "凝神术"},
		神道无念 = {"乾天罡气", "分身术"},
		斜月步 = {},
		--龙宫
		九龙诀 = {"解封", "清心", "二龙戏珠"},
		破浪诀 = {"神龙摆尾", "龙战于野"},
		呼风唤雨 = {"龙卷雨击"},
		龙腾术 = {"龙腾"},
		逆鳞术 = {"逆鳞"},
		游龙术 = {"乘风破浪"},
		龙附术 = {"龙吟", "龙啸九天"},
		--普陀山
		灵性 = {"自在心法"},
		护法金刚 = {},
		观音咒 = {"紧箍咒", "杨柳甘露"},
		五行学说 = {"日光华", "靛沧海", "巨岩破", "苍茫树", "地裂火"},
		金刚经 = {"普渡众生", "灵动九天"},
		五行扭转 = {"五行错位", "颠倒五行", "清静菩提"},
		莲花宝座 = {},
		--五庄观
		周易学 = {"驱魔", "驱尸"},
		潇湘仙雨 = {"烟雨剑法", "飘渺式"},
		乾坤袖 = {"日月乾坤", "天地同寿", "乾坤妙法"},
		修仙术 = {"炼气化神", "生命之泉", "太极生化"},
		混元道果 = {},
		明性修身 = {"同伤式"},
		七星遁 = {},
		--天宫
		天罡气 = {"天神护体", "天神护法", "天诛地灭", "五雷轰顶", "雷霆万钧"},
		傲世诀 = {"天雷斩", "鸣雷诀"},
		清明自在 = {},
		宁气诀 = {"宁心"},
		乾坤塔 = {"镇妖", "错乱"},
		混天术 = {"百万神兵", "金刚镯"},
		云霄步 = {},
		--地府
		灵通术 = {"寡欲令"},
		六道轮回 = {"魂飞魄散", "无间地狱"},
		幽冥术 = {"阎罗令", "锢魂术", "黄泉之息"},
		拘魂诀 = {"判官令", "还阳术"},
		九幽阴魂 = {"冤魂不散"},
		尸腐恶 = {"尸腐毒", "修罗隐身"},
		无常步 = {},
		--狮驼岭
		魔兽神功 = {"变身", "魔兽啸天", "疯狂鹰击"},
		生死搏 = {"象形", "鹰击", "狮搏", "天魔解体"},
		训兽诀 = {"威慑"},
		阴阳二气诀 = {"定心术"},
		狂兽诀 = {"连环击"},
		大鹏展翅 = {},
		魔兽反噬 = {"极度疯狂"},
		--魔王
		牛逼神功 = {},
		震天诀 = {"魔火焚世"},
		火云术 = {"飞砂走石", "三昧真火", "火甲术"},
		火牛阵 = {"牛劲", "踏山裂石"},
		牛虱阵 = {"摇头摆尾"},
		回身击 = {"魔王回首"},
		裂石步 = {},
		--盘丝洞
		蛛丝阵法 = {"夺命蛛丝"},
		迷情大法 = {"含情脉脉", "瘴气", "魔音摄魂"},
		秋波暗送 = {"勾魂", "摄魄", "媚眼如丝"},
		天外魔音 = {},
		盘丝大法 = {"盘丝阵", "复苏"},
		盘丝步 = {"天罗地网", "幻镜术"},
		姊妹相随 = {"姐妹同心"},
		--凌波城
		天地无极 = {},
		九转玄功 = {"不动如山"},
		武神显圣 = {"碎星诀", "镇魂诀"},
		啸傲 = {},
		气吞山河 = {"裂石", "断岳势", "天崩地裂", "浪涌", "惊涛怒", "翻江搅海"},
		诛魔 = {"腾雷", "指地成钢"},
		法天象地 = {"无穷妙道", "无双战魂"},
		--无底洞
		枯骨心法 = {"移魂化骨"},
		阴风绝章 = {"夺魄令", "煞气诀", "惊魂掌", "摧心术"},
		鬼蛊灵蕴 = {"夺命咒"},
		燃灯灵宝 = {"明光宝烛", "金身舍利"},
		地冥妙法 = {"地涌金莲", "万木凋枯"},
		混元神功 = {"净土灵华"},
		秘影迷踪 = {},
		--神木林
		瞬息万变 = {"落叶萧萧"},
		万灵诸念 = {"荆棘舞", "尘土刃", "冰川怒"},
		巫咒 = {"雾杀", "血雨"},
		万物轮转 = {"星月之惠"},
		天人庇护 = {"炎护"},
		神木恩泽 = {"花语歌谣"},
		驭灵咒 = {"蜜润", "蝼蚁蚀天"},

      --花果山
		 神通广大 = {"威震凌霄", "气慑天军"},
		 如意金箍 = {"当头一棒", "神针撼海", "杀威铁棒", "泼天乱棒"},
		 齐天逞胜 = {"九幽除名", "移星换斗", "云暗天昏"},
		 金刚之躯 = {"担山赶月", "铜头铁臂"},
		 灵猴九窍 = {"无所遁形", "天地洞明", "除光息焰"},
		 七十二变 = {"呼子唤孙", "八戒上身"},
		 腾云驾霧 = {"筋斗云"},
	}
	return 技能[名称]
end

function 副本积分(名称)
	local 积分 = 0
	if 名称 == "胡姬琵琶行" then--玄天残卷、修炼果 银子5W
		积分 =100
	elseif 名称 == "泾河龙王" then--彩果、魔兽要诀 银子 九转金丹10W
		积分 =200
	elseif 名称 == "初出茅庐" then--宝图、储备、秘制烹饪 银子 九转金丹10W
		积分 =50
	elseif 名称 == "车迟斗法" then--彩果、魔兽要诀 银子16W
		积分 =200
	elseif 名称 == "四季" then--玄天残卷、修炼果 银子8W
		积分 =200
	elseif 名称 == "五庄观" then--宝图、宝石、彩果、魔兽要诀 银子16W
		积分 =100
	elseif 名称 == "水陆大会" then--珍珠、变身卡 银子4W
		积分 =200
	elseif 名称 == "乌鸡国" then -- 召唤兽装备、魔兽要诀 银子20W
		积分 =200
	elseif 名称 == "前世今生2" then--五宝、修炼果、兽诀 银子30W
		积分 =200
	elseif 名称 == "齐天大圣" then--五宝、修炼果 银子10W
		积分 =200
	elseif 名称 == "七绝山" then --高级宝石 银子30W
		积分 =300
	elseif 名称 == "天火之殇上部" then--月华露、储灵袋、分解符、彩果、修炼果。c66 银子15W
		积分 =200
	elseif 名称 == "黑风山" then--五宝、珍珠、彩果、c66、 银子15W
		积分 =200
	elseif 名称 == "无底洞" then--玄天残卷、修炼果 银子15W
		积分 =200
	elseif 名称 == "通天河" then-- 附魔宝珠、魔兽要诀 银子8W
		积分 =200
	elseif 名称 == "（侠）水陆大会" then --必得110-120珍珠、银子4W 概率树苗、强化石、如意丹
		积分 =200
	elseif 名称 == "红孩儿" then--玄天残卷、修炼果 银子8W
		积分 =200
	elseif 名称 == "大闹天宫" then -- 附魔宝珠、魔兽要诀 银子8W
		积分 =200
	elseif 名称 == "秘境降妖" then --五宝。兽诀 银子40W
		积分 =200--380 看是否跳关

	elseif 名称 == "轮回镜" then
	end

end

function 取种族敌对(玩家id)
	local 模型范围={"人","魔","仙"}
	if 玩家数据[玩家id].角色.种族=="人" then
		模型范围={"魔","仙"}
	elseif 玩家数据[玩家id].角色.种族=="魔" then
		模型范围={"人","仙"}
	elseif 玩家数据[玩家id].角色.种族=="仙" then
		模型范围={"魔","人"}
	end
	模型范围=模型范围[取随机数(1,2)]
	local 模型=""
	if 模型范围=="人" then
		模型=Q_随机模型[取随机数(1,5)]
	elseif 模型范围=="仙" then
		模型=Q_随机模型[取随机数(6,10)]
	elseif 模型范围=="魔" then
		模型=Q_随机模型[取随机数(11,15)]
	end
	return 模型
end

function 武神坛角色处理(名称,模型,门派,等级,阵法,变身)
	local fhsj = {
	名称 = 名称,
	模型 = 模型,
	武器 = 取武器数据(Q_随机武器[模型][7],160),
	技能={},
	等级=等级,
	--法宝技能={"苍白纸人","干将莫邪"},
	气血=Q_武神坛角色属性[门派].气血,
	魔法=Q_武神坛角色属性[门派].魔法,
	伤害=Q_武神坛角色属性[门派].伤害,
	灵力=Q_武神坛角色属性[门派].灵力,
	速度=Q_武神坛角色属性[门派].速度,
	防御=Q_武神坛角色属性[门派].防御,
	法防=Q_武神坛角色属性[门派].法防,
	法伤=Q_武神坛角色属性[门派].法伤,
	躲闪=Q_武神坛角色属性[门派].速度,
	体质=Q_武神坛角色属性[门派].体质,
	魔力=Q_武神坛角色属性[门派].魔力,
	力量=Q_武神坛角色属性[门派].力量,
	耐力=Q_武神坛角色属性[门派].耐力,
	敏捷=Q_武神坛角色属性[门派].敏捷,
	物伤减少=1,
	法伤减少=1,
	抵抗封印等级=0,
	封印命中等级=0,
	法宝佩戴 = Q_武神坛角色佩戴法宝[门派],
	变身数据 = 变身,
	门派 = 门派,
	附加阵法 = 阵法,
	修炼 = {防修=25,攻修=25},

	角色=true,
	}

	fhsj.主动技能={}
	fhsj.被动技能={}
	fhsj.法宝技能={}
	fhsj.AI战斗 = {AI=true}
	-- local fhz = 取门派技能(fhsj.门派)
	-- for s=1,#fhz do
	-- 	fhsj.被动技能[#fhsj.被动技能+1] =fhz[s]
	-- 	local fhz1 = 取包含技能(fhz[s])
	-- 	for n=1,#fhz1 do
	-- 		fhsj.主动技能[#fhsj.主动技能+1] =fhz1[n]
	-- 	end
	-- end
	fhz = Q_武神坛特技[fhsj.门派]
	for i=1,#fhz do
		fhsj.主动技能[#fhsj.主动技能+1] =fhz[i]
	end
	fhz = Q_武神坛法宝[fhsj.门派]
	for i=1,#fhz do
		fhsj.法宝技能[#fhsj.法宝技能+1] =fhz[i]
	end
	return fhsj
end

function 武神坛召唤兽处理(名称,模型,等级,阵法)
	local 宠物类型 = Q_武神坛宠物类型[取随机数(1,#Q_武神坛宠物类型)]
	local fhsj = {
	名称 = 名称,
	模型 = 模型,
	技能=Q_武神坛召唤兽技能[宠物类型],
	等级=等级,
	主动技能=Q_武神坛召唤兽主动技能[宠物类型],
	气血=Q_武神坛召唤兽属性[宠物类型].气血,
	魔法=Q_武神坛召唤兽属性[宠物类型].魔法,
	伤害=Q_武神坛召唤兽属性[宠物类型].伤害,
	灵力=Q_武神坛召唤兽属性[宠物类型].灵力,
	速度=Q_武神坛召唤兽属性[宠物类型].速度,
	防御=Q_武神坛召唤兽属性[宠物类型].防御,
	法防=Q_武神坛召唤兽属性[宠物类型].法防,
	法伤=Q_武神坛召唤兽属性[宠物类型].法伤,
	躲闪=Q_武神坛召唤兽属性[宠物类型].速度,
	体质=Q_武神坛召唤兽属性[宠物类型].体质,
	魔力=Q_武神坛召唤兽属性[宠物类型].魔力,
	力量=Q_武神坛召唤兽属性[宠物类型].力量,
	耐力=Q_武神坛召唤兽属性[宠物类型].耐力,
	敏捷=Q_武神坛召唤兽属性[宠物类型].敏捷,
	炫彩=取染色id(模型),
	炫彩组=取炫彩染色("灰黑色"),
	物伤减少=1,
	法伤减少=1,
	抵抗封印等级=0,
	封印命中等级=0,
	法宝佩戴 = Q_武神坛角色佩戴法宝[门派],
	变身数据 = 变身,
	门派 = 门派,
	附加阵法 = 阵法,
	修炼 = {防修=25,攻修=25},

	饰品显示 = false,
	被动技能={},
	法宝技能={},
	}

	return fhsj
end
取指引传送次数={}
取指引数据={
	坐标={
		游泳比赛={
			map=1092,
			xy={ X=145,Y=62 },
		},
		门派闯关={
			map=1001,
			xy={ X=128,Y=90 },
		},
		文韵墨香={
			map=1001,
			xy={ X=234,Y=168 },
		},
		彩虹争霸={
			map=1208,
			xy={ X=104,Y=45 },
		},
		降妖伏魔={
			map=1040,
			xy={ X=137,Y=104 },
		},
		帮派迷宫={
			map=1001,
			xy={ X=387,Y=15 },
		},
		天降辰星={
			map=1001,
			xy={ X=128,Y=97 },
		},
		帮战={
			map=1001,
			xy={ X=365,Y=159 },
		},
		保卫长安={
			map=1001,
			xy={ X=110,Y=49 },
		},
		比武大会={
			map=1001,
			xy={ X=110,Y=168 },
		},
		剑会={
			map=1001,
			xy={ X=145,Y=177 },
		},
		初出江湖={
			map=1001,
			xy={ X=407,Y=211 },
		},
		镖王活动={
			map=1024,
			xy={ X=31,Y=25 },
		},
		雁塔地宫={
			map=1001,
			xy={ X=445,Y=45 },
		},
		乌鸡国={
			map=1026,
			xy={ X=26,Y=25 },
		},
		车迟斗法={
			map=1070,
			xy={ X=131.2,Y=143.4  },
		},
		水陆大会={
			map=1002,
			xy={  X=34,Y=78 },
		},
		-- 一斛珠={
		-- 	map=1501,
		-- 	xy={  X=15,Y=18 },
		-- },
		五更寒={
			map=1501,
			xy={  X=15,Y=18 },
		},
		双城记={
			map=1501,
			xy={  X=15,Y=18 },
		},
		通天河={
			map=1070,
			xy={  X=47,Y=71 },
		},
 		通天塔={
 			map=1001,
 			xy={  X=240,Y=110 },
 		},
 		妖王争霸赛={
 			map=1001,
 			xy={  X=255,Y=116 },
 		},
 		降妖除魔={
 			map=1040,
 			xy={  X=140,Y=104 },
 		},
 		天降辰星={
 			map=1001,
 			xy={  X=130,Y=97 },
 		},
 		门派闯关={
 			map=1001,
 			xy={  X=131,Y=89 },
 		},
 		门皇宫飞贼={
 			map=1001,
 			xy={  X=104,Y=53 },
 		},
 		秘境降妖={
 			map=1001,
 			xy={  X=110,Y=51 },
 		},
 	    武神坛={
 			map=1001,
 			xy={  X=222,Y=103 },
 		},
 	    皇宫飞贼={
 			map=1001,
 			xy={  X=105,Y=55 },
 		},
 	    彩虹争霸赛={
 			map=1208,
 			xy={  X=108,Y=45 },
 		},
 	    蚩尤挑战={
 			map=1205,
 			xy={  X=67,Y=49 },
 		},
 	    红孩儿={
 			map=1210,
 			xy={  X=177,Y=36 },
 		},
 	    大闹天宫={
 			map=1070,
 			xy={  X=53,Y=18 },
 		},
 	 --    无底洞={
 		-- 	map=1040,
 		-- 	xy={  X=89,Y=34 },
 		-- },
 	    天火之殇上={
 			map=1092,
 			xy={  X=15,Y=120 },
 		},
 	    齐天大圣={
 			map=1092,
 			xy={  X=201,Y=16 },
 		},
 	 --    黑风山={
 		-- 	map=1110,
 		-- 	xy={  X=64,Y=67 },
 		-- },
  	    七绝山={
 			map=1173,
 			xy={  X=86,Y=75 },
 		},
  	    泾河龙王={
 			map=1044,
 			xy={  X=68,Y=52 },
 		},
	}
}