-- @Author: baidwwy
-- @Date:   2024-11-23 13:32:07
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-13 16:59:05
-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-15 15:40:11
function 产出物品计算(name) --还差个yuanxiao
	if name["装备特效宝珠"] and math.random(100)<=name["装备特效宝珠"] then
	    return "装备特效宝珠"
	elseif name["灵饰特效宝珠"] and math.random(100)<=name["灵饰特效宝珠"]  then
	    return "灵饰特效宝珠"
	elseif name["神兜兜"] and math.random(100)<=name["神兜兜"] then
	    return "神兜兜",取随机数(1,3)
	end
	local zgl = 0
	for _, rate in pairs(name) do
		zgl = zgl + rate
	end
	local num = math.random(zgl) --设置为100时 会有nil
	local lj = 0
	for item, rate in pairs(name) do
		lj = lj + rate
		if num <= lj then
			return item
		end
	end
end

function 生成产出(name,hd) --名称,数量,参数
	if __Funfa[name] then
		return __Funfa[name](name,hd)
	end
	return name,1
end

__Funfa={}
__Funfa["宝石"]=function(name,hd) --这个不对 1
	return 取宝石(),取随机数(HDPZ[hd]["宝石"][1],HDPZ[hd]["宝石"][2])
	-- 玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(3,4),nil,链接)
end
---------------------------------------------------------------
__Funfa["钟灵石"]=function(name,hd)
	return name,1,取随机数(1,3)
end
__Funfa["玄灵珠"]=function(name,hd)
	return 取玄灵珠(),1,取随机数(1,3)
end
__Funfa["月华露"]=function(name,hd)
	return name,取随机数(1,3)
end
__Funfa["星辉石"]=function(name,hd)
	return name,取随机数(1,3)
end
__Funfa["精魄灵石"]=function(name,hd)
	return name,取随机数(1,3)
end
__Funfa["灵犀之屑"]=function(name,hd)
	return name,取随机数(2,5)
end
__Funfa["青龙印"]=function(name,hd)
	return name,取随机数(1,1)
end
__Funfa["白虎印"]=function(name,hd)
	return name,取随机数(1,1)
end
__Funfa["朱雀印"]=function(name,hd)
	return name,取随机数(1,1)
end
__Funfa["玄武印"]=function(name,hd)
	return name,取随机数(1,1)
end

__Funfa["特效宝珠"]=function(name,hd)
	return "160特效宝珠",1
end


----------------------------------------------------------------

-- 玩家数据[cyid].道具:给予超链接道具(cyid,强化石,1,nil,链接,"成功")
__Funfa["强化石"]=function(name,hd)
	return 取强化石(),取随机数(1,1)
end

__Funfa["五宝"]=function(name,hd) --玩家数据[id].道具:给予道具(id,取五宝())
	return 取五宝()
end
__Funfa["未激活的符石"]=function(name,hd)
	return name,取随机数(1,1)
end

QJBBWP={"水晶糕","芝麻沁香元宵","桂花酒酿元宵","细磨豆沙元宵","蜜糖腰果元宵","山楂拔丝元宵","如意丹","滑玉莲蓉元宵","蜜糖腰果元宵","芝麻沁香元宵","桂花酒酿元宵","细磨豆沙元宵","蜜糖腰果元宵","山楂拔丝元宵","滑玉莲蓉元宵","蜜糖腰果元宵","炼兽真经"}
-- 玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
__Funfa["元宵"]=function(name,hd)
	return QJBBWP[取随机数(1,#QJBBWP)],取随机数(1,1)
end
-- 玩家数据[cyid].道具:给予超链接道具(cyid,钨金,1,160,链接)
__Funfa["钨金"]=function(name,hd)
	-- return name,1,取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]/10),qz(HDPZ[hd]["宝珠钨金珍珠"][2]/10))*10
	return name,取随机数(1,3),取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]/10),qz(HDPZ[hd]["宝珠钨金珍珠"][2]/10))*10
end
-- 玩家数据[cyid].道具:给予超链接道具(cyid,附魔宝珠,取随机数(15,16),nil,链接)
__Funfa["附魔宝珠"]=function(name,hd)
	-- return name,取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]/10),qz(HDPZ[hd]["宝珠钨金珍珠"][2]/10))*10
	return name,取随机数(1,1),取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]/10),qz(HDPZ[hd]["宝珠钨金珍珠"][2]/10))*10
end
-- 玩家数据[id].道具:给予道具(id,"珍珠",160,nil,"商店")
__Funfa["珍珠"]=function(name,hd)
	return name,1,取随机数(qz(HDPZ[hd]["宝珠钨金珍珠"][1]/10),qz(HDPZ[hd]["宝珠钨金珍珠"][2]/10))*10
end
-- 玩家数据[失败id].道具:给予超链接道具(失败id,高级摄灵珠,1,取随机数(10,30),链接)
__Funfa["高级摄灵珠"]=function(name,hd)
	return name,1,取随机数(20,50)
end
-- 玩家数据[cyid].道具:给予超链接道具(cyid,九转金丹,取随机数(100,200),nil,链接,"成功")
__Funfa["九转金丹"]=function(name,hd)
	return name,取随机数(HDPZ[hd]["金丹"][1],HDPZ[hd]["金丹"][2])
end
-- 玩家数据[id].道具:给予超链接道具(id,怪物卡片,取随机数(4,8),nil,链接,"成功")
__Funfa["怪物卡片"]=function(name,hd)
	return name,取随机数(HDPZ[hd]["怪物卡片"][1],HDPZ[hd]["怪物卡片"][2])
end
__Funfa["装备书铁"]=function(name,hd)
	local mc="制造指南书"
	if 取随机数()<40 then
		mc="百炼精铁"
	end
	local 书铁等级=取随机数(qz(HDPZ[hd]["书铁"][1]/10),qz(HDPZ[hd]["书铁"][2]/10))*10 --{150,150} 书铁
	local 书铁种类=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		书铁种类=取随机数(19,#书铁范围)
	end
	书铁等级=math.floor(书铁等级/10)*10
	return mc,书铁等级,书铁种类
	-- if 取随机数()<=50 then
	--             return "装备书铁" ,{qz(num[1]/10),qz(num[2]/10)} ,"书"
	-- else
	-- 	return "装备书铁" ,{qz(num[1]/10),qz(num[2]/10)} ,"铁"
	-- end
end
__Funfa["百炼精铁"]=function(name,hd)
	local mc="百炼精铁"
	local 书铁等级=取随机数(qz(HDPZ[hd]["书铁"][1]/10),qz(HDPZ[hd]["书铁"][2]/10))*10 --{150,150} 书铁
	local 书铁种类=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		书铁种类=取随机数(19,#书铁范围)
	end
	书铁等级=math.floor(书铁等级/10)*10
	return mc,书铁等级,书铁种类
end
__Funfa["制造指南书"]=function(name,hd)
	local mc="制造指南书"
	local 书铁等级=取随机数(qz(HDPZ[hd]["书铁"][1]/10),qz(HDPZ[hd]["书铁"][2]/10))*10 --{150,150} 书铁
	local 书铁种类=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		书铁种类=取随机数(19,#书铁范围)
	end
	书铁等级=math.floor(书铁等级/10)*10
	return mc,书铁等级,书铁种类
end

__Funfa["灵饰书铁"]=function(name,hd) --等级也可以不自己设置
	if 取随机数()<=50 then
	    return "元灵晶石",{(math.random(1,5)*2+4)}
	else
		return "灵饰指南书",{(math.random(1,5)*2+4)}
	end
	-- local mc="灵饰指南书"
	-- if 取随机数()<=55 then
	-- 	mc="元灵晶石"
	-- end
	-- local fanwei={num[1],num[2]}
	-- if num[2]>14 then
	--         fanwei={12,14}
	-- end
	-- return mc,fanwei
	-- 玩家数据[id].道具:给予超链接道具(id,名称,fanwei,nil,链接,"成功")
end
__Funfa["宝宝书铁"]=function(name,hd) --等级也可以不自己设置
	if 取随机数()<=60 then
		return "炼妖石",{(math.random(8,16))}
	else
		return "上古锻造图策",{(math.random(8,16))}
	end
end



function 取暗器(等级)
	local 名称="飞刀"
	if 等级==1 then
		名称="飞刀"
	elseif 等级==2 then
		名称="飞蝗石"
	elseif 等级==3 then
		名称="铁蒺黎"
	elseif 等级==4 then
		名称="无影神针"
	elseif 等级==5 then
		名称="孔雀翎"
	elseif 等级==6 then
		名称="含沙射影"
	elseif 等级==7 then
		名称="回龙镊魂镖"
	elseif 等级==8 then
		名称="寸阴若梦"
	elseif 等级==9 then
		名称="魔睛子"
	elseif 等级==10 then
		名称="顺逆神针"
	end
	return 名称
end
__Funfa["暗器"]=function(name,hd)
	return 取暗器(取随机数(1,10))
end

书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
function 开始生成环装(lv)

	local 临时等级=lv
	local 临时参数=取随机数(1,#书铁范围)
	if 取随机数()<=40 then
		临时参数=取随机数(19,#书铁范围)
	end
	local 临时序列=临时参数
	if 临时序列==25 then
		临时序列=23
	elseif 临时序列==24 then
		临时序列=22
	elseif 临时序列==23 or 临时序列==22 then
		临时序列=21
	elseif 临时序列==21 then
		临时序列=20
	elseif 临时序列==20 or 临时序列==19 then
		临时序列=19
	end
	-- local 临时等级=玩家数据[id].道具.数据[制造格子].子类/10
	-- 计算武器值
	if 临时序列<=18 and 临时等级>=9 then --是武器 10-12是普通光武
		临时等级=取随机数(10,12)
	else
		if 临时等级>=12 then
			临时等级=13
		end
	end
	local 临时类型=装备处理类.打造物品[临时序列][临时等级+1]
	if type(临时类型)=="table" then
		if 临时参数 ==23 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==22 then
		 临时类型=临时类型[1]
		elseif 临时参数 ==20 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==19 then
		 临时类型=临时类型[1]
		else
			临时类型=临时类型[取随机数(1,2)]
		end
	end

	return 装备处理类:生成环装(id,临时等级*10,临时序列,临时类型,"系统产出") --所有系统产出的都给他未鉴定，让他自己鉴定去
end

-- 玩家数据[cyid].道具:取随机装备(cyid,取随机数(5,8))
__Funfa["环装"]=function(name,hd)
	return 开始生成环装(取随机数(5,8)),9999
end

QSJZW={"回梦丹","天眼通符","回梦丹","秘制回梦饮","如意丹","彩果","金柳露","超级金柳露","净瓶玉露","超级净瓶玉露","五宝盒","福禄丹","高级摄灵珠","天赋符","分解符","储灵袋","易经丹","玉葫灵髓"}
__Funfa["杂物"]=function(name,hd)
	return QSJZW[取随机数(1,#QSJZW)],1
end

HDPZ={}
-- if f函数.文件是否存在([[全局bl.txt]])==false then
if f函数.文件是否存在([[全局bl.txt]])==false or f函数.文件是否存在([[全局bl.txt]]) then

	HDPZ={

镖王任务={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=1,
		ITEM={
		   杂物=1,
		   鬼谷子=1,
		   宝石=1,
		   怪物卡片=1,

	},},

新手活动怪={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=2,
		ITEM={
		   杂物=2,
		   宝石=2,
		   随机经验礼包=1,
		   强化石=2,
		   金丹=1,
		   装备书铁=1,
		   修炼果=1,
		   十万银票=1,

	},},

抓鬼={难度=1,经验=1,银子=1,爆率=100,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=3,
		ITEM={
		   环装=1,
		   杂物=1,
		   强化石=1,
	},},

鬼王={难度=1,经验=1.2,银子=1.5,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=4,
		ITEM={
		   环装=1,
		   杂物=1,
		   强化石=1,
		   怪物卡片=1,
		   金丹=1,
		   修炼果=2,
		   十万银票=1,


	},},

封妖={难度=1,经验=1.3,银子=1.8,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=5,
		ITEM={

		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   宝宝书铁=1,
		   宠装特效宝珠=1,
		   魔兽要诀=1,
		   高级魔兽要诀=1,
		   召唤兽内丹=1,
		   高级召唤兽内丹=1,
		   装备特效宝珠=1,
		   灵饰特效宝珠=1,
		   双加转换符=1,
		   不磨符=1,
		   特技书=1,
		   愤怒符=1,
		   淬灵石=1,
		   吸附石=1,
		   特效宝珠=1,
		   百万银票=1,
	},},

-- 妖土侍者={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
-- 	 排序=6,
-- 		ITEM={
-- 			杂物=1,
-- 		   强化石=5,
-- 	},},

-- 妖土护法={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
-- 	 排序=7,
-- 		ITEM={
-- 			杂物=1,
-- 		   钨金=5,
-- 	},},

-- 妖土灵王={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
-- 	 排序=8,
-- 		ITEM={

-- 		   杂物=10,
-- 		   陨铁=10,
-- 		   特殊兽诀·碎片=1,
-- 		   超级兽诀·碎片=1,

-- 	},},

-- 妖土神王={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
-- 	 排序=9,
-- 		ITEM={
-- 			杂物=10,
-- 			战魄=10,
-- 			特殊兽诀·碎片=1,
-- 		   超级兽诀·碎片=1,
-- 	},},

-- 妖土圣主={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
-- 	 排序=10,
-- 		ITEM={
-- 			杂物=10,
-- 		   附魔宝珠=10,
-- 		   特殊兽诀·碎片=1,
-- 		   超级兽诀·碎片=1,
-- 	},},

门派闯关={难度=1,经验=1.2,银子=1.1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=11,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   怪物卡片=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   魔兽要诀=5,
		   高级魔兽要诀=2,
		   附魔宝珠=2,
		   随机仙玉礼包=1,
		   随机经验礼包=1,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,
		   十万银票=1,
	},},

游泳比赛={难度=1,经验=1.3,银子=1.5,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=12,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   高级召唤兽内丹=2,
		   随机仙玉礼包=1,
		   随机经验礼包=1,
	},},

文韵墨香={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=13,
		ITEM={
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钟灵石=1,
		   精魄灵石=1,
		   玄灵珠=1,
		   星辉石=1,
		   灵犀之屑=1,
		   未激活的星石=1,
		   吸附石=1,
		   清灵净瓶=1,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		   陨铁=1,
		   随机经验微礼包=1,

	},},

天降辰星={难度=1,经验=1.5,银子=1.2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=14,
		ITEM={
		   宝石=1,
		   强化石=1,
		   装备书铁=2,
		   怪物卡片=2,
		   修炼果=2,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		   随机经验微礼包=1,


	},},

彩虹：场景小怪={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=15,
		ITEM={
		   杂物=1,
		   宝石=1,
		   随机经验礼包=1,

	},},

彩虹：传送大使={难度=1,经验=1.5,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=16,
		ITEM={
			杂物=1,
		    宝石=1,
		    随机经验微礼包=1,
		    特殊兽诀·碎片=1,
		    超级兽诀·碎片=1,


	},},

彩虹：仙境泡泡={难度=1,经验=1.7,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=17,
		ITEM={
			杂物=1,
			随机仙玉礼包=1,
		    随机经验礼包=1,


	},},

铃铛：小怪={难度=1,经验=1,银子=1.1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=18,
		ITEM={
		   宝石=1,
		   强化石=1,
		   装备书铁=2,
		   怪物卡片=2,
		   修炼果=2,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
	},},

铃铛：千年魔灵={难度=1,经验=1.5,银子=1.1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=19,
		ITEM={
		   宝石=1,
		   强化石=1,
		   装备书铁=2,
		   怪物卡片=2,
		   修炼果=2,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,
	},},

铃铛：万年魔灵={难度=1.2,经验=1.8,银子=1.2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=20,
		ITEM={
		   宝石=1,
		   强化石=1,
		   装备书铁=2,
		   怪物卡片=2,
		   随机仙玉礼包=1,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		   随机仙玉小礼包=1,
		   随机经验小礼包=1,
	},},

保卫长安：小怪先锋={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=21,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   高级召唤兽内丹=2,
		   随机仙玉礼包=1,
		   随机经验礼包=1,

	},},

保卫长安：小怪头目={难度=1,经验=1.1,银子=1.1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=22,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   高级召唤兽内丹=2,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,

	},},

保卫长安：小怪头目={难度=1,经验=1.1,银子=1.1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=23,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   高级召唤兽内丹=2,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,

	},},

保卫长安：小怪大王={难度=1.1,经验=1.3,银子=1.3,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=24,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   随机经验礼包=2,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,

	},},

保卫长安：魑魅魍魉={难度=1.2,经验=1.5,银子=1.5,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=25,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   随机仙玉小礼包=1,
		   随机经验小礼包=1,

	},},

保卫长安：鼍龙兕怪={难度=1,经验=1.7,银子=1.7,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=26,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   随机仙玉礼包=2,
		   随机仙玉小礼包=1,
		   随机经验小礼包=1,

	},},

保卫长安：振威大王={难度=1,经验=2,银子=2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=27,
		ITEM={
		   怪物卡片=1,
		   宝石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   召唤兽内丹=5,
		   随机仙玉中礼包=1,
		   随机经验中礼包=1,

	},},

剑会：胜利={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={5,8},金丹={100,200},怪物卡片={1,8},
	 排序=28,
		ITEM={
			杂物=1,
			随机仙玉微中礼包=1,
			宝石=1,
			陨铁=1,


	},},

剑会：失败={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={3,6},金丹={100,200},怪物卡片={1,8},
	 排序=29,
		ITEM={
			杂物=1,
			宝石=1,
			随机仙玉礼包=1,




	},},

帮战：PVP胜利={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=30,
		ITEM={
			杂物=1,
			随机仙玉中礼包=1,
			宝石=1,
			陨铁=1,
			战魄=1,

	},},

帮战：胜利奖励={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=31,
		ITEM={
			杂物=1,
			随机仙玉小礼包=1,
			宝石=1,
			陨铁=1,
			战魄=1,

	},},

帮战：失败奖励={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=32,
		ITEM={
			杂物=1,
			随机经验礼包=1,

	},},

帮战伐木：伐木工={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=33,
		ITEM={
			杂物=1,
			随机经验微礼包=1,

	},},

帮战夺旗：夺旗守卫={难度=1.1,经验=1.1,银子=1.3,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=34,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
			随机经验微礼包=1,
			随机仙玉微礼包=1,


	},},

帮战夺旗：抢夺旗帜={难度=1.2,经验=1.2,银子=1.5,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=35,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
			随机仙玉中礼包=1,
			随机经验中礼包=1,


	},},

天罡：星级1={难度=1,经验=1,银子=1,爆率=10,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=36,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉微礼包=1,
		   	随机经验微礼包=1,

	},},

天罡：星级2={难度=1,经验=1.5,银子=1.5,爆率=15,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=37,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉微礼包=1,
		   	随机经验微礼包=1,


	},},

天罡：星级3={难度=1,经验=1.8,银子=1.8,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=37 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉小礼包=1,
		   	随机经验小礼包=1,

	},},

天罡：星级4={难度=1,经验=2,银子=2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=38 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉小礼包=1,
		   	随机经验小礼包=1,
		   	抽奖令牌=1,
		   	战魄=2,

	},},

天罡：星级5={难度=1,经验=2.5,银子=2.5,爆率=30,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=39 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉中礼包=1,
		   	随机经验中礼包=1,
		   	战魄=2,
		   	抽奖令牌=1,
	},},

天罡：星级6={难度=1,经验=3,银子=3,爆率=35,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=40 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉中礼包=1,
		   	随机经验中礼包=1,
		   	战魄=2,
		   	抽奖令牌=1,
	},},

地煞：星级1={难度=1,经验=1,银子=1,爆率=10,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=41 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉微礼包=1,
		   	随机经验微礼包=1,

	},},

地煞：星级2={难度=1,经验=1.5,银子=1.5,爆率=15,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=42 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉微礼包=1,
		   	随机经验微礼包=1,

	},},

地煞：星级3={难度=1,经验=1.8,银子=1.8,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=43 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉礼包=1,
		   	随机经验礼包=1,
		   	随机仙玉小礼包=1,
		   	随机经验小礼包=1,

	},},

地煞：星级4={难度=1,经验=2,银子=2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=44 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉礼包=1,
		   	随机经验礼包=1,
		   	随机仙玉小礼包=1,
		   	随机经验小礼包=1,
		   	抽奖令牌=1,
		   	战魄=2,

	},},

地煞：星级5={难度=1,经验=2.5,银子=2.5,爆率=30,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=45 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉中礼包=1,
		   	随机经验中礼包=1,
		   	抽奖令牌=1,
		   	战魄=2,
	},},

地煞：星级6={难度=1,经验=3,银子=3,爆率=35,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=46 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	随机仙玉中礼包=1,
		   	随机经验中礼包=1,
		   	抽奖令牌=1,
		   	战魄=2,
	},},

投放怪：巡山小妖={难度=1,经验=1,银子=1,爆率=60,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=47 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=5,
		   未激活的符石=1,
		   元宵=1,
		   钨金=5,
		   珍珠=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   灵犀之屑=1,
		   摇钱树苗=1,
		   未激活的星石=1,
		   吸附石=1,
		   镇妖拘魂铃=1,
		   清灵净瓶=2,
		   随机仙玉礼包=1,
		   随机经验礼包=1,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,

	},},

投放怪：白骨精={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=48 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=5,
		   未激活的符石=1,
		   元宵=1,
		   钨金=5,
		   珍珠=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   灵犀之屑=1,
		   摇钱树苗=1,
		   未激活的星石=1,
		   吸附石=1,
		   镇妖拘魂铃=1,
		   清灵净瓶=2,
		   随机仙玉礼包=1,
		   随机经验礼包=1,
		   随机仙玉微礼包=1,
		   随机经验微礼包=1,

	},},

投放怪：狮驼国={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=49 + 1,
		ITEM={
			杂物=1,
			未激活的符石=1,
			未激活的星石=1,
			魔兽要诀=1,
			高级魔兽要诀=1,
		    随机仙玉小礼包=1,
		    随机经验小礼包=1,
		    随机仙玉微礼包=1,
		    随机经验微礼包=1,

	},},

裂风兽={难度=1,经验=1.4,银子=1.4,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=50 + 1,
		ITEM={
			杂物=1,
			未激活的符石=1,
			未激活的星石=1,
		    特殊兽诀·碎片=1,
		    超级兽诀·碎片=1,
			魔兽要诀=1,
			高级魔兽要诀=1,
		    随机仙玉小礼包=1,
		    随机经验小礼包=1,
		    随机仙玉微礼包=1,
		    随机经验微礼包=1,
		   	抽奖令牌=1,

	},},

冒牌小白龙={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=51 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,

	},},

冒牌沙僧={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=52 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,

	},},

冒牌猪八戒={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=53 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,

	},},

冒牌大圣={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=53 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,

	},},

冒牌唐僧={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=54 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,
	},},

六耳猕猴={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=55 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,

	},},

是俺老孙={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=56 + 1,
		ITEM={
			杂物=1,
			装备书铁=1,
			灵饰书铁=1,
			宝宝书铁=1,

	},},

二十八星宿={难度=1,经验=1.9,银子=3,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=57 + 1,
		ITEM={


		   钟灵石=1,
		   精魄灵石=1,
		   玄灵珠=1,
		   鬼谷子=1,
		   月华露=1,
		   星辉石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		    随机仙玉礼包=1,
		    随机经验礼包=1,
		    随机仙玉微礼包=1,
		    随机经验微礼包=1,



	},},

远古妖魔头目={难度=1,经验=3,银子=3,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=58 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		    随机仙玉礼包=1,
		    随机经验礼包=1,

	},},
远古妖魔领主={难度=1.3,经验=4,银子=4,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=59 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,

	},},
远古妖魔尊主={难度=1.5,经验=5,银子=5,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=60 + 1,
		ITEM={
			特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,

	},},
车迟斗法三清={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=61 + 1,
		ITEM={
			杂物=1,

	},},
车迟斗法雷电雨={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=62 + 1,
		ITEM={
			杂物=1,

	},},
车迟斗法三妖={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=63 + 1,
		ITEM={
			杂物=1,

	},},
地宫1至10={难度=1,经验=1.1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=64 + 1,
		ITEM={

		杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		   菩提果=1,
	},},
地宫11至20={难度=1.2,经验=1.2,银子=1.2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=65 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=2,
		   超级兽诀·碎片=2,
		   菩提果=2,
	},},
地宫21至30={难度=1.3,经验=1.3,银子=1.3,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=66 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=3,
		   超级兽诀·碎片=3,
		   菩提果=3,
	},},
地宫31至40={难度=1.4,经验=1.4,银子=1.4,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=67 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=4,
		   超级兽诀·碎片=4,
		   菩提果=4,
	},},
地宫41至50={难度=1.5,经验=1.5,银子=1.5,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=68 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=5,
		   超级兽诀·碎片=5,
		   菩提果=5,
	},},
地宫51至60={难度=1.6,经验=1.6,银子=1.6,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=69 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=5,
		   超级兽诀·碎片=5,
		   菩提果=5,
	},},
地宫61至70={难度=1.7,经验=1.7,银子=1.7,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=70 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=5,
		   超级兽诀·碎片=5,
		   菩提果=5,
	},},
地宫71至80={难度=1.8,经验=1.8,银子=1.8,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=71 + 1,
		ITEM={
			杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=5,
		   超级兽诀·碎片=5,
		   菩提果=5,
	},},
地宫81至90={难度=1.9,经验=1.9,银子=1.9,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=72 + 1,
		ITEM={

		   杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=5,
		   超级兽诀·碎片=5,
		   菩提果=5,
	},},
地宫91至100={难度=2,经验=2,银子=2,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=73 + 1,
		ITEM={

		   杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

		   特殊兽诀·碎片=5,
		   超级兽诀·碎片=5,
		   菩提果=5,
	},},
蚩尤元神={难度=1,经验=3,银子=3,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=74 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	特效宝珠=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,

	},},
自动抓鬼={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=75 + 1,
		ITEM={
			杂物=1,

	},},
妖王={难度=1,经验=1.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=76 + 1,
		ITEM={
			杂物=1,

	},},
通天塔={难度=1,经验=1.3,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			杂物=1,

	},},

黑神话：星级1={难度=1,经验=2.1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,
            随机仙玉小礼包=1,
            随机经验小礼包=1,
            随机仙玉中礼包=1,
            随机经验中礼包=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,

	},},
黑神话：星级2={难度=1,经验=2.2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,
            随机仙玉小礼包=1,
            随机经验小礼包=1,
            随机仙玉中礼包=1,
            随机经验中礼包=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,


	},},
黑神话：星级3={难度=1,经验=2.3,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,
            随机仙玉小礼包=1,
            随机经验小礼包=1,
            随机仙玉中礼包=1,
            随机经验中礼包=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,


	},},
黑神话：星级4={难度=1,经验=2.4,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,
            随机仙玉中礼包=1,
            随机经验中礼包=1,
            随机仙玉大礼包=1,
            随机经验大礼包=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,


	},},
黑神话：星级5={难度=1,经验=2.5,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,
            随机仙玉中礼包=1,
            随机经验中礼包=1,
            随机仙玉大礼包=1,
            随机经验大礼包=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,

	},},
黑神话：星级6={难度=1,经验=2.6,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	附魔宝珠=1,
		   	战魄=1,
            随机仙玉中礼包=1,
            随机经验中礼包=1,
            随机仙玉大礼包=1,
            随机经验大礼包=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,

	},},
黑神话：星级7={难度=1,经验=2.7,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	-- 武圣称谓=1,
		   	附魔宝珠=1,
		   	战魄=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,
		   	随机仙玉中礼包=1,
            随机经验中礼包=1,
            随机仙玉大礼包=1,
            随机经验大礼包=1,

	},},
黑神话：星级8={难度=1,经验=2.8,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	-- 武圣称谓=1,
		   	附魔宝珠=1,
		   	战魄=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,
		   	随机仙玉中礼包=1,
            随机经验中礼包=1,
            随机仙玉大礼包=1,
            随机经验大礼包=1,

	},},
黑神话：星级9={难度=1,经验=2.9,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=77 + 1,
		ITEM={
			特殊兽诀·碎片=1,
		   	超级兽诀·碎片=1,
		   	抽奖令牌=1,
		   	灵兽星斗盘=1,
		   	特殊清灵仙露=1,
		   	菩提果=1,
		   	-- 武圣称谓=1,
		   	附魔宝珠=1,
		   	战魄=1,
		   	特效宝珠=1,
		   	装备特效宝珠=1,
		   	灵饰特效宝珠=1,
		   	不磨符=1,
		   	双加转换符=1,
		   	特技书=1,
		   	愤怒符=1,
		   	宠装特效宝珠=1,
		   	随机仙玉中礼包=1,
            随机经验中礼包=1,
            随机仙玉大礼包=1,
            随机经验大礼包=1,

	},},

初出江湖={难度=1,经验=2,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=78 + 1,
		ITEM={
			杂物=1,
			怪物卡片=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,

	},},

圣兽青龙={难度=1,经验=1.3,银子=1.1,爆率=40,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=79 + 1,
		ITEM={
			青龙印=2,
			精魄灵石=1,
			怪物卡片=1,
	},},
圣兽白虎={难度=1,经验=1.3,银子=1.1,爆率=40,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=80 + 1,
		ITEM={
			白虎印=2,
			精魄灵石=1,
			怪物卡片=1,
	},},
圣兽朱雀={难度=1,经验=1.3,银子=1.1,爆率=40,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=81 + 1,
		ITEM={
			朱雀印=2,
			精魄灵石=1,
			怪物卡片=1,
	},},
圣兽玄武={难度=1,经验=1.3,银子=1.1,爆率=40,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=82 + 1,
		ITEM={
			玄武印=2,
			精魄灵石=1,
			怪物卡片=1,
	},},
龙族={难度=1,经验=1.7,银子=1.5,爆率=40,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=83 + 1,
		ITEM={
			精魄灵石=1,
			宝宝书铁=1,
		   宠装特效宝珠=1,
		   仙露小丸子=1,
		   神兽涎=1,
		   青龙印=2,
		   白虎印=2,
		   朱雀印=2,
		   玄武印=2,
	},},
摇钱树={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=84 + 1,
		ITEM={
			精魄灵石=6,
			宝石=8,
			彩果=5,
			怪物卡片=6,
			金柳露=10,
			超级金柳露=6,
			特赦令牌=2,
			十万银票=1,
			百万银票=1,
	},},
剑会5v5：胜利={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=86,
		ITEM={
			杂物=1,

	},},

剑会5v5：失败={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=87,
		ITEM={
			杂物=1,

	},},

全服物品奖励={难度=1,经验=1,银子=1,爆率=100,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=88,
		ITEM={
			杂物=1,
	},},
红孩儿副本={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	 排序=89,
		ITEM={
			杂物=1,
	},},


爆率模板={难度=1,经验=1,银子=1,爆率=25,书铁={150,150},宝珠钨金珍珠={160,160},宝石={1,5},金丹={100,200},怪物卡片={1,8},
	     排序=111,
		 ITEM={
		   杂物=1,
		   宝石=1,
		   强化石=1,
		   未激活的符石=1,
		   元宵=1,
		   钨金=1,
		   附魔宝珠=1,
		   珍珠=1,
		   高级摄灵珠=1,
		   怪物卡片=1,
		   环装=1,
		   暗器=1,
		   装备书铁=1,
		   灵饰书铁=1,
		   宝宝书铁=1,
		   宠装特效宝珠=1,
		   钟灵石=1,
		   精魄灵石=1,
		   玄灵珠=1,
		   鬼谷子=1,
		   月华露=1,
		   星辉石=1,
		   藏宝图=1,
		   高级藏宝图=1,
		   玲珑宝图=1,
		   特殊兽诀·碎片=1,
		   超级兽诀·碎片=1,
		   灵犀之屑=1,
		   种族坐骑=1,
		   摇钱树苗=1,
		   九转金丹=1,
		   随机仙玉礼包=1,
		   随机仙玉微礼包=1,
		   随机仙玉小礼包=1,
		   随机仙玉中礼包=1,
		   随机仙玉大礼包=1,
		   随机经验礼包=1,
		   随机经验微礼包=1,
		   随机经验小礼包=1,
		   随机经验中礼包=1,
		   随机经验大礼包=1,
           十万银票=1,
           百万银票=1,
		   修炼果=1,
		   魔兽要诀=1,
		   高级魔兽要诀=1,
		   召唤兽内丹=1,
		   高级召唤兽内丹=1,
		   未激活的星石=1,
		   神兜兜=1,
		   灵兜兜=1,
		   装备特效宝珠=1,
		   灵饰特效宝珠=1,
		   双加转换符=1,
		   不磨符=1,
		   特技书=1,
		   愤怒符=1,
		   淬灵石=1,
		   陨铁=1,
		   战魄=1,
		   吸附石=1,
		   镇妖拘魂铃=1,
		   清灵净瓶=1,
		   仙露小丸子=1,
		   神兽涎=1,
		   特效宝珠=1,
		   菩提果=1,
		   特殊兽诀礼盒=1,
		   超级兽诀礼盒=1,
		   武器附神锤=1,

	},},

	}
	写出文件([[全局bl.txt]],table.tostring(HDPZ))
else
	HDPZ=table.loadstring(读入文件([[全局bl.txt]]))

end
-- if HDPZ["地宫1至10"] then
--    HDPZ["地宫1至10"].排序=53
-- end
------------------------------------------------------------------------------
XZBL={}
XZBL={


}

for k,v in pairs(XZBL) do
	HDPZ[k]={}
	HDPZ[k]=v
end

写出文件([[全局bl.txt]],table.tostring(HDPZ))
__S服务:输出("新增爆率成功")

