-- @Author: baidwwy
-- @Date:   2024-12-14 19:53:29
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-09 21:55:25
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-04 13:30:57
制造装备={}
制造装备.戒指={[60]="枫华戒",[80]="芙蓉戒",[100]="金麟绕",[120]="悦碧水",[140]="九曜光华",[160]="太虚渺云"}
制造装备.手镯={[60]="香木镯",[80]="翡玉镯",[100]="墨影扣",[120]="花映月",[140]="金水菩提",[160]="浮雪幻音"}
制造装备.耳饰={[60]="翠叶环",[80]="明月珰",[100]="玉蝶翩",[120]="点星芒",[140]="凤羽流苏",[160]="焰云霞珠"}
制造装备.佩饰={[60]="芝兰佩",[80]="逸云佩",[100]="莲音玦",[120]="相思染",[140]="玄龙苍珀",[160]="碧海青天"}
-- 制造装备.戒指={[60]="枫华戒",[80]="芙蓉戒",[100]="金麟绕",[120]="悦碧水",[140]="九曜光华"}
-- 制造装备.手镯={[60]="香木镯",[80]="翡玉镯",[100]="墨影扣",[120]="花映月",[140]="金水菩提"}
-- 制造装备.耳饰={[60]="翠叶环",[80]="明月珰",[100]="玉蝶翩",[120]="点星芒",[140]="凤羽流苏"}
-- 制造装备.佩饰={[60]="芝兰佩",[80]="逸云佩",[100]="莲音玦",[120]="相思染",[140]="玄龙苍珀"}
随机灵饰={"手镯","佩饰","戒指","耳饰"}
幻化属性值={"伤害","防御","气血","速度","法术伤害","抗封印等级","法术伤害结果","法术暴击等级","抗法术暴击等级","治疗能力","抗物理暴击等级","格挡值","气血回复效果","封印命中等级","固定伤害","狂暴等级","穿刺等级","物理暴击等级"}
幻化战斗属性={"抗封印等级","法术伤害","法术伤害结果","法术暴击等级","抗法术暴击等级","治疗能力","抗物理暴击等级","格挡值","气血回复效果","封印命中等级","固定伤害","狂暴等级","穿刺等级","物理暴击等级"}
灵饰属性={}
灵饰属性.手镯={主属性={"封印命中等级","抵抗封印等级"},副属性={"气血回复效果","气血","防御","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}}
灵饰属性.佩饰={主属性={"速度"},副属性={"气血回复效果","气血","防御","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级"}}
灵饰属性.戒指={主属性={"伤害","防御"},副属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}}
灵饰属性.耳饰={主属性={"法术伤害","法术防御"},副属性={"固定伤害","法术伤害","伤害","封印命中等级","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","治疗能力","速度"}}
灵饰战斗属性={"气血回复效果","抗法术暴击等级","格挡值","法术防御","抗物理暴击等级","封印命中等级","抵抗封印等级","固定伤害","法术伤害","法术暴击等级","物理暴击等级","狂暴等级","穿刺等级","法术伤害结果","物理伤害结果","物伤结果","法伤结果","治疗能力"}
灵饰正常属性={"伤害","防御","气血","速度"}
五宝名称={"金刚石","定魂珠","夜光珠","避水珠","龙鳞"}
灵饰属性.基础={
	封印命中等级={
		[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,抵抗封印等级={
		[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,防御={
		[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,气血回复效果={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,气血={
		[140]={a=98,b=147},
		[120]={a=84,b=126},
		[100]={a=70,b=105},
		[80]={a=56,b=84},
		[60]={a=42,b=63}
	}
	,抗法术暴击等级={
		[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,格挡值={[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,法术防御={
		[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,抗物理暴击等级={
		[140]={a=28,b=42},
		[120]={a=24,b=36},
		[100]={a=20,b=30},
		[80]={a=16,b=24},
		[60]={a=12,b=18}
	}
	,速度={
		[140]={a=20,b=30},
		[120]={a=18,b=27},
		[100]={a=16,b=24},
		[80]={a=14,b=21},
		[60]={a=12,b=18}
	}
	,伤害={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,固定伤害={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,法术伤害={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,法术暴击等级={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,物理暴击等级={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,狂暴等级={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,穿刺等级={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,法术伤害结果={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
	,治疗能力={
		[140]={a=14,b=21},
		[120]={a=12,b=18},
		[100]={a=10,b=15},
		[80]={a=8,b=12},
		[60]={a=6,b=9}
	}
}

灵饰主属性={
	封印命中等级={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,抵抗封印等级={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,防御={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,法术防御={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,速度={[140]={a=20,b=30},[120]={a=18,b=27},[100]={a=16,b=24},[80]={a=14,b=21},[60]={a=12,b=18}}
	,伤害={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,法术伤害={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
}
灵饰副属性={                                                                                                     --灵饰属性范围
	封印命中等级={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,抵抗封印等级={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,防御={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,气血回复效果={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,气血={[140]={a=98,b=147},[120]={a=84,b=126},[100]={a=70,b=105},[80]={a=56,b=84},[60]={a=42,b=63}}
	,抗法术暴击等级={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,格挡值={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,法术防御={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,抗物理暴击等级={[140]={a=28,b=42},[120]={a=24,b=36},[100]={a=20,b=30},[80]={a=16,b=24},[60]={a=12,b=18}}
	,速度={[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,伤害={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,固定伤害={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,法术伤害={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,法术暴击等级={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,物理暴击等级={[140]={a=14,b=21},[120]={a=12,b=18},[100]={a=10,b=15},[80]={a=8,b=12},[60]={a=6,b=9}}
	,狂暴等级={[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,穿刺等级={[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,法术伤害结果={[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=8,b=12},[80]={a=7,b=10},[60]={a=6,b=9}}
	,治疗能力={[140]={a=10,b=15},[120]={a=9,b=13},[100]={a=80,b=12},[80]={a=8,b=10},[60]={a=6,b=9}}
}

一级符石 = {"冰符石","土符石","雷符石","电符石","风符石","炎符石","火符石"}
二级符石 = {"红云符石","碧玉符石","金光符石","天神符石","飘渺符石","天仙符石","霞光符石","逍遥符石"}
三级符石 = {"虹珀符石","陌影符石","北冥符石","灵月符石","锦瑟符石","银光符石","清心符石","星辰符石","雪月符石","玄魂符石","乾坤符石","珍珀符石",
      "银竹符石","神川符石","玲珑符石","暮影符石","天珍符石","九影符石","百冥符石","莫念符石","醉魂符石","玄羽符石","霸风符石","无相符石",
      "无极符石","紫晶符石","圣火符石","昔光符石","子蚀符石","流风符石","地炎符石","素影符石","燕灵符石","降龙符石","苍玉符石","流魂符石",
      "九凤符石","墨陀符石","南夕符石","引幽符石","波涛符石","铃星符石","狂念符石","乱花符石","幽月符石","两仪符石","七情符石","召影符石"}
新三级符石 = {"太极符石","阴仪符石","阳仪符石","太阴符石","少阴符石","少阳符石","太阳符石"}

function 取随机星石()
	local xsfw={"头盔","饰物","武器","衣甲","腰带","靴子"}
	return xsfw[取随机数(1,#xsfw)]
end

function 取单双加属性(lv)
	if lv==10 then
		return 4,5
	elseif lv==20 then
        return 6,8
    elseif lv==30 then
        return 10,12
    elseif lv==40 then
        return 12,16
    elseif lv==50 then
        return 16,20
    elseif lv==60 then
        return 22,28
    elseif lv==70 then
        return 24,32
    elseif lv==80 then
        return 28,38
    elseif lv==90 then
        return 30,42
    elseif lv==100 then
        return 34,48
    elseif lv==110 then
        return 35,52
    elseif lv==120 then
        return 39,56
    elseif lv==130 then
        return 42,62
    elseif lv==140 then
        return 45,66
    elseif lv==150 then
        return 48,72
    elseif lv==160 then
        return 61,86
    end
end

function 取五行()
	local 五行_ = {"金","木","水","火","土"}
	return 五行_[取随机数(1,5)]
end

function 取灵犀玉特性()
	local 特性_ = {"蔓延","无","无","天平","无","无","相生","无","无","相克","无","无","金耀","无","无","木耀","无","无","水耀","无","无","火耀","无","无","土耀","无","利金","无","利木","无","利水","无","利火","无","无","利土"}
	return 特性_[取随机数(1,#特性_)]
end

function 取礼包灵犀玉特性()
	local 特性_ = {"蔓延","天平","相生","相克","金耀","木耀","水耀","火耀","土耀","金耀","木耀","水耀","火耀","土耀","利金","利木","利水","利火","利土","利金","利木","利水","利火","利土"}
	return 特性_[取随机数(1,#特性_)]
end

function 取五宝()
	return 五宝名称[取随机数(1,5)]
end

function 取宝石()
	local 宝石 = {"红玛瑙","太阳石","舍利子","黑宝石","月亮石","光芒石","翡翠石"}
	return 宝石[取随机数(1,#宝石)]
end

function 取强化石()
	local 宝石 = {"青龙石","白虎石","朱雀石","玄武石"}
	return 宝石[取随机数(1,#宝石)]
end

function 取掉落道具()
	local 道具 = {"琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲"}
	return 道具[取随机数(1,#道具)]
end

function 取掉落道具2()
	local 道具 = {"圣兽丹","金刚石","定魂珠","避水珠","夜光珠","龙鳞"}
	return 道具[取随机数(1,#道具)]
end

function 取随机灵宝()
	local lb = {"断穹巨剑","静心禅珠","宁心道符","相思寒针","风舞心经","锢魂命谱","青狮獠牙","冥火炼炉","缚仙蛛丝","煞魂冥灯","九霄龙锥","化怨清莲","真阳令旗",
	"天雷音鼓","寒霜盾戟","乾坤金卷","乾坤木卷","乾坤水卷","乾坤火卷","乾坤土卷","定神仙琴","赤炎战笛","护体灵盾","惊兽云尺","战神宝典"}
	return lb[取随机数(1,#lb)]
end

function 取掉落法宝材料()
	local 道具 = {"天蚕丝","玄龟板","阴沉木","麒麟血","内丹","金凤羽","补天石","龙之筋"}
	return 道具[取随机数(1,#道具)]
end
function 秘制食谱子类()
	return {"红罗羹","绿芦羹","玉露羹","百岁香","神仙饮","八珍玉液","五味露","福灵沙","千金露"}
end

function 秘制食谱消耗()
	local lsb = {
	红罗羹={材料=100,活力=25,银子=15000,次数=50},
	绿芦羹={材料=125,活力=25,银子=15000,次数=50},
	玉露羹={材料=150,活力=35,银子=20000,次数=50},
	百岁香={材料=200,活力=35,银子=20000,次数=50},
	神仙饮={材料=250,活力=45,银子=25000,次数=50},
	八珍玉液={材料=275,活力=45,银子=25000,次数=50},
	福灵沙={材料=300,活力=55,银子=30000,次数=50},
	五味露={材料=325,活力=55,银子=30000,次数=50},
	千金露={材料=350,活力=65,银子=40000,次数=50},
}
	return lsb
end

function 绑定等级物品()
	local n = {}
	n[1] = {"红缨枪","曲尖枪","锯齿矛","乌金三叉戟","火焰枪","墨杆金钩","玄铁矛","金蛇信","丈八点钢矛","暗夜","梨花","霹雳","刑天之逆","五虎断魂","飞龙在天","天龙破城","弑皇"}
	n[2] = {"青铜斧","开山斧","双面斧","双弦钺","精钢禅钺","黄金钺","乌金鬼头镰","狂魔镰","恶龙之齿","破魄","肃魂","无敌","五丁开山","元神禁锢","护法灭魔","碧血干戚","裂天"}
	n[3] = {"青铜短剑","铁齿剑","吴越剑","青锋剑","龙泉剑","黄金剑","游龙剑","北斗七星剑","碧玉剑","鱼肠","倚天","湛卢","魏武青虹","灵犀神剑","四法青云","霜冷九州","擒龙"}
	n[4] = {"双短剑","镔铁双剑","龙凤双剑","竹节双剑","狼牙双剑","鱼骨双剑","赤焰双剑","墨玉双剑","梅花双剑","阴阳","月光双剑","灵蛇","金龙双剪","连理双树","祖龙对剑","紫电青霜","浮犀"}
	n[5] = {"五色缎带","幻彩银纱","金丝彩带","无极丝","天蚕丝带","云龙绸带","七彩罗刹","缚神绫","九天仙绫","彩虹","流云","碧波","秋水落霞","晃金仙绳","此最相思","揽月摘星","九霄"}
	n[6] = {"铁爪","天狼爪","幽冥鬼爪","青龙牙","勾魂爪","玄冰刺","青刚刺","华光刺","龙鳞刺","撕天","毒牙","胭脂","九阴勾魂","雪蚕之刺","贵霜之牙","忘川三途","离钩"}
	n[7] = {"折扇","铁骨扇","精钢扇","铁面扇","百折扇","劈水扇","神火扇","阴风扇","风云雷电","太极","玉龙","秋风","画龙点睛","秋水人家","逍遥江湖","浩气长舒","星瀚"}
	n[8] = {"细木棒","金丝魔棒","玉如意","点金棒","云龙棒","幽路引魂","满天星","水晶棒","日月光华","沧海","红莲","盘龙","降魔玉杵","青藤玉树","墨玉骷髅","丝萝乔木","醍醐"}
	n[9] = {"松木锤","镔铁锤","八棱金瓜","狼牙锤","烈焰锤","破甲战锤","震天锤","巨灵神锤","天崩地裂","八卦","鬼牙","雷神","混元金锤","九瓣莲花","鬼王蚀日","狂澜碎岳","碎寂"}
	n[10] = {"牛皮鞭","牛筋鞭","乌龙鞭","钢结鞭","蛇骨鞭","玉竹金铃","青藤柳叶鞭","雷鸣嗜血鞭","混元金钩","龙筋","百花","吹雪","游龙惊鸿","仙人指路","血之刺藤","牧云清歌","霜陨"}
	n[11] = {"黄铜圈","精钢日月圈","离情环","金刺轮","风火圈","赤炎环","蛇形月","子母双月","斜月狼牙","如意","乾坤","月光双环","别情离恨","金玉双环","九天金线","无关风月","朝夕"}
	n[12] = {"柳叶刀","苗刀","夜魔弯刀","金背大砍刀","雁翅刀","破天宝刀","狼牙刀","龙鳞宝刀","黑炎魔刀","冷月","屠龙","血刃","偃月青龙","晓风残月","斩妖泣血","业火三灾","鸣鸿"}
	n[13] = {"曲柳杖","红木杖","白椴杖","墨铁拐","玄铁牛角杖","鹰眼法杖","腾云杖","引魂杖","碧玺杖","业焰","玉辉","鹿鸣","庄周梦蝶","凤翼流珠","雪蟒霜寒","碧海潮生","弦月"}
	n[14] = {"硬木弓","铁胆弓","紫檀弓","宝雕长弓","錾金宝弓","玉腰弯弓","连珠神弓","游鱼戏珠","灵犀望月","非攻","幽篁","百鬼","冥火薄天","龙鸣寒水","太极流光","九霄风雷","若木"}
	n[15] = {"琉璃珠","水晶珠","珍宝珠","翡翠珠","莲华珠","夜灵珠","如意宝珠","沧海明珠","无量玉璧","离火","飞星","月华","回风舞雪","紫金葫芦","裂云啸日","云雷万里","赤明"}
	n[16] = {"钝铁重剑","桃印铁刃","赭石巨剑","壁玉长铗","青铜古剑","金错巨刃","惊涛雪","醉浮生","沉戟天戊","鸦九","昆吾","弦歌","墨骨枯麟","腾蛇郁刃","秋水澄流","百辟镇魂","长息"}
	n[17] = {"油纸伞","红罗伞","紫竹伞","锦绣椎","幽兰帐","琳琅盖","孔雀羽","金刚伞","落梅伞","鬼骨","云梦","枕霞","碧火琉璃","雪羽穿云","月影星痕","浮生归梦","晴雪"}
	n[18] = {"素纸灯","竹骨灯","红灯笼","鲤鱼灯","芙蓉花灯","如意宫灯","玲珑盏","玉兔盏","冰心盏","蟠龙","云鹤","风荷","金风玉露","凰火燎原","月露清愁","夭桃秾李","荒尘"}
	n[19] = {{"方巾","簪子"},{"布帽","玉钗",},{"面具","梅花簪子"},{"纶巾","珍珠头带"},{"缨络丝带","凤头钗"},{"羊角盔","媚狐头饰"},{"水晶帽","玉女发冠"},{"乾坤帽","魔女发冠"},{"黑魔冠","七彩花环"},{"白玉龙冠","凤翅金翎"},{"水晶夔帽","寒雉霜蚕"},{"翡翠曜冠","曜月嵌星"},{"金丝黑玉冠","郁金流苏簪"},{"白玉琉璃冠","玉翼附蝉翎"},{"兽鬼珐琅面","鸾羽九凤冠"},{"紫金磐龙冠","金珰紫焰冠"},{"浑天玄火盔","乾元鸣凤冕"}}
	n[20] = {"护身符","五色飞石","珍珠链",{"骷髅吊坠","苍魂珠"},{"江湖夜雨","九宫坠"},{"荧光坠子","高速之星"},{"风月宝链","八卦坠"},{"碧水青龙","鬼牙攫魂"},{"万里卷云","疾风之铃"},"七彩玲珑","黄玉琉佩","鸾飞凤舞","衔珠金凤佩","七璜珠玉佩","鎏金点翠佩","紫金碧玺佩","落霞陨星坠"}
	n[21] = {{"布裙","布衣"},{"丝绸长裙","皮衣"},{"五彩裙","鳞甲"},{"龙鳞羽衣","锁子甲"},{"天香披肩","紧身衣"},{"金缕羽衣","钢甲"},{"霓裳羽衣","夜魔披风"},{"流云素裙","龙骨甲"},{"七宝天衣","死亡斗篷"},{"飞天羽衣","神谕披风"},{"穰花翠裙","珊瑚玉衣"},{"金蚕丝裙","金蚕披风"},{"紫香金乌裙","乾坤护心甲"},{"碧霞彩云衣","蝉翼金丝甲"},{"金丝蝉翼衫","金丝鱼鳞甲"},{"五彩凤翅衣","紫金磐龙甲"},{"鎏金浣月衣","混元一气甲"}}
	n[22] = {"腰带","缎带","银腰带",{"水晶腰带","玉树腰带"},{"琥珀腰链","白面狼牙"},{"乱牙咬","魔童大牙"},{"攫魂铃","双魂引"},{"兽王腰带","百窜云"},{"八卦锻带","圣王坠"},"幻彩玉带","珠翠玉环","金蟾含珠","乾坤紫玉带","琉璃寒玉带","蝉翼鱼佩带","磐龙凤翔带","紫霄云芒带"}
	n[23] = {"布鞋","牛皮靴","马靴","侠客履","神行靴","绿靴","追星踏月","九州履","万里追云履","踏雪无痕","平步青云","追云逐电","乾坤天罡履","七星逐月靴","碧霞流云履","金丝逐日履","辟尘分光履"}
	n[24] = {"竹编护腕","皮腕","针腕","骨镯","青铜护腕","玛瑙护腕","琉璃护腕","镂空银镯","笼玉镯","嵌宝金腕","玳瑁护腕","七星宝腕","缚龙筋","凤翎护腕","织锦彩带","冰蚕丝带"}
	n[25] = {"竹编脖环","钢圈","荆棘环","骨环","青铜颈环","玛瑙石环","琉璃环","九曲环","笼玉环","嵌宝金环","玳瑁环","七星宝环","缚龙圈","鸾尾环","织锦颈圈","冰蚕丝圈"}
	n[26] = {"竹藤甲","皮甲","刺甲","骨排甲","青铜披甲","玛瑙软甲","琉璃罩甲","连环铠甲","笼玉甲","嵌宝金甲","玳瑁衣","七星宝甲","缚龙甲","凤凰彩衣","织锦软褡","冰蚕织甲"}
	n[30] = {"顽石双斧(乾)","镔铁双斧(乾)","黑曜双斧(乾)","枭首双斧(乾)","破军双斧(乾)","隳城双戚(乾)","飞头蛮(乾)","竹叶青(乾)","鲛煞(乾)","啖月(乾)","义战(乾)","恶来(乾)","烬世野火(乾)","九州海沸(乾)","八狱末劫(乾)","罗喉计都(乾)","非天(乾)"}
    n[31] = {"顽石双斧(坤)","镔铁双斧(坤)","黑曜双斧(坤)","枭首双斧(坤)","破军双斧(坤)","隳城双戚(坤)","飞头蛮(坤)","竹叶青(坤)","鲛煞(坤)","啖月(坤)","义战(坤)","恶来(坤)","烬世野火(坤)","九州海沸(坤)","八狱末劫(坤)","罗喉计都(坤)","非天(坤)"}

	return n
end

function 取装备序列(名称)
	local 装备表=绑定等级物品()
	for i=1,#装备表 do
		for n=1,#装备表[i] do
			if 装备表[i][n] == 名称  then
				return i
			end
		end
	end
end
function 取装备序列1(名称)
	local 装备表=绑定等级物品()
	for i=1,#装备表 do
		for n=1,#装备表[i] do
			if type(装备表[i][n])=="table" then
				for s=1,#装备表[i][n] do
					if 装备表[i][n][s] == 名称  then
						return i
					end
                end
			elseif 装备表[i][n] == 名称  then
				return i
			end
		end
	end
end

function 取随机装备名称(等级,类型)
	-- local 书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
	local 随机装备=绑定等级物品()
	local 临时等级=等级
	local 临时参数=取随机数(1,#书铁范围)
	if 取随机数()<=30 then
	    临时参数=取随机数(19,#书铁范围)
	end
	if 类型 then
		临时参数 = 类型
	end
	local 临时序列=临时参数
	if 临时序列==25 then
	 临时序列=23
	elseif 临时序列==24 then
	 临时序列=22
	elseif 临时序列==23 or 临时序列==22 then
	 临时序列=21
	elseif 临时序列==21 then
	 临时序列=20
	elseif 临时序列==20 or 临时序列==19 then
	 临时序列=19
	end
	if 临时序列<=18 and 临时等级>=9 then --是武器 10-12是普通光武
	 	临时等级=取随机数(10,12)
	else
	  if 临时等级>=12 then
		 临时等级=13
		end
	end
	local 临时类型=随机装备[临时序列][临时等级+1]
	if type(临时类型)=="table" then
	   if 临时参数 ==23 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==22 then
		 临时类型=临时类型[1]
		elseif 临时参数 ==20 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==19 then
		 临时类型=临时类型[1]
		else
		  临时类型=临时类型[取随机数(1,2)]
		end
	 end
 return 临时类型
end

function 取真随机装备名称(等级,类型)
	-- local 书铁范围 = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","头盔","发钗","项链","女衣","男衣","腰带","鞋子"}
	local 随机装备=绑定等级物品()
	local 临时等级=等级
	local 临时参数=取随机数(1,#书铁范围)
	if 取随机数()<=30 then
	    临时参数=取随机数(19,#书铁范围)
	end
	if 类型 then
		临时参数 = 类型
	end
	local 临时序列=临时参数
	if 临时序列==25 then
	 临时序列=23
	elseif 临时序列==24 then
	 临时序列=22
	elseif 临时序列==23 or 临时序列==22 then
	 临时序列=21
	elseif 临时序列==21 then
	 临时序列=20
	elseif 临时序列==20 or 临时序列==19 then
	 临时序列=19
	end

	local 临时类型=随机装备[临时序列][临时等级+1]
	if type(临时类型)=="table" then
	   if 临时参数 ==23 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==22 then
		 临时类型=临时类型[1]
		elseif 临时参数 ==20 then
		 临时类型=临时类型[2]
		elseif 临时参数 ==19 then
		 临时类型=临时类型[1]
		else
		  临时类型=临时类型[取随机数(1,2)]
		end
	 end
 return 临时类型
end





function 取官职任务物品(id)
	local 物品名称=装备处理类.打造物品[取随机数(1,23)][取随机数(5,9)]
	if type(物品名称)=="table" then
		物品名称=物品名称[取随机数(1,#物品名称)]
	end
 return 物品名称
end

function 取武器数据(名称,级别)
	if 名称==nil or 级别==nil then return  end
	local 道具 = 物品类()
	道具:置对象(名称)
	道具.级别限制 = 级别
	return {名称=名称,级别限制=级别,子类=道具.子类}
end

function 法宝公式(内丹,材料1,材料2,法宝,天珠)
	if 材料1 =="天蚕丝金" and 材料2=="金凤羽土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
		return {"碧玉葫芦","风袋","幽灵珠"}
	elseif 材料1 =="天蚕丝金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 == nil and 天珠== nil then
	 	return {"金甲仙衣","鬼脸面具","玄冰面具"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
	 	return {"缚妖索","清心咒","五色旗盒","迷魂灯","现形符","断线木偶","混元伞"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == nil and 天珠== nil then
	 	return {"嗜血幡","织女扇","雷兽","定风珠","万鬼幡","五彩娃娃"}
	elseif 材料1 =="玄龟板水" and 材料2=="补天石土"  and 内丹=="内丹木"  and 法宝 == nil and 天珠== nil then
	 	return {"飞剑","九黎战鼓","盘龙壁","神行飞剑","汇灵盏"}
	elseif 材料1 =="麒麟血水" and 材料2=="补天石土"  and 内丹=="内丹木"  and 法宝 == nil and 天珠== nil then
	 	return {"拭剑石","金钱镖","天师符"}
	elseif 材料1 =="麒麟血水" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== nil then
	 	return {"发瘟匣","影蛊"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
	 	return {"聚妖铃","番天印"}
	elseif 材料1 =="阴沉木木" and 材料2=="补天石土"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== nil then
	 	return{"惊魂铃"}
	elseif 材料1 =="龙之筋金" and 材料2=="金凤羽土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== nil then
	 	return {"捆仙绳"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== nil then
	 	return {"缩地尺"}
	elseif 材料1 =="龙之筋金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == nil and 天珠== "三眼天珠木" then
	 	return {"七杀"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== "三眼天珠火" then
	 	return {"罗汉珠"}
	 elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"分水"}
	elseif 材料1 =="金凤羽土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"赤焰"}
	elseif 材料1 =="补天石土" and 材料2=="金凤羽木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"金刚杵"}
	elseif 材料1 =="麒麟血水" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"兽王令"}
	elseif 材料1 =="补天石木" and 材料2=="金凤羽土"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return {"摄魂","降魔斗篷"}
	 elseif 材料1 =="阴沉木木" and 材料2=="金凤羽土"  and 内丹=="内丹火"  and 法宝 == nil and 天珠== "三眼天珠金" then
	 	return{"附灵玉"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "飞剑金" and 天珠== "九眼天珠火" then
	 	return {"干将莫邪"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "碧玉葫芦金" and 天珠== "九眼天珠火"  then
	 	return {"慈悲"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "织女扇木" and 天珠== "九眼天珠火"  then
	 	return {"曼陀罗"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "风袋火" and 天珠== "九眼天珠木"  then
	 	return {"救命毫毛"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == "雷兽木" and 天珠== "九眼天珠金"  then
	 	return {"伏魔天书"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 ==  "碧玉葫芦金" and 天珠== "九眼天珠水"  then
	 	return {"普渡"}
	elseif 材料1 =="玄龟板木" and 材料2=="麒麟血火"  and 内丹=="内丹水"  and 法宝 ==  "飞剑金" and 天珠== "九眼天珠土"  then
	 	return {"镇海珠"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 ==  "定风珠木" and 天珠== "九眼天珠火"  then
	 	return {"奇门五行令"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 ==  "惊魂铃金" and 天珠== "九眼天珠木"  then
	 	return {"失心钹"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "清心咒木" and 天珠== "九眼天珠火"  then
	 	return {"五火神焰印"}
	elseif 材料1 =="麒麟血金" and 材料2=="补天石水"  and 内丹=="内丹土"  and 法宝 == "金钱镖木" and 天珠== "九眼天珠火"  then
	 	return {"九幽"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 == "迷魂灯木"  and 天珠== "九眼天珠火" then
	 	return {"忘情"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "金钱镖火"  and 天珠== nil then
	 	return {"落雨金钱","落宝金钱"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "金钱镖火"  and 天珠== nil then
	 	return {"聚宝盆"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹木"  and 法宝 == "风带火"  and 天珠== nil then
	 	return {"无魂傀儡"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "风带木"  and 天珠== nil then
	 	return {"苍白纸人"}
	elseif 材料1 =="天蚕丝金" and 材料2=="龙之筋木"  and 内丹=="内丹土"  and 法宝 == "缚妖索水"  and 天珠== nil then
	 	return {"缚龙索"}
	elseif 材料1 =="阴沉木木" and 材料2=="补天石土"  and 内丹=="内丹火"  and 法宝 == "缚妖索金"  and 天珠== nil then
	 	return {"照妖镜"}
	elseif 材料1 =="龙之筋金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == "缚妖索火"  and 天珠== nil then
	 	return {"鬼泣"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "嗜血幡火"  and 天珠== nil then
	 	return {"乾坤玄火塔"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == "嗜血幡金"  and 天珠== nil then
	 	return {"无字经"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == "嗜血幡火"  and 天珠== nil then
	 	return {"无尘扇"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "碧玉葫芦火"  and 天珠== nil then
	 	return {"通灵宝玉"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == "鬼脸面具金"  and 天珠== nil then
	 	return{"神木面具"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "飞剑火"  and 天珠== nil then
	 	return {"月光宝盒"}
	elseif 材料1 =="天蚕丝金" and 材料2=="阴沉木木"  and 内丹=="内丹水"  and 法宝 == "清心咒火"  and 天珠== nil then
	 	return{"七宝玲珑灯"}
	elseif 材料1 =="补天石土" and 材料2=="天蚕丝金"  and 内丹=="内丹木"  and 法宝 == "飞剑木"  and 天珠== nil then
	 	return {"月影"}
	elseif 材料1 =="阴沉木木" and 材料2=="麒麟血金"  and 内丹=="内丹木"  and 法宝 == "迷魂灯金"  and 天珠== nil then
	 	return {"神木宝鼎"}
	elseif 材料1 =="玄龟板水" and 材料2=="补天石土"  and 内丹=="内丹木"  and 法宝 == "飞剑金"  and 天珠== nil then
	 	return {"斩魔"}
	elseif 材料1 =="阴沉木木" and 材料2=="天蚕丝金"  and 内丹=="内丹火"  and 法宝 == "迷魂灯金"  and 天珠== nil then
	 	return {"天煞"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板木"  and 内丹=="内丹金"  and 法宝 == "迷魂灯木"  and 天珠== nil then
	 	return {"金蟾"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 == "迷魂灯火"  and 天珠== nil then
	 	return {"宝烛"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血火"  and 内丹=="内丹土"  and 法宝 == "迷魂灯火"  and 天珠== nil then
	 	return {"天煞"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "九黎战鼓木" and 天珠== "九眼天珠火"  then
	 	return {"重明战鼓"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "金甲仙衣金" and 天珠== "九眼天珠火"  then
	 	return {"梦云幻甲"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "清心咒金" and 天珠== "九眼天珠火" then
	 	return {"河图洛书"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "定风珠火" and 天珠== "九眼天珠木"  then
	 	return {"炽焰丹珠"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == "盘龙壁木" and 天珠== "九眼天珠金"  then
	 	return {"翡翠芝兰"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 ==  "汇灵盏金" and 天珠== "九眼天珠水"  then
	 	return {"太虚玉液"}
	elseif 材料1 =="玄龟板木" and 材料2=="麒麟血火"  and 内丹=="内丹水"  and 法宝 ==  "盘龙壁金" and 天珠== "九眼天珠土"  then
	 	return {"蟠龙玉璧"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 ==  "碧玉葫芦木" and 天珠== "九眼天珠火"  then
	 	return {"九梵清莲"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 ==  "织女扇金" and 天珠== "九眼天珠木"  then
	 	return {"苍灵雪羽"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "天师符木" and 天珠== "九眼天珠火"  then
	 	return {"烽火狼烟"}
	elseif 材料1 =="麒麟血金" and 材料2=="补天石水"  and 内丹=="内丹土"  and 法宝 == "织女扇木" and 天珠== "九眼天珠火"  then
	 	return {"舞雪冰蝶"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 == "天师符木"  and 天珠== "九眼天珠火" then
	 	return {"紫火如意"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "天师符木" and 天珠== "九眼天珠火"  then
	 	return {"凌波仙符"}
	elseif 材料1 =="补天石土" and 材料2=="玄龟板水"  and 内丹=="内丹木"  and 法宝 == "雷兽金" and 天珠== "九眼天珠火"  then
	 	return {"归元圣印"}
	elseif 材料1 =="补天石土" and 材料2=="麒麟血水"  and 内丹=="内丹木"  and 法宝 == "飞剑金" and 天珠== "九眼天珠火" then
	 	return {"落星飞鸿"}
	elseif 材料1 =="天蚕丝金" and 材料2=="麒麟血水"  and 内丹=="内丹土"  and 法宝 == "拭剑石火" and 天珠== "九眼天珠木"  then
	 	return {"流影云笛"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 == "风袋木" and 天珠== "九眼天珠金"  then
	 	return {"软烟罗锦"}
	elseif 材料1 =="补天石土" and 材料2=="阴沉木木"  and 内丹=="内丹火"  and 法宝 ==  "盘龙壁金" and 天珠== "九眼天珠水"  then
	 	return {"谷玄星盘"}
	elseif 材料1 =="玄龟板木" and 材料2=="麒麟血火"  and 内丹=="内丹水"  and 法宝 ==  "九黎战鼓金" and 天珠== "九眼天珠土"  then
	 	return {"千斗金樽"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 ==  "飞剑木" and 天珠== "九眼天珠火"  then
	 	return {"宿幕星河"}
	elseif 材料1 =="麒麟血火" and 材料2=="补天石土"  and 内丹=="内丹水"  and 法宝 ==  "金甲仙衣金" and 天珠== "九眼天珠木"  then
	 	return {"北冥巨鳞"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "嗜血幡木" and 天珠== "九眼天珠火"  then
	 	return {"血魄元幡"}
	elseif 材料1 =="麒麟血金" and 材料2=="补天石水"  and 内丹=="内丹土"  and 法宝 == "拭剑石木" and 天珠== "九眼天珠火"  then
	 	return {"冷龙石磐"}
	elseif 材料1 =="天蚕丝金" and 材料2=="金凤羽水"  and 内丹=="内丹土"  and 法宝 == "风袋木"  and 天珠== "九眼天珠火" then
	 	return {"琉璃云罩"}
	elseif 材料1 =="金凤羽金" and 材料2=="玄龟板水"  and 内丹=="内丹土"  and 法宝 ==  "金甲仙衣木" and 天珠== "九眼天珠火"  then
	 	return {"璞玉灵钵"}
	end
	return  {}
end

function 取物品数据(wd)
	local wds={}
	if ItemData[wd] then
	    for i=1,22 do
	    	if ItemData[wd]["wp_"..i] then
	    	    wds[i]=ItemData[wd]["wp_"..i]
	    	end
	    end
	end
	return table.copy(wds)
end

function 加载物品数据()
ItemData["顽石双斧(乾)"]={
    wp_1 = "质地粗糙，手感不佳，造型简陋。但够大够重，威力十足。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 0
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '顽石双斧(乾)小'
    ,wp_13 = '顽石双斧(乾)大'

    }
    ItemData["顽石双斧(坤)"]={
    wp_1 = "质地粗糙，手感不佳，造型简陋。但够大够重，威力十足。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 0
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '顽石双斧(坤)小'
    ,wp_13 = '顽石双斧(坤)大'

    }
    ItemData["镔铁双斧(乾)"]={
    wp_1 = "两把白铁大斧的绝妙搭配，性能均衡，适合新手使用。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 10
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '镔铁双斧(乾)小'
    ,wp_13 = '镔铁双斧(乾)大'

    }

    ItemData["修业通天录"]={
        wp_1 = "通天录乃前人为自身传承所创，历经岁月的侵蚀，通天录的内容已模糊不清，但对后人仍大有裨益。\n#G【功能】用于修业系统炼化\n#G【效果】可获得1000修业点"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xF5CC975D
        ,wp_13 = 0x540ECDBD
        }
    ItemData["白虎印"]={
        wp_1 = "四圣兽之白虎印，白虎雄姿傲立印上。主凶杀征伐之事，冲锋陷阵可破坚甲，赋予使用者无畏战斗之锋芒。\n#Y【说明】集齐四兽印可合成四象天罡印"
        ,wp_2 = 202
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x6B08F32E
        ,wp_13 = 0xD9D5BAB8
        ,wp_15 = "鼠标右键点击使用"
        }
    ItemData["青龙印"]={
        wp_1 = "四圣兽之青龙印，状若青龙盘旋。可聚风云之力，兴甘霖润泽大地，使拥有者能驾驭自然伟力。\n#Y【说明】集齐四兽印可合成四象天罡印"
        ,wp_2 = 202
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0xFEEF9473
        ,wp_13 = 0xD2DF07DC
        ,wp_15 = "鼠标右键点击使用"
        }
    ItemData["玄武印"]={
        wp_1 = "四圣兽之玄武印，龟蛇相济之象。专注防御守护之责，坚如磐石可挡诸般灾厄，庇佑持有者于危难之中。\n#Y【说明】集齐四兽印可合成四象天罡印"
        ,wp_2 = 202
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x3E50047F
        ,wp_13 = 0xD79EE5DF
        ,wp_15 = "鼠标右键点击使用"
        }
    ItemData["朱雀印"]={
        wp_1 = "四圣兽之朱雀印，周身符文似焰舞。烈火净化邪恶，暖光治愈生灵，攻防随心，助持有者掌控非凡火焰与生命之力。\n#Y【说明】集齐四兽印可合成四象天罡印"
        ,wp_2 = 202
        ,wp_3 = 1
        ,wp_4 = 1
        ,wp_11 = "item.wdf"
        ,wp_12 = 0x3CA923F0
        ,wp_13 = 0x2A25E1F7
        ,wp_15 = "鼠标右键点击使用"
        }
    ItemData["随机仙玉礼包"]={
        wp_1 ="可开出随机仙玉{100~500}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10215
        ,wp_13 = 0xC10215
        }
    ItemData["随机仙玉微礼包"]={
        wp_1 ="可开出随机仙玉{150~600}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10215
        ,wp_13 = 0xC10215
        }
    ItemData["随机仙玉小礼包"]={
        wp_1 ="可开出随机仙玉{200~700}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10215
        ,wp_13 = 0xC10215
        }
    ItemData["随机仙玉中礼包"]={
        wp_1 ="可开出随机仙玉{300~800}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10215
        ,wp_13 = 0xC10215
        }
    ItemData["随机仙玉大礼包"]={
        wp_1 ="可开出大量随机仙玉{1000~5000}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10215
        ,wp_13 = 0xC10215
        }
    ItemData["随机经验礼包"]={
        wp_1 ="可开出随机经验值{50W~100W}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10231
        ,wp_13 = 0xC10231
        }
    ItemData["随机经验微礼包"]={
        wp_1 ="可开出随机经验值{150W~300W}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10231
        ,wp_13 = 0xC10231
        }
    ItemData["随机经验小礼包"]={
        wp_1 ="可开出随机经验值{400W~600W}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10231
        ,wp_13 = 0xC10231
        }
    ItemData["随机经验中礼包"]={
        wp_1 ="可开出随机经验值{750W~1000W}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10231
        ,wp_13 = 0xC10231
        }
    ItemData["随机经验大礼包"]={
        wp_1 ="可开出大量随机经验值{1000W~5000W}"
        ,wp_2 = 3
        ,wp_3 = 2
        ,wp_4 = 4
        ,wp_11 = "火影1.wdf"
        ,wp_12 = 0xC10231
        ,wp_13 = 0xC10231
        }


	ItemData["技能突破符"]={
		wp_1 ="当宝宝技能>16个时，可使用此符为宝宝增加一个随机技能，使用必定成功"
		,wp_2 = 3
		,wp_3 = 2
		,wp_4 = 4
		,wp_11 = "item.wd1"
		,wp_12 = 0x47BA011E
		,wp_13
		}

    ItemData["元素曜石·冰"] = {
        wp_1 = "元素曜石·冰,可为装备镶嵌，对应的属性为：防御。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandanxz.dll"
        , wp_12 = "冰小" --小
        , wp_13 = "冰大"
    }
    ItemData["元素曜石·风"] = {
        wp_1 = "元素曜石·风,可为装备镶嵌，对应的属性为：速度。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandanxz.dll"
        , wp_12 = "风小" --小
        , wp_13 = "风大"
    }
    ItemData["元素曜石·火"] = {
        wp_1 = "元素曜石·火,可为装备镶嵌，对应的属性为：伤害。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandanxz.dll"
        , wp_12 = "火小" --小
        , wp_13 = "火大"
    }
    ItemData["元素曜石·雷"] = {
        wp_1 = "元素曜石·雷,可为装备镶嵌，对应的属性为：固定伤害。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandanxz.dll"
        , wp_12 = "雷小" --小
        , wp_13 = "雷大"
    }
    ItemData["元素曜石·水"] = {
        wp_1 = "元素曜石·水,可为装备镶嵌，对应的属性为：法伤。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandanxz.dll"
        , wp_12 = "水小" --小
        , wp_13 = "水大"
    }
    ItemData["元素曜石·岩"] = {
        wp_1 = "元素曜石·岩,可为装备镶嵌，对应的属性为：封印命中等级。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        , wp_11 = "jiandanxz.dll"
        , wp_12 = "岩小" --小
        , wp_13 = "岩大"
    }


    ItemData["镔铁双斧(坤)"]={
    wp_1 = "两把白铁大斧的绝妙搭配，性能均衡，适合新手使用。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 10
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "镔铁双斧(坤)小"
    ,wp_13 = "镔铁双斧(坤)大"

    }
    ItemData["黑曜双斧(乾)"]={
    wp_1 = "边地所产之奇石所打造的双斧，锋利无比，更胜精铁。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 20
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "黑曜双斧(乾)小"
    ,wp_13 = "黑曜双斧(乾)大"

    }
    ItemData["黑曜双斧(坤)"]={
    wp_1 = "边地所产之奇石所打造的双斧，锋利无比，更胜精铁。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 20
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "黑曜双斧(坤)小"
    ,wp_13 = "黑曜双斧(坤)大"

    }
    ItemData["枭首双斧(乾)"]={
    wp_1 = "黄铜制造的危险双斧，造型适合斩下敌人的首级。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 30
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "枭首双斧(乾)小"
    ,wp_13 = "枭首双斧(乾)大"

    }
    ItemData["枭首双斧(坤)"]={
    wp_1 = "黄铜制造的危险双斧，造型适合斩下敌人的首级。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 30
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "枭首双斧(坤)小"
    ,wp_13 = "枭首双斧(坤)大"

    }
    ItemData["破军双斧(乾)"]={
    wp_1 = "精钢打造的双斧，在工匠的坚持下加入了多道淬炼工艺和斧柄配重，使用起来得心应手，只是价格不甚美好。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 40
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "破军双斧(乾)小"
    ,wp_13 = "破军双斧(乾)大"

    }
    ItemData["破军双斧(坤)"]={
    wp_1 = "精钢打造的双斧，在工匠的坚持下加入了多道淬炼工艺和斧柄配重，使用起来得心应手，只是价格不甚美好。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 40
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "破军双斧(坤)小"
    ,wp_13 = "破军双斧(坤)大"

    }
    ItemData["隳城双戚(乾)"]={
    wp_1 = "一人敌者兵，万人敌者王。此斧重若千钧，能摧城破寨，震慑千军，堪称斧中之王。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 50
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "隳城双戚(乾)小"
    ,wp_13 = "隳城双戚(乾)大"

    }
    ItemData["隳城双戚(坤)"]={
    wp_1 = "一人敌者兵，万人敌者王。此斧重若千钧，能摧城破寨，震慑千军，堪称斧中之王。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 50
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "隳城双戚(坤)小"
    ,wp_13 = "隳城双戚(坤)大"

    }
    ItemData["飞头蛮(乾)"]={
    wp_1 = "此斧一大一小，大斧近身御敌，小斧投掷毙敌。飞出之斧状似飞头獠子，以恶齿取人性命，以此得名。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 60
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "飞头蛮(乾)小"
    ,wp_13 = "飞头蛮(乾)大"

    }
    ItemData["飞头蛮(坤)"]={
    wp_1 = "此斧一大一小，大斧近身御敌，小斧投掷毙敌。飞出之斧状似飞头獠子，以恶齿取人性命，以此得名。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 60
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "飞头蛮(坤)小"
    ,wp_13 = "飞头蛮(坤)大"

    }

    ItemData["竹叶青(乾)"]={
    wp_1 = "形似毒蛇之怪斧，涂有奇毒。削铁如泥，视甲胄如无物，只需触人肌肤，即可取人性命。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 70
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '竹叶青(乾)小'
    ,wp_13 = '竹叶青(乾)大'

    }
    ItemData["竹叶青(坤)"]={
    wp_1 = "形似毒蛇之怪斧，涂有奇毒。削铁如泥，视甲胄如无物，只需触人肌肤，即可取人性命。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 70
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "竹叶青(坤)小"
    ,wp_13 = "竹叶青(坤)大"

    }

    ItemData["鲛煞(乾)"]={
    wp_1 = "北海有大鱼，其名为鲛。取其利齿作双斧，攻时如巨鲨噬人，凶煞万分，旁人不得近身。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 80
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "鲛煞(乾)小"
    ,wp_13 = "鲛煞(乾)大"

    }

    ItemData["鲛煞(坤)"]={
    wp_1 = "北海有大鱼，其名为鲛。取其利齿作双斧，攻时如巨鲨噬人，凶煞万分，旁人不得近身。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 80
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "鲛煞(坤)小"
    ,wp_13 = "鲛煞(坤)大"

    }

    ItemData["啖月(乾)"]={
    wp_1 = "有美玉称月陨，其自天上来，落于大荒之深，时人以为天狗食月所致。锻之为斧，清辉不减，寒气逼人。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 90
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "啖月(乾)小"
    ,wp_13 = "啖月(乾)大"

    }

    ItemData["啖月(坤)"]={
    wp_1 = "有美玉称月陨，其自天上来，落于大荒之深，时人以为天狗食月所致。锻之为斧，清辉不减，寒气逼人。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 90
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "啖月(坤)小"
    ,wp_13 = "啖月(坤)大"

    }

    ItemData["义战(乾)"]={
    wp_1 = "墨子曰：万事莫贵于义。义战利于天下，不义祸害四海，故造此器，集机关偃术之大成。义者持此甲盾之兵，所向无敌。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 100
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "义战(乾)小"
    ,wp_13 = "义战(乾)大"

    }

    ItemData["义战(坤)"]={
    wp_1 = "墨子曰：万事莫贵于义。义战利于天下，不义祸害四海，故造此器，集机关偃术之大成。义者持此甲盾之兵，所向无敌。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 100
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "义战(坤)小"
    ,wp_13 = "义战(坤)大"

    }

    ItemData["恶来(乾)"]={
    wp_1 = "古之猛士恶来，力可拔山，勇不可当。即使手提重若九鼎之兵作战，也能行云流水，手到擒来。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 110
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "恶来(乾)小"
    ,wp_13 = "恶来(乾)大"

    }

    ItemData["恶来(坤)"]={
    wp_1 = "古之猛士恶来，力可拔山，勇不可当。即使手提重若九鼎之兵作战，也能行云流水，手到擒来。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 110
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "恶来(坤)小"
    ,wp_13 = "恶来(坤)大"

    }

    ItemData["烬世野火(乾)"]={
    wp_1 = "毕方者，火鸟也，传其在世时火海连天，三界皆焚。后人以其羽为械，仍有焦金流石之威。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 120
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "烬世野火(乾)小"
    ,wp_13 = "烬世野火(乾)大"

    }

    ItemData["烬世野火(坤)"]={
    wp_1 = "毕方者，火鸟也，传其在世时火海连天，三界皆焚。后人以其羽为械，仍有焦金流石之威。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 120
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "烬世野火(坤)小"
    ,wp_13 = "烬世野火(坤)大"

    }

    ItemData["九州海沸(乾)"]={
    wp_1 = "九婴毙于凶水，有巧匠以其骸骨龙筋制成双斧之胚，欲设斧刃，忽九婴目光洞洞，吐洪流以成斧身，流水千变，百克不殆。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 130
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '九州海沸(乾)小'
    ,wp_13 = '九州海沸(乾)大'

    }
    ItemData["九州海沸(坤)"]={
    wp_1 = "九婴毙于凶水，有巧匠以其骸骨龙筋制成双斧之胚，欲设斧刃，忽九婴目光洞洞，吐洪流以成斧身，流水千变，百克不殆。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 130
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '九州海沸(坤)小'
    ,wp_13 = '九州海沸(坤)大'

    }
    ItemData["八狱末劫(乾)"]={
    wp_1 = "地府之深，谓之地狱，有八层：曰等活，曰号叫，曰大焦热，曰无间，云云八类，遍常冥世之苦。此斧鬼面黑绳，曾为八大地狱之门，阻挡万千恶鬼。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 140
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '八狱末劫(乾)小'
    ,wp_13 = '八狱末劫(乾)大'

    }
    ItemData["八狱末劫(坤)"]={
    wp_1 = "地府之深，谓之地狱，有八层：曰等活，曰号叫，曰大焦热，曰无间，云云八类，遍常冥世之苦。此斧鬼面黑绳，曾为八大地狱之门，阻挡万千恶鬼。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 140
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '八狱末劫(坤)小'
    ,wp_13 = '八狱末劫(坤)大'

    }
    ItemData["罗喉计都(乾)"]={
    wp_1 = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 150
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '罗喉计都(乾)小'
    ,wp_13 = '罗喉计都(乾)大'

    }
    ItemData["罗喉计都(坤)"]={
    wp_1 = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 150
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = '罗喉计都(坤)小'
    ,wp_13 = '罗喉计都(坤)大'

    }
    ItemData["非天(乾)"]={
    wp_1 = "似神非神，似人非人。狠天神之无情，亦嗔凡人之黯弱。上战提婆，下扶苍氓，心火焚诸魔，斩业断恶果，所图非天，不顺天意。此即阿修罗之道。"
    ,wp_2 = 2
    ,wp_3 = 3
    ,wp_4 = 910
    ,wp_5 = 160
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "非天(乾)小"
    ,wp_13 = "非天(乾)大"

    }
    ItemData["非天(坤)"]={
    wp_1 = "似神非神，似人非人。狠天神之无情，亦嗔凡人之黯弱。上战提婆，下扶苍氓，心火焚诸魔，斩业断恶果，所图非天，不顺天意。此即阿修罗之道。"
    ,wp_2 = 2
    ,wp_3 = 4
    ,wp_4 = 911
    ,wp_5 = 160
    ,wp_7 = {
        "影精灵(九黎城)"
    }
    ,wp_11 = "影精灵.dll"
    ,wp_12 = "非天(坤)小"
    ,wp_13 = "非天(坤)大"

    }
   ItemData["驭魔笼"]={
    wp_1 = "【九黎城门派法宝】昔日蚩尤遨游魔域，收服万邪，以此笼囚禁诸魔异兽，妖气浓郁，威压四方。佩戴后可令“黎魂”触发3个师门技能概率增加。"
    ,wp_2 = 1000
    ,wp_3 = 3
    ,wp_4 = 2
    ,wp_5 = 0
    ,wp_6 = 100
    ,wp_7 = 1
    ,wp_8 = 0
    ,wp_11 = "item.wd1"
    ,wp_12 = 0x00000082
    ,wp_13 = 0x00000083

    }

    ItemData["铸兵锤"]={
    wp_1 = "于九黎城魔息熔浆中锻炼，由兵主蚩尤亲自铸造，魔兵之魂汇入其中，击之震撼乾坤。主动使用可获得“怒哮状态”，并且抵抗封印类法术能力提升，持续2回合。"
    ,wp_2 = 1000
    ,wp_3 = 2
    ,wp_4 = 1
    ,wp_5 = 1
    ,wp_6 = 80
    ,wp_7 = 8
    ,wp_8 = 3
    ,wp_11 = "item.wd1"
    ,wp_12 = 0x00000084
    ,wp_13 = 0x00000085

    }

    ItemData["魔息角"]={
    wp_1 = "上古魔域，四凶尽出，占四方为王。至兵主降世，降穷奇饕餮，伏混沌梼杌，折其之角，引至浊魔息，以地火熔铸而得。持之号令魔域，莫有不从。"
    ,wp_2 = 1001
    ,wp_3 = 99
    ,wp_11 = "item.wd1"
    ,wp_12 = 0x00000086
    ,wp_13 = 0x00000087
    }
	ItemData["新三符石礼包"]={ --武神坛
			wp_1 = "打开随机获得新三符石一枚\n#Y【使用方式】鼠标右键使用"
			,wp_2 = 1
			,wp_3 = 11
			,wp_4 = 0
			,wp_8 = 3
			,wp_11 = "item.wdf"
			,wp_12 = 959572106 --小
			,wp_13 = 2953344867
			}
	ItemData["星石礼包"]={ --武神坛
			wp_1 = "打开随机获得新三符石一枚\n#Y【使用方式】鼠标右键使用"
			,wp_2 = 1
			,wp_3 = 11
			,wp_4 = 0
			,wp_8 = 3
			,wp_11 = "item.wdf"
			,wp_12 = 959572106 --小
			,wp_13 = 2953344867
			}
		ItemData["小魔头饰品"]={
		wp_1 = "适合小魔头使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["进阶小魔头饰品"]={
		wp_1 = "适合进阶小魔头使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["小毛头饰品"]={
		wp_1 = "适合小毛头使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["小丫丫饰品"]={
		wp_1 = "适合小丫丫使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["小仙灵饰品"]={
		wp_1 = "适合小仙灵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["小仙女饰品"]={
		wp_1 = "适合小仙女使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["小精灵饰品"]={
		wp_1 = "适合小精灵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["进阶小毛头饰品"]={
		wp_1 = "适合进阶小毛头使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["进阶小丫丫饰品"]={
		wp_1 = "适合进阶小丫丫使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["进阶小仙灵饰品"]={
		wp_1 = "适合进阶小仙灵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["进阶小仙女饰品"]={
		wp_1 = "适合进阶小仙女使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["进阶小精灵饰品"]={
		wp_1 = "适合进阶小精灵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["地心印记"]={
		wp_1 = "神秘"
		,wp_2 = 9
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 1
		,wp_11 = "自用图标.wdf"
		,wp_12 = 0x10000220
		,wp_13 = 0x10000221
		}
	ItemData["低级矿石"]={
		wp_1 = "铜矿石是各个地图最常见的矿石之一，通常出现在地下深度较浅的地方。铜矿石可以用来制作铜锭，也可以用来制作其他一些初级的装备和工具。"
		,wp_2 = 9
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "自用图标.wdf"
		,wp_12 = 0x10000214
		,wp_13 = 0x10000215
		}
	ItemData["中级矿石"]={
		wp_1 = "银矿石是各个地图的基础矿石之一，通常出现在地下深度较深的地方。银矿石可以用来制作银锭，也可以用来制作更高级的装备和工具。"
		,wp_2 = 9
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "自用图标.wdf"
		,wp_12 = 0x10000216
		,wp_13 = 0x10000217
		}
	ItemData["高级矿石"]={
		wp_1 = "金矿石是各个地图的贵重矿石之一，通常出现在地下深度较深的地方。金矿石可以用来制作金锭，也可以用来制作高级的装备和工具。"
		,wp_2 = 9
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "自用图标.wdf"
		,wp_12 = 0x10000217
		,wp_13 = 0x10000218
		}
	ItemData["队标特效"]={
		wp_1 = "使用可随机改变队标特效特效"
		,wp_2 = 161
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "mhxiu.wdf"
		,wp_12 = 785530686
		,wp_13 = 1858558533
		}
	ItemData["月卡"]={
		wp_1 = "月卡\n#Y【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "sjm.wdf"
		,wp_12 = 0x00000771 --小
		,wp_13 = 0x00000771
		}
	ItemData["体验月卡"]={
		wp_1 = "开服七天的月卡体验资格\n#Y【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "sjm.wdf"
		,wp_12 = 0x00000771 --小
		,wp_13 = 0x00000771
		}
	ItemData["新手大礼包"]={
		wp_1 = "感谢您对游戏的支持与热爱！这是游戏管理员为您定制的礼包\n#Y【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wd1"
		,wp_12 = 725942267 --小
		,wp_13 = 3792851385
		}
	ItemData["铁锤"]={
		wp_1 = "使用廉价的铁打造出的锤子，有一定的破坏性。\n【功效】右键点击，对敌方师爷使用，可降低对方建筑物的完成度。"
		,wp_2 = "更改鼠标"
		,wp_3 = 9999
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2510274275 --小
		,wp_13 = 3228783945
		}
	ItemData["特殊清灵仙露"]={
		wp_1 = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（可以直接使召唤兽灵性提升至110）\n#Y灵气：110"
		,wp_2 = "召唤兽道具"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0xE0D95C88
		,wp_13 = 0x253B7A83
		}
	ItemData["九转金丹礼包"]={
		wp_1 = "感谢您的支持与热爱！打开能获得10个#G九转金丹\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
	ItemData["路费大礼包"]={
		wp_1 ="来自沉默的关爱\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "kkjn.wdf"
		,wp_12 = 0xA3DB661B --小
		,wp_13 = 0x5AAF94C0
		}
	 ItemData["八级玄灵珠礼包"]={
	 	wp_1 = "装着玄灵珠的宝袋,打开获得随机8级玄灵珠一枚"
	 	,wp_2 = 1
	 	,wp_3 = 11
	 	,wp_4 = 0
	 	,wp_8 = 3
	 	,wp_11 = "XWD.wdf"
		,wp_12 = 0xF0F80A47
		,wp_13 = 0x4A9F710F
	 	}
	 ItemData["十级玄灵珠礼包"]={
	 	wp_1 = "装着玄灵珠的宝袋,打开获得随机10级玄灵珠一枚"
	 	,wp_2 = 1
	 	,wp_3 = 11
	 	,wp_4 = 0
	 	,wp_8 = 3
	 	,wp_11 = "XWD.wdf"
		,wp_12 = 0xF0F80A47
		,wp_13 = 0x4A9F710F
	 	}
	ItemData["8级钟灵石礼包"]={
	 	wp_1 = "装着钟灵石的宝袋,打开获得随机8级钟灵石一颗"
	 	,wp_2 = 1
	 	,wp_3 = 11
	 	,wp_4 = 0
	 	,wp_8 = 3
	 	,wp_11 = "ceshi.wdf"
		,wp_12 = "钟灵石小"
		,wp_13 = "钟灵石大"
		}
	ItemData["6级钟灵石礼包"]={
	 	wp_1 = "装着钟灵石的宝袋,打开获得随机6级钟灵石一颗"
	 	,wp_2 = 1
	 	,wp_3 = 11
	 	,wp_4 = 0
	 	,wp_8 = 3
	 	,wp_11 = "ceshi.wdf"
		,wp_12 = "钟灵石小"
		,wp_13 = "钟灵石大"
		}
	ItemData["月饼"]={
		wp_1 = "中秋节活动的奖品。食用后可以增加人物1点潜能（不可以对召唤兽使用），但每个人物最多食用100个月饼"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "nvdi1.wdf"
		,wp_12 = 0x846AD205--小
		,wp_13 = 0x49B4F6DC
		}
	ItemData["160附魔宝珠礼包"]={
		wp_1 = "感谢您的支持与热爱！打开能获得10个#G160级附魔宝珠\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
	ItemData["炫彩ID"]={
	    wp_1 = "可以改变ID特效，用以展示实力！"
	    ,wp_2 = 1
	    ,wp_3 = 11
	    ,wp_4 = 0
	    ,wp_8 = 3
	    ,wp_11 = "沉默.wdf"
	    ,wp_12 = 0x0B0D2690--小
	    ,wp_13 = 0x90c786f8
	    }
	-- ItemData["紫色"]={
	--     wp_1 = "感谢您"
	--     ,wp_2 = 1
	--     ,wp_3 = 11
	--     ,wp_4 = 0
	--     ,wp_8 = 3
	--     ,wp_11 = "沉默.wdf"
	--     ,wp_12 = 0xAAAAAAA4 --小
	--     ,wp_13 = 0xAAAAAAA5
	--     }
	-- ItemData["红色"]={
	--     wp_1 = "感谢您"
	--     ,wp_2 = 1
	--     ,wp_3 = 11
	--     ,wp_4 = 0
	--     ,wp_8 = 3
	--     ,wp_11 = "沉默.wdf"
	--     ,wp_12 = 0X2FBEF441--小
	--     ,wp_13 = 0x8E2EB02B
	--     }
	-- ItemData["黄色"]={
	--     wp_1 = "感谢您"
	--     ,wp_2 = 1
	--     ,wp_3 = 11
	--     ,wp_4 = 0
	--     ,wp_8 = 3
	--     ,wp_11= "沉默.wdf"
	--     ,wp_12= 0xAAAAAAA7 --小
	--     ,wp_13= 0xAAAAAAA2
	-- }
	-- ItemData["绿色"]={
	--     wp_1 = "感谢您"
	--     ,wp_2 = 1
	--     ,wp_3 = 11
	--     ,wp_4 = 0
	--     ,wp_8 = 3
	--     ,wp_11 = "沉默.wdf"
	--     ,wp_12 = 0xAAAAAAA6 --小
	--     ,wp_13 = 0xAAAAAAA3
	--     }
	ItemData["武器附神锤"]={ -------武器神附
        wp_1 = "阎罗殿地下岩浆历经千万载的铁金制成。\n#G/可赋予#R/[武器]#G/随机品阶:卓越/神赐/完美/神圣,最大提升50%武器属性值.\n【功效】对武器使用，可为武器附加神附效果"
        ,wp_2 = 184
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "item.wdf"
        ,wp_12 = 2510274275 --小
        ,wp_13 = 3228783945
        }

    ItemData["元素曜石礼包"] = {
        wp_1 = "随机元素曜石礼包，购买后开启可获得10个随机的元素曜石。"
        , wp_2 = 201
        , wp_3 = 1
        , wp_4 = 1
        ,wp_11 = "item.wd1"
        ,wp_12 = 0x5A8D153B --小
        ,wp_13 = 0xA36FE571
        }

	ItemData["160钨金礼包"]={
		wp_1 = "打开能获得10个#G160级钨金\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
	ItemData["机缘宝箱"]={
		wp_1 = "右键点击能开启一次赤金宝箱"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 3424199175 --小
		,wp_13 = 3708724141
		}
	ItemData["秘宝宝箱"]={
		wp_1 = "右键使用可以开启大转盘抽奖一次，可能获得神兜兜等珍稀道具"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 3424199175 --小
		,wp_13 = 3708724141
		}
	ItemData["摇钱树苗"]={
		wp_1 = "摇钱树的树苗，在特定地方种下，可能有意想不到的收获。"
		,wp_2 = 21
		,wp_3 = 3
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x2D1399E3
		,wp_13 = 0x82254575
		}
	ItemData["新手宝宝"]={
		wp_1 = "随机（1-2）只新手宝宝，陪伴您的成长\n#G有可能会发生变异"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 89393477 --小
		,wp_13 = 786306231
		}
	ItemData["装备特效宝珠"]={
		wp_1 = ""
		,wp_2 = 181
		,wp_3 = 3
		,wp_4 = 0
		}
	ItemData["灵饰特效宝珠"]={
	   wp_1 = ""
	  ,wp_2 = 182
	  ,wp_3 = 3
	  ,wp_4 = 0
	}
	ItemData["特效宝珠"]={
		wp_1 = ""
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 2
		}
	ItemData["和田白玉"]={
		wp_1 = "临江之畔，璞石无光，千年白玉，温润有方。有一定的概率为人物装备点化出#R无级别限制#W特效。\n#Y【使用限制】≤140级"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 1236953673
		,wp_13 = 551114488
		}
	ItemData["癫散戏票·一斛珠"]={
		wp_1 = "开启癫散戏班如梦奇谭“一斛珠”的专属戏票。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 293483709
		,wp_13 = 3532779943
		}
	ItemData["癫散戏票·五更寒"]={
		wp_1 = "开启癫散戏班如梦奇谭“五更寒”的专属戏票。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 2778675438
		,wp_13 = 1844496031
		}
	ItemData["癫散戏票·双城记"]={
		wp_1 = "开启癫散戏班如梦奇谭“双城记”的专属戏票。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 2573435701
		,wp_13 = 3262694175
		}
	ItemData["愤怒符"]={
		wp_1 = "太上老君的精气炼化而成，可为腰带附加特殊效果。\n\n#W特效：#R愤怒"
		,wp_2 = 183   --总类
		,wp_3 = 3     --分类
		,wp_4 = 0     --子类
		,wp_11 = "item.wdf"
		,wp_12 = 0x5FE14302
		,wp_13 = 0x44189679
		}
	ItemData["不磨符"]={
		wp_1 = "为装备附加永不磨损效果。\n\n#W概率：50%"
		,wp_2 = 183
		,wp_3 = 4
		,wp_4 = 0
		,wp_11 = "nvdi1.wdf"
		,wp_12 = 0x6ED001C0
		,wp_13 = 0x0DA2828E  --大
		}
	ItemData["双加转换符"]={
		wp_1 = "可为武器，衣服更换单加和双加属性，不会更换数值。"
		,wp_2 = 183   --总类
		,wp_3 = 5     --分类
		,wp_4 = 0     --子类
		,wp_11 = "kkjn.wdf"
		,wp_12 = 0x86AF33D1
		,wp_13 = 0x6FE3C110
		}
	ItemData["特技书"]={
		wp_1 = "神兵之精魂所汇，记载着各种武功秘籍，可为装备附加特殊效果。\n【说明】：该物品为测试物品\n【类型】：#R特技"
		,wp_2 = 180
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1685829875
		,wp_13 = 7947442
		}
	ItemData["40装备礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】40"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x4A764237
		,wp_13 = 0x63C9C2D2
		}
	ItemData["60装备礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】60"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x4A764237
		,wp_13 = 0x63C9C2D2
		}
	ItemData["90装备礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】90"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1687078938--0x65AE0DFF
		,wp_13 = 4188923289--0x2CE03BE9
		}
	ItemData["100无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】100"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1687078938--0x65AE0DFF
		,wp_13 = 4188923289--0x2CE03BE9
		}
		ItemData["110无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】110"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1687078938--0x65AE0DFF
		,wp_13 = 4188923289--0x2CE03BE9
		}
	ItemData["120无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】120"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1687078938--0x65AE0DFF
		,wp_13 = 4188923289--0x2CE03BE9
		}
	ItemData["130无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】130"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD6363DD6
		,wp_13 = 0x5FBAB8DC
		}
	ItemData["140无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】140"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD6363DD6
		,wp_13 = 0x5FBAB8DC
		}
	ItemData["150无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】150"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD6363DD6
		,wp_13 = 0x5FBAB8DC
		}
	ItemData["160无级别礼包"]={
		wp_1 = "为您量身定制的一套装备礼包\n【等级】150"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD6363DD6
		,wp_13 = 0x5FBAB8DC
		}
	ItemData["160无级别全套"]={
		wp_1 = "武神坛专用装备礼包\n【等级】150"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD6363DD6
		,wp_13 = 0x5FBAB8DC
		}
	ItemData["一万银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["十万银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["百万银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["千万银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["一亿银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["十亿银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["百亿银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }
    ItemData["千亿银票"]={
        wp_1 = "这是一张银票打开可获得相应银两"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "kkjn.wdf"
        ,wp_12 = 0xFA49DAFD    --小
        ,wp_13 = 0x7F1E2D96
        }

    ItemData["十点仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["一百仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["一千仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["一万仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["十万仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["百万仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["千万仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["一亿仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["十亿仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["百亿仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["千亿仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }
    ItemData["万亿仙玉"]={
        wp_1 = "这是一张仙玉兑换券，打开可获得相应仙玉"
        ,wp_2 = 113
        ,wp_3 = 3
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0x5627FA3F    --小
        ,wp_13 = 0x5627FA3F
        }

	ItemData["种族坐骑"]={
		wp_1 = "一只随机种族坐骑"
		,wp_2 = "坐骑礼包"
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 3012605770
		,wp_13 = 2079551749
		}
	ItemData["无常勾魂索"]={
		wp_1 = "黑白无常索命时用的钩索，不知为何流落人间。可以用于追杀仇人。若仇恨已经消弭，可以交给强行PK申请人。\n#Y右键点击使用"
		,wp_2 = 162
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 3779216716
		,wp_13 = 3763912924
		}
	ItemData["阎罗免死牌"]={
		wp_1 = "十殿阎罗赐予的免死金牌，带有此物便可以不死不灭，不入轮回。"
		,wp_2 = 163
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 2436730921
		,wp_13 = 1415631913
		}
	ItemData["密信"]={
		wp_1 = "礼部侍郎向各门派求试题的书信"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xD75A7F1C
		,wp_13 = 0xEA0E76DF
		}
	ItemData["梁木"]={
		wp_1 = "源自长安社区的木材，据说是制造笔杆子的良好木材"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1192555457 --小4056791876
		,wp_13 = 4056791876
		}
	ItemData["符纸"]={
		wp_1 = "福寿店老板亲自制作的符纸，据说有定魂超度之效"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 3041913303 --小
		,wp_13 = 1452310727
		}
	ItemData["镇妖拘魂铃"]={
		wp_1 = "声音悦耳，为女子所喜，常买回去佩带在身上。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x254F32EB
		,wp_13 = 0xDF6AC41C
		}
	ItemData["宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["1级宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["2级宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["3级宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["4级宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["5级宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["五宝盒"]={
		wp_1 = "装着神奇的宝贝，散发着不凡的光华"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 1386278008
		,wp_13 = 2785666721 --大
		}
	ItemData["经验"]={
		wp_1 = "你将获得丰厚的经验。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2858754553
		,wp_13 = 137229032
		}
	ItemData["测试经验"]={
		wp_1 = "你将获得丰厚的经验。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2858754553
		,wp_13 = 137229032
		}
		-----特效
	ItemData["虎威一震白"]={
		wp_1 = "虎威一震白。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "虎宝攻击小"
		,wp_13= "虎宝攻击大"
		}

	ItemData["虎威一震黑"]={
		wp_1 = "虎威一震黑。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "虎宝攻击小"
		,wp_13= "虎宝攻击大"
		}
	ItemData["虎威一震金"]={
		wp_1 = "虎威一震金。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "虎宝攻击小"
		,wp_13= "虎宝攻击大"
		}
	ItemData["虎啸生风黑"]={
		wp_1 = "虎啸生风黑。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "虎宝生风施法小"
		,wp_13= "虎啸生风施法大"
		}
	ItemData["虎啸生风金"]={
		wp_1 = "虎啸生风金。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "虎宝生风施法小"
		,wp_13= "虎啸生风施法大"
		}
	ItemData["耀炎麒麟白"]={
		wp_1 = "耀炎麒麟白。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "耀炎麒麟小"
		,wp_13= "耀炎麒麟大"
		}
	ItemData["耀炎麒麟黑"]={
		wp_1 = "耀炎麒麟黑。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "耀炎麒麟小"
		,wp_13= "耀炎麒麟大"
		}
	ItemData["耀炎麒麟金"]={
		wp_1 = "耀炎麒麟金。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "耀炎麒麟小"
		,wp_13= "耀炎麒麟大"
		}
	ItemData["万物生长白"]={
		wp_1 = "万物生长白。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "万物小"
		,wp_13= "万物大"
		}
	ItemData["万物生长黑"]={
		wp_1 = "万物生长黑。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "万物小"
		,wp_13= "万物大"
		}
	ItemData["万物生长绿"]={
		wp_1 = "万物生长绿。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "万物小"
		,wp_13= "万物大"
		}
	ItemData["曜焰麒麟白"]={
		wp_1 = "曜焰麒麟白。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "曜焰麒麟小"
		,wp_13= "曜焰麒麟大"
		}
	ItemData["曜焰麒麟黑"]={
		wp_1 = "曜焰麒麟黑。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "曜焰麒麟小"
		,wp_13= "曜焰麒麟大"
		}
	ItemData["比翼飞粉"]={
		wp_1 = "比翼飞粉。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "比翼飞粉小"
		,wp_13= "比翼飞粉大"
		}
	ItemData["比翼飞蓝"]={
		wp_1 = "比翼飞蓝。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "比翼飞蓝小"
		,wp_13= "比翼飞蓝大"
		}
	ItemData["扶摇九霄"]={
		wp_1 = "扶摇九霄。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "扶摇九霄小"
		,wp_13= "扶摇九霄大"
		}
	ItemData["四海归源"]={
		wp_1 = "四海归源。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "四海归源小"
		,wp_13= "四海归源"
		}

	ItemData["牛气冲天"]={
		wp_1 = "牛气冲天。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "牛气小"
		,wp_13= "牛气大"
		}
	ItemData["齐天大圣（攻）"]={
		wp_1 = "齐天大圣。（攻击特效）"
		,wp_2 = "特效"
		,wp_3 = 19
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "攻击小"
		,wp_13= "攻击大"
		}
	ItemData["齐天大圣（法）"]={
		wp_1 = "齐天大圣。（施法特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "施法小"
		,wp_13= "施法大"
		}
	ItemData["齐天大圣·群法"]={
		wp_1 = "齐天大圣。（法术特效）"
		,wp_2 = "特效"
		,wp_3 = 20
		,wp_4 = 5
		,wp_5 = 0
		,wp_11 = "sftx.dll"
		,wp_12 = "施法小"
		,wp_13= "施法大"
		}
	ItemData["竹木签"]={
		wp_1 = "你向惠明长老求来的竹木签。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xAD79AA55
		,wp_13 = 0x7DB155A9
		}
	ItemData["逐妖蛊虫"]={
		wp_1 = "降妖伏魔的重要道具，在正确的地方使用后可以追寻到妖魔的踪迹。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3157569278
		,wp_13 = 3506935754
		}
	ItemData["招魂帖"]={
		wp_1 = "降妖伏魔的重要道具，招魂帖贴在地图，可以快速引来附件的妖魔。"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3040004711
		,wp_13 = 3494094318
		}
	ItemData["蓝色导标旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 1
		,wp_4 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 53543608
		,wp_13 = 340145338
		,wp_14 = 60000
		}
	ItemData["黄色导标旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 1
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 1953229980
		,wp_13 = 1011605557
		,wp_14 = 13000
		}
	ItemData["红色导标旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 1
		,wp_4 = 10
		,wp_11 = "item.wdf"
		,wp_12 = 2856215948
		,wp_13 = 3379177744
		,wp_14 = 7000
		}
	ItemData["绿色导标旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 1
		,wp_4 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 1060779522
		,wp_13 = 662138631
		,wp_14 = 120000
		}
	ItemData["白色导标旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 1
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 2217728758
		,wp_13 = 1751361785
		,wp_14 = 1500
		}
	ItemData["蓝色合成旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 2
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x78C6828D
		,wp_13 = 0x4D27A80E
		,wp_14 = 13000
		}
	ItemData["绿色合成旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 2
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0xC87EF093
		,wp_13 = 0x498354A0
		,wp_14 = 13000
		}
	ItemData["黄色合成旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 2
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x409FA7D1
		,wp_13 = 0x3D64E066
		,wp_14 = 13000
		}
	ItemData["白色合成旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 2
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x306FE9B9
		,wp_13 = 0xB06EE4C6
		,wp_14 = 13000
		}
	ItemData["红色合成旗"]={
		wp_1 = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		,wp_2 = 11
		,wp_3 = 2
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x0DE87173
		,wp_13 = 0x4F8723DA
		,wp_14 = 13000
		}
	ItemData["超级合成旗"]={
		wp_1 = "合成旗的进阶版，想飞哪里就飞哪里！！"
		,wp_2 = 11
		,wp_3 = 2
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0xb451d176
		,wp_13 = 0x2c95bd3b
		,wp_14 = 100000
		}
	ItemData["草果"]={
		wp_1 = "“香草高士意,兰花隐者心。”散发淡淡香气的药草,具有一定的疗伤作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_10 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x48B661C2
		,wp_13 = 0x1134EEB1
		,wp_15 = 10
		}
	ItemData["山药"]={
		wp_1 = "直立草本,羽状复叶,花白色、黄色、蓝色或紫色,浆果紫色,常见药草,可补充少量气血对疗伤有定效果"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_10 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x9D941C39
		,wp_13 = 0xC0EC938B
		,wp_15 = 10
		}
	ItemData["九香虫"]={
		wp_1 = "带有药性的虫,因为与异花生活在一起,通体散着浓浓的异香,具有一定疗伤作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_10 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0xC30AE6EF
		,wp_13 = 0x1BF0DE4E
		,wp_15 = 10
		}
	ItemData["八角莲叶"]={
		wp_1 = "八角形状的莲叶,是非常少见的药物,产自西牛贺洲,可补充少量气血,具有疗伤作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_10 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x35C25C5F
		,wp_13 = 0x2B46AADD
		,wp_14 = 10
		}
	ItemData["人参"]={
		wp_1 = "千年的老参,药性很强,可以补充些许气血,具有定疗伤作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_10 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x15E4304F
		,wp_13 = 0xF09CBA45
		,wp_14 = 80
		}
	ItemData["四叶花"]={
		wp_1 = "具有药性的中草药，长着四片叶子的药草，可以补充少量气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_10 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 2403345371
		,wp_13 = 2730519933
		,wp_14 = 100
		}
	ItemData["七叶莲"]={
		wp_1 = "“出污泥而不染”七片叶子的莲花更是稀有品种，难能可贵的是，这种莲花具有药性。可以补充少量气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1559451305
		,wp_13 = 3792310897
		,wp_14 = 150
		}
	ItemData["天青地白"]={
		wp_1 = "产于北方的药草，天青色的花，青白色的叶，具有药性。可以补充少量气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2832513988
		,wp_13 = 296513300
		,wp_14 = 200
		}
	ItemData["鬼切草"]={
		wp_1 = "产自阴间的药草，由于常年在阴湿之地，故而有很强的药力,可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x4CE95CD4
		,wp_13 = 0x405AE01C
		,wp_14 = 80
		}
	ItemData["紫丹罗"]={
		wp_1 = "产自东胜神洲的药草,紫色的叶子上散发出阵阵清香，可以补充少许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3370160386
		,wp_13 = 1385083912
		,wp_14 = 80
		}
	ItemData["佛手"]={
		wp_1 = "非常常见的药物，因其外貌酷似佛的手指而得名，可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2548894140
		,wp_13 = 383352299
		,wp_14 = 80
		}
	ItemData["旋复花"]={
		wp_1 = "产于东海海滨的药草,花开三色，暗和三才之术数，可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3005200763
		,wp_13 = 1826111581
		,wp_14 = 80
		}
	ItemData["百色花"]={
		wp_1 = "海外仙草，原产于方壶岛，兼百花之灵气，可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 542670697
		,wp_13 = 2739363770
		,wp_14 = 140
		}
	ItemData["香叶"]={
		wp_1 = "散发香气的药草叶子可以补充少量的法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1613933236
		,wp_13 = 4251066160
		,wp_14 = 140
		}
	ItemData["龙须草"]={
		wp_1 = "《古今注》曰：“世称皇帝炼丹凿砚山，乃得仙，乘龙上天。群臣援龙须，须堕而生草，曰龙须”，可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1050552246
		,wp_13 = 2301092035
		,wp_14 = 140
		}
	ItemData["灵脂"]={
		wp_1 = "采天地灵气而生的药物，又称三秀，可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2234254574
		,wp_13 = 4179146971
		,wp_14 = 200
		}
	ItemData["白玉骨头"]={
		wp_1 = "东方白民国药兽的骨头，具有很强的药性，可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3784788337
		,wp_13 = 3455660261
		,wp_14 = 200
		}
	ItemData["曼陀罗花"]={
		wp_1 = "常用的药草之一，华佗当年配制麻沸散的主要原料。可以补充少量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1670376717
		,wp_13 = 351908663
		,wp_14 = 275
		}
		-- 二级药品
	ItemData["熊胆"]={
		wp_1 = "千年熊罴的胆"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 2
		,wp_9 = 200
		,wp_11 = "item.wdf"
		,wp_12 = 1374442124
		,wp_13 = 278044265
		,wp_14 = 1250
		}
	ItemData["麝香"]={
		wp_1 = "仙山灵麝的麝香，是名贵的中草药材，可以补充些许法力"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 2
		,wp_10 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 117711803
		,wp_13 = 1653741198
		,wp_14 = 1250
		}
	ItemData["丁香水"]={
		wp_1 = "从仙岛上的丁香花中精心提炼而成"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 2
		,wp_10 = 75
		,wp_11 = "item.wdf"
		,wp_12 = 870043705
		,wp_13 = 598856410
		,wp_14 = 1000
		}
	ItemData["天不老"]={
		wp_1 = "南瞻部洲常见的药草，花期非常之长，故而得名，可以补充些许气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA1292738
		,wp_13 = 0x812F04D7
		,wp_14 = 1000
		}
	ItemData["紫石英"]={
		wp_1 = "紫色的千年英石，具有药性，可以补充些许气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x388CCEE9
		,wp_13 = 0x8AC7636D
		,wp_14 = 1000
		}
	ItemData["鹿茸"]={
		wp_1 = "南极仙翁仙鹿之茸,可以补充些许气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x92DCE8F4
		,wp_13 = 0x4B5BF1AF
		,wp_14 = 2000
		}
	ItemData["血色茶花"]={
		wp_1 = "出自南方的野生茶花,可以补充些许气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x50B560E1
		,wp_13 = 0x4DE946B5
		,wp_14 = 2000
		}
	ItemData["六道轮回"]={
		wp_1 = "天宫的异花，六种颜色可以清楚的反映出六道的轮回，故而得名，可以补充大量气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7A231B4A
		,wp_13 = 0x6F66E996
		,wp_14 = 2000
		}
	ItemData["熊胆"]={
		wp_1 = "千年熊罴的胆，是十分难得可遇不可求的宝物，可以补充大量气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x51EC528C
		,wp_13 = 0x10929E69
		,wp_14 = 2000
		}
	ItemData["凤凰尾"]={
		wp_1 = [[“彩凤双飞翼，心犀一点通。”这是一根灵鸟鸾凤尾部的羽毛，可以补充大量气血。]]
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x5BC584A7
		,wp_13 = 0x9E720FD5
		,wp_14 = 3000
		}
	ItemData["硫磺草"]={
		wp_1 = "在硫磺地长大的圣草，可以补充大量气血"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x338422D9
		,wp_13 = 0xA49FDDC1
		,wp_14 = 3000
		}
	ItemData["龙之心屑"]={
		wp_1 = "用龙心提炼出的灵药,只在魔界存在，可以补充极大量的气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBF847936
		,wp_13 = 0xC26FA33C
		,wp_14 = 4000
		}
	ItemData["火凤之睛"]={
		wp_1 = "无色界天的火凤凰的眼睛，可以补充极大量的气血。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD0B9CCDF
		,wp_13 = 0x7756A846
		,wp_14 = 4000
		}
	ItemData["丁香水"]={
		wp_1 = "从仙岛上的丁香花中精心提炼而成，可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x33DBD039
		,wp_13 = 0x23B1D2DA
		,wp_14 = 4000
		}
	ItemData["月星子"]={
		wp_1 = "五台山的名产，用水研化后使用，可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x18450CD6
		,wp_13 = 0xE3307E95
		,wp_14 = 4000
		}
	ItemData["仙狐涎"]={
		wp_1 = "东方青丘国九尾仙狐的涎水制成的药草，可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xB5F99FA9
		,wp_13 = 0x1E547A7E
		,wp_14 = 5000
		}
	ItemData["地狱灵芝"]={
		wp_1 = "产自地狱深处的灵芝草，由于吸取了阴魂怨气，药力很强，可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2F7C81CE
		,wp_13 = 0x696C18EE
		,wp_14 = 5000
		}
	ItemData["血珊瑚"]={
		wp_1 = "东海海底的千年珊瑚，具有强大的灵力,可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x0789B660
		,wp_13 = 0x92583E49
		,wp_14 = 5000
		}
	ItemData["餐风饮露"]={
		wp_1 = "南海普陀山的仙竹枝，可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xEB07E77A
		,wp_13 = 0x28AF1886
		,wp_14 = 5000
		}
	ItemData["白露为霜"]={
		wp_1 = "五庄观前的仙松之枝,服用后可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xC94308D2
		,wp_13 = 0x95A825DD
		,wp_14 = 5000
		}
	ItemData["天龙水"]={
		wp_1 = "九天真龙的血液炼成的药物，可以补充些许法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3256793E
		,wp_13 = 0xDA628B3B
		,wp_14 = 6000
		}
	ItemData["孔雀红"]={
		wp_1 = "用仙家孔雀的精华制成的药品，有很强的魔性，可以补充大量法力。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xF4A285EE
		,wp_13 = 0x82670C5A
		,wp_14 = 6000
		--三级药药品
		}
	ItemData["金创药"]={
		wp_1 = "用云南白药制成的疗伤药，可以止血、消毒，是常见的药品。具有补充气血的作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 3360268674
		,wp_13 = 3769489910
		,wp_14 = 10000
		}
	ItemData["金香玉"]={
		wp_1 = "仙子仙女常用的药物，除了可以养颜之外，服用后具有恢复气血的作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 99
		,wp_11 = "item.wdf"
		,wp_12 = 875333087
		,wp_13 = 2395394781
		,wp_14 = 12500
		}
	ItemData["小还丹"]={
		wp_1 = "载于中国古老药书《千金方》，散发着香气的紫色药丸，具有补充气血的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1261161767
		,wp_13 = 4110383651
		,wp_14 = 10000
		}
	ItemData["千年保心丹"]={
		wp_1 = "用大量名贵药品，经名师的精心加工制成的药丹，具有补充气血的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 3968259402
		,wp_13 = 212192249
		,wp_14 = 15000
		}
	ItemData["风水混元丹"]={
		wp_1 = "有混元之神效，用各类名贵药品精炼的丹药，具有补充法力和恢复战斗中某些情况下损失的灵力的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1613137255
		,wp_13 = 3441623302
		,wp_14 = 10000
		}
	ItemData["定神香"]={
		wp_1 = "有定神凝气的功效，名贵药物，精心练成的丹药，具有补充法力的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2570329553
		,wp_13 = 4232010254
		,wp_14 = 11000
		}
	ItemData["蛇蝎美人"]={
		wp_1 = "魔王妖王常用的药物，具有补充法力的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2982020731
		,wp_13 = 2737638149
		,wp_14 = 15000
		}
	ItemData["十香返生丸"]={
		wp_1 = "用十种仙山上奇香的药草制成，奇异的药丸，具有补充法力和解除酒类异常状态的作用。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xC4D733DA
		,wp_13 = 0x3D4A4DFD
		,wp_14 = 15000
		}
	ItemData["九转回魂丹"]={
		wp_1 = "炼过九转的仙丹，用极为珍贵而特殊的药物制成，具有补充气血、疗伤和起死回生的功效。"
		,wp_2 = 1
		,wp_3 = 2
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 68961914
		,wp_13 = 1116089577
		,wp_14 = 40000
		}
	ItemData["佛光舍利子"]={
		wp_1 = "佛的舍利子具有补充气血、疗伤和起死回生的功效。"
		,wp_2 = 1
		,wp_3 = 2
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 529664613
		,wp_13 = 362856580
		,wp_14 = 20000
		}
	ItemData["五龙丹"]={
		wp_1 = "来自东海龙宫的珍贵药品，是用五颗龙珠凝练的，具有补充气血和解除封类异常状态的功效（解封几率与品质相关）。若未在封类异常状态服用五龙丹，会进入睡眠状态。"
		,wp_2 = 1
		,wp_3 = 2
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 260113467
		,wp_13 = 3795878131
		,wp_14 = 17500
		}
	ItemData["红雪散"]={
		wp_1 = "仙家灵药:用仙家红血制成:具有补充气血、解除善类异常状态以及恢复战斗中某些情况下损失的防御的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x8ABE812C
		,wp_13 = 0x8ABE812C
		,wp_14 = 17500
		---擂台药
		}
	ItemData["醉仙果"]={
		wp_1 = "用琼浆玉液灌溉培育而成服后让入醉生梦死。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n恢复愤怒值=品质*1\n附加疯狂状态3~4回合"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 432990065
		,wp_13 = 254688831
		,wp_14 = 12500
		}
	ItemData["七珍丸"]={
		wp_1 = "用七种仙草凝炼而成，能补充法万和解除酒类异常状态。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n解除酒类异常状态\n恢复魔法=品质*3+50"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2328296568
		,wp_13 = 1083002633
		,wp_14 = 12500
		}
	ItemData["九转续命丹"]={
		wp_1 = "取天地阴阳之精华,糅合多种草药精制而成,能起死回生。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n复活、恢复气血=品质*5+100\n临时气血上限变为品质*5+100"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1127213293
		,wp_13 = 1137250963
		,wp_14 = 12500
		}
	ItemData["十全大补丸"]={
		wp_1 = "补剂古方之一，十全大补，有补血疗伤乏功效。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n恢复气血=品质*4+200\n治疗伤势=品质*4+100"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1220225280
		,wp_13 = 424386854
		,wp_14 = 12500
		}
	ItemData["固本培元丹"]={
		wp_1 = "用于恢复元气的灵丹妙药，服用后可以恢复一定气血。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n恢复气血=品质*12+150"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 4119346967
		,wp_13 = 1626787288
		,wp_14 = 12500
		}
	ItemData["舒筋活络丸"]={
		wp_1 = "行走江湖必备之良药，能补充气血和解除封类异常状态。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n解除封类异常状态\n恢复气血=品质*3"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1804667887
		,wp_13 = 47447545
		,wp_14 = 12500
		}
	ItemData["凝气丸"]={
		wp_1 = "兰虎家传之丹药，服用后有助于凝神聚气，能补充法力。\n兰虎秘制、擂台专用，请认明虎头标志，慎防假冒。\n【功效】\n恢复魔法=品质*5+100"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 3171198485
		,wp_13 = 2987017153
		,wp_14 = 12500
		--高级三药药品
		}
	ItemData["黑玉云苓膏"]={
		wp_1 = "用名贵药材熬制的奇妙药膏,温润如黑玉,具有补充魔法功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xf26ec524
		,wp_13 = 0xa04794a8
		}
	ItemData["金石返魂丹"]={
		wp_1 = "传说是根据华佗遗留的药方炼制而成的丹药,具有补充气血、疗伤和起死回生的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xe1f55a52
		,wp_13 = 0x177c8f03
		}
	ItemData["百炼金乌丸"]={
		wp_1 = "经过百次炼制的名贵丹药,具有补充气血的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xe83da360
		,wp_13 = 0xc40f2beb
		}
	ItemData["生骨续命膏"]={
		wp_1 = "用名贵中药熬制七七四十九日而成的药膏,具有补充气血、疗伤和起死回生的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xcadbd5d8
		,wp_13 = 0xcadbd5d8
		}
	ItemData["回春龙沙散"]={
		wp_1 = "细如金沙却有回春神效的名贵丹药,具有疗伤的功效,且可以解除封类、酒类、毒类以外的常规异常效果。,具有补充气血的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xf6d57eba
		,wp_13 = 0x4b616312
		}
	ItemData["紫心玉露丸"]={
		wp_1 = "传说是太上老君丹药炉中炼制出来的名贵丹药,具有补充气血的功效。"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xfec469af
		,wp_13 = 0x3800f29e
		,wp_14 = 20000
		--烹饪类
		}
	ItemData["包子"]={
		wp_1 = "精面粉制作的肉包子味道非常好"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 1457520669
		,wp_13 = 1302655530
		,wp_14 = 100
		}
	ItemData["女儿红"]={
		wp_1 = "名酒，酒香浓烈"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x2ECB8558
		,wp_13 = 0x5F376254
		,wp_14 = 100
		}
	ItemData["臭豆腐"]={
		wp_1 = "虽然闻起来有些臭，吃起来很香的。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x7E096A40
		,wp_13 = 0xCC401415
		,wp_14 = 100
		}
	ItemData["烤鸭"]={
		wp_1 = "北方特产，油滑可口"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x900198D8
		,wp_13 = 0xAA17FF00
		,wp_14 = 100
		}
	ItemData["烤肉"]={
		wp_1 = "烤出的肉，非常好吃"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x775117AB
		,wp_13 = 0x09D51835
		,wp_14 = 100
		}
	ItemData["佛跳墙"]={
		wp_1 = "东吴名厨创制的一道菜，味道鲜美。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x76A70298
		,wp_13 = 0x01F1ED48
		,wp_14 = 100
		}
	ItemData["翡翠豆腐"]={
		wp_1 = "名厨名菜，炒得色香味美全。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x11D6858F
		,wp_13 = 0x3178273A
		,wp_14 = 100
		}
	ItemData["桂花丸"]={
		wp_1 = "糯米和桂花制成的食品。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0xCCC8D804
		,wp_13 = 0xDF9A8FAB
		,wp_14 = 100
		}
	ItemData["豆斋果"]={
		wp_1 = "素食品，豆面制成的各种水果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0xEA4ED968
		,wp_13 = 0x58130DB3
		,wp_14 = 100
		}
	ItemData["长寿面"]={
		wp_1 = "一碗热气腾腾的长寿面条。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x9914F83B
		,wp_13 = 0xC5652305
		,wp_14 = 100
		}
	ItemData["珍露酒"]={
		wp_1 = "用露水酿制的美酒。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x71F4446B
		,wp_13 = 0xEFFC63BB
		,wp_14 = 100
		}
	ItemData["梅花酒"]={
		wp_1 = "梅花泡成的酒，有梅花的清香。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x717E19FF
		,wp_13 = 0xF8D6B828
		,wp_14 = 100
		}
	ItemData["蛇胆酒"]={
		wp_1 = "用蛇胆泡的美酒，具有药性。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x6607309D
		,wp_13 = 0x67A3D814
		,wp_14 = 100
		}
	ItemData["虎骨酒"]={
		wp_1 = "虎骨泡成的酒，具有药性"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0xCD6FDF37
		,wp_13 = 0x46A54492
		,wp_14 = 100
		}
	ItemData["百味酒"]={
		wp_1 = "泡了上百味药品的药酒"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0x1FA7B36A
		,wp_13 = 0xFFB20F40
		,wp_14 = 100
		}
	ItemData["醉生梦死"]={
		wp_1 = "仙酒，瑶池会的必备佳酿"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0xED576385
		,wp_13 = 0x2B2980FB
		,wp_14 = 100
		--高级烹饪
		}
	ItemData["千金露"]={
		wp_1 = "据异域食谱秘制而成的珍品佳胬。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x884099a7
		,wp_13 = 0x125f2dd0
		,wp_14 = 20000
		}
	ItemData["福灵沙"]={
		wp_1 = "据异域良谱移制而成的珍品佳肴。良用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x8da58e2
		,wp_13 = 0x1c704a0e
		,wp_14 = 20000
		}
	ItemData["五味露"]={
		wp_1 = "据异域食谱移制而成的珍品佳肴。食用后具有神奇"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x5c357f39
		,wp_13 = 0x5f85b7d2
		,wp_14 = 20000
		}
	ItemData["八珍玉液"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x7f51dbb5
		,wp_13 = 0x8a1909b8
		,wp_14 = 20000
		}
	ItemData["神仙饮"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x343860f3
		,wp_13 = 0x812d644d
		,wp_14 = 20000
		}
	ItemData["忠义肉脯"]={
		wp_1 = "据异域食谱秘制而成的珍品佳箐。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x88be1648
		,wp_13 = 0xab4299
		,wp_14 = 20000
		}
	ItemData["同心肉脯"]={
		wp_1 = "据异域良谱秘制而成的珍品佳。食用后具有神奇"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x8119e63
		,wp_13 = 0x712c63ec
		,wp_14 = 20000
		}
	ItemData["百岁香"]={
		wp_1 = "据异域食谱秘制而成的珍品佳箐。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x8b8273b0
		,wp_13 = 0x2f91f37e
		,wp_14 = 20000
		}
	ItemData["玉露羹"]={
		wp_1 = "据异域食谱移制而成的珍品佳肴。食用后具有神奇的效果。非战斗中使用。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x2a67967e
		,wp_13 = 0xaf20f884
		,wp_14 = 20000
		}
	ItemData["红罗羹"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x2a7eec49
		,wp_13 = 0x198296a0
		,wp_14 = 20000
		}
	ItemData["绿芦羹"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 3
		,wp_10 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0xc8a3cd7e
		,wp_13 = 0xeef9cf88
		,wp_14 = 20000
		}
	ItemData["秘制回梦饮"]={
		wp_1 = "异域传来的美味珍懂,服用后有神奇功效。该物品为纯手工制作,有机食品,可自由交易。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x6394740
		,wp_13 = 0x24b6e819
		,wp_14 = 20000
		}
	ItemData["秘制八珍玉液"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "item.wdf"
		,wp_12 = 0x7f51dbb5
		,wp_13 = 0x8a1909b8
		,wp_14 = 20000
		}
	ItemData["秘制红罗羹"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 10000
		,wp_11 = "common/item.wdf"
		,wp_12 = 1928344100
		,wp_13 = 2602015807
		,wp_14 = 20000
		}
	ItemData["秘制绿芦羹"]={
		wp_1 = "据异域食谱秘制而成的珍品佳肴。食用后具有神奇的效果。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_10 = 10000
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xCDDC07C1
		,wp_13 = 0x0B070C18
		,wp_14 = 20000
		}
	ItemData["秘制翡翠豆腐"]={
		wp_1 = "异域传来的美味珍馐，服用后有神奇功效。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_10 = 5000
		,wp_11 = "item.wdf"
		,wp_12 = 299271567
		,wp_13 = 829957946
		,wp_14 = 15000
		}
	ItemData["秘制醉生忘死"]={
		wp_1 = "异域传来的美味珍馐，服用后有神奇功效。"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = 1
		,wp_9 = 5000
		,wp_11 = "item.wdf"
		,wp_12 = 3981927301
		,wp_13 = 724140283
		,wp_14 = 15000
		-- 变身
		}
	ItemData["一级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1241680878
		,wp_13 = 4046019597
		,wp_14 = 10000
		}
	ItemData["二级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBB35E1EE
		,wp_13 = 0xBB35E1EE
		,wp_14 = 10000
		}
	ItemData["三级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xE7FC64D2
		,wp_13 = 0xE7FC64D2
		,wp_14 = 10000
		}
	ItemData["四级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA00740F6
		,wp_13 = 0xA00740F6
		,wp_14 = 10000
		}
	ItemData["五级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x21838782
		,wp_13 = 0x21838782
		,wp_14 = 10000
		}
	ItemData["六级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xF1C84EB5
		,wp_13 = 0xF1C84EB5
		,wp_14 = 10000
		}
	ItemData["七级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xEFA4BA2C
		,wp_13 = 0xEFA4BA2C
		,wp_14 = 10000
		}
	ItemData["八级变身卡"]={
		wp_1 = "可以变化成对应的召唤兽，并附加特殊效果"
		,wp_2 = 12
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2E030271
		,wp_13 = 0x2E030271
		,wp_14 = 10000
		-- 五宝
		}
	ItemData["金刚石"]={
		wp_1 = "最坚硬美丽的宝石，是传说中的五宝之一。"
		,wp_2 = 21
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x517A3AFF
		,wp_13 = 0x797267D4
		}
	ItemData["定魂珠"]={
		wp_1 = "可以用来寻找失散在人间鬼魂的奇妙宝珠，是传说中的五宝之一"
		,wp_2 = 21
		,wp_3 = 3
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x3B83CE08
		,wp_13 = 0x605D073F
		}
	ItemData["避水珠"]={
		wp_1 = "用这件宝物，不熟水性的人也可以去到深海底，是传说中的五宝之一"
		,wp_2 = 21
		,wp_3 = 3
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xAF394F2F
		,wp_13 = 0xAF8B6CC5
		}
	ItemData["夜光珠"]={
		wp_1 = "能在夜里发光的明珠，是传说中的五宝之一。"
		,wp_2 = 21
		,wp_3 = 3
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x4497E508
		,wp_13 = 0x91BB3A47
		}
	ItemData["龙鳞"]={
		wp_1 = "龙族下颚的鳞，愤怒和威力的象征，是传说中的五宝之一。"
		,wp_2 = 21
		,wp_3 = 3
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x1C64382E
		,wp_13 = 0x853BB4DA
		--宝石类
		}
	ItemData["黄宝石"]={
		wp_1 = "闪耀着金色光彩的宝石，代表友情、友爱与希望；传说有着护主的奇效。\n增加4*宝石等级%的雷系法术吸收率\n【镶嵌对象】饰品、鞋子"
		,wp_2 = 12
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2523388870
		,wp_13 = 1932648737
		}
	ItemData["光芒石"]={
		wp_1 = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 1
		,wp_8 = "铠甲、腰带"
		,wp_9 = "提高40点气血上限"
		,wp_11 = "item.wdf"
		,wp_12 = 182374181
		,wp_13 = 1097166752
		}
	ItemData["月亮石"]={
		wp_1 = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 2
		,wp_8 = "铠甲、头盔"
		,wp_9 = "提高12点防御力"
		,wp_11 = "item.wdf"
		,wp_12 = 3488952287
		,wp_13 = 3067278649
		}
	ItemData["太阳石"]={
		wp_1 = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 3
		,wp_8 = "武器、头盔"
		,wp_9 = "提高8点伤害力"
		,wp_11 = "item.wdf"
		,wp_12 = 1387446262
		,wp_13 = 2414382713
		}
	ItemData["宝石"]={
		wp_1 = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 3
		,wp_8 = "武器、头盔"
		,wp_9 = "提高8点伤害力"
		,wp_11 = "item.wdf"
		,wp_12 = 1387446262
		,wp_13 = 2414382713
		}
	ItemData["翡翠石"]={
		wp_1 = "南蛮之地进献之翡翠，是用来合成装备的神奇矿石。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 0
		,wp_8 = "铠甲、饰品"
		,wp_9 = "提高12点法术防御"
		,wp_12 = 3824352456
		,wp_13 = 3517783128
		}
	ItemData["舍利子"]={
		wp_1 = "佛的舍利子是合成装备的神秘材料。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 4
		,wp_8 = "铠甲、饰品"
		,wp_9 = "提高6点灵力"
		,wp_11 = "item.wdf"
		,wp_12 = 2228232000
		,wp_13 = 3414114421
		}
	ItemData["红玛瑙"]={
		wp_1 = "红色的玛瑙石，是合成装备的神秘材料。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 5
		,wp_8 = "武器、头盔"
		,wp_9 = "提高25点命中"
		,wp_11 = "item.wdf"
		,wp_12 = 2783082158
		,wp_13 = 3655137177
		}
	ItemData["黑宝石"]={
		wp_1 = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 6
		,wp_8 = "腰带、鞋子"
		,wp_9 = "提高8点速度"
		,wp_11 = "item.wdf"
		,wp_12 = 4208912380
		,wp_13 = 1963658266
		}
	ItemData["神秘石"]={
		wp_1 = "在民间流传已久的的宝石，来历不详；似乎对外界施与的打击有着一股神秘的抗力。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 7
		,wp_8 = "武器、腰带、鞋子"
		,wp_9 = "提高20点躲避力"
		,wp_11 = "item.wdf"
		,wp_12 = 749980813
		,wp_13 = 3278224394
		}
	ItemData["星辉石"]={
		wp_1 = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 8
		,wp_8 = "武器、腰带、鞋子"
		,wp_9 = "提高20点躲避力"
		,wp_11 = "item.wd1"
		,wp_12 = 0xD2DFDC4D
		,wp_13 = 0x1F2B86DF
		}
	ItemData["精魄灵石"]={
		wp_1 = "通过特殊技巧从原矿提炼而出，可与召唤兽装备进行合成，以提升召唤兽装备的能力"
		,wp_2 ="召唤兽镶嵌"
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xfc91c407
		,wp_13 = 0x6397856f
		}
	--海产类
	ItemData["鱼竿"]={
		wp_1 = "用于垂钓的工具"
		,wp_2 = 10
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2523388870
		,wp_13 = 1932648737
		}
	ItemData["毛蟹"]={
		wp_1 = "常见于近海深水区域，身小壳薄，肉质细嫩而有香味"
		,wp_2 = 10
		,wp_3 = 2
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 602109723
		,wp_13 = 3555868873
		}
	ItemData["河虾"]={
		wp_1 = "生长在河水中的小虾"
		,wp_2 = 10
		,wp_3 = 1
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 1697773646
		,wp_13 = 1542469648
		}
	ItemData["甲鱼"]={
		wp_1 = "两栖爬行动物，有坚硬厚实的甲壳，行动缓慢但寿命比较长"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 174833964
		,wp_13 = 3829834695
		}
	ItemData["海马"]={
		wp_1 = "生活在热带及温带深海，头部弯曲，形状与马头相似"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 2901285604
		,wp_13 = 2563380359
		}
	ItemData["金枪鱼"]={
		wp_1 = "温热带海洋鱼类，身型细长，游速非常快"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 1109845536
		,wp_13 = 3822216681
		}
	ItemData["鲤鱼"]={
		wp_1 = "淡水鱼类，肉质坚实，味道鲜美"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 3865632193
		,wp_13 = 2442761904
		}
	ItemData["河豚"]={
		wp_1 = "肉食鱼类，主要捕食小鱼小虾和贝类，部分内脏有毒，但肉味非常鲜美，是难得的佳肴"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 2328042941
		,wp_13 = 2165741719
		}
	ItemData["娃娃鱼"]={
		wp_1 = "生活在山区的溪流湖泊中，形象可爱"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 2884328689
		,wp_13 = 1455411021
		}
	ItemData["草鱼"]={
		wp_1 = "淡水鱼类，因喜食水草而得名"
		,wp_2 = 10
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3951553868
		,wp_13 = 1888688338
		}
	ItemData["沙丁鱼"]={
		wp_1 = "常见海洋鱼类，身型小巧，行动敏捷，喜好群居于暖水海区"
		,wp_2 = 10
		,wp_3 = 1
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 1219611956
		,wp_13 = 3258862526
		}
	ItemData["大黄鱼"]={
		wp_1 = "常见于近海深水区域，身型修长"
		,wp_2 = 10
		,wp_3 = 2
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 2350785153
		,wp_13 = 2912558181
		}
	ItemData["海星"]={
		wp_1 = "生活在深海，因身型呈五角星状而得名"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 320725587
		,wp_13 = 1259406158
		}
	ItemData["泥鳅"]={
		wp_1 = "常见淡水鱼类，肉质细嫩，味道鲜美"
		,wp_2 = 10
		,wp_3 = 1
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1404739243
		,wp_13 = 2931630332
		}
	ItemData["河蟹"]={
		wp_1 = "体型较大的淡水蟹，常见于深水湖泊之中"
		,wp_2 = 10
		,wp_3 = 2
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 1298631470
		,wp_13 = 3041830860
		}
	ItemData["对虾"]={
		wp_1 = "常栖于沿岸浅海，肉质鲜嫩，营养丰富"
		,wp_2 = 10
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1712326570
		,wp_13 = 2200846910
		}
	ItemData["大闸蟹"]={
		wp_1 = "体型较大的淡水蟹，常见于深水湖泊之中"
		,wp_2 = 10
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2720292819
		,wp_13 = 2971511263
		}
	ItemData["小黄鱼"]={
		wp_1 = "也称黄花鱼，喜欢在近海底层结群活动，是常见的海产鱼类"
		,wp_2 = 10
		,wp_3 = 2
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 3155849929
		,wp_13 = 1939631478
		}
	ItemData["鲫鱼"]={
		wp_1 = "体态雍容,有鱼中君子之称"
		,wp_2 = 10
		,wp_3 = 2
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 392448174
		,wp_13 = 3721203032
		--传音类
		}
	ItemData["鸿雁传书纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xe452ab10
		,wp_13 = 0xf22219a2
		}
	ItemData["财源滚滚纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3194a950
		,wp_13 = 0xe2659840
		}
	ItemData["喜从天降纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xe452ab10
		,wp_13 = 0xf22219a2
		}
	ItemData["忽而今夏纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x7a1cd1fd
		,wp_13 = 0xacef1a24
		}
	ItemData["万丈红尘纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x8b9e70fe
		,wp_13 = 0xf63230c1
		}
	ItemData["金粉世界纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 6
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3194a950
		,wp_13 = 0xe2659840
		}
	ItemData["雪花纷飞纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 7
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x821943c2
		,wp_13 = 0x8e9b1602
		}
	ItemData["浪漫玫瑰纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xcaf6ad2f
		,wp_13 = 0x52bb8ec2
		}
	ItemData["浪漫玫瑰纸鸢"]={ -- 家具
		wp_1 = "神仙遗留下来的秘宝，以无上法力将声音传至千里之外。右键使用将说话内容显示在界面左下角"
		,wp_2 = 143
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xcaf6ad2f
		,wp_13 = 0x52bb8ec2
		--冒泡框类
		}
	ItemData["灿烂葵花"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x8af1df70
		,wp_13 = 0x2d4ec852
		}
	ItemData["冰清玉洁"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x1e2e1e43
		,wp_13 = 0x706b9381
		}
	ItemData["甜蜜葡萄"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x93f56713
		,wp_13 = 0xf2565916
		}
	ItemData["觅缘"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x3b06a859
		,wp_13 = 0x737ab5c6
		}
	ItemData["喜结连理"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xb9e8cc57
		,wp_13 = 0x9b531254
		}
	ItemData["甜甜蜜蜜"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xffa201f4
		,wp_13 = 0x5943a136
		}
	ItemData["泡泡相约"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x3158ca6d
		,wp_13 = 0x84482aa2
		}
	ItemData["秋意浓"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x53bfab4a
		,wp_13 = 0x110cc05d
		}
	ItemData["踏雪寻梅"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x55f56aa
		,wp_13 = 0xbe86d59b
		}
	ItemData["竹下饮"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x78271e77
		,wp_13 = 0x8e7c0a5e
		}
	ItemData["午夜惊魂"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xd22e1433
		,wp_13 = 0x96c0c430
		}
	ItemData["暖暖线球"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xc4c7ff87
		,wp_13 = 0x5ac719c1
		}
	ItemData["云中传音"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xf22180ca
		,wp_13 = 0x2b58bd46
		}
	ItemData["夏日西瓜"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x4858709b
		,wp_13 = 0x423c7d69
		}
	ItemData["鸿雁传情"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x3dcefea6
		,wp_13 = 0x4b1c743
		}
	ItemData["中国结"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xeb8ef380
		,wp_13 = 0x69922009
		}
	ItemData["冰雪天地"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x6949b8ff
		,wp_13 = 0x5997460a
		}
	ItemData["星月童话"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xc090f28d
		,wp_13 = 0x19b3703e
		}
	ItemData["绯色蔷薇"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x90e807a7
		,wp_13 = 0xf1ce4544
		}
	ItemData["荷塘虹影"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xbeb3ad3b
		,wp_13 = 0xbc59cfd5
		}
	ItemData["四叶草"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x951250b2
		,wp_13 = 0xd9c07d45
		}
	ItemData["海洋乐园"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xf95a15
		,wp_13 = 0x96c4ca08
		}
	ItemData["木纹回忆"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xc268eee8
		,wp_13 = 0x7c4d7435
		}
	ItemData["悦动之心"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x3449d74a
		,wp_13 = 0x9eff260e
		}
	ItemData["飞翔之翼"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x13892b93
		,wp_13 = 0x15de1910
		}
	ItemData["花之浪漫"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xf4730c1a
		,wp_13 = 0x38d8ad3d
		}
	ItemData["龙虎斗"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0xc7360f6
		,wp_13 = 0x58388303
		}
	ItemData["吉祥如意"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x4ced68bf
		,wp_13 = 0x91a91d56
		}
	ItemData["糖果"]={
		wp_1 = "当前，队伍频道的发言有特效装饰"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/wzife.wdf"
		,wp_12 = 0x89caa377
		,wp_13 = 0xaa95f67a
		--宝箱类
		}
	ItemData["祈愿宝箱"]={
		wp_1 = "外表华贵的宝箱，蕴含祈愿之力，是迷宫主人的专属宝箱\n【使用】右键点击开始祈愿"
		,wp_2 = 164
		,wp_3 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xaf9d4681
		,wp_13 = 0xd57c766
		}
	ItemData["神秘宝箱"]={
		wp_1 = "神秘的宝箱，上古神仙遗留下来的宝物打开宝箱可随机获得宝箱内的一件物品，打开宝箱需要一把神秘钥匙"
		,wp_2 = 145
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xaf9d4681
		,wp_13 = 0xd57c766
		}
	ItemData["神秘钥匙"]={
		wp_1 = "神秘的宝箱钥匙，可打开上古遗留下来的各类神秘宝箱"
		,wp_2 = 146
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x63ec1458
		,wp_13 = 0x69978a40
		}
	ItemData["铜钥匙"]={
		wp_1 = "铜制钥匙，能打开对应类型的宝箱"
		,wp_2 = 148
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xf5f06b0
		,wp_13 = 0xafddad30
		}
	ItemData["银钥匙"]={
		wp_1 = "银制钥匙，能打开对应类型的宝箱"
		,wp_2 = 148
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x51e52f58
		,wp_13 = 0xd65c5b3d
		}
	ItemData["金钥匙"]={
		wp_1 = "金制钥匙，能打开对应类型的宝箱"
		,wp_2 = 148
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x21ad8898
		,wp_13 = 0x1d70abbd
		}
	ItemData["装备特效宝珠礼包"]={
		wp_1 = "打开能获得10个#G装备特效宝珠\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "kkjn.wdf"
		,wp_12 = 0x9724BCB0      --小
		,wp_13 = 0xFE37E4E0
		}
	ItemData["陨铁礼包"]={
		wp_1 = "打开能获得30个#G陨铁\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
	ItemData["高级宝石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华,随机获得12-16级宝石一枚"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wd1"
		,wp_12 = 0x2B44FFFB --小
		,wp_13 = 0xE21251B9
		}
	ItemData["高级星辉石礼包"]={
		wp_1 = "装着一代珠宝，散发着宝石的光华,随机获得6-10级星辉石一枚"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 830397566 --小
		,wp_13 = 452924612
		}
	ItemData["120灵饰礼包"]={
		wp_1 = "为您量身定制的一套超级简易灵饰礼包\n【等级】120"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
	ItemData["140灵饰礼包"]={
		wp_1 = "为您量身定制的一套超级简易灵饰礼包\n【等级】140"
		,wp_2 = "装备礼包"
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
	ItemData["灵犀玉礼包"]={
		wp_1 = "打开能获得10个三级随机特性的灵犀玉#G\n【使用方式】鼠标右键使用"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 2650955991 --小
		,wp_13 = 2817725067
		}
    ItemData["120灵饰自选-手镯"]={
        wp_1 = "内含一件120级超级简易灵饰手镯，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["140灵饰自选-手镯"]={
        wp_1 = "内含一件140级超级简易灵饰手镯，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["120灵饰自选-戒指"]={
        wp_1 = "内含一件120级超级简易灵饰戒指，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["140灵饰自选-戒指"]={
        wp_1 = "内含一件140级超级简易灵饰戒指，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["120灵饰自选-佩饰"]={
        wp_1 = "内含一件120级超级简易灵饰佩饰，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["140灵饰自选-佩饰"]={
        wp_1 = "内含一件140级超级简易灵饰佩饰，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["120灵饰自选-耳饰"]={
        wp_1 = "内含一件120级超级简易灵饰耳饰，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
    ItemData["140灵饰自选-耳饰"]={
        wp_1 = "内含一件140级超级简易灵饰耳饰，属性自选。"
        ,wp_2 = "装备礼包"
        ,wp_3 = 8
        ,wp_4 = 0
        ,wp_11 = "common/item.wdf"
        ,wp_12 = 0xd6363dd6
        ,wp_13 = 0x5fbab8dc
		}
	-- ItemData["宝石礼盒"]={
	-- 	wp_1 = "打开礼盒可以获得各类15-17级的高级宝石各一颗，（打开前请保证背包内有足够的空位）"
	-- 	,wp_2 = 147
	-- 	,wp_3 = 3
	-- 	,wp_4 = 10001
	-- 	,wp_11 = "common/item.wdf"
	-- 	,wp_12 = 0x317edc7e
	-- 	,wp_13 = 0x1aff14c4
	-- 	}
	-- ItemData["新春翻一番"]={
		-- 	wp_1 = "开年享运，新春翻一番!右键点击新春翻一番大礼包可以获得奖励。"
		-- 	,wp_2 = 160
		-- 	,wp_3 = 1
		-- 	,wp_4 = 1
		-- 	,wp_11 = "item.wd1"
		-- 	,wp_12 = 0xfd5df2c1
		-- 	,wp_13 = 0x445e4462
		-- }
	ItemData["黄铜钥匙"]={
		wp_1 = "打开黄铜宝箱的钥匙"
		,wp_2 = 148
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xf5f06b0
		,wp_13 = 0xafddad30
		}
	ItemData["乌金钥匙"]={
		wp_1 = "打开乌金宝箱的钥匙"
		,wp_2 = 148
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x51e52f58
		,wp_13 = 0xd65c5b3d
		}
	ItemData["赤金钥匙"]={
		wp_1 = "打开赤金宝箱的钥匙"
		,wp_2 = 148
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x21ad8898
		,wp_13 = 0x1d70abbd
		}
	ItemData["神奇钥匙"]={
		wp_1 = "打开神奇宝箱的钥匙"
		,wp_2 = 148
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x21ad8898
		,wp_13 = 0x1d70abbd
		--杂货类
		}
	ItemData["设计图"]={ -- 家具
		wp_1 = "关于家具制作的设计图记载着某种家具的制造方法"
		,wp_2 = 142
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFFD52D59
		,wp_13 = 0xBFF204C7
		}
	ItemData["上古灵符"]={ -- 上交道具
		wp_1 = "神奇的符纸，蕴藏着上古的力量，可交置战神山的巫师处为蚩尤元神增强能力，并有一定几率获得奖励"
		,wp_2 = 151
		,wp_3 = 12
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBB132249
		,wp_13 = 0xFFF82E53
		}
	ItemData["药杵"]={ -- 上交道具
		wp_1 = "可将药引研磨成粉末的工具，有几率失败"
		,wp_2 = 147
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xEEA36768
		,wp_13 = 0x051D5F1D
		}
	ItemData["通缉令"]={ -- 使用道具
		wp_1 = "衙门的通缉令，此令上的人均是罪大恶极之人。"
		,wp_2 = 144
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBE2D4EEC
		,wp_13 = 0x0BDEB087
		}
	ItemData["烧春香"]={ -- 使用道具
		wp_1 = "可令人迷惑混乱的神奇香"
		,wp_2 = 145
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD53DF05D
		,wp_13 = 0xF8AAC750
		}
	ItemData["人参果"]={ -- 使用道具
		wp_1 = "形状似人的仙果，五庄观的宝贝"
		,wp_2 = 146
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x80622951
		,wp_13 = 0x8502F80B
		}
	ItemData["彩虹草"]={ -- 使用道具
		wp_1 = "一种很神奇的草，可用于子女染色"
		,wp_2 = 151
		,wp_3 = 13
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xAAE95E4E
		,wp_13 = 0x2C1693B2
		}
	ItemData["摄妖香"]={
		wp_1 = "人间流行的一种驱逐妖魔的异香，时效为三个时辰"
		,wp_2 = 4
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 3553509277
		,wp_13 = 4033100487
		,wp_14 = 80
		}
	ItemData["乾坤袋"]={
		wp_1 = "一个能装天地万物的乾坤如意袋，在特定战斗中祭起可将对手收入袋中。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xE83A6DBF
		,wp_13 = 0x9A0EA431
		,wp_14 = 80
		}
	ItemData["特赦令牌"]={
		wp_1 = "阎罗地狱里用来宽恕极恶不赦的鬼魂，非常罕见。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x8FF330C0
		,wp_13 = 0xFE72166A
		,wp_14 = 80
		}
	ItemData["空白强化符"]={
		wp_1 = "传说世间中流传着一些神奇的法术，可以点化装备为其附加某种临时属性。而懂得这些法术的人也能将一张空白的强化符进行点化，使其成为有着神奇功效的灵符。"
		,wp_2 = 101
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xCD6B3CDA
		,wp_13 = 0x82CAB6E5
		,wp_14 = 80
		}
	ItemData["强化符"]={
		wp_1 = "神奇的灵符，有着为装备附加临时属性的效果，强化符效果在下线后自行消失"
		,wp_2 = 101
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8FA84829
		,wp_13 = 0x2DFD9D18
		,wp_14 = 80
		}
	ItemData["洞冥草"]={
		wp_1 = "山洞中生长的一种阴暗的小草，可以解除摄妖香效果"
		,wp_2 = 4
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 3286276407
		,wp_13 = 3672031387
		,wp_14 = 80
		}
	ItemData["彩果"]={
		wp_1 = "神奇的果子，可以改变角色的造型"
		,wp_2 = 8
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 567106113
		,wp_13 = 4251752243
		}
	ItemData["天眼通符"]={
		wp_1 = "天界的灵符,具有洞察世界万物象的神奇作用。\n【效果】可以查看到部分任务要求的NPC准确坐标。"
		,wp_2 = 9
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDF37C485
		,wp_13 = 0x7FA4203F
		,wp_14 = 10000
		}
	ItemData["蜡烛"]={ -- 福寿店
		wp_1 = "红色的蜡烛。用以照明和做法事。"
		,wp_2 = 151
		,wp_3 = 14
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xCB791292
		,wp_13 = 0x0D81554B
		}
	ItemData["香"]={ -- 福寿店
		wp_1 = "普通的香,点燃后有异香。"
		,wp_2 = 151
		,wp_3 = 14
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x55877D9A
		,wp_13 = 0x017DD224
		}
	ItemData["黄纸"]={ -- 福寿店
		wp_1 = "祭祀的必备物品。"
		,wp_2 = 151
		,wp_3 = 14
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xB54FE9D7
		,wp_13 = 0x569080C7
		}
	ItemData["牡丹"]={ -- 花卉
		wp_1 = "花中之王,富贵的象征。"
		,wp_2 = 151
		,wp_3 = 15
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFFF1B4CE
		,wp_13 = 0xCFD3A149
		}
	ItemData["桃花"]={ -- 花卉
		wp_1 = "人面桃花相映红,娇艳无比。"
		,wp_2 = 151
		,wp_3 = 15
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x07870048
		,wp_13 = 0xAAB0BA1D
		}
	ItemData["康乃馨"]={ -- 花卉
		wp_1 = "青色的康乃馨,代表着祝福。"
		,wp_2 = 151
		,wp_3 = 15
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x28DA1984
		,wp_13 = 0x960C3163
		}
	ItemData["兰花"]={ -- 花卉
		wp_1 = "兰花象征着高洁,被称为花中隐士。"
		,wp_2 = 151
		,wp_3 = 15
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xF26A689A
		,wp_13 = 0xBEAE27D0
		}
	ItemData["百合"]={ -- 花卉
		wp_1 = "白色的百合,纯洁的象征。"
		,wp_2 = 151
		,wp_3 = 15
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x206394EF
		,wp_13 = 0xCE65E9FA
		}
	ItemData["红玫瑰"]={ -- 花卉
		wp_1 = "火红的玫瑰,爱情的象征。"
		,wp_2 = 151
		,wp_3 = 1
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0x3944ABFA
		,wp_13 = 0x614A5011
		}
	ItemData["飞刀"]={ -- 10暗器
		wp_1 = "曾通的暗器,刀口锋利。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 10
		,wp_11 = "item.wdf"
		,wp_12 = 0xA4C811C5
		,wp_13 = 0x935EC081
		}
	ItemData["飞蝗石"]={ -- 20暗器
		wp_1 = "普通暗器,但如果使用熟了,非常得心应手。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 0x4C07009E
		,wp_13 = 0xBF944057
		}
	ItemData["铁蒺黎"]={ -- 30暗器
		wp_1 = "形状似蒺的铁制暗器。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 30
		,wp_11 = "item.wdf"
		,wp_12 = 0x2851A8EC
		,wp_13 = 0x5D501D52
		}
	ItemData["无影神针"]={ -- 50暗器
		wp_1 = "著名暗器,特点为伤害力较大且极不易防范。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 40
		,wp_11 = "item.wdf"
		,wp_12 = 0x961527F8
		,wp_13 = 0x9E5D7895
		}
	ItemData["孔雀翎"]={ -- 50暗器
		wp_1 = "传说中的暗器,据说伤人例不虚发。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 0xB2657A38
		,wp_13 = 0x454FC9EB
		}
	ItemData["含沙射影"]={ -- 60暗器
		wp_1 = "传说中的暗器,扣动机关,万针齐射,非常难防。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 60
		,wp_11 = "item.wdf"
		,wp_12 = 0xBE43C96E
		,wp_13 = 0xE4366820
		}
	ItemData["回龙镊魂镖"]={ -- 70暗器
		wp_1 = "名暗器,发出时阴风阵阵令人防不胜防。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 70
		,wp_11 = "item.wdf"
		,wp_12 = 0xCD324F8E
		,wp_13 = 0x3EF314E5
		}
	ItemData["寸阴若梦"]={ -- 80暗器
		wp_1 = "来自阴府的暗器,甩出时带动惨惨阴风"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 80
		,wp_11 = "item.wdf"
		,wp_12 = 0xFB2A8F4C
		,wp_13 = 0x57255C54
		}
	ItemData["魔睛子"]={ -- 90暗器
		wp_1 = "魔王妖王所用的邪恶暗器,会自动追踪攻击目标。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 90
		,wp_11 = "item.wdf"
		,wp_12 = 0x82A15466
		,wp_13 = 0x69404DEA
		}
	ItemData["顺逆神针"]={ -- 100暗器
		wp_1 = "此暗器中后不易取出,极为厉害。"
		,wp_2 = 141
		,wp_3 = 1
		,wp_4 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 0xA1716F61
		,wp_13 = 0x7AFB7396
		}
	ItemData["宝宝窝"]={ -- 牧场
		wp_1 = "这是一个小动物最暖的宝宝窝，里面有嗷嗷待哺的小动物正汽带你把它带回家，如果你精心的呵护她他会回报你呦"
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0x695DCCEE
		,wp_13 = 0x47609F3B
		}
	ItemData["珍惜的宝宝窝"]={ -- 牧场
		wp_1 = "这是一个小动物最暖的宝宝窝，里面有嗷嗷待哺的小动物正汽带你把它带回家，如果你精心的呵护她他会回报你呦"
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0xE16282E4
		,wp_13 = 0x47E729F1
		}
	ItemData["饲料"]={ -- 牧场
		wp_1 = "使用特殊材料制作的饲料，喂养给动物时可增加它的体性值。"
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0xFD4B2D5E
		,wp_13 = 0x87997B41
		}
	ItemData["珍贵饲料"]={ -- 牧场
		wp_1 = "使用特殊材料制作的饲料，喂养给变异的动物时可增加它的体性值。"
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0xFD4B2D5E
		,wp_13 = 0x87997B41
		}
	ItemData["祭台"]={ -- 牧场
		wp_1 = "可以保护你的牧场"
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0x19529A58
		,wp_13 = 0xFF65857C
		}
	ItemData["木鱼"]={ -- 乐器
		wp_1 = "古代打击乐器,常用于法事。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x171AE24F
		,wp_13 = 0x6D12F11F
		}
	ItemData["琵琶"]={ -- 乐器
		wp_1 = "古代乐器,普通百姓所喜爱。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xE4D3F15A
		,wp_13 = 0x1E2183D9
		}
	ItemData["编钟"]={ -- 乐器
		wp_1 = "古代乐器,为宫廷和豪门所喜爱。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x26114A21
		,wp_13 = 0x7836B5A5
		}
	ItemData["钹"]={ -- 乐器
		wp_1 = "古代打击乐器,常用于法事。长安乐器店有售"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x2A798918
		,wp_13 = 0x3CCB26E8
		}
	ItemData["萧"]={ -- 乐器
		wp_1 = "古代吹奏乐器,声音悠长。长安乐器店有售。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x3BAD5575
		,wp_13 = 0x6B2746E7
		}
	ItemData["竖琴"]={ -- 乐器
		wp_1 = "古代弹奏乐器,声音悦耳。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0xAC00E345
		,wp_13 = 0x699C657A
		}
	ItemData["唢呐"]={ -- 乐器
		wp_1 = "古代乐器,普通百姓所喜爱。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 7
		,wp_11 = "item.wdf"
		,wp_12 = 0x80310385
		,wp_13 = 0xB5758271
		}
	ItemData["笛子"]={ -- 乐器
		wp_1 = "古代乐器,又称横吹。"
		,wp_2 = 151
		,wp_3 = 16
		,wp_4 = 8
		,wp_11 = "item.wdf"
		,wp_12 = 0x11BF355E
		,wp_13 = 0x21135929
		--高级物品
		}
	ItemData["藏宝图"]={
		wp_1 = "一张记着藏宝地点的地图"
		,wp_2 = 7
		,wp_3 = 1
		,wp_4 = 1
		,wp_9 = 0
		,wp_10 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 211127435
		,wp_13 = 1954996989
		}
	ItemData["高级藏宝图"]={
		wp_1 = "一张记着藏宝地点的地图"
		,wp_2 = 7
		,wp_3 = 1
		,wp_4 = 1
		,wp_9 = 0
		,wp_10 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xA3DF3AA3
		,wp_13 = 0x894d37c5
		}
	ItemData["玲珑宝图"]={
		wp_1 = "一张记着藏宝地点的地图"
		,wp_2 = 7
		,wp_3 = 1
		,wp_4 = 1
		,wp_9 = 0
		,wp_10 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0xab0839f2
		,wp_13 = 0xecb7e2ba
		}
	ItemData["心魔宝珠"]={
		wp_1 = "汲取野妖族精华而成，蕴含着无穷魔力的宝珠"
		,wp_2 = 151
		,wp_3 = 19
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1153796395
		,wp_13 = 1350319491
		}
	ItemData["地载阵"]={
		wp_1 = "战国智者鬼谷子所著的兵法兼玄学书籍。"
		,wp_2 = 13
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 4271545734
		,wp_13 = 1264860140
		}
	ItemData["鬼谷子"]={
		wp_1 = "战国智者鬼谷子所著的兵法兼玄学书籍。"
		,wp_2 = 13
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 4271545734
		,wp_13 = 1264860140
		}
	ItemData["九转金丹"]={
		wp_1 = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5A0E9307
		,wp_13 = 0x6EB440C8
		}
	ItemData["高品九转*2"]={
		wp_1 = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5A0E9307
		,wp_13 = 0x6EB440C8
		}
	ItemData["高品九转*4"]={
		wp_1 = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5A0E9307
		,wp_13 = 0x6EB440C8
		}
	ItemData["高品九转*6"]={
		wp_1 = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5A0E9307
		,wp_13 = 0x6EB440C8
		}
	ItemData["高品九转*5"]={
		wp_1 = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5A0E9307
		,wp_13 = 0x6EB440C8
		}
	ItemData["修炼果"]={
		wp_1 = "具有灵气的果子，为修炼之士所常用。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x19CEE771 --小 0x5A0E9307
		,wp_13 = 0x0F2E3E3F --大 0x62EB440C8
		}
	ItemData["修炼果*4"]={
		wp_1 = "具有灵气的果子，为修炼之士所常用。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x19CEE771 --小 0x5A0E9307
		,wp_13 = 0x0F2E3E3F --大 0x62EB440C8
		}
	ItemData["修炼果*6"]={
		wp_1 = "具有灵气的果子，为修炼之士所常用。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x19CEE771 --小 0x5A0E9307
		,wp_13 = 0x0F2E3E3F --大 0x62EB440C8
		}
	ItemData["修炼果*5"]={
		wp_1 = "具有灵气的果子，为修炼之士所常用。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x19CEE771 --小 0x5A0E9307
		,wp_13 = 0x0F2E3E3F --大 0x62EB440C8
		}
	ItemData["三界悬赏令"]={
		wp_1 = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x45BDA0CD --小 0x5A0E9307
		,wp_13 = 0x7231709D --大 0x62EB440C8
		}
	ItemData["金鸦火羽（高级）"]={
		wp_1 = "内含浓厚的金乌之力,仅仅根就可以提供足够的力量用于使用化圣技能。但由于羽毛外部的火温度极高,不小心保管可能会不小心烧坏背包"
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "common/item.wdf"
		,wp_12 = 129260811
		,wp_13 = 4262587751
		}
	ItemData["神兵图鉴"]={
		wp_1 ="征战沙场的大唐弟子所撰写的书册，记载着天下武器和铠甲的鉴定心法。"
		,wp_2 = 111
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA523F956
		,wp_13 = 0x4FB63423
		}
	ItemData["灵宝图鉴"]={
		wp_1 ="颜如玉呕心沥血所写下的书册，记录着灵饰的鉴定心法。"
		,wp_2 = 111
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA80AC05A
		,wp_13 = 0xF316C979
		}
	ItemData["灵饰图鉴"]={
		wp_1 ="来自地府的灵宝，记载着一些装备的鉴定心法。"
		,wp_2 = 111
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x91D53565
		,wp_13 = 0x9B651FF7
		}
	ItemData["怪物卡片"]={
		wp_1 = "一张记载着某种怪物造型的神奇卡片，使用后可以变化身形"
		,wp_2 = 30
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2E030271
		,wp_13 = 0x2E030271
		}
	ItemData["随机怪物卡片"]={
		wp_1 = "一张记载着某种怪物造型的神奇卡片，使用后可以变化身形"
		,wp_2 = 31
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2E030271
		,wp_13 = 0x2E030271
		}
	ItemData["金银锦盒"]={
		wp_1 = "上缴(快捷键Alt+G)给帮派的白虎堂总管,可获得5点帮贡,并且增加50000两帮派储备金。"
		,wp_2 = 100
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA8BB247D
		,wp_13 = 0xF1AB952C

		}
	ItemData["树苗"]={
		wp_1 ="在特定的地方种下，可能有意想不到的收获。"
		,wp_2 = 102
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2D1399E3
		,wp_13 = 0x82254575
		}

	ItemData["圣兽丹"]={
		wp_1 = "与特定召唤兽炼妖合成，将内丹上古圣兽之态与召唤兽融合，合成出该召唤兽的饰品，饰品能增加新的形态装饰效果。\n【说明】炼妖过程中使用的召唤兽会被消耗。"
		,wp_2 = 681
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8029B90A
		,wp_13 = 0x80237D0F
		,wp_14 = 80
		}
	ItemData["召唤兽内丹"]={
		wp_1 = "上古魔兽遗留下来的精气经万年而成的高级内丹，可供你的召唤兽学习。"
		,wp_2 = 203
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x722F3F52
		,wp_13 = 0x46D073B2
		}
	ItemData["高级召唤兽内丹"]={
		wp_1 = "上古魔兽遗留下来的精气经万年而成的高级内丹，可供你的召唤兽学习。"
		,wp_2 = 203
		,wp_3 = 1
		,wp_4 = 1
		,wp_7 = "提升召唤兽伤害力与速度，提升效果受召唤兽自身等级影响。"
		,wp_11 = "item.wdf"
		,wp_12 = 0x02A776DE
		,wp_13 = 0x4E43EBFF
		}
	ItemData["水晶糕"]={
		wp_1 = "晶莹剔透的水晶糕，上面浇上满满的糖桂花，甜味渗入糕点层次分明，简直美味呀！"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可使对应召唤兽在本周内多食用一个元宵"
		,wp_11 = "common/item.wdf"
		,wp_12 = 1969094585
		,wp_13 = 2354504915
		}
	ItemData["糖桂花"]={
		wp_1 = "一勺糖桂花，甜到心里头。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "和6种不同的元宵各一个可以在百兽王处兑换1个水晶糕"
		,wp_11 = "common/item.wdf"
		,wp_12 = 304092183
		,wp_13 = 634352296
		}
	ItemData["桂花酒酿元宵"]={
		wp_1 = "在传统元宵中加入酒酿，配以桂花作馅，口感清甜香味浓郁，是江浙地区有名的特色小吃。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可提高一定的防御资质"
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["芝麻沁香元宵"]={
		wp_1 = "香软的糯米做成的元宵，用芝麻粉拌以糖料做馅入口松软香甜，是元宵佳节的特色美食。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可提高一定的攻击资质"
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["细磨豆沙元宵"]={
		wp_1 = "馅料采用饱满赤豆煮熟磨细而成，其特点是形美味甘，豆香宜人，食后令人赞不绝口。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可提高一定的速度资质"
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["蜜糖腰果元宵"]={
		wp_1 = "入口松软鲜甜，味香浓郁，有着天然腰果的甘香，食后神清爽，回味无穷。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可提高一定的躲避资质"
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["山楂拔丝元宵"]={
		wp_1 = "青红丝拌以山楂、瓜仁作馅，元宵炸至金黄后入锅与糖稀拔丝，造型别致，宛如金珠缠丝，别有情趣。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可提高一定的体力资质"
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["滑玉莲蓉元宵"]={
		wp_1 = "特色糯米精制而成，采用润滑清甜的莲蓉作主馅料，质地藁韧，口味清爽，是不可多得的节白美食。"
		,wp_2 = 1
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "召唤兽食用，可提高一定的法力资质"
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["如意丹"]={
		wp_1 ="女娲补天时所用五彩石,残留在人间的碎屑，吸取万年日月精华，逐渐成型的一种丹石淡紫色圆形光珠质软，上有条形纹理，时不时还散发着若有若无的气味。可重置召唤兽的潜力点"
		,wp_2 = 109
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B910BEF
		,wp_13 = 0x2D3FDF9
		}
	ItemData["神兽涎"]={
		wp_1 ="源自神兽同感极致之时的珍惜涎液，内含纯净的生命能量。" --150W 5~6
		,wp_2 = 110
		,wp_3 = 1
		,wp_4 = 1
		,wp_7 = {"【用途】在长安城云来酒店可用于制作仙露丸子"}
		,wp_11 = "wzcf.npk"
		,wp_12 = "神兽涎小"--0x00FB2F4A
		,wp_13 = "神兽涎大"--0x00F95A15
		}
	ItemData["仙露小丸子"]={
		wp_1 ="嫦娥严选，玉兔手作，月宫驰名。一口尽享清甜！是超级神柚钟爱的甜品。" --15W 20~30？
		,wp_2 = 110
		,wp_3 = 2
		,wp_4 = 1
		,wp_7 = {"【用途】在长安城云来酒店可用于制作仙露丸子"}
		,wp_11 = "wzcf.npk"
		,wp_12 = "仙露小丸子小"--0x00FFE220
		,wp_13 = "仙露小丸子大"--0x00FB291A
		}
	ItemData["仙露丸子"]={
		wp_1 ="嫦娥严选，玉兔手作，月宫驰名。一口尽享清甜！是超级神柚钟爱的甜品。" --15W 20~30？
		,wp_2 = 110
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"【用途】交给长安城(0,0)超级神柚，可用于赐福召唤兽"}
		,wp_11 = "wzcf.npk"
		,wp_12 = "仙露丸子小"--0x0A1F51BF --小
		,wp_13 = "仙露丸子大"--0x0A0B2531 --大
		}
	ItemData["点化石"]={
		wp_1 = "吸附石在成功吸取召唤兽身上的特殊能力后转变而成的打造材料，与召唤兽装备合成后即可成为套装之一。"
		,wp_2 = 5
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFBFCFCF2
		,wp_13 = 0x1FB5F6AD
		}
	ItemData["魔兽要诀"]={
		wp_1 = "记载着上古魔兽特技，可供你的召唤兽学习。"
		,wp_2 = 3
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1241924823
		,wp_13 = 2950829831
		}
	ItemData["高级魔兽要诀"]={
		wp_1 = "记载着上古魔兽特技，可供你的召唤兽学习。"
		,wp_2 = 3
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x6cad36e8
		,wp_13 = 0xd86d89b8
		}
    ItemData["超级魔兽要诀"]={
		wp_1 = "记载着上古魔兽特技，可供你的召唤兽学习。"
		,wp_2 = 3
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x30BB01D5
		,wp_13 = 0x33077071
		}
    ItemData["特殊魔兽要诀"]={
		wp_1 = "记载着上古魔兽特技，可供你的召唤兽学习。"
		,wp_2 = 3
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x04694A50
		,wp_13 = 0xC3A8BEA9
		}
	ItemData["金柳露"]={
		wp_1 = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品#Y/(仅可作用于参战等级≤85级的召唤兽身上)"
		,wp_2 = 3
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 2911364506
		,wp_13 = 1443777343
		}
	ItemData["超级金柳露"]={
		wp_1 = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。"
		,wp_2 = 3
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 1572601177
		,wp_13 = 2703428501
		}
	ItemData["玄灵珠·回春"]={
		wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“召唤”效果"
		,wp_2 = 199
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "XWD.wdf"
		,wp_12 = 0xF0F80A47c
		,wp_13 = 0x4A9F710F
		}
	ItemData["玄灵珠·破军"]={
		wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“召唤”效果"
		,wp_2 = 199
		,wp_3 = 9
		,wp_4 = 1
		,wp_11 = "XWD.wdf"
		,wp_12 = 0xF0F80A47c
		,wp_13 = 0x4A9F710F
		}
	ItemData["玄灵珠·空灵"]={
		wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“佩戴”效果"
		,wp_2 = 199
		,wp_3 = 6
		,wp_4 = 1
		,wp_11 = "XWD.wdf"
		,wp_12 = 0xF0F80A47c
		,wp_13 = 0x4A9F710F
		}
	ItemData["玄灵珠·噬魂"]={
		wp_1 = "看起来和玄珠灵仙的珠子有些相似，不知道是什么材料制成。可以在坐骑界面镶嵌，获得额外的“佩戴”效果"
		,wp_2 = 199
		,wp_3 = 7
		,wp_4 = 1
		,wp_11 = "XWD.wdf"
		,wp_12 = 0xF0F80A47c
		,wp_13 = 0x4A9F710F
		}
	ItemData["净瓶玉露"]={
		wp_1 = "来自南海珞珈山的仙水:拥有神奇的效果:可以将变异召唤兽便成为0级。"
		,wp_2 = 3
		,wp_3 = 2
		,wp_4 = 2
		,wp_8 = "【效果】将参战等级<95级的变算召唤兽囊为0级。"
		,wp_11 = "item.wd1"
		,wp_12 = 0xb96f5c00
		,wp_13 = 0x8fd5c6ab
		}
	ItemData["超级净瓶玉露"]={
		wp_1 = "来自南海珞珈山的仙水:拥有神奇的效果:可以将变异召唤兽便成为0级。"
		,wp_2 = 3
		,wp_3 = 2
		,wp_4 = 3
		,wp_8 = "【效果】将参战等级≥95级的变算召唤兽囊为0级。"
		,wp_11 ="item.wd1"
		,wp_12 = 0x249ea067
		,wp_13 = 0x24b1d99c
		}
	ItemData["灵丹"]={
		wp_1 = "召唤兽的道具，能够唤醒召唤兽体内的潜力，突破界限，进阶后的召唤兽可以增加一定的资质和成长，并额外获得30潜力点"
		,wp_2 = 3
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xE41F5356
		,wp_13 = 0x5B75710B
		}
	ItemData["吸附石"]={
		wp_1 ="精铁铸造的装备中分解而出的特殊材料，与召唤兽进行炼妖会有一定几率获取召唤兽身上的特殊能力。"
		,wp_2 = 3
		,wp_3 = 4
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x4C07009E
		,wp_13 = 0xBF944057
		}
	ItemData["会员票"]={
		wp_1 = "开启可获得一张月卡及挂机功能"
		,wp_2 = "银票"
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "common/item.wdf"
		,wp_12 = 2778675438
		,wp_13 = 1844496031
		}
	ItemData["特殊兽诀·碎片"]={
		wp_1 = "外形很像某种兽诀，上面依稀记载着上古魔兽特技。\n#Y【特别说明】获得50个碎片后，右键可以进行合成。"
		,wp_2 = 3
		,wp_3 = 99
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1241924823   --小
		,wp_13 = 2950829831
		}
	ItemData["超级兽诀·碎片"]={   --新加
		wp_1 = "被封印的超级兽诀。\n#Y【特别说明】获得99个碎片后，右键可以进行合成。"
		,wp_2 = 3
		,wp_3 = 99
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x30BB01D5
		,wp_13 = 0x33077071
		}
	ItemData["特殊兽诀礼盒"]={
		wp_1 = "右键使用可以获得随机一本特殊兽诀"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wd1"
		,wp_12 = 0xC8858A83       --小
		,wp_13 = 0xD305AB81
		}
	ItemData["稀有兽诀礼盒"]={
		wp_1 = "右键使用可以随机获得观照万象,扶摇万里,乘胜追击,凭风借力,流沙轻音,虎虎生风，超级神柚复生，柳暗花明,气贯长虹,义薄云天,与生俱来的一本"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "kkjn.wdf"
		,wp_12 = 0x00000037        --小
		,wp_13 = 0x00000038
		}
	ItemData["神兜兜礼包"]={
		wp_1 = "右键使用可以随机获得2-5个神兜兜"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x9D18052B         --小
		,wp_13 = 0x012BAF1D
		}
	ItemData["修炼果礼包"]={
		wp_1 = "右键使用可以随机获得2-5个修炼果"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xFC9B9B95        --小
		,wp_13 = 0xD3BAD3DB
		}
	ItemData["超级鲲鹏礼盒（物理）"]={
		wp_1 = "右键使用可以获得超级鲲鹏物理一只"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x331341CF  --小
		,wp_13 = 0x94FFDE01
		}
	ItemData["超级鲲鹏礼盒（法术）"]={
		wp_1 = "右键使用可以获得超级鲲鹏法一只"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x16D49102   --小
		,wp_13 = 0x4BBC2FC7
		}
	ItemData["定制宠礼盒（法术）"]={
		wp_1 = "右键使用可以获得十技能超级BB一只"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "火影1.wdf"
		,wp_12 = 0xC10211  --小
		,wp_13 = 0xC10211
		}
	ItemData["定制宠礼盒（物理）"]={
		wp_1 = "右键使用可以获得十技能超级BB一只"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "火影1.wdf"
		,wp_12 = 0xC10225   --小
		,wp_13 = 0xC10225
		}
	ItemData["超级兽诀礼盒"]={
		wp_1 = "右键使用可以获得随机一种超级魔兽要诀"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "nvdi1.wdf"
		,wp_12 = 0xCBE18B4D          --小
		,wp_13 = 0x7C7BBC9C
		}

    ItemData["召唤兽礼包"]={
        wp_1 = "右键使用可以获得一只召唤兽"
        ,wp_2 = 1
        ,wp_3 = 11
        ,wp_4 = 0
        ,wp_8 = 3
        ,wp_11 = "nvdi1.wdf"
        ,wp_12 = 0xCBE18B4D          --小
        ,wp_13 = 0x7C7BBC9C
        }




	ItemData["月华露"]={
		wp_1 = "昆仑山顶采集的皓月光华，是增加修为的仙露。由于月有阴晴圆缺，所以不同时间采集的光华效果也不尽相同。"
		,wp_2 = 1
		,wp_3 = 12
		,wp_4 = 0
		,wp_8 = "增加召唤兽经验=品质*2*服用召唤兽等级"
		,wp_11 = "item.wdf"
		,wp_12 = 0x016F4E03
		,wp_13 = 0x026E613B
		}
	ItemData["宠物口粮"]={
		wp_1 = "宠物非常喜欢的食物,可以恢复一定的宠物耐力."
		,wp_2 = 4
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0X73080A8C
		,wp_13 = 0X33BBE002
		,wp_14 = 80
		}
	ItemData["口粮"]={
		wp_1 = "宠物非常喜欢的食物,可以恢复一定的宠物耐力."
		,wp_2 = 4
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0X73080A8C
		,wp_13 = 0X33BBE002
		,wp_14 = 80
		}
	ItemData["高级宠物口粮"]={
		wp_1 = "宠物非常喜欢的食物,可以大量恢复宠物耐力."
		,wp_2 = 4
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0X73080A8C
		,wp_13 = 0XDBB55CC4
		,wp_14 = 80
		}
	ItemData["炼兽丹"]={
		wp_1 ="神奇的丹器,点化后能够将你潜心修炼所得经验纳入丹內让召唤兽内丹领悟到下一级"
		,wp_2 = 110
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 542897860
		,wp_13 = 3410934766
		}
	ItemData["炼兽真经"]={
		wp_1 ="武林秘籍，给召唤兽学习后可以提升成长"
		,wp_2 = 109
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1B4E9E52
		,wp_13 = 0x59A1B6CA
		}
	ItemData["如意丹"]={
		wp_1 ="女娲补天时所用五彩石,残留在人间的碎屑，吸取万年日月精华，逐渐成型的一种丹石淡紫色圆形光珠质软，上有条形纹理，时不时还散发着若有若无的气味。可重置召唤兽的潜力点"
		,wp_2 = 109
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B910BEF
		,wp_13 = 0x2D3FDF9
		}
	ItemData["玉葫灵髓"]={
		wp_1 = "《博物录》之中记载的玄妙丹药，可以将召唤兽已使用的清灵仙露的状态回归原始。"
		,wp_2 = 103
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"【说明】:右键使用"}
		,wp_11 = "item.wd1"
		,wp_12 = 0x3FE08883
		,wp_13 = 0x05104141
		}
	ItemData["易经丹"]={
		wp_1 = "《异兽录》之中记载的奇妙药丸，使用得当可助召唤兽打通筋骨达到形易经之境。"
		,wp_2 = 103
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"【说明】:右键使用"}
		,wp_11 = "item.wd1"
		,wp_12 = 0xD9BBCB07
		,wp_13 = 0x8C34FD39
		}
	ItemData["高级摄灵珠"]={
		wp_1 ="经过千年,吸取仙界灵气汇集而成的神奇宝珠，蕴含着丰富的仙界灵气。根据灵气值的不同，给予坐骑服用增加坐骑的灵气也不相同，当灵气累计到定程度可以增加坐骑的成长值"
		,wp_2 = "可使用"
		,wp_3 = 16
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0x64E29D3F
		,wp_13 = 0xA41661FF
		}
	ItemData["高级清灵仙露"]={
		wp_1 = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
		,wp_2 = 103
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"【说明】:右键使用"}
		,wp_11 = "item.wd1"
		,wp_12 = 0xE0D95C88
		,wp_13 = 0x253B7A83
		}
	ItemData["中级清灵仙露"]={
		wp_1 = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
		,wp_2 = 103
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"【说明】:右键使用"}
		,wp_11 = "item.wd1"
		,wp_12 = 0xFD5F44C0
		,wp_13 = 0xC8F9A4D3
		}
	ItemData["初级清灵仙露"]={
		wp_1 ="由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
		,wp_2 = 103
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"【说明】:右键使用"}
		,wp_11 = "item.wd1"
		,wp_12 = 0x6F4A548E
		,wp_13 = 0x1287E12D
		}
	ItemData["清灵净瓶"]={
		wp_1 ="自上古流传至今的神奇净瓶，注以灵力之后可以汇聚清灵仙露"
		,wp_2 = 102
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xBB62F78D
		,wp_13 = 0x455BD7CF
		--==========法宝材料=====
		}
	ItemData["天蚕丝"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 1003
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x14E761F5
		,wp_13 = 0x4460B6DC
		}
	ItemData["玄龟板"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 1003
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x5623AC23
		,wp_13 = 0x375D214F
		}
	ItemData["阴沉木"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 1003
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD2817A66
		,wp_13 = 0x9331724B
		}
	ItemData["麒麟血"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 1003
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD639DEE5
		,wp_13 = 0xF491B41E
		}
	ItemData["内丹"]={
		wp_1 = "修炼者经过百年甚至千年的修炼在体内以灵气结成的丹丸，是锻造法宝必备的材料。"
		,wp_2 = 1003
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x32AAB711
		,wp_13 = 0x629E3769
		}
	ItemData["金凤羽"]={
		wp_1 = "蜂巢百凤之王金凤凰的羽毛，羽毛上带着不熄的火焰，一片凤羽即可燎原，是锻造法宝的上好材料。"
		,wp_2 = 1003
		,wp_3 = 6
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDD59C419
		,wp_13 = 0x6060D273
		}
	ItemData["补天石"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 1003
		,wp_3 = 7
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3E7764B4
		,wp_13 = 0xC078A142
		}
	ItemData["龙之筋"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 1003
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x0309AD83
		,wp_13 = 0x0309AD83
		}
	ItemData["天玑九转汤"]={
		wp_1 = "为合成法宝的材料之一"
		,wp_2 = 107
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 148527330
		,wp_13 = 477121038
		}
	ItemData["金砖"]={
		wp_1 = "闪闪发光，可获得大量的银子储备"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x5453A471 --小 0x5A0E9307
		,wp_13 = 0xDDCB73B2 --大 0x62EB440C8
		}
	ItemData["储备"]={
		wp_1 = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x5453A471 --小 0x5A0E9307
		,wp_13 = 0xDDCB73B2 --大 0x62EB440C8
		}
	ItemData["仙丹"]={
		wp_1 = "可获得大量经验"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xF5883F17 --小 0x5A0E9307
		,wp_13 = 0x60F6CDD8 --大 0x62EB440C8
		--精铁制造类
		}
	ItemData["百炼精铁"]={
		wp_1 = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		,wp_2 = 5
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 3971456754
		,wp_13 = 2585045399
		}
	ItemData["制造指南书"]={
		wp_1 = "记载着各种装备武器制造方法的书卷。"
		,wp_2 = 5
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1102456535
		,wp_13 = 3855535092
		}
	ItemData["指南书"]={
		wp_1 = "记载着各种装备武器制造方法的书卷。"
		,wp_2 = 5
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1102456535
		,wp_13 = 3855535092
		}
	ItemData["140百炼精铁"]={
		wp_1 = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		,wp_2 = 5
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 3971456754
		,wp_13 = 2585045399
		}
	ItemData["150百炼精铁"]={
		wp_1 = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		,wp_2 = 5
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 3971456754
		,wp_13 = 2585045399
		}
	ItemData["140制造指南书"]={
		wp_1 = "记载着各种装备武器制造方法的书卷。"
		,wp_2 = 5
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1102456535
		,wp_13 = 3855535092
		}
	ItemData["150制造指南书"]={
		wp_1 = "记载着各种装备武器制造方法的书卷。"
		,wp_2 = 5
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 1102456535
		,wp_13 = 3855535092
		}
	ItemData["140灵饰指南书"]={
		wp_1 = "记载各种灵饰制造方法的古老书卷"
		,wp_2 = 5
		,wp_3 = 20
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0xAEB5E00E
		,wp_13 = 0xD7E29586
		}
	ItemData["160灵饰指南书"]={
		wp_1 = "记载各种灵饰制造方法的古老书卷"
		,wp_2 = 5
		,wp_3 = 20
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0xAEB5E00E
		,wp_13 = 0xD7E29586
		}
	ItemData["160元灵晶石"]={
		wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
		,wp_2 = 5
		,wp_3 = 21
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0x321116AF
		,wp_13 = 0x13A717B5
		}
	ItemData["140元灵晶石"]={
		wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
		,wp_2 = 5
		,wp_3 = 21
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0x321116AF
		,wp_13 = 0x13A717B5
		}
	ItemData["灵饰指南书"]={
		wp_1 = "记载各种灵饰制造方法的古老书卷"
		,wp_2 = 5
		,wp_3 = 20
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0xAEB5E00E
		,wp_13 = 0xD7E29586
		}
	ItemData["元灵晶石"]={
		wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
		,wp_2 = 5
		,wp_3 = 21
		,wp_4 = 0
		,wp_11 = "item.wd1"
		,wp_12 = 0x321116AF
		,wp_13 = 0x13A717B5
		}
	ItemData["炼妖石"]={
		wp_1 = "从仙界散落到人间的“灵”石，拥有强烈的吸附能量的能力。"
		,wp_2 = 3
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 94724302
		,wp_13 = 164529735
		}
	ItemData["上古锻造图策"]={
		wp_1 = "古代的典籍，详细记录了各种护具的锻造方法。"
		,wp_2 = 3
		,wp_3 = 10
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9F6993FA
		,wp_13 = 0xF2379F81
		}
	ItemData["天眼珠"]={
		wp_1 = "吸收了一定的生物潜能，再通过特别的方式将此潜能转化到召唤兽装备上。"
		,wp_2 = 3
		,wp_3 = 11
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD29E5ECE
		,wp_13 = 0x859c0204
		}
	ItemData["三眼天珠"]={
		wp_1 = "吸收了较多的生物潜能，再通过特别的方式将此潜能转化到召唤兽装备上。"
		,wp_2 = 3
		,wp_3 = 11
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3c1e325
		,wp_13 = 0x8aabe686
		}
	ItemData["九眼天珠"]={
		wp_1 = "完全吸收了生物潜能，再通过特别的方式将此潜能转化到召唤兽装备上。"
		,wp_2 = 3
		,wp_3 = 11
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x50e14899
		,wp_13 = 0x4e9b7820
		}
	ItemData["青龙石"]={
		wp_1 = "带有灵气的石头，是强化装备所需的原料之一"
		,wp_2 = 5
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = "装备镶嵌时附加10%气血上限和10%魔法上限"
		,wp_11 = "item.wdf"
		,wp_12 = 2289281503
		,wp_13 = 603616920
		}
	ItemData["强化石"]={
		wp_1 = "带有灵气的石头，是强化装备所需的原料之一"
		,wp_2 = 5
		,wp_3 = 4
		,wp_4 = 2
		,wp_5 = "装备镶嵌时附加5%伤害"
		,wp_11 = "item.wdf"
		,wp_12 = 2867857574
		,wp_13 = 1492919136
		}
	ItemData["白虎石"]={
		wp_1 = "带有灵气的石头，是强化装备所需的原料之一"
		,wp_2 = 5
		,wp_3 = 4
		,wp_4 = 2
		,wp_5 = "装备镶嵌时附加5%伤害"
		,wp_11 = "item.wdf"
		,wp_12 = 2867857574
		,wp_13 = 1492919136
		}
	ItemData["朱雀石"]={
		wp_1 = "带有灵气的石头，是强化装备所需的原料之一"
		,wp_2 = 5
		,wp_3 = 4
		,wp_4 = 3
		,wp_5 = "装备镶嵌时附加5%灵力"
		,wp_11 = "item.wdf"
		,wp_12 = 650195920
		,wp_13 = 3642232128
		}
	ItemData["玄武石"]={
		wp_1 = "带有灵气的石头，是强化装备所需的原料之一"
		,wp_2 = 5
		,wp_3 = 4
		,wp_4 = 4
		,wp_5 = "装备镶嵌时附加5%防御"
		,wp_11 = "item.wdf"
		,wp_12 = 727733710
		,wp_13 = 3146274026
		}
	ItemData["珍珠"]={
		wp_1 = "光彩夺目的珍珠，可镶嵌在武器装备上，恢复装备一定的耐久度，每件装备镶嵌珍珠的数量没有限制，但装备等级高于珍珠等级时无法镶嵌。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 20
		,wp_5 = 160
		,wp_11 = "item.wdf"
		,wp_12 = 0x611926C4
		,wp_13 = 0x58C5D6AC
		}
	ItemData["分解符"]={
		wp_1 = "用于分解装备"
		,wp_2 = 5
		,wp_3 = 22
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xEBA131CF
		,wp_13 = 0xBE268B81
		}
	ItemData["附魔宝珠"]={
		wp_1 = "蕴含天地精华的宝珠，可为一件人物装备随机附加一种特殊效果。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 23
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0x002A5EAF
		,wp_13 = 0x575EE64D
		}
	ItemData["钨金"]={
		wp_1 = "一种十分稀有的矿产，其坚硬的性能受广大铸造师的喜爱，是熔炼装备的主要配料。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 24
		,wp_5 = 160
		,wp_11 = "item.wdf"
		,wp_12 = 0x18EAE6A5
		,wp_13 = 0x248E4364
		}
	ItemData["陨铁"]={
		wp_1 = "一种十分稀有的矿产，其坚硬的性能受广大铸造师的喜爱，打造。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 25
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0xE1E3F845
		,wp_13 = 0x26DC005
		}
	ItemData["精致碎石锤"]={
		wp_1 = "由碎石锤升级而成,精巧美更具有强大的法力。可将装备上的宝石锻造效果全清楚,随机获得一颗与锻造等级相同的宝石"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xBCC5105C
		,wp_13 = 0x64FECF98
		}
	ItemData["巨剑·元身"]={
		wp_1 = "等待被唤醒的洪荒巨剑，与战魄一起锻造为[长息]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xD5E5ADD3
		,wp_13 = 0x43CC0E3B
		}
	ItemData["伞·元身"]={
		wp_1 = "等待被唤醒的风云之伞，与战魄一起锻造成为[晴雪]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xCB5C6EFD
		,wp_13 = 0x47EA4C41
		}
	ItemData["灯笼·元身"]={
		wp_1 = "等待被唤醒的河汉之灯，与战魄一起锻造为[荒尘]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x7AE2641F
		,wp_13 = 0x4DCB3823
		}
	ItemData["长杖·元身"]={
		wp_1 = "等待被唤醒的天地之杖，与战魄一起锻造为[弦月]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3221FB78
		,wp_13 = 0x7023E521
		}
	ItemData["宝珠·元身"]={
		wp_1 = "等待被唤醒的盘古之珠，与战魄一起锻造为[赤明]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xAED3678B
		,wp_13 = 0x9381644E
		}
	ItemData["弓·元身"]={
		wp_1 = "等待被唤醒的射日之弓，与战魄一起锻造为[若木]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xCE170DFA
		,wp_13 = 0x157E1425
		}
	ItemData["扇·元身"]={
		wp_1 = "等待被唤醒的玄冥之扇，与战魄一起锻造为[星瀚]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x6DF2FD31
		,wp_13 = 0x4370EED8
		}
	ItemData["刀·元身"]={
		wp_1 = "等待被唤醒的复仇之刀，与战魄一起锻造为[鸣鸿]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x42313640
		,wp_13 = 0xE8E78B92
		}
	ItemData["剑·元身"]={
		wp_1 = "等待被唤醒的宿敌之剑，与战魄一起锻造为[擒龙]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xAD7B3E5B
		,wp_13 = 0xE0BB9E80
		}
	ItemData["斧·元身"]={
		wp_1 = "等待被唤醒的魔君之斧，与战魄一起锻造为[裂天]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xFBEC3D5B
		,wp_13 = 0xE5709BCF
		}
	ItemData["锤·元身"]={
		wp_1 = "等待被唤醒的盘古龙齿，与战魄一起锻造为[碎寂]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x397D0A2C
		,wp_13 = 0x4A0E1D74
		}
	ItemData["枪·元身"]={
		wp_1 = "等待被唤醒的王者之枪，与战魄一起锻造为[弑皇]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xAA64F92D
		,wp_13 = 0x4A0E1D74
		}
	ItemData["飘带·元身"]={
		wp_1 = "等待被唤醒的九霄澄云，与战魄一起锻造为[九霄]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x4F4AD0CD
		,wp_13 = 0xDF316EF7
		}
	ItemData["魔棒·元身"]={
		wp_1 ="等待被唤醒的混沌异果，与战魄一起锻造为[醍醐]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x8D1F0679
		,wp_13 = 0xAB525F51
		}
	ItemData["双环·元身"]={
		wp_1 ="等待被唤醒的朝夕霞雾，与战魄一起锻造为[朝夕]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x111D93EB
		,wp_13 = 0x7D9D4D19
		}
	ItemData["双剑·元身"]={
		wp_1 = "等待被唤醒的双飞利刃，与战魄一起锻造为[浮犀]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xEB9EDC89
		,wp_13 = 0x5EDAC2DE
		}
	ItemData["长鞭·元身"]={
		wp_1 = "等待被唤醒的九曲月华，与战魄一起锻造为[霜陨]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x94B20072
		,wp_13 = 0x1C30212D
		}
	ItemData["爪刺·元身"]={
		wp_1 = "等待被唤醒的天地离愁，与战魄一起锻造为[离钩]。"--
		,wp_2 = 204
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x0F776C4A
		,wp_13 = 0x9CE1A36C
		}
	ItemData["头盔·元身"]={
		wp_1 = "等待被唤醒的浑天玄火，与战魄一起锻造为[浑天玄火盔]。"--
		,wp_2 = 204
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x764A4001
		,wp_13 = 0x80644D9A
		}
	ItemData["冠冕·元身"]={
		wp_1 = "等待被唤醒的乾元鸣凤，与战魄一起锻造为[乾元鸣凤冕]。"--
		,wp_2 = 204
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xCD93E6F7
		,wp_13 = 0xD97AD016
		}
	ItemData["坚甲·元身"]={
		wp_1 ="等待被唤醒的混元一气，与战魄一起锻造为[混元一气甲]。"--
		,wp_2 = 204
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xD08B5887
		,wp_13 = 0x5FC5E447
		}
	ItemData["纱衣·元身"]={
		wp_1 = "等待被唤醒的鎏金浣月，与战魄一起锻造为[鎏金浣月衣]。"--
		,wp_2 = 204
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x99EDA596
		,wp_13 = 0x4A94E5EC
		}
	ItemData["挂坠·元身"]={
		wp_1 = "等得被唤醒的落霞陨星，与战魄一起锻造为[落霞陨星坠]。"--
		,wp_2 = 204
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x2365F2C0
		,wp_13 = 0xC31B0927
		}
	ItemData["束带·元身"]={
		wp_1 = "等待被唤醒的紫霄云芒，与战魄一起锻造为[紫霄云芒带]。"--
		,wp_2 = 204
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x83D8E526
		,wp_13 = 0xDA79287A
		}
	ItemData["鞋履·元身"]={
		wp_1 = "等待被唤醒的红尘光阴，与战魄一起锻造为[辟尘分光履]。"
		,wp_2 = 204
		,wp_3 = 6
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0x2D4D76E4
		,wp_13 = 0x2E7EEDEF
		}
	ItemData["战魄"]={
		wp_1 = "十二神兵精魄所凝的玄彩战魄，不屈的杀意仍在其间咆哮呐喊，他们誓要铸躯重生，再续与魔气这万年未竟之战，与元身一同锻造则可制作160级装备。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 25
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0xF87C4047
		,wp_13 = 0x54382E1C
		--装备类
		}
	ItemData["凤头钗"]={
		wp_1 = "雕刻着凤头的金钗，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 40
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 1305963475
		,wp_13 = 1323749060
		}
	ItemData["雁翅刀"]={
		wp_1 = "刀背布满粗大的锯齿，上挂银环，铿锵入耳如雁过九天"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 40
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 1719719282
		,wp_13 = 3277123413
		}
	ItemData["骨环"]={
		wp_1 = "骨头围成的项圈，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 35
		,wp_11 = "item.wdf"
		,wp_12 = 1727331457
		,wp_13 = 440555011
		}
	ItemData["面具"]={
		wp_1 = "用皮制的面具，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 20
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1622680174
		,wp_13 = 544766765
		}
	ItemData["勾魂爪"]={
		wp_1 = "状似银勾，夺命勾魂"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 40
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 2945873492
		,wp_13 = 3529952713
		}
	ItemData["铁腕"]={
		wp_1 = "铁做的护腕，可以起到伤害力"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2535965770
		,wp_13 = 1102893761
		}
	ItemData["皮衣"]={
		wp_1 = "用兽皮制的皮衣，防御力较布衣要好的多"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 10
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1569129428
		,wp_13 = 4004133926
		}
	ItemData["双面斧"]={
		wp_1 = "两面均制成半月状锋刃，双面制敌，力猛势强"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 20
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 595341788
		,wp_13 = 917777182
		}
	ItemData["七彩罗刹"]={
		wp_1 = "用各式丝绸编织而成的丝带"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 60
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 4216697314
		,wp_13 = 1196299810
		}
	ItemData["五色飞石"]={
		wp_1 = "仙人炼制的饰品，佩带在身上有极强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 10
		,wp_11 = "item.wdf"
		,wp_12 = 3139664596
		,wp_13 = 374271655
		}
	ItemData["梅花簪子"]={
		wp_1 = "因簪子外端有梅花形状而得名，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 20
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2353187566
		,wp_13 = 3355592593
		}
	ItemData["霓裳羽衣"]={
		wp_1 = "非常美丽的羽衣，可以起到一定的防御作用"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 60
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3005484634
		,wp_13 = 2665296729
		}
	ItemData["龙鳞羽衣"]={
		wp_1 = "用龙鳞制成的羽衣，有相当的防御力"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 30
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 4057563157
		,wp_13 = 2734928170
		}
	ItemData["夜灵珠"]={
		wp_1 = "白日之时看似平平无奇，置于灯火昏昏之处，方有幽光融融。其夜愈深，而光华愈明。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 50
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3855395369
		,wp_13 = 814300484
		}
	ItemData["风月宝链"]={
		wp_1 = "名家制成的精致饰品，佩带在身上有较强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 60
		,wp_11 = "item.wdf"
		,wp_12 = 91099687
		,wp_13 = 1990243519
		}
	ItemData["云龙绸带"]={
		wp_1 = "绸如云彩，龙隐其间"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 50
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 140457428
		,wp_13 = 4041408902
		}
	ItemData["黄金钺"]={
		wp_1 = "以华丽的黄金装饰,使其更加沉重威猛,金光起处血光飞溅"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 50
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 804669659
		,wp_13 = 3468478581
		}
	ItemData["硬木弓"]={
		wp_1 = "柳木头制成的短弓，质轻便携，很适合新手练习使用"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1102238567
		,wp_13 = 322855055
		}
	ItemData["缎带"]={
		wp_1 = "高级丝绸制成的腰带，能起到不错的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 10
		,wp_11 = "item.wdf"
		,wp_12 = 3002795508
		,wp_13 = 4182781118
		}
	ItemData["幽冥鬼爪"]={
		wp_1 = "精钢打造，饰以冥文，透出森森鬼气"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 20
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 473959188
		,wp_13 = 3711514054
		}
	ItemData["五彩裙"]={
		wp_1 = "五彩绵制成的裙子，可以起到一定的防御作用"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 20
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2890413629
		,wp_13 = 3454325495
		}
	ItemData["墨铁拐"]={
		wp_1 = "墨铁打造而成的法杖，冰冷坚硬，似乎含有奇妙的力量。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 30
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 6277753
		,wp_13 = 2738948963
		}
	ItemData["玄铁矛"]={
		wp_1 = "枪头玄铁制成，宽大沉重，可刺可砍，威势不可挡"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 60
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 4108563339
		,wp_13 = 1450072521
		}
	ItemData["腾云杖"]={
		wp_1 = "仙人踏云而至，有着祥云之形的云母石法杖，有着奇妙法力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 60
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 4198430474
		,wp_13 = 1425813651
		}
	ItemData["双弦钺"]={
		wp_1 = "铁杆黝黑，银月如弦，舞动时眩人眼目"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 30
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2083951632
		,wp_13 = 709060887
		}
	ItemData["紫檀弓"]={
		wp_1 = "精致的紫楠木弓箭，云纹雕花流畅雅致。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 20
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1817338084
		,wp_13 = 1474683356
		}
	ItemData["开山斧"]={
		wp_1 = "铁铸的巨大战斧，沉重无比，力大者用以开石裂碑"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 10
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2876225806
		,wp_13 = 511692637
		}
	ItemData["神行靴"]={
		wp_1 = "非常轻便的靴子，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 40
		,wp_11 = "item.wdf"
		,wp_12 = 3963558258
		,wp_13 = 1110999757
		}
	ItemData["风火圈"]={
		wp_1 = "钢制的边缘有似火焰般的刀锋"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 40
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 3696047428
		,wp_13 = 3443374908
		}
	ItemData["幽路引魂"]={
		wp_1 = "通体乌黑，引魂归冥"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 50
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3655607718
		,wp_13 = 496189030
		}
	ItemData["珍宝珠"]={
		wp_1 = "东海海底方能寻得的巨大珍珠，光华缓缓流动，似是凝聚了海底之中游鱼的灵气。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 20
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2649110916
		,wp_13 = 1758505762
		}
	ItemData["青铜短剑"]={
		wp_1 = "青铜制成，上铸有简单的图案纹饰，初学者练习常用"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 1261240304
		,wp_13 = 4201657972
		}
	ItemData["玉钗"]={
		wp_1 = "用玉制成的钗，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 10
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 509457918
		,wp_13 = 3519518702
		}
	ItemData["丝绸长裙"]={
		wp_1 = "用名贵丝绸制成的长裙，女子用，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 10
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 1759000550
		,wp_13 = 451022751
		}
	ItemData["绿靴"]={
		wp_1 = "绿水晶制成的鞋子，防御作用非常的强"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 2631819456
		,wp_13 = 3993409018
		}
	ItemData["布裙"]={
		wp_1 = "普通的布裙，女子用，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2415237558
		,wp_13 = 4137686182
		}
	ItemData["荧光坠子"]={
		wp_1 = "有荧光的宝石，佩带在身上有相当强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 240077184
		,wp_13 = 4212393181
		}
	ItemData["龙凤双剑"]={
		wp_1 = "双剑剑身一刻龙纹一刻凤饰，可同入一鞘"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 20
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 2574377494
		,wp_13 = 2688315512
		}
	ItemData["破甲战锤"]={
		wp_1 = "精钢打造的巨型战锤，上部粗大的尖齿，可破甲裂碑"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 50
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2961406351
		,wp_13 = 2582952463
		}
	ItemData["骷髅吊坠"]={
		wp_1 = "皮绳上吊着一个骷髅，佩带在身上有一定法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 30
		,wp_11 = "item.wdf"
		,wp_12 = 3414243240
		,wp_13 = 3509217536
		}
	ItemData["神火扇"]={
		wp_1 = "扇面用红绸制，此扇动则似神火四起，使敌人心不能宁"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 60
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 1646280508
		,wp_13 = 2148260737
		}
	ItemData["玉如意"]={
		wp_1 = "细长的白玉棒，白玉使魔棒能力得到加强"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 20
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1722461164
		,wp_13 = 4043165218
		}
	ItemData["狼牙双剑"]={
		wp_1 = "剑身向前方密布粗长的狼牙锯齿，令人胆寒长"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 40
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 1830383421
		,wp_13 = 885886005
		}
	ItemData["铁骨扇"]={
		wp_1 = "铁制的扇骨会对敌人造成较大的威胁"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 10
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 290823954
		,wp_13 = 1443372759
		}
	ItemData["玄铁牛角杖"]={
		wp_1 = "用寒铁锻冶的牛角状法杖，尖锐坚硬，闪着寒光，隐含奇妙的法力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 40
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3096649690
		,wp_13 = 1043225710
		}
	ItemData["纶巾"]={
		wp_1 = "真丝织成的白色头巾，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 30
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1730098396
		,wp_13 = 2497291232
		}
	ItemData["玉女发冠"]={
		wp_1 = "仙女常带的头环，有相当强的防御力"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 60
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3770740399
		,wp_13 = 438307144
		}
	ItemData["媚狐头饰"]={
		wp_1 = "狐眼嵌着宝石的狐头帽，魔女们喜爱的头饰"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 50
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 413224440
		,wp_13 = 798712466
		}
	ItemData["折扇"]={
		wp_1 = "普通的纸扇改装而成，可以此练习最基本的使扇方法"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3563784870
		,wp_13 = 817774560
		}
	ItemData["破天宝刀"]={
		wp_1 = "刀光八面，劈风破天"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 50
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 1201880064
		,wp_13 = 3191505206
		}
	ItemData["夜魔弯刀"]={
		wp_1 = "精钢制成的细弯刀，刀背密布细齿，如夜魔之牙。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 20
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 2386679785
		,wp_13 = 2763619781
		}
	ItemData["水晶珠"]={
		wp_1 = "晶莹水晶打磨而成的水晶球，发出微微的光晕。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 10
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 424958581
		,wp_13 = 517101356
		}
	ItemData["皮腕"]={
		wp_1 = "皮布做的护腕，可以起到伤害力"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 15
		,wp_11 = "item.wdf"
		,wp_12 = 862596806
		,wp_13 = 2834822848
		}
	ItemData["骨镯"]={
		wp_1 = "骨头做的护腕，可以起到伤害力"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 35
		,wp_11 = "item.wdf"
		,wp_12 = 1197998449
		,wp_13 = 3679624742
		}
	ItemData["青铜披甲"]={
		wp_1 = "青铜制成的衣服，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 35
		,wp_11 = "item.wdf"
		,wp_12 = 3118973276
		,wp_13 = 1828827555
		}
	ItemData["乌金鬼头镰"]={
		wp_1 = "乌金打造的巨镰，透出森森鬼气，令人不寒而栗"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 60
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1269150805
		,wp_13 = 2315090325
		}
	ItemData["玉树腰带"]={
		wp_1 = "玉树之丝绦制成的腰带，能起到较强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 30
		,wp_11 = "item.wdf"
		,wp_12 = 1806472204
		,wp_13 = 3616026443
		}
	ItemData["镔铁双剑"]={
		wp_1 = "铁制双短剑，轻巧实用"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 10
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 1169767913
		,wp_13 = 2278749441
		}
	ItemData["飞行符"]={
		wp_1 = "一种神奇的符咒，使用后可以穿梭于各大陆之间"
		,wp_2 = 9
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3496860737
		,wp_13 = 2592521580
		,wp_14 = 500
		}
		ItemData["新春飞行符"]={
		wp_1 = "看起来像是平常的飞行符，但效果却不同凡响。\n#Y使用次数：永久"
		,wp_2 = 99
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "ceshi.wdf"
		,wp_12 = 4199546886
		,wp_13 = 4199546885
		,wp_14 = 500
		}
	ItemData["红木杖"]={
		wp_1 = "用上好红木刻成的法杖，十分坚硬，内含一点奇妙的法力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 10
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2519088005
		,wp_13 = 2809977168
		}
	ItemData["蛇骨鞭"]={
		wp_1 = "结似蛇骨，环环相联，抖动时骨节相撞，噼啪作响"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 40
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 2780394861
		,wp_13 = 2403200026
		}
	ItemData["乌金三叉戟"]={
		wp_1 = "玄铁长枪，头部以乌金打造，气势如虹"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 30
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 2487968590
		,wp_13 = 3770180780
		}
	ItemData["金缕羽衣"]={
		wp_1 = "用金丝缝制的羽衣，可以起到一定的防御作用"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 50
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 995989694
		,wp_13 = 4188048378
		}
	ItemData["铁爪"]={
		wp_1 = "镔铁制成的铁爪"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 252413888
		,wp_13 = 3216807428
		}
	ItemData["离情环"]={
		wp_1 = "乌金铁环，通体乌黑，似悠悠离情"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 20
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 2588804470
		,wp_13 = 2925351135
		}
	ItemData["竹编护腕"]={
		wp_1 = "竹子做的护腕，可以起到伤害力"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 1408822181
		,wp_13 = 2157708488
		}
	ItemData["云龙棒"]={
		wp_1 = "棒身九曲，似云龙腾跃"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 40
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1889288915
		,wp_13 = 741134712
		}
	ItemData["墨杆金钩"]={
		wp_1 = "乌金铁杆，枪尖粗大且制有金色的粗大倒钩，威猛无比"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 50
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 1104964498
		,wp_13 = 3076442266
		}
	ItemData["黄铜圈"]={
		wp_1 = "黄铜制的环圈，握手处缚上丝线，是常用的兵器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 8632408
		,wp_13 = 526420633
		}
	ItemData["荆棘环"]={
		wp_1 = "荆棘围成的项圈，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 25
		,wp_11 = "item.wdf"
		,wp_12 = 352928497
		,wp_13 = 2194758983
		}
	ItemData["高速之星"]={
		wp_1 = "神秘的项圈，来历至今无人知晓"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 4175067704
		,wp_13 = 1572566259
		}
	ItemData["钝铁重剑"]={
		wp_1 = "废铁弃疗打造出来的重剑，价格低廉，适宜新手。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 4219998266
		,wp_13 = 3460607829
		}
	ItemData["江湖夜雨"]={
		wp_1 = "流传于中土的奇异饰物，佩带在身上有较强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 40
		,wp_11 = "item.wdf"
		,wp_12 = 3985913426
		,wp_13 = 293361877
		}
	ItemData["白面狼牙"]={
		wp_1 = "白色的神镜片，可束在腰间，能起到较强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 40
		,wp_11 = "item.wdf"
		,wp_12 = 3575831350
		,wp_13 = 3209666649
		}
	ItemData["钢圈"]={
		wp_1 = "皮布围成的项圈，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 15
		,wp_11 = "item.wdf"
		,wp_12 = 1375604814
		,wp_13 = 4041865794
		}
	ItemData["白椴杖"]={
		wp_1 = "用极佳的椴木精心雕凿而成的法杖，杖身光滑，蕴含着奇妙的法力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 20
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1994971958
		,wp_13 = 1336522328
		}
	ItemData["天狼爪"]={
		wp_1 = "天山雪狼之爪，锐利无比"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 10
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3766972932
		,wp_13 = 2543379065
		}
	ItemData["竹编脖环"]={
		wp_1 = "竹子围成的项圈，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 308637008
		,wp_13 = 3243526110
		}
	ItemData["玄冰刺"]={
		wp_1 = "吸玄冰阴寒之气，可以直透骨骸"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 50
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3220766446
		,wp_13 = 1038526054
		}
	ItemData["震天锤"]={
		wp_1 = "寒钢制成的锤头巨大沉重，一击之下威势震天"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 60
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1233600514
		,wp_13 = 3915438961
		}
	ItemData["百折扇"]={
		wp_1 = "采用非常多的扇骨，扇面百折，非常坚固"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 40
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 742792031
		,wp_13 = 972230490
		}
	ItemData["缨络丝带"]={
		wp_1 = "红色的缨络结成的丝带，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 40
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1901332626
		,wp_13 = 1222266422
		}
	ItemData["腰带"]={
		wp_1 = "一条普通的腰带，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 581742663
		,wp_13 = 1978200666
		}
	ItemData["钢甲"]={
		wp_1 = "用精钢制成的铠甲，防御能力较强"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 50
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1672609844
		,wp_13 = 1862358389
		}
	ItemData["宝雕长弓"]={
		wp_1 = "乌木长弓，弓身镌刻之宝雕，栩栩如生，振翅欲飞。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 30
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2253432731
		,wp_13 = 1106872316
		}
	ItemData["金丝魔棒"]={
		wp_1 = "棒身缠以金丝，显得华丽"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 10
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 2190248338
		,wp_13 = 850861563
		}
	ItemData["马靴"]={
		wp_1 = "皮制的马靴，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 3241248586
		,wp_13 = 3542020689
		}
	ItemData["藤圈"]={
		wp_1 = "藤条围成的项圈，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 4170754053
		,wp_13 = 2301647242
		}
	ItemData["侠客履"]={
		wp_1 = "非常强的鞋，速度和防御作用都属上品"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 30
		,wp_11 = "item.wdf"
		,wp_12 = 32184820
		,wp_13 = 558037323
		}
	ItemData["八卦坠"]={
		wp_1 = "以八卦制成的饰物，佩带在身上有较强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 60
		,wp_11 = "item.wdf"
		,wp_12 = 1357232476
		,wp_13 = 3364357037
		}
	ItemData["细木棒"]={
		wp_1 = "看似细小却有不小的威力，可以当作兵器防身"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3647840943
		,wp_13 = 445770073
		}
	ItemData["牛筋鞭"]={
		wp_1 = "以上等牛筋制成，弹性极佳，抽之有破空之声"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 10
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 156247531
		,wp_13 = 2779337532
		}
	ItemData["夜魔披风"]={
		wp_1 = "来自阴间的披风，隐隐透出神秘的幽冥气息"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 60
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2191193414
		,wp_13 = 1388622524
		}
	ItemData["苍魂珠"]={
		wp_1 = "据说珠里附有魂魄，佩带在身上有较强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 30
		,wp_11 = "item.wdf"
		,wp_12 = 4237594230
		,wp_13 = 1893159766
		}
	ItemData["护身符"]={
		wp_1 = "一块护身符，佩带在身上有一定法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2460748358
		,wp_13 = 359787750
		}
	ItemData["刺甲"]={
		wp_1 = "精铁制成的衣服，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 15
		,wp_11 = "item.wdf"
		,wp_12 = 1718680620
		,wp_13 = 360517064
		}
	ItemData["烈焰锤"]={
		wp_1 = "锤面上制造了不少火焰波浪一般的锋刃，可怕的武器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 40
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1937110983
		,wp_13 = 2558099166
		}
	ItemData["锁子甲"]={
		wp_1 = "胸部是铁环，如铁锁加身，防御力相当不错"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 30
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2078226169
		,wp_13 = 2963205363
		}
	ItemData["苗刀"]={
		wp_1 = "苗疆常用的兵器，极细极尖锐"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 10
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 183813784
		,wp_13 = 3883026774
		}
	ItemData["青铜斧"]={
		wp_1 = "以硬木和青铜制造的大斧，是常用的兵器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1194618546
		,wp_13 = 1823715223
		}
	ItemData["麻衣"]={
		wp_1 = "麻布制成的衣服，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 3547852010
		,wp_13 = 276685974
		}
	ItemData["精钢日月圈"]={
		wp_1 = "精钢打造的圆环，外缘锋利"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 10
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 2611939848
		,wp_13 = 523588802
		}
	ItemData["方巾"]={
		wp_1 = "普通人常带的帽子"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 4205295661
		,wp_13 = 266830706
		}
	ItemData["青刚刺"]={
		wp_1 = "寒刚玉所制，坚硬无比，可断金"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 60
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 1950914816
		,wp_13 = 414938796
		}
	ItemData["蛇形月"]={
		wp_1 = "划动时锋刃似盘卷的黑蛇，令人防不胜防"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 60
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 3576968772
		,wp_13 = 2783575959
		}
	ItemData["针腕"]={
		wp_1 = "针做的护腕，可以起到伤害力"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 25
		,wp_11 = "item.wdf"
		,wp_12 = 3248808566
		,wp_13 = 472447855
		}
	ItemData["银腰带"]={
		wp_1 = "银制的腰带，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 3920753159
		,wp_13 = 1636787949
		}
	ItemData["镔铁锤"]={
		wp_1 = "镔铁打造的锤是价廉而常被采用的兵器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 10
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2560759534
		,wp_13 = 2680776140
		}
	ItemData["如意宝珠"]={
		wp_1 = "琅嬛福地生香橼，百年方熟，熟而坠地，化为如意宝珠，鲜明莹洁，祥瑞兆也。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 60
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1237441752
		,wp_13 = 296013680
		}
	ItemData["青龙牙"]={
		wp_1 = "龙牙状的尖刺，可以透入坚固的衣甲"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 30
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3410109601
		,wp_13 = 2844091192
		}
	ItemData["曲柳杖"]={
		wp_1 = "柳木雕凿的法杖，蕴含一点法力，适合新手使用"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 214558735
		,wp_13 = 1713378827
		}
	ItemData["狼牙锤"]={
		wp_1 = "锤面密布狼牙细齿，杀伤力不可小视"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 30
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 575451669
		,wp_13 = 3613953095
		}
	ItemData["莲华珠"]={
		wp_1 = "来自天竺佛国的灵巧宝珠，晶莹圆润，光华四溢，置于水中，可化作轻盈莲花，净水生香。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 40
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 121754786
		,wp_13 = 3809551301
		}
	ItemData["翡翠珠"]={
		wp_1 = "南蛮之地进献之翡翠，经能工巧匠九琢九磨，方成玲珑宝珠，通体翠绿凝碧，触手冰凉，仿似有仙气缭绕。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 30
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3824352456
		,wp_13 = 3517783128
		}
	ItemData["玉腰弯弓"]={
		wp_1 = "柘木宝弓嵌以碧绿美玉，质坚且韧，精准凌厉。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 50
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3397522151
		,wp_13 = 106500071
		}
	ItemData["天香披肩"]={
		wp_1 = "瑶台玉女穿的披肩，有相当的防御力"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 40
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3709034410
		,wp_13 = 3803079314
		}
	ItemData["琉璃珠"]={
		wp_1 = "三色琉璃熔成的宝珠，轻盈剔透，适合新手携带"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2607779407
		,wp_13 = 3954061095
		}
	ItemData["连珠神弓"]={
		wp_1 = "玲珑连珠，发机如电，一发连五，绝无虚矢。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 60
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 4094037333
		,wp_13 = 2641579130
		}
	ItemData["点金棒"]={
		wp_1 = "华丽的蛇形棒，相传作法之人常用其点石成金"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 30
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3187022651
		,wp_13 = 2074779560
		}
	ItemData["錾金宝弓"]={
		wp_1 = "黑檀宝弓，经巧匠之手精雕细錾，华贵不可方物。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 40
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 234218100
		,wp_13 = 706673394
		}
	ItemData["铁胆弓"]={
		wp_1 = "硬木制成的弓箭，背嵌铁条，射程很远。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 10
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1814282557
		,wp_13 = 2181027484
		}
	ItemData["鹰眼法杖"]={
		wp_1 = "孤鹰展翅，划破长空，依照孤鹰之形打造的法杖，蕴含神奇法力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 50
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3849435987
		,wp_13 = 2058809879
		}
	ItemData["金背大砍刀"]={
		wp_1 = "刀身挺直，以黄金镶背，刀道沉猛"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 30
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 1741978907
		,wp_13 = 3104242640
		}
	ItemData["佛光舍利子"]={
		wp_1 = "佛的舍利子具有补充气血、疗伤和起死回生的功效。"
		,wp_2 = 1
		,wp_3 = 2
		,wp_4 = 3
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 529664613
		,wp_13 = 362856580
		,wp_14 = 15000
		}
	ItemData["无极丝"]={
		wp_1 = "天地无极尽收于其间"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 30
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 85830180
		,wp_13 = 4066138115
		}
	ItemData["牛皮靴"]={
		wp_1 = "牛皮缝制的靴子，速度和防御作用都比较强"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 10
		,wp_11 = "item.wdf"
		,wp_12 = 4095390557
		,wp_13 = 2232108129
		}
	ItemData["皮甲"]={
		wp_1 = "皮布制成的衣服，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 1141657141
		,wp_13 = 3835149326
		}
	ItemData["鱼骨双剑"]={
		wp_1 = "剑身似鱼骨，长满倒钩刺"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 50
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 741866499
		,wp_13 = 1761353936
		}
	ItemData["赤炎环"]={
		wp_1 = "环边有锯齿，如太阳之火焰"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 50
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 692700444
		,wp_13 = 609650976
		}
	ItemData["珍珠链"]={
		wp_1 = "一串珍珠，佩带在身上有一定法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 20
		,wp_11 = "item.wdf"
		,wp_12 = 2451318875
		,wp_13 = 4232202616
		}
	ItemData["牛皮鞭"]={
		wp_1 = "用牛皮制的皮鞭，很容易得到的练习用品"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 1637717692
		,wp_13 = 799104265
		}
	ItemData["布帽"]={
		wp_1 = "布制，普通人家使用的头冠"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 10
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2131362658
		,wp_13 = 1813515840
		}
	ItemData["骨排甲"]={
		wp_1 = "骨头制成的衣服，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 25
		,wp_11 = "item.wdf"
		,wp_12 = 1237852263
		,wp_13 = 1956127955
		}
	ItemData["青藤柳叶鞭"]={
		wp_1 = "采深山古藤制成，上缚柳叶刀片，刀光闪动，杀气逼人"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 60
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 962191784
		,wp_13 = 996954971
		}
	ItemData["铁面扇"]={
		wp_1 = "连扇面也用铁片构成，更易格挡，晃动可出声，乱敌耳目"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 30
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3848744867
		,wp_13 = 2633687797
		}
	ItemData["八棱金瓜"]={
		wp_1 = "锤似金瓜，八棱突起，是实用的战锤"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 20
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2288044564
		,wp_13 = 959970229
		}
	ItemData["幻彩银纱"]={
		wp_1 = "上等蚕丝与银丝混织成的纱带"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 10
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 3727411355
		,wp_13 = 1872145487
		}
	ItemData["精钢扇"]={
		wp_1 = "精钢制的扇骨，可以格挡锋利的兵器攻击"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 20
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 742558490
		,wp_13 = 208678969
		}
	ItemData["珍珠头带"]={
		wp_1 = "珍珠结成的头带，非常好看女性饰品，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 30
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3660503604
		,wp_13 = 1074719537
		}
	ItemData["紧身衣"]={
		wp_1 = "紧身的皮衣，非常轻便，有不错的防御力"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 40
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2338366605
		,wp_13 = 4031115015
		}
	ItemData["曲尖枪"]={
		wp_1 = "采用上等合木，枪尖九曲，是常用的兵器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 10
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3971589602
		,wp_13 = 632407849
		}
	ItemData["劈水扇"]={
		wp_1 = "挥舞之下可使狂风止，水断流"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 50
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 1676697803
		,wp_13 = 108510315
		}
	ItemData["狼牙刀"]={
		wp_1 = "精钢打造，刀背密布狼牙锯齿"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 60
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 2655796221
		,wp_13 = 295875160
		}
	ItemData["追星踏月"]={
		wp_1 = "非由于鞋上有云月图案而得名，有不错的防御力"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 60
		,wp_11 = "item.wdf"
		,wp_12 = 1891477910
		,wp_13 = 4017464926
		}
	ItemData["黄金剑"]={
		wp_1 = "真金铸脊，精钢淬锋，其光灿烂夺人眼，魔障远避不及；沉于渭水，可镇河魔。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 50
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 2052074173
		,wp_13 = 1174324866
		}
	ItemData["松木锤"]={
		wp_1 = "松木质轻，制成的锤主要作练习用"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 753815448
		,wp_13 = 3891646017
		}
	ItemData["天蚕丝带"]={
		wp_1 = "以名贵天蚕丝制成，可通生命之灵气"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 40
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 794010110
		,wp_13 = 140768110
		}
	ItemData["金丝彩带"]={
		wp_1 = "金丝与彩缎编成的丝带"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 20
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 3086295697
		,wp_13 = 81211738
		}
	ItemData["红缨枪"]={
		wp_1 = "白腊木制成的枪杆，柔韧有弹性"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3032516444
		,wp_13 = 661869979
		}
	ItemData["琥珀腰链"]={
		wp_1 = "用琥珀制的腰链，能起到较强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 40
		,wp_11 = "item.wdf"
		,wp_12 = 1085821316
		,wp_13 = 4041311819
		}
	ItemData["簪子"]={
		wp_1 = "女孩子们喜欢的簪子，可以起到防御作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 1004476789
		,wp_13 = 2338230752
		}
	ItemData["羊角盔"]={
		wp_1 = "以羊角为装饰的盔，有非常强的防御力"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 50
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 48596533
		,wp_13 = 1115249525
		}
	ItemData["火焰枪"]={
		wp_1 = "以火焰状的精铁代替枪缨，焰缘锋利无比"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 40
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 382126947
		,wp_13 = 2230233436
		}
	ItemData["九宫坠"]={
		wp_1 = "以九宫制成的坠子，佩带在身上有较强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 40
		,wp_11 = "item.wdf"
		,wp_12 = 1591157328
		,wp_13 = 2581108802
		}
	ItemData["柳叶刀"]={
		wp_1 = "形如柳叶的细弯刀"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 1159059801
		,wp_13 = 388221160
		}
	ItemData["竹节双剑"]={
		wp_1 = "精钢制成，剑身似竹节般伸长"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 30
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 1329171010
		,wp_13 = 2218313214
		}
	ItemData["龙泉剑"]={
		wp_1 = "精铁铸造，又以龙泉之水淬制，上刻青龙，其利无比。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 40
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 3230696706
		,wp_13 = 3094355456
		}
	ItemData["双短剑"]={
		wp_1 = "青铜制的双短剑，制造简单，是练习常用的兵器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 3212246691
		,wp_13 = 1334943898
		}
	ItemData["布鞋"]={
		wp_1 = "布缝制的鞋子，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 2418869371
		,wp_13 = 2669010133
		}
	ItemData["赤焰双剑"]={
		wp_1 = "剑身赤红，齿如焰苗窜动，有一股刚烈之势"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 60
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 1459131170
		,wp_13 = 1669329241
		}
	ItemData["青锋剑"]={
		wp_1 = "剑长三尺，用起来方便灵活，是常用的兵器"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 30
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 3995192813
		,wp_13 = 1523776943
		}
	ItemData["五色缎带"]={
		wp_1 = "五色蚕丝织成的彩缎"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 964324271
		,wp_13 = 359839285
		}
	ItemData["精钢禅钺"]={
		wp_1 = "精钢打造，环随舞动，铿锵入耳，震人心魄"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 40
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 4268709342
		,wp_13 = 1201979768
		}
	ItemData["玉竹金铃"]={
		wp_1 = "由玉制的竹节联结而成,节间缚着金铃,铃随鞭动,声声悦耳"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 50
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 462481146
		,wp_13 = 478344459
		}
	ItemData["金刺轮"]={
		wp_1 = "由多片精铁打造的极薄的锋刃组成，刃口白光闪闪"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 30
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 1780092674
		,wp_13 = 2925351135
		}
	ItemData["游龙剑"]={
		wp_1 = "剑体九曲如龙形，覆鳞片，手弹其锋刃，鸣如龙吟。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 60
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 3272689235
		,wp_13 = 2801949288
		}
	ItemData["钢结鞭"]={
		wp_1 = "以细钢环联结起一个个钢条，柔中带刚"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 30
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 3232417863
		,wp_13 = 2274385367
		}
	ItemData["满天星"]={
		wp_1 = "棒头细密的镶嵌了无数宝石，闪闪发光，似满天星辰"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 60
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3427188370
		,wp_13 = 1777161115
		}
	ItemData["吴越剑"]={
		wp_1 = "吴越之地产名剑，极其锐利"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 20
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 2309179882
		,wp_13 = 118455348
		}
	ItemData["锯齿矛"]={
		wp_1 = "枪尖三陷三突，枪杆红绸缠绕，彩缨闪动令人眼花瞭乱"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 20
		,wp_7 = {"神天兵","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 2315151120
		,wp_13 = 1069998337
		}
	ItemData["布衣"]={
		wp_1 = "普通的布衣，可以起到防御的作用"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2686301321
		,wp_13 = 2162639125
		}
	ItemData["水晶腰带"]={
		wp_1 = "佩带在腰间的水晶腰带，能起到不错的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 30
		,wp_11 = "item.wdf"
		,wp_12 = 588758831
		,wp_13 = 684918234
		}
	ItemData["乌龙鞭"]={
		wp_1 = "以鲨鱼皮制成，表皮毛糙，极其坚韧"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 20
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 3122588387
		,wp_13 = 3141830232
		}
	ItemData["鳞甲"]={
		wp_1 = "用铁鳞制成的铠甲，有相当的防御力"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 20
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 391851478
		,wp_13 = 2281395560
		}
	ItemData["铁齿剑"]={
		wp_1 = "铁制的短剑，边缘带齿"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 10
		,wp_7 = {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 3620311050
		,wp_13 = 2592140397
		}
	ItemData["水晶帽"]={
		wp_1 = "水晶制成的帽子，因为坚硬，有相当强的防御力"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 60
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 606790429
		,wp_13 = 2525896057
		--高级装备
		}
	ItemData["金蛇信"]={
		wp_1 = "神木制杆，弯曲似蛇形，金枪透甲，腥红双叉似金蛇出信"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 70
		,wp_7  = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3443351294
		,wp_13 = 2134413363
		}
	ItemData["丈八点钢矛"]={
		wp_1 = "通体百精纯钢，如天雷击落、蛟龙出海"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 80
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 853333771
		,wp_13 = 2376999944
		}
	ItemData["暗夜"]={
		wp_1 = "通体乌黑,极细的枪尖无形中直抵咽喉,如暗夜中引魂之手"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 90
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 2297122969
		,wp_13 = 4085619601
		}
	ItemData["梨花"]={
		wp_1 = "锋刃五裂似梨花绽放,粉红的枪缨银白的枪,尽显潇洒风流"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 100
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1491619643
		,wp_13 = 3901170806
		}
	ItemData["霹雳"]={
		wp_1 = "以万古溶岩之火锤炼，枪杆似古树盘结，枪尖似雷霆霹雳"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 100
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1553552793
		,wp_13 = 1828152464
		}
	ItemData["刑天之逆"]={
		wp_1 = "刑天应劫而出，劫分天兵火水土，此即为其应兵劫之武器。形长两丈，刃如月牙，锋似寒星，身雕百龙蟠纹，挥舞直欲搅碎银汉，号为枪中霸君。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 120
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3591831101
		,wp_13 = 3656521229
		}
	ItemData["五虎断魂"]={
		wp_1 = "出如虎奔，刺如虎爪，扫如虎尾，锁如虎噬，声如虎啸；使敌魂断胆破，不战自溃，谓之“五虎断魂”，有枪中王者之气。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 130
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1491403685
		,wp_13 = 1403609878
		}
	ItemData["飞龙在天"]={
		wp_1 = "曾为文殊菩萨降妖密宝，如今幻化为一杆金龙宝枪。此枪掷出可化为飞龙，从万丈高空俯冲而下，撕碎敌人。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 140
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 4100462769
		,wp_13 = 3889305017
		}
	ItemData["天龙破城"]={
		wp_1 = "天外陨石炼九日九夜，雷生地底、天坠神龙，乃成此戟。霸王项羽持之横行当世，睥睨天下，故名“天龙破城”。霸王既殁，佚于乌江，龙衔乃出。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 150
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1375567358
		,wp_13 = 1041126896
		}
	ItemData["弑皇"]={
		wp_1 = "炎黄之战，杀怨之气俱归此兵。黄帝得胜，以此兵祭祀天地，誓曰:若治下三界失靖、四海不宁，则天下之人皆可持此兵取吾之首级！"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 160
		,wp_7 = {"龙太子","神天兵"}
		,wp_11 = "item.wd1"
		,wp_12 = 439395128
		,wp_13 = 127581936
		}
	ItemData["狂魔镰"]={
		wp_1 = "沉于万魔之地，染魔性，映魔心，挥之即魔瘴四起"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 70
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2105378421
		,wp_13 = 1325914922
		}
	ItemData["恶龙之齿"]={
		wp_1 = "寒钢为柄，龙齿为刃，风过龙鸣，摄破敌胆"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 80
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2656260066
		,wp_13 = 2796123546
		}
	ItemData["破魄"]={
		wp_1 = "集艳日与阴月之精华，挥舞如日月同晖，中者形神俱灭"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 90
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 3159282811
		,wp_13 = 4245622670
		}
	ItemData["肃魂"]={
		wp_1 = "吸取无尽黑暗之气，肃清无规、无序、无章之魂"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 100
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 0x2D6D80DE
		,wp_13 = 0x1CE23AB4
		}
	ItemData["无敌"]={
		wp_1 = "斧杆以千年古木之根打造，盘桓虬曲；寒铁锻造的双面巨斧发出魔气逼人的暗光"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 110
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 872395348
		,wp_13 = 3255150154
		}
	ItemData["五丁开山"]={
		wp_1 = "古蜀有五力士奉命凿通群山，见一大蛇尾在洞外，乃曳之出，其身长数十里。惊讶间，山崩，五丁与蛇俱死，化为神斧，执之者有开山之力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 120
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1781160921
		,wp_13 = 354227088
		}
	ItemData["元神禁锢"]={
		wp_1 = "阴司轮转王司过之宝。若有鬼仙犯大恶，即以此物拟其头，吸尽元神，再无转生可能。细看刃缘，可见无数痛苦鬼脸。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 130
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1793469736
		,wp_13 = 3058265679
		}
	ItemData["护法灭魔"]={
		wp_1 = "佛门护法之武器，柄为鲁班所雕吴刚伐桂之枝，斧为老君所炼炉中千年玄铁，上有佛门梵文，妖怪见之退避三舍。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 140
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 3099472859
		,wp_13 = 2571183494
		}
	ItemData["碧血干戚"]={
		wp_1 = "刑天与帝争神，身首异处，碧血零落，干缺戚残；后人冶于一炉乃得神兵。长戚舞处，风云雷动，碧波流转，巨盾透体而出，其鸣呜咽，如英雄泣。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 150
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 3681089967
		,wp_13 = 1076008261
		}
	ItemData["裂天"]={
		wp_1 = "蚩尤随身魔武之一，取大荒四极异兽骨所制，形如巨镰，镰刃淬海皇兽魂，隐然有嘶鸣之声，裂天笞地，割风断雨。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 160
		,wp_7 = {"巨魔王","虎头怪"}
		,wp_11 = "item.wd1"
		,wp_12 = 3711850827
		,wp_13 = 1944978391
		}
	ItemData["北斗七星剑"]={
		wp_1 = "精炼白金之铁铸造，有北斗七星之纹饰"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 70
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 1102206433
		,wp_13 = 2931293335
		}
	ItemData["碧玉剑"]={
		wp_1 = "以寒冰碧玉制成,剑身如竹节,刚硬无比,难得的奇珍之物"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 80
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 3706066988
		,wp_13 = 2167893769
		}
	ItemData["鱼肠"]={
		wp_1 = "上古名剑，细短柔软，可入鱼腹"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 90
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 703624793
		,wp_13 = 3087768505
		}
	ItemData["倚天"]={
		wp_1 = "上古名剑，雾中山神铁所制，剑光如电，切金如泥"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 100
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 1234219918
		,wp_13 = 1100401070
		}
	ItemData["湛卢"]={
		wp_1 = "上古名剑，剑身宽大，湛然如墨，骨锻其脊，血淬其锋，成绝世名剑"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 100
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 1556155532
		,wp_13 = 559555740
		}
	ItemData["魏武青虹"]={
		wp_1 = "通体青亮如玉，长八尺余，可于千里外取人首级，吸血如虹。曾为魏王曹操配剑，后在战乱中失传，如今又重现江湖。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 120
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 1705858659
		,wp_13 = 2821638391
		}
	ItemData["灵犀神剑"]={
		wp_1 = "剑长七寸，有鼻有眼，与主人心有灵犀。常藏于宝葫芦内，主人有令，则出三丈白光扣敌泥丸宫，尽斩仙魔鬼神。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 130
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 2712960569
		,wp_13 = 866429909
		}
	ItemData["四法青云"]={
		wp_1 = "上有符印，分别为地，火，风，水四字。挥舞时天昏地暗，火蛇狂舞，飞沙走石，龙腾海啸。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 140
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 1749029011
		,wp_13 = 1989171435
		}
	ItemData["霜冷九州"]={
		wp_1 = "冰晶雪魄，浑然天成；出则霜华满地，朔风回舞。其气凛冽，砭人肌骨；其意萧条，山川寂寥。乃天下至寒至洁之物，惟赤子心可驭之。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 150
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wdf"
		,wp_12 = 2892720118
		,wp_13 = 1286710645
		}
	ItemData["擒龙"]={
		wp_1 = "上古魔神所铸神兵，可抗八部天龙。型如鱼骨，伸缩随心；刃化千万剑丝，柔如春蚕吐丝，韧如天地经纬。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 160
		,wp_7 =  {"逍遥生","剑侠客","偃无师"}
		,wp_11 = "item.wd1"
		,wp_12 = 1088458361
		,wp_13 = 3004473909
		}
    ItemData["器灵·金蝉"] = {
        wp_1 = "器灵·金蝉\n【功效】为装备附加上金蝉的器灵特性\n#Y/【限制】装备\n#Y/【效果】两件装备均为金蝉时，触发套装效果，具体效果如下\n#G/【两件套】3%防御、速度、气血\n#G/【四件套】6%防御、速度、气血\n#G/【六件套】8%防御、速度、气血"
        , wp_2 = 198
        , wp_3 = 3
        , wp_4 = 2
        , wp_5 = 160
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0xE142454C
        ,wp_13 =0xE058C0DC
    }
    ItemData["器灵·无双"] = {
        wp_1 = "器灵·无双\n【功效】为装备附加上无双的器灵特性\n#Y/【限制】装备\n#Y/【效果】两件装备均为无双时，触发套装效果，具体效果如下\n#G/【两件套】3%伤害、灵力、封印命中等级\n#G/【四件套】6%伤害、灵力、封印命中等级\n#G/【六件套】8%伤害、灵力、封印命中等级"
        , wp_2 = 199
        , wp_3 = 3
        , wp_4 = 2
        , wp_5 = 160
        ,wp_11 = "common/item.wdf"
        ,wp_12 =0xC97D2B11
        ,wp_13 =0xC8389D67
    }
	ItemData["墨玉双剑"]={
		wp_1 = "体采寒冰墨玉所制，暗光流动"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 70
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 3841664619
		,wp_13 = 3428424501
		}
	ItemData["梅花双剑"]={
		wp_1 = "千年古木所制，剑似梅枝"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 80
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 956549407
		,wp_13 = 353661251
		}
	ItemData["阴阳"]={
		wp_1 = "赤阳之铁成阳，玄冰之玉成阴，两仪相生，气韵非凡"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 90
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 2351851050
		,wp_13 = 2463244045
		}
	ItemData["月光双环"]={
		wp_1 = "清明无暇，似映月之光"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 100
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 3562014914
		,wp_13 = 2953019352
		}
	ItemData["灵蛇"]={
		wp_1 = "采千年寒冰碧玉制成，通体碧绿，剑出似灵蛇出洞"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 100
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 3192742770
		,wp_13 = 1950373522
		}
	ItemData["金龙双剪"]={
		wp_1 = "传说乃是一对金龙所化，头并头如剑，尾交尾如股。从半空中呼啸而下，一绞之力无人能挡。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 120
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 2674540671
		,wp_13 = 2242603958
		}
	ItemData["连理双树"]={
		wp_1 = "一对痴情男女坟前精魂所化双树，攀枝连理，象征在世虽不能合枕，来世愿永无分离。以此木为剑，因至情贯其中，也可成绕指柔，也可以断金玉。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 130
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 835871520
		,wp_13 = 1841177480
		}
	ItemData["祖龙对剑"]={
		wp_1 = "三国时蜀帝刘备所用双剑。据说一为白龙所化，一为赤龙所化。白龙乃是秦皇，赤龙乃是汉祖。执之者当有九五之尊。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 140
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 4254611708
		,wp_13 = 3430248664
		}
	ItemData["紫电青霜"]={
		wp_1 = "鸿蒙灵气所钟，诸天精魄所禳。异器天生，一派自然。紫电稚弱，性如婴孩；青霜老沉，俨如兄长。翛忽隐现，捷如流星，啾啾呢喃，紫燕青虬。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 150
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 1921395100
		,wp_13 = 3349222718
		}
	ItemData["浮犀"]={
		wp_1 = "九天玄女以夔牛之角所制双剑，锋锐无双，轻如无物，曾助黄帝擒杀蚩尤。其上书天书密咒，丹血为文，翠莹如碧。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 160
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wd1"
		,wp_12 = 3650328746
		,wp_13 = 2262501629
		}
	ItemData["缚神绫"]={
		wp_1 = "丝带可紧可松，传言可缚神灵"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 70
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 2774766030
		,wp_13 = 316900368
		}
	ItemData["九天仙绫"]={
		wp_1 = "存于九天，吸日月玄灵"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 80
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 812342002
		,wp_13 = 262652275
		}
	ItemData["彩虹"]={
		wp_1 = "以七彩天蚕丝制成，似天边彩虹"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 90
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 1130709640
		,wp_13 = 3920434794
		}
	ItemData["流云"]={
		wp_1 = "流光溢彩，似天边云彩幻生幻灭"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 100
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 1567038678
		,wp_13 = 2712300537
		}
	ItemData["碧波"]={
		wp_1 = "聚海之灵气，碧波起，天地清"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 100
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 3222386953
		,wp_13 = 2391803383
		}
	ItemData["秋水落霞"]={
		wp_1 = "“落霞与孤鹜齐飞，秋水共长天一色。”此带乃天女掬长空之色，染落霞之艳织成。展开绚烂无比，使人俗念顿消，心无点尘。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 120
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 604608093
		,wp_13 = 1182432751
		}
	ItemData["晃金仙绳"]={
		wp_1 = "“此物可随主人意捆住神仙魔怪，令其不能再施展变化之术。且此绳坚韧异常，火烧刀砍不断。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 130
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 730252838
		,wp_13 = 2065742633
		}
	ItemData["此最相思"]={
		wp_1 = "“道是无情却有情，从来最苦是相思。”此物乃太虚幻境警幻仙子敕令还情债之物，一旦缠住，至死方休；虽有金石心，也顿为绕指柔，神仙难逃。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 140
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 1161776179
		,wp_13 = 1438567800
		}
	ItemData["揽月摘星"]={
		wp_1 = "翩若惊鸿，婉若游龙，仿佛兮若轻云之蔽月，飘飖兮若流风之回雪。三垣为画布，此带为软毫，可清夜起舞，拟为漫天星宿平添花鸟虫鱼。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 150
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wdf"
		,wp_12 = 3130490807
		,wp_13 = 1909699944
		}
	ItemData["九霄"]={
		wp_1 = "九霄澄云所凝，诸天护佑，乾坤氤氲。形随意动，其高则冠盖乎九霄，其旷则笼罩乎八隅，祥瑞纷现，异香扑鼻。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 160
		,wp_7 = {"舞天姬","玄彩娥","桃夭夭"}
		,wp_11 = "item.wd1"
		,wp_12 = 3468947580
		,wp_13 = 3104627686
		}
	ItemData["华光刺"]={
		wp_1 = "百炼纯钢打造，华光刺目"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 70
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 1028689229
		,wp_13 = 127658579
		}
	ItemData["龙鳞刺"]={
		wp_1 = "金色似龙鳞的针刺"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 80
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 111030939
		,wp_13 = 1177500748
		}
	ItemData["撕天"]={
		wp_1 = "天如幕，白光起，破九重天"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 90
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3339488013
		,wp_13 = 1471615949
		}
	ItemData["毒牙"]={
		wp_1 = "恐惧，只有经历无尽虚空中袭来的毒牙才知其真意"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 100
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3832046145
		,wp_13 = 3854364995
		}
	ItemData["胭脂"]={
		wp_1 = "血红的颜色，胭脂的香气，将缤纷的灵魂凝结为黑白"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 100
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3460551634
		,wp_13 = 3441823945
		}
	ItemData["九阴勾魂"]={
		wp_1 = "爪有九刺，阴寒冷酷，破颅勾魂，使正道名门闻之色变。为地藏王所得，将要销毁，不知何人盗出，又重现江湖。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 120
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 393789023
		,wp_13 = 3180402786
		}
	ItemData["雪蚕之刺"]={
		wp_1 = "昆仑山雪蚕之毒毛所化，坚硬非常，穿犀牛皮如针穿薄纱，瞬间透入；刺中后使人身中热毒，如在灼热地狱之中。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 130
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 2033558106
		,wp_13 = 712813114
		}
	ItemData["贵霜之牙"]={
		wp_1 = "昆仑山雪蚕之毒毛所化，坚硬非常，穿犀牛皮如针穿薄纱，瞬间透入；刺中后使人身中热毒，如在灼热地狱之中。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 140
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 3540442244
		,wp_13 = 989722994
		}
	ItemData["忘川三途"]={
		wp_1 = "忘川为生死界河，水分三途，缓急不同。此爪凝三途之水，可证罪业，望之似缓，暗流甚疾。伤者不可骤脱，如坠地狱、饿鬼、畜生道。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 150
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wdf"
		,wp_12 = 4114737939
		,wp_13 = 1943604910
		}
	ItemData["离钩"]={
		wp_1 = "鸿蒙初辟，混沌之气混焉；后清浊渐离，有神识之气胶而不舍，亦聚亦离，愁丝千丈，钩绊难舍，岁月风化遂成离钩。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 6
		,wp_5 = 160
		,wp_7 = {"狐美人","骨精灵","鬼潇潇"}
		,wp_11 = "item.wd1"
		,wp_12 = 3368946268
		,wp_13 = 3833664365
		}
	ItemData["阴风扇"]={
		wp_1 = "扇骨采玄冰制，阴风习习，让人不寒而粟"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 70
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 1174967558
		,wp_13 = 466225414
		}
	ItemData["风云雷电"]={
		wp_1 = "气势勇猛的大型折扇，扇开似风云突变，扇出似雷鸣电闪"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 80
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3812625478
		,wp_13 = 876675307
		}
	ItemData["太极"]={
		wp_1 = "包容太极于其内，博采天地之灵气"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 90
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 795792061
		,wp_13 = 2262423432
		}
	ItemData["玉龙"]={
		wp_1 = "白玉制的扇骨，优雅灵巧，似白龙出海"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 100
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3052815805
		,wp_13 = 896644877
		}
	ItemData["秋风"]={
		wp_1 = "一纸折扇，荡平天下事，一缕秋风，吹尽凡尘心"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 100
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 516817499
		,wp_13 = 1806626143
		}
	ItemData["画龙点睛"]={
		wp_1 = "本是一把普通的折扇，只因张僧繇画神龙于上，并点其睛，挥动时则隐有风雷之声、云雨之气，展开更有神龙奔出。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 120
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 848845144
		,wp_13 = 1782681953
		}
	ItemData["秋水人家"]={
		wp_1 = "扇面上所画《秋水人家图》出神入化，栩栩如生；展扇更可进入其中，游山玩水，身临其境。其中定有道家仙法无疑。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 130
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 2332586416
		,wp_13 = 1923582221
		}
	ItemData["逍遥江湖"]={
		wp_1 = "持此扇行走江湖，可预先知晓福祸吉凶。据说是钦天监台正先生袁天罡书奇门妙法于其上，方使此扇有逍遥美名。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 140
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 1361205238
		,wp_13 = 1457973706
		}
	ItemData["浩气长舒"]={
		wp_1 = "持之若登高望远，五湖四海俱在眼前。不以物喜，不以己悲，心旷神怡，宠辱偕忘。感浩然之气至大至刚，以直养而无害，充盈天地。不亦快哉！"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 150
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wdf"
		,wp_12 = 3595165574
		,wp_13 = 2725529530
		}
	ItemData["星瀚"]={
		wp_1 = "三垣中坠，不知其故。展则漫天星辰失色，收则幽渺万籁无声。万顷星瀚，无始无终，无他无我，怎不使人目眩神驰？"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 7
		,wp_5 = 160
		,wp_7 = {"逍遥生","龙太子"}
		,wp_11 = "item.wd1"
		,wp_12 = 2182063168
		,wp_13 = 1649810470
		}
	ItemData["水晶棒"]={
		wp_1 = "通体以水晶制成，棒头镶嵌了纯净的水晶球，灵光闪闪"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 70
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3433794516
		,wp_13 = 1032230318
		}
	ItemData["日月光华"]={
		wp_1 = "棒端有日月神珠，半黑半白，收太极其内，五行其间"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 80
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 1445409930
		,wp_13 = 345311421
		}
	ItemData["沧海"]={
		wp_1 = "静如海之渊深博从，动似海之激荡翻腾"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 90
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3417923595
		,wp_13 = 32733626
		}
	ItemData["红莲"]={
		wp_1 = "碧杆红莲，阅众生相，度众生孽"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 100
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 2931792494
		,wp_13 = 2090478337
		}
	ItemData["盘龙"]={
		wp_1 = "身若九曲盘龙，口吞八卦金珠"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 100
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 2599922092
		,wp_13 = 1006965180
		}
	ItemData["降魔玉杵"]={
		wp_1 = "乃一块绝世好玉雕刻而成，杵头刻有仙家符咒。拿在手中，轻如鸿毛，打在人身，重如泰山。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 120
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 969185484
		,wp_13 = 1480701803
		}
	ItemData["青藤玉树"]={
		wp_1 = "翡翠藤蔓缠绕于碧玉树干之上，红宝石所雕的鲜花正怒放枝头；它是完美的艺术品，更是仙家妙宝、除魔利器。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 130
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 3608519305
		,wp_13 = 1933825756
		}
	ItemData["墨玉骷髅"]={
		wp_1 = "魔棒上镶嵌着一个刻画精美的墨水晶骷髅，流露出神秘的死亡气息，似乎与地府有很深的渊源。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 140
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 758533892
		,wp_13 = 1365535468
		}
	ItemData["丝萝乔木"]={
		wp_1 = "上古仙侣所化，丝萝出尘，花分五色；中为桐木，曾栖彩凤。千秋万载，其情不泯。仙气缠绕，百邪不侵：“醉向丝萝惊自醒，与君清耳听松湍。”"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 150
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wdf"
		,wp_12 = 832692260
		,wp_13 = 18189260
		}
	ItemData["醍醐"]={
		wp_1 = "天地未分时，混沌有异树，亿万年长成，亿万年花开，亿万年结果，果落化为醍醐。持此杖者洞悉天地，与万物同息。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 8
		,wp_5 = 160
		,wp_7 = {"玄彩娥","骨精灵"}
		,wp_11 = "item.wd1"
		,wp_12 = 493750456
		,wp_13 = 3429406352
		}
	ItemData["巨灵神锤"]={
		wp_1 = "巨灵神所用神锤，锤似流星，非凡力可举，可挡十万天兵"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 70
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 4112468633
		,wp_13 = 977830532
		}
	ItemData["天崩地裂"]={
		wp_1 = "静似天柱巍巍，动则天崩地裂"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 80
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 708738253
		,wp_13 = 1573610528
		}
	ItemData["八卦"]={
		wp_1 = "八卦其间，太极天成，天地造化，混沌无常"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 90
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 4244312578
		,wp_13 = 928644092
		}
	ItemData["鬼牙"]={
		wp_1 = "以万炼钢，合猛鬼牙，噬三界"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 100
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 737823355
		,wp_13 = 25218036
		}
	ItemData["雷神"]={
		wp_1 = "一击天地轰鸣，再击电光四起，三击万物俱灰"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 100
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 3048546465
		,wp_13 = 4287755866
		}
	ItemData["混元金锤"]={
		wp_1 = "锤按六道之纹，柄接阴阳之气，持之者自有五行造化，诸天看护。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 120
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1164647107
		,wp_13 = 2379160869
		}
	ItemData["九瓣莲花"]={
		wp_1 = "此锤乃仙池中的一朵婷婷玉莲，花开九瓣，蕊露金蓬。不知被谁采来，炼为兵器。虽已过五百年，依然盛开如新发。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 130
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 2151061457
		,wp_13 = 432377528
		}
	ItemData["鬼王蚀日"]={
		wp_1 = "斩魔王之头为锤，隐隐发出邪气，使日月无光。执此物则将与魔神契约，可拥魔王之力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 140
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 1075077021
		,wp_13 = 3952974465
		}
	ItemData["狂澜碎岳"]={
		wp_1 = "水神共工至宝，内收九曲黄河，出则天地齐喑，奔涛如雷。共工怒触不周山，天柱折地维绝，水潦尘埃俱归东南，双锤亦泯然其中，为黄帝所得。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 150
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wdf"
		,wp_12 = 3300988828
		,wp_13 = 3989323201
		}
	ItemData["碎寂"]={
		wp_1 = "盘古龙齿所化，固若金汤。嘘为风雨，吹为雷电，舞之铿锵如鸣金铁，乃天下至阳至刚之物，邪魔宵小望之丧魂。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 9
		,wp_5 = 160
		,wp_7 = {"神天兵","虎头怪"}
		,wp_11 = "item.wd1"
		,wp_12 = 0xEA5B0F34
		,wp_13 = 0xE977DF0B
		}
	ItemData["雷鸣嗜血鞭"]={
		wp_1 = "管节空洞，银钩闪闪，挥动时隐隐有风雷之音"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 70
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 1854489623
		,wp_13 = 3234780066
		}
	ItemData["混元金钩"]={
		wp_1 = "混元钢索之上缚有金钩，追命勾魂"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 80
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 0x6182C9F2
		,wp_13 = 0x8AB6DF4B
		}
	ItemData["龙筋"]={
		wp_1 = "以恶龙之筋制成，挥舞若龙腾"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 90
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 1054575251
		,wp_13 = 2303382990
		}
	ItemData["百花"]={
		wp_1 = "龙藤塑其筋，百花其上，集仙灵之气，香飘四海"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 100
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 3472315232
		,wp_13 = 1331779470
		}
	ItemData["吹雪"]={
		wp_1 = "鞭上石晶经千年生长，成雪花密布，映日月之光"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 100
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 3293208513
		,wp_13 = 1657462890
		}
	ItemData["游龙惊鸿"]={
		wp_1 = "此鞭舞之矫如游龙，翩若惊鸿，宛如活物。据传是因仙家点化，方有此功效。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 120
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 722618703
		,wp_13 = 3699553560
		}
	ItemData["仙人指路"]={
		wp_1 = "此鞭之奇，在于打斗时会自寻敌之弱点，或攻或守，或点或缠，如仙人指路，变化万端；又如灵蛇狂舞，眼花缭乱。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 130
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 2337416369
		,wp_13 = 3100047545
		}
	ItemData["血之刺藤"]={
		wp_1 = "此鞭遍体生有倒刺，散发黑色邪气。据传打斗之时会如巨蟒缠住敌人，倒刺嵌入敌人体内，吸食其血肉。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 140
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 3451408733
		,wp_13 = 3574831487
		}
	ItemData["牧云清歌"]={
		wp_1 = "此鞭具大神通，持之则神虑清明，可驭使万物。苍穹为牧野，云霞为羔犊，驱鞭行九天，驭风乘云，竞雷逐电。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 150
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wdf"
		,wp_12 = 422685665
		,wp_13 = 4192744388
		}
	ItemData["霜陨"]={
		wp_1 = "昆仑之巅有涧曰冰溪，灿然如银，凝霜聚雪。溪流九曲，矫然若蛟，后凝为软玉长鞭，姑射仙子倚为护身仙器。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 10
		,wp_5 = 160
		,wp_7 = {"英女侠","狐美人"}
		,wp_11 = "item.wd1"
		,wp_12 = 3829142397
		,wp_13 = 522032539
		}
	ItemData["子母双月"]={
		wp_1 = "锋刃似弯月一般交错，可四面制敌"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 70
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 3736409706
		,wp_13 = 1612643041
		}
	ItemData["斜月狼牙"]={
		wp_1 = "青玉制成，锋似狼牙"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 80
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 4116561830
		,wp_13 = 2276604919
		}
	ItemData["如意"]={
		wp_1 = "白玉制成，光滑清丽，如意随心"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 90
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 2711948052
		,wp_13 = 952271091
		}
	ItemData["乾坤"]={
		wp_1 = "集天地乾坤之灵，可制万物"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 100
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 2571022629
		,wp_13 = 338904132
		}
	ItemData["月光"]={
		wp_1 = "清明无暇，似映月之光"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 100
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 3562014914
		,wp_13 = 2953019352
		}
	ItemData["别情离恨"]={
		wp_1 = "乐莫乐兮新相知，悲莫悲兮生别离；此情黯然销魂，永恨伤心。有人制同心永结环象征永不分离，但别离之后把玩，却更加伤感。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 120
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 2437493189
		,wp_13 = 3959090370
		}
	ItemData["金玉双环"]={
		wp_1 = "乐莫乐兮新相知，悲莫悲兮生别离；此情黯然销魂，永恨伤心。有人制同心永结环象征永不分离，但别离之后把玩，却更加伤感。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 130
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 2908362125
		,wp_13 = 1659862730
		}
	ItemData["九天金线"]={
		wp_1 = "此物套在手上，金光闪闪。圈飘金线，声音清越，守中有攻，刚柔并济，使敌人不知所措。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 140
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 1468552095
		,wp_13 = 2047583638
		}
	ItemData["无关风月"]={
		wp_1 = "精玉双环一名“离风”，一名“遮月”，舞之月影憧憧，别愁离绪，俱上心头。诗云：人生自是有情痴，此恨不关风与月。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 150
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wdf"
		,wp_12 = 3036111619
		,wp_13 = 3104854202
		}
	ItemData["朝夕"]={
		wp_1 = "此双环伴日月而生，沐浴光华，吞吐烟云，三清将其置于天穹之上，日夜吸纳诸天亿兆流光，朝夕霞雾源出于此。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 11
		,wp_5 = 160-------------原150
		,wp_7 = {"飞燕女","舞天姬"}
		,wp_11 = "item.wd1"
		,wp_12 = 1379061378
		,wp_13 = 1662428245
		}
	ItemData["龙鳞宝刀"]={
		wp_1 = "百练寒钢打造，以龙鳞装饰，身份的象征"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 70
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 668589754
		,wp_13 = 2944368377
		}
	ItemData["黑炎魔刀"]={
		wp_1 = "刀身透出森森鬼气，有着摄人心魄的魔力"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 80
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 162972978
		,wp_13 = 279098730
		}
	ItemData["冷月"]={
		wp_1 = "夜清冷，月露眉尖，笑引幽冥路"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 90
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 603925505
		,wp_13 = 407135953
		}
	ItemData["屠龙"]={
		wp_1 = "上古神兵，宝刀屠龙"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 100
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 1961749850
		,wp_13 = 155455945
		}
	ItemData["血刃"]={
		wp_1 = "血红的刃，血红的光，以血洗天地"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 100
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 1138002761
		,wp_13 = 3952677662
		}
	ItemData["偃月青龙"]={
		wp_1 = "关公之配刀，青龙化刀柄，刀身如半月，百万军中取上将首级如探囊取物。关公死，刀柄不知去向，唯余此刀身。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 120
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 241494943
		,wp_13 = 2525360226
		}
	ItemData["晓风残月"]={
		wp_1 = "迅如晓风，刃如残月。此非中土大唐之物，乃海外大食国宝刀，其上蛩伏可实现愿望之神明。但如何召唤已不可知。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 130
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 293054687
		,wp_13 = 3069402462
		}
	ItemData["斩妖泣血"]={
		wp_1 = "大唐名匠半生心血所成的宝刀，因其妻子被妖魔所害，故将满腔愤恨倾注于刀中。谁能为他复仇，便以此刀相赠。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 140
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 2680057538
		,wp_13 = 1425981787
		}
	ItemData["业火三灾"]={
		wp_1 = "周身暗红如浴血池，刃裂三线引为三灾，中有赤瞳勾人心火。敌心神既失，十方俱灭，惟余红莲：“汝一念起，业火炽然，非人燔汝，乃汝自燔。”"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 150
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wdf"
		,wp_12 = 2013357951
		,wp_13 = 2366906872
		}
	ItemData["鸣鸿"]={
		wp_1 = "刀长三尺，与轩辕剑同炉而成。黄帝见其刀意过盛，恐反噬刀主，欲以轩辕剑毁之；此刀乃化玄红云鹊，穿霞而逝。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 12
		,wp_5 = 160
		,wp_7 = {"剑侠客","巨魔王"}
		,wp_11 = "item.wd1"
		,wp_12 = 3497244314
		,wp_13 = 3024786057
		}
	ItemData["引魂杖"]={
		wp_1 = "点点萤光，引路幽魂，指引迷途幽魂的法杖，有着强大的法力"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 70
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2962804578
		,wp_13 = 1687273756
		}
	ItemData["碧玺杖"]={
		wp_1 = "碧霞莹莹，玉暖生烟，浑然天成的碧玉法杖，神妙异常"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 80
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 264053858
		,wp_13 = 203186473
		}
	ItemData["业焰"]={
		wp_1 = "取地狱燧石锻冶，燃万年业火之杖。“以业火乾枯，酬其宿债”，业焰之舞，焚尽世间罪孽。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 90
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1824574630
		,wp_13 = 2003240450
		}
	ItemData["钟灵石"]={
		wp_1 = "拥有特性的灵石，可点化灵饰，获得指定类型的特性效果。"
		,wp_2 = 5
		,wp_3 = 6
		,wp_4 = 9
		,wp_8 = "灵饰"
		,wp_9 = "点化"
		,wp_11 = "xiaoshen.npk"
		,wp_12 = "钟灵石小"
		,wp_13 = "钟灵石大"
		}
	ItemData["淬灵石"]={
		wp_1 = "神奇的灵石，可吸取灵饰上已附加的特性。"
		,wp_2 = 82
		,wp_3 = 6
		,wp_4 = 9
		,wp_11 = "沉默.wdf"
		,wp_12 = 0xD0B9CCD5
		,wp_13 = 0xD0B9CCD6
		}
	ItemData["玉辉"]={
		wp_1 = "琉璃玉辉，星降人间，熠熠生辉的琉璃法杖，挥舞时如繁星落尽，蕴含无限灵力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 100
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3341482479
		,wp_13 = 3389535995
		}
	ItemData["鹿鸣"]={
		wp_1 = "牡鹿凄鸣，风云雷动，天下至寒之墨玉炼成鹿角之形，夹风雷之势，让敌人闻之色变。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 100
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 4184601743
		,wp_13 = 1009912375
		}
	ItemData["庄周梦蝶"]={
		wp_1 = "“昔者庄周梦为蝴蝶，栩栩然蝴蝶也”梦中蝶舞花落，焉知人世几何？杖取冥府幽灯为首，引路之蝶翩飞，最善蛊惑人心。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 120
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 4210455798
		,wp_13 = 3003334713
		}
	ItemData["凤翼流珠"]={
		wp_1 = "有凤来仪，祥瑞兆也。炎帝融千金，取明珠，塑凤凰振翅衔珠之形，炼得一杖，光华灿烂，百鸟朝凤，深蕴妙法。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 130
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3777157831
		,wp_13 = 1526765929
		}
	ItemData["雪蟒霜寒"]={
		wp_1 = "刘邦斩白蛇，取其精魄封于至阴至寒之地，吸寒冰精华千年，蛇魄化杖，成“雪蟒霜寒”，阴鸷寒毒，唯奇人异士方可驾驭自如。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 140
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1585143397
		,wp_13 = 3652569447
		}
	ItemData["碧海潮生"]={
		wp_1 = "应龙伏旱魃，寻深海冰晶，取潮涌奔腾之势，融白浪连山之气，吐龙息为灵珠，成龙神逐珠之形，终获一杖，名曰“碧海潮生”。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 150
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 859134972
		,wp_13 = 2904010505
		}
	ItemData["弦月"]={
		wp_1 = "盘古开天辟地之时，一外化陨铁落于不周山之巅，沐月华，吸星魄，尽得天地清明之气，化一杖，清辉万丈，疏影琉璃，曰之“弦月”。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 13
		,wp_5 = 160
		,wp_7 = {"巫蛮儿","羽灵神"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1620809403
		,wp_13 = 481332718
		}
	ItemData["沧海明珠"]={
		wp_1 = "东海之浪，西海之湍，南海之潮，北海之涌，凝为玲珑明珠，置于耳畔，可闻四海浪涛奔涌。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 70
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3775040856
		,wp_13 = 1581614754
		}
	ItemData["无量玉璧"]={
		wp_1 = "奇珍璞玉，历神工鬼斧琢磨百年，方成无瑕白璧，明澈如镜，可见本心。心无旁骛，不惹尘埃。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 80
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 219820456
		,wp_13 = 1327897055
		}
	ItemData["离火"]={
		wp_1 = "北地铁骨，质坚且寒，南疆离火，熔之成珠。铁骨灼灼，烈火熊熊，炽焰炎炎，刚猛之至。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 90
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3130687183
		,wp_13 = 295884750
		}
	ItemData["飞星"]={
		wp_1 = "河汉渺渺，星华灿灿。流星坠地，而光华不灭，繁光云影，剔透灵动。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 100
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2857125772
		,wp_13 = 3385292234
		}
	ItemData["月华"]={
		wp_1 = "芙蓉出水，风荷凌波。采月宫新荷之叶，凝流金月色之光，成琳琅花灯一盏，暖光融融，晴光皎皎。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 100
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3767404245
		,wp_13 = 776402569
		}
	ItemData["回风舞雪"]={
		wp_1 = "洛水汤汤，钟灵毓秀。河洛之女质比霜雪，态似惊鸿；一日童心乍起，采河滨之蝶、沉水之冰，吟清歌而成宝珠，蝶舞之时回风舞雪，琴音泠泠。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 120
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3065427050
		,wp_13 = 269710225
		}
	ItemData["紫金葫芦"]={
		wp_1 = "混沌初分，天开地辟，昆仑山脚下生仙藤一缕，上结葫芦七枚，名曰紫金葫芦，千年方得瓜熟蒂落，有吞吐万象之力。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 130
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1536710915
		,wp_13 = 2788268887
		}
	ItemData["裂云啸日"]={
		wp_1 = "烛龙之鳞，采璇玑之华，待千年。浴羲和之光，再千年。经九煅九灼，方熔为赤金之珠，其光煌煌，可照千里，其势熊熊，耀日贯虹。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 140
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3954481057
		,wp_13 = 3032716270
		}
	ItemData["云雷万里"]={
		wp_1 = "北溟之鲲，化而为鹏，凌风而起，翼若垂天之云，啸如雷霆之怒，水击三千，风驰如电。沉眠时化作神异之珠，聚风雷云电之力，有呼山啸海之能。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 150
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3251343750
		,wp_13 = 3115679889
		}
	ItemData["赤明"]={
		wp_1 = "盘古开天辟地后，齿骨为金石，精髓为珠玉，灵窍一点聚天地浩气，化为宝珠“赤明”，虹霓为衣，金螭为息，吞云吐明，异光万里。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 15
		,wp_5 = 160
		,wp_7 = {"巫蛮儿","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1303853669
		,wp_13 = 4145962850
		}
	ItemData["游鱼戏珠"]={
		wp_1 = "弓箭之形仿若双鱼，共戏剔透宝珠。出箭之势，亦如游鱼嬉水，婉转灵动，让对手无从躲避。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 70
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1424340640
		,wp_13 = 4113025121
		}
	ItemData["灵犀望月"]={
		wp_1 = "天降奇石，锻为兵器，自生光华。美玉做灵犀之形，嵌于弓腰，祥瑞兆也。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 80
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2652946197
		,wp_13 = 3194521736
		}
	ItemData["非攻"]={
		wp_1 = "墨家机关之术神秘莫测，相传有采玉人偶得其残片，上记“非攻”弓弩，机括精妙，威力非常。遂寻美玉，勤琢磨，终得天下难见之绝品。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 90
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3157963095
		,wp_13 = 1966338355
		}
	ItemData["幽篁"]={
		wp_1 = "潮音洞外梵音悠悠，云岚缭绕，幽篁万杆，满目翠色。林中紫竹既坚且韧，扣之琅然有金石声，金童子置之于老君炉中，锻成神弓，名曰“幽篁”。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 100
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3823221168
		,wp_13 = 3873525610
		}
	ItemData["百鬼"]={
		wp_1 = "春秋时古墓中，青铜之樽，凝百鬼之魂，锻九千日，乃成。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 100
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1920235031
		,wp_13 = 878233843
		}
	ItemData["冥火薄天"]={
		wp_1 = "幽冥之地，麒麟衔火而生，踏火而行，所经处金石皆熔，游九州聚天地精华，得遇有缘之士，乃化作良弓一柄，凌风驭火，箭矢如焰，有燎日之能。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 120
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3592078104
		,wp_13 = 944851297
		}
	ItemData["龙鸣寒水"]={
		wp_1 = "云龙居寒水，可呼云雨，开江海，鸣动天地，腾云起风。此弩熔云龙之鳞，凝万年寒水之底，聚玄冰苦寒之气，千年方成，出矢如冰，霜寒雪冷。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 130
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 4125263988
		,wp_13 = 566006425
		}
	ItemData["太极流光"]={
		wp_1 = "天地之道，以阴阳二气造化万物，日月、风雨，刚柔、动静莫不合此道也。此番水火相逢，相生相克，有大神通。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 140
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1065909571
		,wp_13 = 453912996
		}
	ItemData["九霄风雷"]={
		wp_1 = "灵凰栖九天，高飞穿云，清音裂石。妙手仙匠采灵凰之魄，河汉之星，云雷之怒，以九霄长风锻造千载而成此弓，箭簇既出，风雷声动，江海怒号。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 150
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1632354244
		,wp_13 = 4026131118
		}
	ItemData["若木"]={
		wp_1 = "金乌栖若木，振翅日升，归巢日落，十鸟齐飞，则十日齐出，民不聊生。后羿采若木为弓，连射九日，凝金乌之魂于弓上，羲和光华，日夜不息。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 14
		,wp_5 = 160
		,wp_7 = {"羽灵神","杀破狼"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 2281686232
		,wp_13 = 1581270869
		}
	ItemData["月光双剑"]={
		wp_1 = "皎洁如白玉，清明如月光  "
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 100
		,wp_7 = {"英女侠","飞燕女"}
		,wp_11 = "item.wdf"
		,wp_12 = 38511533
		,wp_13 = 2184315991
		--高级装备新人物
		}
	ItemData["桃印铁刃"]={
		wp_1 = "常见铁剑，以桃木为剑柄。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 10
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 3651866845
		,wp_13 = 151833112
		}
	ItemData["赭石巨剑"]={
		wp_1 = "以赭石去杂质锻淬而成，色泽沉郁。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 20
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 1525417198
		,wp_13 = 2861515391
		}
	ItemData["壁玉长铗"]={
		wp_1 = "精铁重剑，剑身嵌美玉。碧波流光，颇有君子之风。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 30
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x51105074
		,wp_13 = 0x976BFD27
		}
	ItemData["青铜古剑"]={
		wp_1 = "青铜宝剑，古朴大气，然剑锋凌厉，不可小觑。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 40
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x809D1FDD
		,wp_13 = 0xCC013376
		}
	ItemData["金错巨刃"]={
		wp_1 = "铁匠采丹阳铜矿冶炼锻造，剑身以镶金包裹，工艺精湛，灼灼夺目。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 50
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xBD5C010E
		,wp_13 = 0xE8F34110
		}
	ItemData["惊涛雪"]={
		wp_1 = "铸剑师偶得深海晶石一块，冶炼成剑，挥斩之时，流光溢彩。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 60
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x1F648228
		,wp_13 = 0x0B0AB6FB
		}
	ItemData["醉浮生"]={
		wp_1 = "浮生若梦，一醉解忧，以布裹之，掩锋芒，平杀气，大巧不工，颇具豪侠之意。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 70
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x379213E4
		,wp_13 = 0xE98BD873
		}
	ItemData["沉戟天戊"]={
		wp_1 = "原为沙场断戟，后经人收敛重铸，以缅忠魂。握之，勇武无惧。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 80
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x2E58E991
		,wp_13 = 0xE7692943
		}
	ItemData["鸦九"]={
		wp_1 = "剑痴鸦九得欧冶子所遗铸剑秘法，铸长剑无名。因不舍爱剑磨损，剑成当日。即以冰匣封之。十余年后得人点拔开悟，欲拔剑出匣，然而冰匣早已与剑芯融为一体，不可分离，寻得熔岩炼化三年，方重铸此剑，剑身自此红雾缭绕。后人得之，为此剑冠以剑痴鸦九之名。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 90
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xEE633A71
		,wp_13 = 0x3ADE1603
		}
	ItemData["昆吾"]={
		wp_1 = "前朝君主雄才大略，文治武功皆成鼎盛，有邦国朝献天降陨铁。以为祥瑞，遂寻当世铸剑高手，炼化成剑，彪炳功勋。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 100
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x458E5B98
		,wp_13 = 0xF9D8AF7B
		}
	ItemData["弦歌"]={
		wp_1 = "乐师师旷以剑为胆，棹伏羲木，铺天蚕丝，制成琴身重剑，以酬知己，友人闻弦歌而知雅意，奏高山流水，成一段佳话。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 110
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x7B631424
		,wp_13 = 0x2952AF91
		}
	ItemData["墨骨枯麟"]={
		wp_1 = "东海龙冢有龙骨万千，尤以黑龙龙骨为尊，取其残骨，熔以业火，成墨骨重剑。弹触剑身，争鸣作响，似有龙吟。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 120
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x84131194
		,wp_13 = 0xEDAE8F1A
		}
	ItemData["腾蛇郁刃"]={
		wp_1 = "中山之州有赤目飞蛇，乘雾游云，于柴桑之山嬉戏，疲乏后盘松石小憩，留蛇蜕一副，化为巨剑，此乃王道之师。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 130
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x6F6CAC00
		,wp_13 = 0x9B3ACC82
		}
	ItemData["秋水澄流"]={
		wp_1 = "泑水之畔盛产婴垣之玉，得蓐收赤足踏过而成金秋之色，胜碧玉琼瑶。有人界巧匠偶得之，不知何物，投剑炉一试，不想即刻炉毁剑成，更一日入秋，遂得此名。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 140
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x5F69A15B
		,wp_13 = 0x60665CA2
		}
	ItemData["百辟镇魂"]={
		wp_1 = "千年以前，世间妖魔横行，有神将除妖邪，斩厉鬼，力竭而亡，然其精魂不灭，附于生前所用神兵重剑，继续护佑四方。此剑祭出，则正气浩然冲天，可诛邪平患，可定历熄灾。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 150
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xF88C7462
		,wp_13 = 0x18605DF5
		}
	ItemData["长息"]={
		wp_1 = "洪水滔天，鲧窃帝之息壤以堙洪水，息壤生生不息，却于疏洪无益。帝令祝融取息壤，复命禹布土疏洪，以定九州。此时山川逼仄，水塞不出。禹借祝融火龙之力，熔炼息壤成重剑之体，以之开山疏浚，方江河倾泻，洪水东去。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 16
		,wp_5 = 160
		,wp_7 = {"偃无师"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x14412394
		,wp_13 = 0x50C65EB2
		}
	ItemData["素纸灯"]={
		wp_1 = "轻巧的纸灯笼，最适合新手练习使用。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 0
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xC2554C5A
		,wp_13 = 0x053A2EC4
		}
	ItemData["竹骨灯"]={
		wp_1 = "以竹骨扎成的灯笼，看起来精致又风雅。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 10
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3EC471A0
		,wp_13 = 0xEA6DAE59
		}
	ItemData["红灯笼"]={
		wp_1 = "节日时方可悬挂起来的红灯笼，看到它就能感到喜庆的氛围。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 20
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xC7DFDFEE
		,wp_13 = 0x38E5EA0B
		}
	ItemData["鲤鱼灯"]={
		wp_1 = "仿照锦鲤的样子精致而成的花灯，说不定会和锦鲤一样带给人好运呢！"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 30
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x97F6C50B
		,wp_13 = 0x97DB902B
		}
	ItemData["芙蓉花灯"]={
		wp_1 = "晶莹剔透的白瓷灯笼，更有名家所绘之工笔芙蓉，美轮美奂。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 40
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xCD622A06
		,wp_13 = 0x7E3F070B
		}
	ItemData["如意宫灯"]={
		wp_1 = "宫廷巧匠耗费月余精制而成的宫灯，象征着平安吉祥，如意你心。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 50
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xB4FBA38A
		,wp_13 = 0xCE867B66
		}
	ItemData["玲珑盏"]={
		wp_1 = "西域工匠以 费盘斯 工艺烧制的灯笼，其色流云清彩，其质晶莹剔透，玲珑奇巧，引人注目。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 60
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x97987F5C
		,wp_13 = 0xA3B8F8E5
		}
	ItemData["玉兔盏"]={
		wp_1 = "白璧无瑕琢成团绒玉兔，碧玉青翠雕琢剔透环珮，光润莹然，美不胜收。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 70
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xD1839465
		,wp_13 = 0x9C3DDB33
		}
	ItemData["冰心盏"]={
		wp_1 = "北俱寒冰，澄澈剔透，经年不化。炽焰为刃，琢成玲珑灯盏，寒光为焰，凛风逼人。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 80
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x06427E44
		,wp_13 = 0xF2575943
		}
	ItemData["蟠龙"]={
		wp_1 = "风从龙出，云有龙息，夜放光华，金碧辉煌。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 90
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xA2DC05D6
		,wp_13 = 0x73DE6960
		}
	ItemData["云鹤"]={
		wp_1 = "饥餐瑶草，渴饮琼泉。朝飞阆苑，暮宿云烟。白鹤雪羽为灯盏，光耀如雪，不惹尘埃。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 100
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x5470130D
		,wp_13 = 0x7B377B2F
		}
	ItemData["风荷"]={
		wp_1 = "清莲出水，玉立亭亭。其灵性卓然者，化为灵仙，凡胎肉身，则凝为灯盏。含苞欲放，清芬十里。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 110
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xE61D828A
		,wp_13 = 0x03F289DB
		}
	ItemData["金风玉露"]={
		wp_1 = "今日云軿渡鹊桥，应非脉脉与迢迢。灵鹊仙羽，织就金凤，七夕月华，酿作玉露。皎皎华光，可照良人。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 120
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xD9D63E3A
		,wp_13 = 0x56ECB65C
		}
	ItemData["凰火燎原"]={
		wp_1 = "凰与凤，生相伴，死同归。一方离世，则生者必引颈而鸣，唤涅槃之火，双双浴火重生。此火五百年不灭，奔腾炽烈，可焚八方。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 130
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x9129C027
		,wp_13 = 0x9DD18309
		}
	ItemData["月露清愁"]={
		wp_1 = "三界之西，有湖曰灵，湖水乃天女眼泪所化，夜色深浓时，有溶溶光华。水滴如泪，泪干为夜明灵珠，风流藴籍，清光冷冷。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 140
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x7DB16375
		,wp_13 = 0x17020397
		}
	ItemData["夭桃秾李"]={
		wp_1 = "桃之夭夭，灼灼其华。烂漫春光，转瞬即逝。九重天上仙娥取之以为灯盏，光华所至处，枯木吐芽，桃李争芳。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 150
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x71FEDD98
		,wp_13 = 0xEAEFA73D
		}
	ItemData["荒尘"]={
		wp_1 = "星河浩瀚，繁星若尘，亿万星尘聚沙为塔，是以沧海桑田，人世幻变，其光华永恒也。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 18
		,wp_5 = 160
		,wp_7 = {"桃夭夭"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x889E6AB7
		,wp_13 = 0xFEEAD4B6
		}
	ItemData["油纸伞"]={
		wp_1 = "普通的油纸伞，美观轻巧，最适合新手使用。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 0
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x75285B05
		,wp_13 = 0x63C38A86
		}
	ItemData["红罗伞"]={
		wp_1 = "当下最时兴的雨伞样式，正红色的罗缎伞面看起来甚是喜庆。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 10
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xABC1FF05
		,wp_13 = 0x1485AABF
		}
	ItemData["紫竹伞"]={
		wp_1 = "伞骨及伞柄皆是紫竹制成，非常坚韧。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 20
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x7EB4CE4A
		,wp_13 = 0x28EEC31C
		}
	ItemData["锦绣椎"]={
		wp_1 = "巧手绣娘，择上品丝绸，飞针走线，历时年逾，方成此伞，设色精妙，光彩夺目。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 30
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x38E84E48
		,wp_13 = 0xA0A62144
		}
	ItemData["幽兰帐"]={
		wp_1 = "本为一尺无暇素锦，不慎沾染墨痕，幸得雅士泼墨挥毫，绘幽兰一枝，其清俊姿态，栩栩如生，其清雅香气，扑鼻欲来。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 40
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x898B70A3
		,wp_13 = 0xF2391CAB
		}
	ItemData["琳琅盖"]={
		wp_1 = "《般若经》有七宝：乃金、银、琉璃、珊瑚、琥珀、砗磲、玛瑙。能工巧匠以金银为骨，饰以琉璃、砗磲之属，方成此伞。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 50
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xD105662F
		,wp_13 = 0x38B4CA6B
		}
	ItemData["孔雀羽"]={
		wp_1 = "西域巧匠，取珍兽孔雀之尾羽，以玄妙秘法织造而成，碧彩闪烁，金翠辉煌。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 60
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xFEBE2460
		,wp_13 = 0x24BD153A
		}
	ItemData["金刚伞"]={
		wp_1 = "金刚怒目，降妖四魔。金刚伞以精钢百炼而成，铁骨刚叶，坚不可摧。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 70
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xCC7106BF
		,wp_13 = 0x4FD7BCC4
		}
	ItemData["落梅伞"]={
		wp_1 = "北俱苦寒之地，生千年老梅。一甲子方开花一次，色若胭脂，香欺兰蕙。梅枝落雪上，苦心雕琢，方成此伞。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 80
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xC0151FE6
		,wp_13 = 0x25E301EE
		}
	ItemData["鬼骨"]={
		wp_1 = "昆山有玉，性阴厉，蓄百年煞气，幻为枯骨，谓之鬼玉。此玉为伞骨，伞下阴魂环绕，寒气森然。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 90
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xC1D8FB19
		,wp_13 = 0x5CBC9754
		}
	ItemData["云梦"]={
		wp_1 = "高唐有梦，水阔花飞，梦有神女取巫山之风云为伞，谓之云梦。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 100
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x9DF0BB9B
		,wp_13 = 0x32DC87DD
		}
	ItemData["枕霞"]={
		wp_1 = "瑶池有仙蝶，枕霞沐云而生，其态纤巧翩然，其色艳若丹霞，取其羽翼为伞，霞光云影，如在目前。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 110
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x28771B6D
		,wp_13 = 0x4FBB679F
		}
	ItemData["碧火琉璃"]={
		wp_1 = "金蛇之鳞，可萃命魂之焰。以百枚金蛇之鳞，取百鬼命魂之火，成此伞。碧火幽幽，杀气腾腾，此伞过处，百鬼夜哭，绕梁不绝。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 120
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xEB48DDFB
		,wp_13 = 0x284DD72B
		}
	ItemData["雪羽穿云"]={
		wp_1 = "昆仑山中，有仙禽雪鸢，振翅可穿云，歌有裂石音，灵气所钟，位列仙班，其羽裳化伞，持此者，身轻如燕，振翅可至九天。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 130
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xD189B9E5
		,wp_13 = 0x14945888
		}
	ItemData["月影星痕"]={
		wp_1 = "汲天河之水，取星河之光。凝月华之露，锻千日，成此伞。其光灿然，其色清灵，伞起时，月华照人，清辉泻地。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 140
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x8E5D6A40
		,wp_13 = 0x45CB2F4A
		}
	ItemData["浮生归梦"]={
		wp_1 = "三生河畔，彼岸花开，殷红似火，灼灼其华。曼珠沙华一株，藏浮生忆念一世。幽梦为瓣，情丝若蕊，墨蝶翩翩，归梦何时？"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 150
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xE1EC0610
		,wp_13 = 0x2DF481E2
		}
	ItemData["晴雪"]={
		wp_1 = "燕山雪，大如席，有华胥之女幽娴娇丽，踏凌云风波，乘逐月之辇，辇有华盖，正是燕山晴雪，清光冷冷，不可逼视。"
		,wp_2 = 2
		,wp_3 = 3
		,wp_4 = 17
		,wp_5 = 160
		,wp_7 = {"鬼潇潇"}
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x8020E83B
		,wp_13 = 0x4C2F3E26
		-- 新增装备
		}
	ItemData["乾坤帽"]={
		wp_1 = "天下名冠，暗藏乾坤玄机，有相当强的防御力"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 70
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1272695123
		,wp_13 = 1771271296
		}
	ItemData["黑魔冠"]={
		wp_1 = "魔王妖王常戴的冠帽，有相当强的防御力"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 80
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 685770468
		,wp_13 = 1237041059
		}
	ItemData["白玉龙冠"]={
		wp_1 = "高贵雅致的冠帽，镶有上等白玉精雕之飞龙图案"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 90
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 4284490218
		,wp_13 = 1412110631
		}
	ItemData["水晶夔帽"]={
		wp_1 = "其状如牛,苍色无角,一足能走,出入水即风雨,目光如日月,其声如雷,名曰夔。黄帝杀之,取皮以冒鼓,声闻五百里。”相传远古奇兽夔牛皮最终为一能工巧匠所得，辅以水晶玉石经上经千锤百炼雕琢编制而成一件冠帽。据传此帽拥有奇兽的庇佑，千年不坏"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 100
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 77382880
		,wp_13 = 2164041151
		}
	ItemData["翡翠曜冠"]={
		wp_1 = "相传为三清之一灵宝天尊佩戴过的帽冠。七颗翡翠分别代表“日、月、火、水、金、木、土”环绕在玉石宝珠上。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 110
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 482138369
		,wp_13 = 830308889
		}
	ItemData["金丝黑玉冠"]={
		wp_1 = "远古盘古开天辟地，混沌初开时凝结而成的玉石雕琢而成的冠帽，充满着神奇的灵气。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 120
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1140741771
		,wp_13 = 948281107
		}
	ItemData["白玉琉璃冠"]={
		wp_1 = "太上老君曾佩戴过的冠帽，用仙界白玉与琉璃珠辅以天丝编织而成。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 130
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 778966943
		,wp_13 = 243238969
		}
	ItemData["兽鬼珐琅面"]={
		wp_1 = "上古神魔所戴，虽经几千年，面具独角四周仍散发着神奇的魔力。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 140
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2310107289
		,wp_13 = 125393860
		}
	ItemData["紫金磐龙冠"]={
		wp_1 = "火神遗留之物。冠上用金雕琢为吉龙盘云，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 150
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 447473455
		,wp_13 = 3859378496
		}
	ItemData["浑天玄火盔"]={
		wp_1 = "黄帝征伐四方之时所配战盔，刀枪不入，水火不侵，瘟邪难近，更添无尽战意。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 160
		,wp_6 = "男"
		,wp_11 = "item.wd1"
		,wp_12 = 3566352403
		,wp_13 = 1502470676
		-- 女帽
		}
	ItemData["魔女发冠"]={
		wp_1 = "魔女们常带的头环，可以起到非常强的防御作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 70
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2508308579
		,wp_13 = 845102994
		}
	ItemData["七彩花环"]={
		wp_1 = "用七彩神花编成的花环，可以起到极强防御的作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 80
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3183056480
		,wp_13 = 2570521405
		}
	ItemData["凤翅金翎"]={
		wp_1 = "以凤翅和凤翎编织而成的金丝头环，有极强防御的作用"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 90
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2373769150
		,wp_13 = 3600964026
		}
	ItemData["寒雉霜蚕"]={
		wp_1 = "由寒玉以及蚕丝编制而成，相传为七仙女常戴之物"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 100
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 86765519
		,wp_13 = 42155348
		}
	ItemData["曜月嵌星"]={
		wp_1 = "瑶池圣母所戴之物。冠上镶有七星宝珠环绕在月光石周围形成七星曜月的图案。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 110
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3373770544
		,wp_13 = 2683232345
		}
	ItemData["郁金流苏簪"]={
		wp_1 = "白晶晶佩戴的发髻。白色玉石与金丝编织而成。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 120
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3156867369
		,wp_13 = 2529030399
		}
	ItemData["玉翼附蝉翎"]={
		wp_1 = "嫦娥仙女佩戴过的帽冠。将月宫中玉石经千年雕琢而成，羽翼薄如蝉翼"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 130
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 678644164
		,wp_13 = 3321477618
		}
	ItemData["鸾羽九凤冠"]={
		wp_1 = "九只五彩凤凰的羽翼与金丝编织而成的冠帽。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 140
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 1580187502
		,wp_13 = 2242355262
		}
	ItemData["金珰紫焰冠"]={
		wp_1 = "水神遗留之物。上古神兽凤凰羽翼制成的帽冠，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 150
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3789475693
		,wp_13 = 3128529272
		}
	ItemData["乾元鸣凤冕"]={
		wp_1 = "有感于女娲造人之德，三界名匠合力铸造献上的帝王冠冕。五德齐聚，凤仪天下。"
		,wp_2 = 2
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 160
		,wp_6 = "女"
		,wp_11 = "item.wd1"
		,wp_12 = 2064393561
		,wp_13 = 364230466
		-- 男衣
		}
	ItemData["龙骨甲"]={
		wp_1 = "以龙骨制成的宝甲，有惊人的防御力"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 70
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 541785355
		,wp_13 = 1741806040
		}
	ItemData["死亡斗篷"]={
		wp_1 = "魔王妖王梦寐以求的防具，非常有价值"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 80
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1766901621
		,wp_13 = 1885524269
		}
	ItemData["神谕披风"]={
		wp_1 = "受到神谕祝福的银色披风，带有灵动之气"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 90
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1771196770
		,wp_13 = 1105958467
		}
	ItemData["珊瑚玉衣"]={
		wp_1 = "相传为龙王所用铠甲，穿上后能获得仙界的庇护。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 100
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2065701734
		,wp_13 = 2474213076
		}
	ItemData["金蚕披风"]={
		wp_1 = "由千年玉桑上的金蚕吐丝为材料缝制而成的衣甲，有极强的韧性。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 110
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 2152164595
		,wp_13 = 1839718700
		}
	ItemData["乾坤护心甲"]={
		wp_1 = "为道教流传的宝物，内有八卦乾坤玄机，能抵御极强的伤害。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 120
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 3449582254
		,wp_13 = 3993401193
		}
	ItemData["蝉翼金丝甲"]={
		wp_1 = "月宫桂树上的灵蝉身上的蝉翼辅以金丝编织而成的铠甲。绝非寻常仙家之物"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 130
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 3962403816
		,wp_13 = 60903505
		}
	ItemData["金丝鱼鳞甲"]={
		wp_1 = "水神遗留之物。时隔千年，依然充满着灵气。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 140
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 1521396689
		,wp_13 = 340629621
		}
	ItemData["紫金磐龙甲"]={
		wp_1 = "相传为黄帝的遗物。紫金磐龙，四周散发着神奇的力量"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 150
		,wp_6 = "男"
		,wp_11 = "item.wdf"
		,wp_12 = 400462349
		,wp_13 = 54627476
		}
	ItemData["混元一气甲"]={
		wp_1 = "混元一气所凝成的宝甲，至坚不摧之物，可与天地同寿"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 160
		,wp_6 = "男"
		,wp_11 = "item.wd1"
		,wp_12 = 1802888376
		,wp_13 = 3052290356
		-- 女衣
		}
	ItemData["流云素裙"]={
		wp_1 = "相传是织女用流云织成的裙子，有很非常的防御力"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 70
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 3322971644
		,wp_13 = 1771157433
		}
	ItemData["七宝天衣"]={
		wp_1 = "所谓天衣无缝，上有七宝华文，是可遇不可求的极品"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 80
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 4180182573
		,wp_13 = 4034456555
		}
	ItemData["飞天羽衣"]={
		wp_1 = "相传以玉女飞天时所着衣装，受到天地精华的凝炼"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 90
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2637194038
		,wp_13 = 1353325810
		}
	ItemData["穰花翠裙"]={
		wp_1 = "翠玉宝珠装饰而成的镶花裙，为王母娘娘赏赐之物。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 100
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 869673869
		,wp_13 = 1836280211
		}
	ItemData["金蚕丝裙"]={
		wp_1 = "由千年玉桑上的金蚕吐丝为材料缝制而成的衣甲，有极强的韧性。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 110
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2107840682
		,wp_13 = 1711858998
		}
	ItemData["紫香金乌裙"]={
		wp_1 = "汲取三界花魂而制成的裙子，穿上此裙香飘千里。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 120
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2898176567
		,wp_13 = 273903801
		}
	ItemData["碧霞彩云衣"]={
		wp_1 = "收集了天界的碧霞五彩祥云编织而成的彩云衣，相传七仙女下凡时就是穿的这件。"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 130
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 1972600201
		,wp_13 = 2452196507
		}
	ItemData["金丝蝉翼衫"]={
		wp_1 = "月宫桂树上的灵蝉身上的蝉翼，并取自瑶池的金丝，经仙界仙女七七四十九天编织而成的软甲"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 140
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 910126967
		,wp_13 = 2753459745
		}
	ItemData["五彩凤翅衣"]={
		wp_1 = "相传女娲娘娘所穿。穿上此衣能得到上古神灵的庇佑"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 150
		,wp_6 = "女"
		,wp_11 = "item.wdf"
		,wp_12 = 2784730653
		,wp_13 = 4139222799
		}
	ItemData["鎏金浣月衣"]={
		wp_1 = "以日月光芒所织造的霞衣，对敌之时往往令其目眩神驰"
		,wp_2 = 2
		,wp_3 = 4
		,wp_4 = 1
		,wp_5 = 160
		,wp_6 = "女"
		,wp_11 = "item.wd1"
		,wp_12 = 1359780053
		,wp_13 = 2596354317
		-- 鞋子
		}
	ItemData["九州履"]={
		wp_1 = "天下名履，有非常不错的防御力和速度"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 70
		,wp_11 = "item.wdf"
		,wp_12 = 1192033620
		,wp_13 = 1060649976
		}
	ItemData["万里追云履"]={
		wp_1 = "可在任何地形疾走的神履，有不错的防御力可在任何地形疾走的神履，有不错的防御力"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 80
		,wp_11 = "item.wdf"
		,wp_12 = 2928326681
		,wp_13 = 1121748353
		}
	ItemData["踏雪无痕"]={
		wp_1 = "包蓄地之灵气，穿之幻影如风，踏雪无痕"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 90
		,wp_11 = "item.wdf"
		,wp_12 = 1140435077
		,wp_13 = 888533789
		}
	ItemData["平步青云"]={
		wp_1 = "寻常仙界之物，穿上此靴可平步青云，借风云飞腾。"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 1930941353
		,wp_13 = 771313116
		}
	ItemData["七星逐月靴"]={
		wp_1 = "天罡星所穿之靴。穿之及疾如风，三界之地任我遨游。"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 130
		,wp_11 = "item.wdf"
		,wp_12 = 1623857733
		,wp_13 = 2763463360
		}
	ItemData["碧霞流云履"]={
		wp_1 = "相传天界神匠以五彩天霞为材料，缝制而成的靴子。"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 140
		,wp_11 = "item.wdf"
		,wp_12 = 3450927651
		,wp_13 = 1312286829
		}
	ItemData["追云逐电"]={
		wp_1 = "相传为雷公电母经过千万年炼化而成，穿上后可以追逐云电，日行万里。"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 110
		,wp_11 = "item.wdf"
		,wp_12 = 1149904553
		,wp_13 = 3062275612
		}
	ItemData["乾坤天罡履"]={
		wp_1 = "相传为太上老君所穿。乃天地之气编织而成"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 120
		,wp_11 = "item.wdf"
		,wp_12 = 1238537463
		,wp_13 = 2413633901
		}
	ItemData["金丝逐日履"]={
		wp_1 = "相传神匠为纪念夸父特造此靴。穿上可追逐太阳，风云皆抛于脑后"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 150
		,wp_11 = "item.wdf"
		,wp_12 = 967718944
		,wp_13 = 2734810061
		}
	ItemData["辟尘分光履"]={
		wp_1 = "上古秘宝，着此履者可于星尘间穿梭，与霞光相竞逐"
		,wp_2 = 2
		,wp_3 = 6
		,wp_4 = 1
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 2907023969
		,wp_13 = 3418242860
		-- 腰带
		}
	ItemData["乱牙咬"]={
		wp_1 = "神铁制的腰箍，能起到较强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 4081289026
		,wp_13 = 1830358071
		}
	ItemData["魔童大牙"]={
		wp_1 = "巨大的魔牙，系在腰间能起到极强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 50
		,wp_11 = "item.wdf"
		,wp_12 = 3917101017
		,wp_13 = 246498213
		}
	ItemData["攫魂铃"]={
		wp_1 = "来自阴间的魔铃，佩在腰间，能起到极强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 60
		,wp_11 = "item.wdf"
		,wp_12 = 3503405586
		,wp_13 = 4282767598
		}
	ItemData["双魂引"]={
		wp_1 = "来自阴间的宝物，可以佩在腰间，能起到极强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 60
		,wp_11 = "item.wdf"
		,wp_12 = 3493684718
		,wp_13 = 2691281237
		}
	ItemData["兽王腰带"]={
		wp_1 = "兽王曾使用过的腰饰，能起到较强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 70
		,wp_11 = "item.wdf"
		,wp_12 = 2946790593
		,wp_13 = 281570977
		}
	ItemData["百窜云"]={
		wp_1 = "神秘的缎带，系在腰间能起到较强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 70
		,wp_11 = "item.wdf"
		,wp_12 = 1956418448
		,wp_13 = 457288512
		}
	ItemData["八卦锻带"]={
		wp_1 = "暗藏八卦玄机的腰带，能起到极强的防御作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 80
		,wp_11 = "item.wdf"
		,wp_12 = 4238438306
		,wp_13 = 3676875648
		}
	ItemData["圣王坠"]={
		wp_1 = "相传为Saber的缠腰带,不如被谁偷走了,流入市场."
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 80
		,wp_11 = "item.wdf"
		,wp_12 = 4161518362
		,wp_13 = 2601988852
		}
	ItemData["幻彩玉带"]={
		wp_1 = "以集天界灵气之幻彩宝玉制成，有强大的护佑作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 90
		,wp_11 = "item.wdf"
		,wp_12 = 2383008893
		,wp_13 = 871942394
		}
	ItemData["珠翠玉环"]={
		wp_1 = "集合千年地气生出的翡翠宝珠雕琢而成的腰带，有强大的庇佑作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 4092702542
		,wp_13 = 4023277032
		}
	ItemData["金蟾含珠"]={
		wp_1 = "相传“蟾”能口吐金钱为旺财之物。由金身蟾口含夜光珠再辅以金丝编织而成的腰带，世间少有，绝非人界之物"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 110
		,wp_11 = "item.wdf"
		,wp_12 = 1436553780
		,wp_13 = 415633459
		}
	ItemData["乾坤紫玉带"]={
		wp_1 = "千年紫玉雕琢而成的腰带，相传为道家失传的宝物，有极强的庇佑作用"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 120
		,wp_11 = "item.wdf"
		,wp_12 = 1070699611
		,wp_13 = 885196883
		}
	ItemData["琉璃寒玉带"]={
		wp_1 = "天界银河之水经亿万年凝结而成的玉石制成的腰带，不为寻常仙物"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 130
		,wp_11 = "item.wdf"
		,wp_12 = 761737729
		,wp_13 = 290193038
		}
	ItemData["蝉翼鱼佩带"]={
		wp_1 = "月宫桂树上的灵蝉身上的蝉翼以及金丝编织而成的腰带，所散发出来的灵气能抵御极强的伤害。"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 140
		,wp_11 = "item.wdf"
		,wp_12 = 1344450765
		,wp_13 = 2406174850
		}
	ItemData["磐龙凤翔带"]={
		wp_1 = "远古天神遗物，龙飞凤舞呈吉祥之态，佩戴起来能受到上古神兽的庇护。"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 150
		,wp_11 = "item.wdf"
		,wp_12 = 2563450676
		,wp_13 = 4015638612
		}
	ItemData["紫霄云芒带"]={
		wp_1 = "以云霞束起雷电所制成的腰带，会散发出闪电自行防御来袭的攻击。"
		,wp_2 = 2
		,wp_3 = 5
		,wp_4 = 1
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 2824149864
		,wp_13 = 2230161080
		-- 饰品
		}
	ItemData["碧水青龙"]={
		wp_1 = "龙形环状可戴在项部，有相当的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 70
		,wp_11 = "item.wdf"
		,wp_12 = 2761659977
		,wp_13 = 4002371974
		}
	ItemData["鬼牙攫魂"]={
		wp_1 = "来自阴间的饰物，佩带在身上有较强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 70
		,wp_11 = "item.wdf"
		,wp_12 = 3973878954
		,wp_13 = 2356109296
		}
	ItemData["万里卷云"]={
		wp_1 = "据说是大禹留下的宝物，佩带在身上有极强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 80
		,wp_11 = "item.wdf"
		,wp_12 = 2814775714
		,wp_13 = 3789092586
		}
	ItemData["疾风之铃"]={
		wp_1 = "来历不详的神秘饰物，佩带在身上有极强的法力作用"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 80
		,wp_11 = "item.wdf"
		,wp_12 = 1790391367
		,wp_13 = 3931720117
		}
	ItemData["七彩玲珑"]={
		wp_1 = "串有七彩玲珑的珍珠，集海之灵气，给予佩戴者祥瑞祝福"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 90
		,wp_11 = "item.wdf"
		,wp_12 = 61182840
		,wp_13 = 1790107582
		}
	ItemData["黄玉琉佩"]={
		wp_1 = "女娲补天遗留下的神石雕琢而成，拥有神奇的灵力。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 100
		,wp_11 = "item.wdf"
		,wp_12 = 4273718431
		,wp_13 = 3596201129
		}
	ItemData["鸾飞凤舞"]={
		wp_1 = "仙界仙女们常佩之物。呈祥瑞和平之气，定能给佩戴者带来好运。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 110
		,wp_11 = "item.wdf"
		,wp_12 = 234019286
		,wp_13 = 805892737
		}
	ItemData["衔珠金凤佩"]={
		wp_1 = "相传曾为嫦娥仙子佩戴之物。此物寓示着美好的追求与向往。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 120
		,wp_11 = "item.wdf"
		,wp_12 = 1808237370
		,wp_13 = 1175473770
		}
	ItemData["七璜珠玉佩"]={
		wp_1 = "以七个天珠以及天丝编制而成的坠子。集天地之灵气，能给予佩戴者吉祥如意。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 130
		,wp_11 = "item.wdf"
		,wp_12 = 150576745
		,wp_13 = 3350488882
		}
	ItemData["鎏金点翠佩"]={
		wp_1 = "玉皇大帝平常佩戴之物，集合了仙界之力，给予佩戴者神奇的魔力。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 140
		,wp_11 = "item.wdf"
		,wp_12 = 91896384
		,wp_13 = 2019827339
		}
	ItemData["紫金碧玺佩"]={
		wp_1 = "上古神兽遗留之物。四颗碧玉珠似乎依附着神奇的魔力。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 150
		,wp_11 = "item.wdf"
		,wp_12 = 782330888
		,wp_13 = 2103726062
		}
	ItemData["落霞陨星坠"]={
		wp_1 = "以陨落的星辰制成的宝玉，带有莫名的灵气与能量。"
		,wp_2 = 2
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 4104259920
		,wp_13 = 1986550511
		-- 召唤兽
		}
	ItemData["青铜护腕"]={
		wp_1 = "铜做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 45
		,wp_11 = "item.wdf"
		,wp_12 = 355149374
		,wp_13 = 2634874482
		}
	ItemData["玛瑙护腕"]={
		wp_1 = "玛缁做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 55
		,wp_11 = "item.wdf"
		,wp_12 = 3007339583
		,wp_13 = 3717112991
		}
	ItemData["琉璃护腕"]={
		wp_1 = "琉璃的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 65
		,wp_11 = "item.wdf"
		,wp_12 = 1069097956
		,wp_13 = 3349215227
		}
	ItemData["镂空银镯"]={
		wp_1 = "银做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 75
		,wp_11 = "item.wdf"
		,wp_12 = 3082110275
		,wp_13 = 3781752769
		}
	ItemData["笼玉镯"]={
		wp_1 = "玉做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 85
		,wp_11 = "item.wdf"
		,wp_12 = 813354899
		,wp_13 = 4276176260
		}
	ItemData["嵌宝金腕"]={
		wp_1 = "金做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 95
		,wp_11 = "item.wdf"
		,wp_12 = 3180910965
		,wp_13 = 2826073060
		}
	ItemData["玳瑁护腕"]={
		wp_1 = "玳瑁做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 105
		,wp_11 = "item.wdf"
		,wp_12 = 2446137013
		,wp_13 = 188760799
		}
	ItemData["七星宝腕"]={
		wp_1 = "寒冰沂蒙精心给大家的护腕，戴上这个可以秒天秒地秒空气"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 115
		,wp_11 = "item.wdf"
		,wp_12 = 770473038
		,wp_13 = 361633315
		}
	ItemData["缚龙筋"]={
		wp_1 = "龙筋做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 125
		,wp_11 = "item.wdf"
		,wp_12 = 1671231141
		,wp_13 = 3934076700
		}
	ItemData["凤翎护腕"]={
		wp_1 = "凤凰的羽毛做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 135
		,wp_11 = "item.wdf"
		,wp_12 = 1520923728
		,wp_13 = 3501233104
		}
	ItemData["织锦彩带"]={
		wp_1 = "锦做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 145
		,wp_11 = "item.wdf"
		,wp_12 = 426710040
		,wp_13 = 4049294130
		}
	ItemData["冰蚕丝带"]={
		wp_1 = "冰蚕丝做的护腕"
		,wp_2 = 2
		,wp_3 = 7
		,wp_4 = 1
		,wp_5 = 155
		,wp_11 = "item.wdf"
		,wp_12 = 669823245
		,wp_13 = 3491081774
		}
	ItemData["青铜颈环"]={
		wp_1 = "铜做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 45
		,wp_11 = "item.wdf"
		,wp_12 = 1454090395
		,wp_13 = 786120977
		}
	ItemData["玛瑙石环"]={
		wp_1 = "玛缁做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 55
		,wp_11 = "item.wdf"
		,wp_12 = 391314910
		,wp_13 = 1466260477
		}
	ItemData["琉璃环"]={
		wp_1 = "琉璃的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 65
		,wp_11 = "item.wdf"
		,wp_12 = 1897984925
		,wp_13 = 2342712762
		}
	ItemData["九曲环"]={
		wp_1 = "银做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 75
		,wp_11 = "item.wdf"
		,wp_12 = 3613005753
		,wp_13 = 3507788902
		}
	ItemData["笼玉环"]={
		wp_1 = "玉做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 85
		,wp_11 = "item.wdf"
		,wp_12 = 1850407544
		,wp_13 = 3784211553
		}
	ItemData["嵌宝金环"]={
		wp_1 = "金做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 95
		,wp_11 = "item.wdf"
		,wp_12 = 3283266712
		,wp_13 = 3275437370
		}
	ItemData["玳瑁环"]={
		wp_1 = "玳瑁做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 105
		,wp_11 = "item.wdf"
		,wp_12 = 3240013292
		,wp_13 = 225036096
		}
	ItemData["七星宝环"]={
		wp_1 = "寒冰沂蒙精心给大家制作的手环，戴上他可以秒天秒地秒空气"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 115
		,wp_11 = "item.wdf"
		,wp_12 = 678406505
		,wp_13 = 552173832
		}
	ItemData["缚龙圈"]={
		wp_1 = "龙筋做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 125
		,wp_11 = "item.wdf"
		,wp_12 = 2612616501
		,wp_13 = 3489814847
		}
	ItemData["鸾尾环"]={
		wp_1 = "凤凰的羽毛做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 135
		,wp_11 = "item.wdf"
		,wp_12 = 2344853585
		,wp_13 = 1622496513
		}
	ItemData["织锦颈圈"]={
		wp_1 = "锦做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 =145
		,wp_11 = "item.wdf"
		,wp_12 = 4086876715
		,wp_13 = 888220028
		}
	ItemData["冰蚕丝圈"]={
		wp_1 = "冰蚕丝做的项圈"
		,wp_2 = 2
		,wp_3 = 8
		,wp_4 = 1
		,wp_5 = 155
		,wp_11 = "item.wdf"
		,wp_12 = 1454090395
		,wp_13 = 786120977
		}
	ItemData["青铜披甲"]={
		wp_1 = "铜做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 45
		,wp_11 = "item.wdf"
		,wp_12 = 3118973276
		,wp_13 = 1828827555
		}
	ItemData["玛瑙软甲"]={
		wp_1 = "玛缁做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 55
		,wp_11 = "item.wdf"
		,wp_12 = 2919721376
		,wp_13 = 3353446058
		}
	ItemData["琉璃罩甲"]={
		wp_1 = "琉璃的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 65
		,wp_11 = "item.wdf"
		,wp_12 = 696270961
		,wp_13 = 2418258211
		}
	ItemData["连环铠甲"]={
		wp_1 = "银做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 75
		,wp_11 = "item.wdf"
		,wp_12 = 801892250
		,wp_13 = 151739274
		}
	ItemData["笼玉甲"]={
		wp_1 = "玉做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 85
		,wp_11 = "item.wdf"
		,wp_12 = 4176524624
		,wp_13 = 307625549
		}
	ItemData["嵌宝金甲"]={
		wp_1 = "金做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 95
		,wp_11 = "item.wdf"
		,wp_12 = 592200716
		,wp_13 = 4156302542
		}
	ItemData["玳瑁衣"]={
		wp_1 = "玳瑁做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 105
		,wp_11 = "item.wdf"
		,wp_12 = 1446992849
		,wp_13 = 371678350
		}
	ItemData["七星宝甲"]={
		wp_1 = "寒冰沂蒙精心为大家做的铠甲，戴上后可以秒天秒地秒空气"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 115
		,wp_11 = "item.wdf"
		,wp_12 = 1584383840
		,wp_13 = 1345840279
		}
	ItemData["缚龙甲"]={
		wp_1 = "龙筋做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 125
		,wp_11 = "item.wdf"
		,wp_12 = 67336897
		,wp_13 = 3490861079
		}
	ItemData["凤凰彩衣"]={
		wp_1 = "凤凰的羽毛做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 135
		,wp_11 = "item.wdf"
		,wp_12 = 3984235518
		,wp_13 = 3296343909
		}
	ItemData["织锦软褡"]={
		wp_1 = "锦做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 145
		,wp_11 = "item.wdf"
		,wp_12 = 3346981047
		,wp_13 = 1314867248
		}
	ItemData["冰蚕织甲"]={
		wp_1 = "冰蚕丝做的铠甲"
		,wp_2 = 2
		,wp_3 = 9
		,wp_4 = 1
		,wp_5 = 155
		,wp_11 = "item.wdf"
		,wp_12 = 524242583
		,wp_13 = 2617390472
		-- 新增灵饰耳环
		}
	ItemData["翠叶环"]={
		wp_1 = "以翠色欲滴的嫩叶为耳饰，似乎可见盎然春意。"
		,wp_2 = 2
		,wp_3 = 10
		,wp_4 = 1
		,wp_5 = 60
		,wp_11 = "item.wd1"
		,wp_12 = 0x447CB949
		,wp_13 = 0x841B1A0B
		}
	ItemData["明月珰"]={
		wp_1 = "珍珠如明月，盈盈有辉光；故名为明月珰。"
		,wp_2 = 2
		,wp_3 = 10
		,wp_4 = 1
		,wp_5 = 80
		,wp_11 = "item.wd1"
		,wp_12 = 0xD99DA265
		,wp_13 = 0xED4BFC24
		}
	ItemData["玉蝶翩"]={
		wp_1 = "彩蝶成双，翩然而舞；有双蝶偶然停驻于灵泉之畔，感其气息，化而为此玉饰。"
		,wp_2 = 2
		,wp_3 = 10
		,wp_4 = 1
		,wp_5 = 100
		,wp_11 = "item.wd1"
		,wp_12 = 0xDC6E80FB
		,wp_13 = 0x0890D479
		}
	ItemData["点星芒"]={
		wp_1 = "福禄寿三星以自身星芒点化而成的异石，紫芒莹然，贵不可言。"
		,wp_2 = 2
		,wp_3 = 10
		,wp_4 = 1
		,wp_5 = 120
		,wp_11 = "item.wd1"
		,wp_12 = 0x97353053
		,wp_13 = 0x718C161F
		}
	ItemData["凤羽流苏"]={
		wp_1 = "灵凤舞九霄，振翼遗金羽；仙人偶得，以火元培之、以仙气养之，又缀以流苏，成一耳饰。静心而听，有凤鸣隐隐，奏大道之声。"
		,wp_2 = 2
		,wp_3 = 10
		,wp_4 = 1
		,wp_5 = 140
		,wp_11 = "item.wd1"
		,wp_12 = 0x32534D07
		,wp_13 = 0xC855E37F
		}
	ItemData["焰云霞珠"]={
		wp_1 = "后羿射日，十去其九；三足金乌之血化为丹霞，灼烈而烧，火光冲天。许久之后，其血方凝为此珠，赤光熠然。"
		,wp_2 = 2
		,wp_3 = 10
		,wp_4 = 1
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0xED104336
		,wp_13 = 0xF36D99FC
		--新增灵饰配饰
		}
	ItemData["芝兰佩"]={
		wp_1 = "玉树芝兰生于其中，良才美质现于其外。"
		,wp_2 = 2
		,wp_3 = 11
		,wp_4 = 2
		,wp_5 = 60
		,wp_11 = "item.wd1"
		,wp_12 = 0xE07ABFDD
		,wp_13 = 0x0B70B0FC
		}
	ItemData["逸云佩"]={
		wp_1 = "飘逸如云，洒脱如风；君子之行也。"
		,wp_2 = 2
		,wp_3 = 11
		,wp_4 = 2
		,wp_5 = 80
		,wp_11 = "item.wd1"
		,wp_12 = 0x44B729A2
		,wp_13 = 0x8B0683BC
		}
	ItemData["莲音玦"]={
		wp_1 = "仙池清莲所化的玉玦，隐隐可闻其中仙音缭绕，长佩于身，有助修行。"
		,wp_2 = 2
		,wp_3 = 11
		,wp_4 = 2
		,wp_5 = 100
		,wp_11 = "item.wd1"
		,wp_12 = 0x09A1563F
		,wp_13 = 0x9AD70885
		}
	ItemData["相思染"]={
		wp_1 = "一寸相思一寸灰，牛郎织女分离之时滴落相思血泪，遇相思灰而化为鸳鸯之形，故名为“相思染”。"
		,wp_2 = 2
		,wp_3 = 11
		,wp_4 = 2
		,wp_5 = 120
		,wp_11 = "item.wd1"
		,wp_12 = 0x59D5C544
		,wp_13 = 0x3AB4C90B
		}
	ItemData["玄龙苍珀"]={
		wp_1 = "潜龙出世，纵情一啸，声震凌霄宝殿；玉帝罪之，命天将封其龙气入苍珀之中，以为惩罚；又将玄龙苍珀送入红尘，以待有缘人。"
		,wp_2 = 2
		,wp_3 = 11
		,wp_4 = 2
		,wp_5 = 140
		,wp_11 = "item.wd1"
		,wp_12 = 0x20FA6A66
		,wp_13 = 0x5E226429
		}
	ItemData["碧海青天"]={
		wp_1 = "鲲鹏破海而出，水浪滔天，排空怒卷；其化形之蜕则凝为一明玉，聚海中灵气而成奇宝，名曰“碧海青天”。"
		,wp_2 = 2
		,wp_3 = 11
		,wp_4 = 2
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0x91E363E8
		,wp_13 = 0xBB4BFFCB
		--新增灵饰戒指
		}
	ItemData["枫华戒"]={
		wp_1 = "以红枫饰于梧桐木上，炼以为戒。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 60
		,wp_11 = "item.wd1"
		,wp_12 = 0x8245870F
		,wp_13 = 0xBB24BAC3
		}
	ItemData["芙蓉戒"]={
		wp_1 = "涉江采芙蓉，饰于白玉之上，是为芙蓉戒。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 80
		,wp_11 = "item.wd1"
		,wp_12 = 0x9D1BB8EC
		,wp_13 = 0x4694CB26
		}
	ItemData["金麟绕"]={
		wp_1 = "金麒麟之影投于其上，使得此戒有护主之能，故名之“金麟绕”。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 100
		,wp_11 = "item.wd1"
		,wp_12 = 0x629A6E47
		,wp_13 = 0x33446FE4
		}
	ItemData["悦碧水"]={
		wp_1 = "智者乐水，观音于水边有所悟，故以佛力凝碧水以为戒。迎光观之，清波荡漾。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 120
		,wp_11 = "item.wd1"
		,wp_12 = 0x81A29179
		,wp_13 = 0x92E3D4EB
		}
	ItemData["九曜光华"]={
		wp_1 = "九曜星君为谢王母娘娘蟠桃会之请，特凝聚九曜光华，成此宝戒；戒中聚星辰之力，华彩耀目，仙气袅然。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 140
		,wp_11 = "item.wd1"
		,wp_12 = 0x3EC26F1F
		,wp_13 = 0x215BBE3E
		}
	ItemData["太虚渺云"]={
		wp_1 = "九霄云气飘渺无踪，自在逍遥；太上老君采撷七七四十九缕云气，以道法凝练九九八十一回，终成此戒，名为“太虚渺云”。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0x86693F55
		,wp_13 = 0xC416CB3D
		}
	ItemData["武神戒"]={
		wp_1 = "三界英雄受天命于武神坛决战邪灵蚩尤，共护三界平安；功成之时，三界善念聚为龙形，吐珠炼瑞，成此“武神戒”，以谢侠士壮举。"
		,wp_2 = 2
		,wp_3 = 12
		,wp_4 = 3
		,wp_5 = 140
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x4dc1acdc
		,wp_13 = 0x229e5e97
		--新增灵饰手镯
		}
	ItemData["香木镯"]={
		wp_1 = "楠木所制，可辟邪护身。"
		,wp_2 = 2
		,wp_3 = 13
		,wp_4 = 4
		,wp_5 = 60
		,wp_11 = "item.wd1"
		,wp_12 = 0x5B5A5A7B
		,wp_13 = 0xBA5B693B
		}
	ItemData["翡玉镯"]={
		wp_1 = "山灵水秀，方出璞石；翡玉镯以翡翠打造而成，自有光华。"
		,wp_2 = 2
		,wp_3 = 13
		,wp_4 = 4
		,wp_5 = 80
		,wp_11 = "item.wd1"
		,wp_12 = 0x59E948D9
		,wp_13 = 0x243475F0
		}
	ItemData["墨影扣"]={
		wp_1 = "仙人绘山水，留影玉石中；巧匠采墨影仙石制为手镯，形制奇巧，内蕴仙力。"
		,wp_2 = 2
		,wp_3 = 13
		,wp_4 = 4
		,wp_5 = 100
		,wp_11 = "item.wd1"
		,wp_12 = 0xFF46F65C
		,wp_13 = 0xCF27B111
		}
	ItemData["花映月"]={
		wp_1 = "嫦娥于广寒宫内观月照花、花映月，思念人间冷暖，故凝月华而成此手镯。"
		,wp_2 = 2
		,wp_3 = 13
		,wp_4 = 4
		,wp_5 = 120
		,wp_11 = "item.wd1"
		,wp_12 = 0x39BFA707
		,wp_13 = 0x9630B1CE
		}
	ItemData["金水菩提"]={
		wp_1 = "佛于西天观芸芸众生，有感于凡间诸般喜怒哀乐，故以纯净佛力凝为金水菩提，愿渡红尘之苦。佩戴此镯者，可得佛力为护，趋吉避凶。"
		,wp_2 = 2
		,wp_3 = 13
		,wp_4 = 4
		,wp_5 = 140
		,wp_11 = "item.wd1"
		,wp_12 = 0xD7A907DD
		,wp_13 = 0xCF3E45BF
		}
	ItemData["浮雪幻音"]={
		wp_1 = "混沌初开，天地生成；其时也，有初生霜雪自天而降。此雪遇混沌清气后凝而不化，成一奇物，静听则有天地玄音。"
		,wp_2 = 2
		,wp_3 = 13
		,wp_4 = 4
		,wp_5 = 160
		,wp_11 = "item.wd1"
		,wp_12 = 0xB2326701
		,wp_13 = 0xFB5EEB41--光环
		}
---------------------------------------新光环类-----------------------
ItemData["财源滚滚"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "财源滚滚小"
		,wp_13 = "财源滚滚大"
	    }
	ItemData["寒霜冰凌"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "寒霜冰凌小"
		,wp_13=  "寒霜冰凌大"
		}
	ItemData["金枝春绽"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "金枝春绽小"
		,wp_13 = "金枝春绽大"
	    }
	ItemData["九尾庞庞"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "九尾庞庞小"
		,wp_13 = "九尾庞庞大"
	    }
		ItemData["九霄云图"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "九霄云图小"
		,wp_13 = "九霄云图大"
	    }
		ItemData["浪淘沙墨黑"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "浪淘沙墨黑小"
		,wp_13 = "浪淘沙墨黑大"
	    }
		ItemData["浪淘沙月白"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "浪淘沙月白小"
		,wp_13 = "浪淘沙月白大"
	    }
		ItemData["凌霄天宫墨黑"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "凌霄天宫墨黑小"
		,wp_13 = "凌霄天宫墨黑大"
	    }
		ItemData["凌霄天宫"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "凌霄天宫小"
		,wp_13 = "凌霄天宫大"
	    }
		ItemData["凌霄天宫月白"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "凌霄天宫月白小"
		,wp_13 = "凌霄天宫月白大"
	    }
		ItemData["流云蝶影"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "流云蝶影小"
		,wp_13 = "流云蝶影大"
	    }
		ItemData["琪草瑶花"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "琪草瑶花小"
		,wp_13 = "琪草瑶花大"
	    }
		ItemData["琪花瑶草"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "琪花瑶草小"
		,wp_13 = "琪花瑶草大"
	    }
		ItemData["沙骨王座"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "沙骨王座小"
		,wp_13 = "沙骨王座大"
	    }
		ItemData["午夜魔蝠"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dl"
		,wp_12 = "午夜魔蝠小"
		,wp_13 = "午夜魔蝠大"
	    }
		ItemData["星驰剑阵染"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "星驰剑阵染小"
		,wp_13 = "星驰剑阵染大"
	    }
		ItemData["星驰剑阵"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "星驰剑阵小"
		,wp_13 = "星驰剑阵大"
	    }
		ItemData["月半潮墨黑"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "月半潮墨黑小"
		,wp_13 = "月半潮墨黑大"
	    }
		ItemData["月半潮"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "月半潮小"
		,wp_13 = "月半潮大"
	    }
		ItemData["月半潮月白"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "月半潮月白小"
		,wp_13 = "月半潮月白大"
	    }
		ItemData["云龙梦墨黑"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "云龙梦墨黑小"
		,wp_13 = "云龙梦墨黑大"
	    }
		ItemData["云龙梦"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "云龙梦小"
		,wp_13 = "云龙梦大"
	    }
		ItemData["云龙梦月白"]={
		wp_1 = "光环。"
		,wp_3 = 17
		,wp_2 = "光环"
		,wp_4 = 3
		,wp_5 = 0
		,wp_11 = "r3d.dll"
		,wp_12 = "云龙梦月白小"
		,wp_13 = "云龙梦月白大"
	    }
----------------------------------------------------------------------
	-- ItemData["雪花飘落"]={
	-- 	wp_1 = "白雪却嫌春色晚，故穿庭树作飞花。"
	-- 	,wp_2 = 2
	-- 	,wp_3 = 13
	-- 	,wp_4 = 4
	-- 	,wp_5 = 160
	-- 	,wp_11 = "item.wd1"
	-- 	,wp_12 = 0xC84F5C16
	-- 	,wp_13= 0x2C82140C
	-- 	}
	-- ItemData["星光熠熠"]={
	-- 	wp_1 = "天接云涛连晓雾，星河欲转千帆舞。"
	-- 	,wp_2 = 2
	-- 	,wp_3 = 13
	-- 	,wp_4 = 4
	-- 	,wp_5 = 160
	-- 	,wp_11 = "r3d.dll.wd1"
	-- 	,wp_12 = 0xC72D37F6
	-- 	,wp_13= 0xED812000
	-- 	}
	-- ItemData["祥云瑞气"]={
	-- 	wp_1 = "日日祥云瑞气连，侬家应作大神仙。"
	-- 	,wp_3 = 16
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_11 = "r3d.dll.wd1"
	-- 	,wp_12 = 0xC53E07A1
	-- 	,wp_13= 0x2251ED60
	-- 	}
	-- ItemData["荷塘涟漪"]={
	-- 	wp_1 = "池面风来波潋潋，波间露下叶田田。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0x9597FC1F
	-- 	,wp_13= 0x4906ED3E
	-- 	}
	-- ItemData["浩瀚星河"]={
	-- 	wp_1 = "天河夜转漂回星，银浦流云学水声。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0x4DEE1719
	-- 	,wp_13= 0x7DF7F4C3
	-- 	}
	-- ItemData["凌波微步"]={
	-- 	wp_1 = "体迅飞凫，飘忽若神。凌波微步，罗袜生尘。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xF2D53378
	-- 	,wp_13= 0x6E786275
	-- 	}
	-- ItemData["珠落玉盘"]={
	-- 	wp_1 = "嘈嘈切切错杂弹，大珠小珠落玉盘。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xDAE844A8
	-- 	,wp_13= 0x9134A488
	-- 	}
	-- ItemData["金沙海滩"]={
	-- 	wp_1 = "阳光、沙滩、浪花、珍珠贝，还有爱梦幻西游的你。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xFA746FBB
	-- 	,wp_13= 0x17158FCB
	-- 	}
	-- ItemData["双鲤寄情"]={
	-- 	wp_1 = "鸿雁在云鱼在水，惆怅此情难寄。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0x81E3D00A
	-- 	,wp_13= 0x48A7F40C
	-- 	}
	-- ItemData["花的海洋"]={
	-- 	wp_1 = "无意苦争春，一任群芳妒。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xCFC57A90
	-- 	,wp_13= 0xB7EB4982
	-- 	}
	-- ItemData["爱的光影"]={
	-- 	wp_1 = "爱心闪动，光影年华。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xD0508654
	-- 	,wp_13= 0xEE091938
	-- 	}
	-- ItemData["红叶随风"]={
	-- 	wp_1 = "晚风岸抚柳，看红叶，秋色染。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xFC70D40D
	-- 	,wp_13= 0x754B1AA6
	-- 	}
	-- ItemData["水墨游龙"]={
	-- 	wp_1 = "翩若惊鸿，婉若游龙。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0x3AA1A218
	-- 	,wp_13= 0x61053102
	-- 	}
	-- ItemData["烈焰澜翻"]={
	-- 	wp_1 = "烈焰澜翻为说时，百千诸佛尽攒眉。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0xB585CF35
	-- 	,wp_13= 0xFBBA047B
	-- 	}
	-- ItemData["桃花飞舞"]={
	-- 	wp_1 = "桃花流水窅然去，别有天地非人间。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0x81313138
	-- 	,wp_13= 0xA64E8031
	-- 	}
	-- ItemData["月影婆娑"]={
	-- 	wp_1 = "今人不见古时月，今月曾经照古人。"
	-- 	,wp_3 = 17
	-- 	,wp_2 = "光环"
	-- 	,wp_4 = 3
	-- 	,wp_5 = 0
	-- 	,wp_12 = 0x20864206
	-- 	,wp_13= 0xCBC9E90F--新锦衣
	-- 	}
	ItemData["从军行"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "男"
		,wp_11 = "r3d.dll"
		,wp_12 = "从军行小"
		,wp_13 = "从军行大"
		}
	ItemData["飞天舞"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "女"
		,wp_11 ="r3d.dll"
		,wp_12 ="飞天舞小"
		,wp_13 ="飞天舞大"
		}
	ItemData["花间梦"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "男"
		,wp_11 = "r3d.dll"
		,wp_12 = "花间梦小"
		,wp_13 = "花间梦大"
		}
	ItemData["鹿角弯弯"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "女"
		,wp_11 ="r3d.dll"
		,wp_12 ="鹿角弯弯小"
		,wp_13 ="鹿角弯弯大"
		}
	ItemData["青花瓷"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "男"
		,wp_11 ="r3d.dll"
		,wp_12 ="青花瓷小"
		,wp_13 ="青花瓷大"
		}
	ItemData["水云归"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "女"
		,wp_11 = "r3d.dll"
		,wp_12 = "水云归小"
		,wp_13 = "水云归大"
		}
	ItemData["羽仙歌"]={
		wp_1 = "锦衣。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "男"
		,wp_11 = "r3d.dll"
		,wp_12 = "羽仙歌小"
		,wp_13 = "羽仙歌大"
		}
	ItemData["渡劫"]={
		wp_1 = "渡劫后自动获取。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "男"
		,wp_11 = "r3d.dll"
		,wp_12 = "渡劫小"
		,wp_13 = "渡劫大"
		}
	ItemData["化圣"]={
		wp_1 = "化圣后自动获取。"
		,wp_2 = 2
		,wp_3 = 15
		,wp_4 = 1
		,wp_5 = 0
		--,wp_6 = "男"
		,wp_11 = "r3d.dll"
		,wp_12 = "化圣小"
		,wp_13 = "化圣大"
		}
	ItemData["甜蜜糖果"]={
		wp_1 = "甜蜜的糖果，满载着我对你的爱意。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x061EAC67
		,wp_13= 0x2F18CFD6
		}
	ItemData["皮球足迹"]={
		wp_1 = "你拍九，我拍九，我们爱玩小皮球。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xE49C886A
		,wp_13= 0x4A4BEAB6
		}
	ItemData["龙卷风足迹"]={
		wp_1 = "龙卷风来啦！大家都闪开，被刮跑了可不是玩的。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xD4A43063
		,wp_13= 0xDBD85DEE
		}
	ItemData["星光"]={
		wp_1 = "流星飞舞，炫彩照人，熠熠生辉。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x970E5222
		,wp_13= 0x081B19F9
		}
	ItemData["小心机"]={
		wp_1 = "小心机，小幸福，小感动~。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xC5828632
		,wp_13= 0x9F6FA0CA
		}
	ItemData["浮游水母"]={
		wp_1 = "这位深海的小精灵，带来了海洋的味道。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x9675928E
		,wp_13= 0x4F336856
		}
	ItemData["闪光足迹"]={
		wp_1 = "我贪恋凡世的喧嚣和明亮，享尽世俗的快乐和幸福。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x60028A69
		,wp_13= 0xB700C276
		}
	ItemData["糖果足迹"] = {
        wp_1 = "曳尾于洋中，出游从容，鱼之乐也。"
        , wp_3 = 18
        , wp_2 = "足迹"
        , wp_4 = 4
        , wp_5 = 0
        , wp_12 = 0xD0B4E713
        , wp_13 = 0xD9B8EE38
    }

	ItemData["跃动喷泉"]={
		wp_1 = "清泉喷涌，水花四溅，给这个夏日带来冰冰凉的舒爽。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x89E33B51
		,wp_13= 0x75B21ED7
		}
	ItemData["彩蝶飞"]={
		wp_1 = "踏访三界时，有翩翩飞舞的彩蝶作伴岂不乐哉！。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x23273029
		,wp_13= 0xBB5E367F
		}
	ItemData["锦鲤游"]={
		wp_1 = "有锦鲤相伴守护，想必一定会有好事发生的"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xFE5A817B
		,wp_13= 0xA377F990
		}
	ItemData["雷电足迹"]={
		wp_1 = "乌云盖顶，电闪雷鸣，行走间如风似电，游走江湖，叱咤风云。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x175DFADE
		,wp_13= 0x4C8EC763
		}
	ItemData["旋律足迹"]={
		wp_1 = "喜欢音乐的人就像我一样，身边总是飘着美好的旋律。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xF5222129
		,wp_13= 0xFBB15C62
		}
	ItemData["踩浪花"]={
		wp_1 = "踩呀踩，踩出浪花一朵朵~。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x2DD8208B
		,wp_13= 0xD1F59181
		}
	ItemData["藤蔓蔓延"]={
		wp_1 = "藤蔓蔓延，一路行走，花草丛生。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x3CE48D1B
		,wp_13= 0xEDFAE4DB
		}
	ItemData["飞天足迹"]={
		wp_1 = "说经已，结跏趺坐。是时提婆蹁跹，天雨曼陀罗华、曼殊沙华。是谓“六欲诸天来供养，天华乱坠遍虚空。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x62004D54
		,wp_13= 0x9A713775
		}
	ItemData["枫叶足迹"]={
		wp_1 = "谁说秋天才有落叶？风吹渭水，落叶满长安。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x87554666
		,wp_13= 0x9AFF9EB5
		}
	ItemData["随风舞"]={
		wp_1 = "风乍起，一株小小蒲公英的种子随之飘舞纷飞。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xA6121A6C
		,wp_13= 0xE8EBA4B2
		}
	ItemData["爱的风暴"]={
		wp_1 = "所到之处，刮起爱的龙卷风"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x384E4B51
		,wp_13= 0x80285EE6
		}
	ItemData["落羽"]={
		wp_1 = "轻柔的羽毛飘落，洒落一地。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x6BAF53E2
		,wp_13= 0x3592F6F6
		}
	ItemData["星如雨"]={
		wp_1 = "掩轩辕，星落如雨~可别忘记许愿哦~。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xCB847768
		,wp_13= 0x94E86880
		}
	ItemData["璀璨足迹"]={
		wp_1 = "自由自在飞向天空，闪烁着璀璨光芒的美丽心灵。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x204E056F
		,wp_13= 0xB6014FED
		}
	ItemData["璀璨烟花"]={
		wp_1 = "火树银花合，星桥铁锁开。烟花璀璨，照亮身后。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x10D4375C
		,wp_13= 0x2AE56949
		}
	ItemData["飞雪足迹"]={
		wp_1 = "雪花飘，雪花飞。飘扬起的雪花，落在身上，晶莹而美丽。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x6682251F
		,wp_13= 0x4F7B9FCB
		}
	ItemData["蝴蝶足迹"]={
		wp_1 = "泡了个花瓣澡身体好香，蝴蝶都飞来围着我转。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xD1081A5B
		,wp_13= 0x10C6A5DC
		}
	ItemData["星光泡泡"]={
		wp_1 = "漫天飞舞着的泡泡晶莹剔透，闪烁着淡淡星光。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xD0B4E713
		,wp_13= 0xD0B4E713
		}
	ItemData["鱼群足迹"]={
		wp_1 = "曳尾于洋中，出游从容，鱼之乐也。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0xD0B4E713
		,wp_13= 0xD9B8EE38
		}
	ItemData["心享气球"]={
		wp_1 = "盈盈气球，浓浓心意，飘飘风中，怡然自乐。"
		,wp_3 = 18
		,wp_2 = "足迹"
		,wp_4 = 4
		,wp_5 = 0
		,wp_12 = 0x3AE30D30
		,wp_13= 0x50634330
		-----神器
		}
	ItemData["鸿蒙石"]={
		wp_1 = "盘古破鸿蒙，清浊之气分化，乃成鸿蒙石。千万年来，此石蕴藉天地灵气，终孕生一九窍石猴。得此石者，可尽收天地灵明之能。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x10000021
		,wp_13 = 0x10000022
		}
	ItemData["轩辕剑"]={
		wp_1 = "黄帝采首山之铜铸此剑，以天文古字铭之，蕴腾龙之魂，光若屈阳之华，寄天地之神，气有顺天之义。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0060
		,wp_13 = 0x01AC0061
		}
	ItemData["墨魂笔"]={
		wp_1 = "挥亳洒落，探玄为奇，墨骨为魂，浓淡由他。此笔蕴浩然之气，绘万物，赋其魂。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0064
		,wp_13 = 0x01AC0065
		}
	ItemData["泪痕碗"]={
		wp_1 = "忽梦少年时，不语泪潸然。瑾瑜之玉为盏，嵌鲛珠，可贮世间女儿之泪。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0066
		,wp_13 = 0x01AC0067
		}
	ItemData["黄金甲"]={
		wp_1 = "黄金甲胄，三界至坚者。披此金甲者，刀枪不入，志固而愈勇。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0062
		,wp_13 = 0x01AC0063
		}
	ItemData["独弦琴"]={
		wp_1 = "凤栖于桐，鸣而为歌。伏羲削此桐为琴，其形法天象地，曾有七弦，作宫商角徵之音，可动喜怒悲欣之情。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0080
		,wp_13 = 0x01AC0081
		}
	ItemData["华光玉"]={
		wp_1 = "昔时，女娲补天于高山之巅，遗五色之玉，润而有光，华彩淞淞，有修复万物之能。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0086
		,wp_13 = 0x01AC0087
		}
	ItemData["清泽谱"]={
		wp_1 = "沧浪激石，泠泠作响，声成韵，录其谱。应龙乘风来去，云雾瀚然而从，啸而为歌，兴风雨而净万物。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0082
		,wp_13 = 0x01AC0083
		}
	ItemData["星斗盘"]={
		wp_1 = "星移斗转，瀚海灿灿，天而为相，地则成形。颛顼以星斗为棋，司生司杀。星斗之盘，可参天机。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0084
		,wp_13 = 0x01AC0085
		}
	ItemData["噬魂齿"]={
		wp_1 = "昆仑之渊有异兽，顽嚣不友，好行凶德。陆吾杀之，禁其魂于其齿，锐不可当。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0074
		,wp_13 = 0x01AC0075
		}
	ItemData["明火珠"]={
		wp_1 = "煌煌天火，巨焰如帜。祝融以气化珠，珠内藏天火之焰,焚尽魍魉魑魅,明光可照天地。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0072
		,wp_13 = 0x01AC0073
		}
	ItemData["四神鼎"]={
		wp_1 = "禺强以鼎为祀，祭天地，祷众生，纳四海怨怼，佑三界平靖。然恶业无尽，此鼎化为至阴至煞之器。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0070
		,wp_13 = 0x01AC0071
		}
	ItemData["昆仑镜"]={
		wp_1 = "镜者，景也，风后登昆仑之丘，取山中金石以为镜，望而无尽，隐而见影，有影照回忆之能。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0076
		,wp_13 = 0x01AC0077
		}
	ItemData["玲珑结"]={
		wp_1 = "一丝一扣系相思，玲球心意知不螺祖亲桑，抽丝编绢成此结，缠绵情意，令人心驰神往，于不觉间掌控人心。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0078
		,wp_13 = 0x01AC0079
		}
	ItemData["天罡印"]={
		wp_1 = "风翻云起，震荡乾坤，天罡一出，四海宾服。崔尤行兵所持之印，王霸之气俨然，有号令天下之能。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0088
		,wp_13 = 0x01AC0089
		}
	ItemData["月光草"]={
		wp_1 = "神木之巅有草，其影亭亭，翩然有凌波之态，其叶葳蕤，皎皎若月华之色。此草乃句芒手植，蕴皓月清辉，可治百病。"
		,wp_2 = 1001
		,wp_3 = 99
		,wp_11 = "Resource.ft"
		,wp_12 = 0x01AC0068
		,wp_13 = 0x01AC0069
		-----神器
		-- 法宝
		--法宝3法宝等级  法宝4法宝分类 法宝5法宝被动主动 法宝6佩戴等级 法宝7CD回合 法宝8持续回合
		--法宝分类 = {"恢复","辅助","防御","攻击","诅咒"}
		}
	ItemData["碧玉葫芦"]={
		wp_1 = "华佗悬壶济世时所带的翡翠葫芦，此宝长期跟随华佗行医，也深谙医术。佩戴此宝会增加师门法术回复的气血。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x60523FF1
		,wp_13 = 0x7669E147
		}
	ItemData["飞剑"]={
		wp_1 = "此飞剑可以从千里之外出击，取敌人首级如探囊取物，精准的袭击令人瞪目，佩戴飞剑可以增加人物命中。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x1C7633D1
		,wp_13 = 0xBC2FAF63
		}
	ItemData["拭剑石"]={
		wp_1 = "以石拭剑，可以厉其锋，此乃蜀山上千百仙剑拭剑之石，佩戴此石可增加人物伤害。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xF95F660F
		,wp_13 = 0xF37BA20D
		}
	ItemData["金甲仙衣"]={
		wp_1 = "拥有神奇效果的道家仙衣，穿上它在战斗中承受物理攻击时候可能出现天兵保护。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 3
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x081E1FF5
		,wp_13 = 0x0BDFD09C
		}
	ItemData["金钱镖"]={
		wp_1 = "财神爷的看家宝贝，散出千枚铜钱伤人，如果碰上不为金钱所动的人就没有办法了。每次使用消耗当前金钱2000。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 4
		,wp_5 = 1
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x3D9C84A5
		,wp_13 = 0xC876D78A
		}
	ItemData["五色旗盒"]={
		wp_1 = "昔日唐王拜将，天将五色旗勤兵。臣民以为祥瑞。丞相乃进五色旗盒，以盛锦旗。江湖素有能人巧士，依样画葫芦得到此宝，为行囊便利之用。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 2
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x2FC44068
		,wp_13 = 0x5D2FF1BC
		}
	ItemData["惊魂铃"]={
		wp_1 = "铃声长鸣，闻者胆战心惊。战斗中摇晃可以恐吓敌方召唤兽，使其丧失斗志试图逃离战场。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 60
		,wp_7 = 5
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xEAA6AD2E
		,wp_13 = 0x450BE7E8
		}
	ItemData["嗜血幡"]={
		wp_1 = "暗红色的布幡，散发着血腥嗜杀的气息，拥有此旗在物理攻击时有一定几率额外多攻击一个目标。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 4
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD92DF835
		,wp_13 = 0x50997E59
		}
	ItemData["风袋"]={
		wp_1 = "风婆系在腰间装风的布袋，放出风来可吹人至数里外，佩上此袋可增加人物速度。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x9968555F
		,wp_13 = 0x59E58E52
		}
	ItemData["清心咒"]={
		wp_1 = "佛门经文，在心中默念三遍可不受外界干扰，清心自如，使用后可解除因法宝而带来的异常效果。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0xCC7D6870
		,wp_13 = 0xA284A058
		}
	ItemData["缚妖索"]={
		wp_1 = "天师的法宝。无需佩戴,在战斗中祭起后可将目标牢牢捆缚住,使其的逃跑成功率降低。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 60
		,wp_7 = 5
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x2320b82f
		,wp_13 = 0x335299ff
		}
	ItemData["捆仙绳"]={
		wp_1 = "天庭法宝,专为缉享神仙所制,材料不知为何物,柔韧结实。旦被捆则降低目标的逃跑成功率。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 5
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x2320b82f
		,wp_13 = 0x335299ff
		}
	ItemData["缚龙索"]={
		wp_1 = "此索就箅八部天龙被缚也难以逃脱,一般人被捆缚住后,逃跑成功率大幅度降低,只有乖乖被擒"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x2320b82f
		,wp_13 = 0x335299ff
		}
	ItemData["九黎战鼓"]={
		wp_1 = "九黎氏族用蛮兽之皮所制的战鼓，佩戴此法宝可以在战斗中增加召唤兽的攻击力。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 4
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xAA69D61E
		,wp_13 = 0xB4FA2E7D
		}
	ItemData["盘龙壁"]={
		wp_1 = "以恶龙之骨制成的饰品，佩带此宝可以在战斗中增加召唤兽的防御。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 3
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x54C9A8DC
		,wp_13 = 0xC7F67DF4
		}
	ItemData["神行飞剑"]={
		wp_1 = "玄铁打造的雌雄飞剑，佩戴此法宝可以在战斗中增加召唤兽的速度。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x5F80A13D
		,wp_13 = 0x9F57F723
		}
	ItemData["汇灵盏"]={
		wp_1 = "凌霄宝殿内的宫灯，佩戴此法宝可以在战斗中增加召唤兽的灵力。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x82982E6B
		,wp_13 = 0x513D3054
		}
	ItemData["天师符"]={
		wp_1 = "神奇的符纸，上面记载着张天师的秘传制符心法，是方寸山的不传之秘，佩戴此符的方寸山弟子将拥有更强大的符咒操控能力。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x44CA233C
		,wp_13 = 0xA5310A75
		}
	ItemData["织女扇"]={
		wp_1 = "女儿村特有的羽扇，以织女而得名。佩戴后可以提升女儿村的封印能力。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x6EA31DE4
		,wp_13 = 0xD3F4F8DB
		}
	ItemData["雷兽"]={
		wp_1 = "李天王为门下弟子专门炼制的宝贝,为五雷之精餽,祭起时夹风雷之势,天旋地转飞沙走石。佩带此物的天宫弟子使用乾坤塔时更为得心应手,同时拥有对封系法术的抗性。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x33768EB0
		,wp_13 = 0xA204F1F0
		}
	ItemData["迷魂灯"]={
		wp_1 = "冰冰姑娘的独门法宝,据说这灯是用百只狐妖的眼神为芯,佩带在身上散发着摄人心魂的灯光。佩带此灯的盘丝洞弟子将提高迷惑敌人的效果,同时拥有对封系法术的抗性。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xAAC25649
		,wp_13 = 0x6EB0B809
		}
	ItemData["定风珠"]={
		wp_1 = "镇元大仙修炼多年的宝贝,拥有摄人的威力,佩带此珠的五庄观弟子对乾坤袖的使用更加纯熟,同时拥有对封系法术的抗性。"
		,wp_2 = 1000
		,wp_3 = 1
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x49D1AE82
		,wp_13 = 0x62DBF406
		}
	ItemData["幽灵珠"]={
		wp_1 = "增加1级阴风绝章技能(8层时可加2级)，提高抗封能力(水属性满层抗封几率5%)"
		,wp_2 = 1000 -- 总类
		,wp_3 = 1 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 60 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 2433556242
		,wp_13 = 632372372
		-- 二级法宝
		}
	ItemData["玄冰面具"]={
		wp_1 = "戴上这个面具,面容就像千年寒冰下的湖水,谁也不知道是什么样子,拥有者可以在战斗中使用变身卡变幻身份。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x2A0DD83C
		,wp_13 = 0xC1D43099
		}
	ItemData["降魔斗篷"]={
		wp_1 = "战斗中遭受法术攻击的时候有一定几率出现神兵现身保护，随着境界提升增加被保护的几率。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 3
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x8F0E6273
		,wp_13 = 0xC1B54E00
		}
	ItemData["附灵玉"]={
		wp_1 = "雪山颠峰中挖拥岀的宝玉,蕴藏着千年灵气,佩带后可以提升自己的灵力。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 60
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x5C571B45
		,wp_13 = 0x7F16538C
		}
	ItemData["现形符"]={
		wp_1 = "无论对方如何变幻形体,用此符都有可能将其识破。无需佩戴,在战斗中主动对对方使用,有一定几率解除目标变身效果。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 60
		,wp_7 = 5
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x86AF33D1
		,wp_13 = 0x6FE3C110
		}
	ItemData["发瘟匣"]={
		wp_1 = "五瘟正神的密保，匣内盛满着发瘟蛊，一旦开启能使目标晕头转向，无法使用法术并且攻击失误。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 5
		,wp_8 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x5F0D2E50
		,wp_13 = 0x780299ED
		}
	ItemData["断线木偶"]={
		wp_1 = "桃木作的人形玩偶，上面雕刻着古怪的符文，会吸引召唤兽对它进行攻击。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 3
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 5
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xA9A08E99
		,wp_13 = 0x812181A6
		}
	ItemData["五彩娃娃"]={
		wp_1 = "衣着五彩，色泽鲜美的布娃娃，战斗中会替主人承受一定的伤害。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 6
		,wp_8 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x5C86CDBC
		,wp_13 = 0xEFDC64D0
		}
	ItemData["番天印"]={
		wp_1 = "广成子修炼的独门宝贝,硒中后能使人神志不清,三魂出窍,失去对法宝的控制。无需佩戴,战斗中祭起后有一定几率使目标身上佩带的被动法宝4回合内失去作用。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 3
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xb33784e0
		,wp_13 = 0x8b590810
		}
	ItemData["七杀"]={
		wp_1 = "勘破人间仁与义，七杀下凡啸腥风。此宝为五斗星君的饰物，战斗祭起后战意漫天，令对手丧失斗志，毫无招架之力。战斗中使用后三回合内降低目标防御，效果无法叠加。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 0
		,wp_8 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x1715E7DE
		,wp_13 = 0x3AE1FD6A
		}
	ItemData["罗汉珠"]={
		wp_1 = "以肉身所化舍利制成的手链,为佛祖赠予目犍连之宝,拥有此宝者可达到杀贼、应供、无生之境界。战斗中祭起后的下三回合内拥有者所使用的门派法术魔法消耗减少,无需佩戴。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x14846B1B
		,wp_13 = 0x695614DB
		}
	ItemData["分水"]={
		wp_1 = "以水为盾,可以护体。此宝为西海龙女佩带之物,祭起后遭受攻击时一定几率将伤害转化为气血是龙宫秘宝,无需佩戴。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 3
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xD330F6C9
		,wp_13 = 0xF1CF0FC1
		}
	ItemData["赤焰"]={
		wp_1 = "此物乃牛魔王与铁扇公主定情之时赠送给娘子的宝贝,使用此宝能在三回合内回复魔法。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 5
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x743685D8
		,wp_13 = 0x62AEC7E3
		}
	ItemData["金刚杵"]={
		wp_1 = "佛门利器，可断除烦恼、除恶魔，代表佛智、空性、真如与智慧。佩戴后可以提升对五行之术的掌握，使五行法术的伤害增加。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 4
		,wp_5 = 0
		,wp_6 = 80
		,wp_7 = 0
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x6F9B0510
		,wp_13 = 0x3E968F47
		}
	ItemData["兽王令"]={
		wp_1 = "玉麒麟甲制成的令牌，经青毛狮以妖力修炼，拥有号令百兽的威力。佩戴此物战斗中所有召唤兽能力都得到提升。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 80
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x6D4DD526
		,wp_13 = 0xF3F163D2
		}
	ItemData["摄魂"]={
		wp_1 = "阎王要你三更死，谁敢留人过五更。此物为黄泉中至阴之物，专门摄取生魂，通常勾魂使者才能携带。祭起后使目标失魂落魄，失去生气，三回合内承受的伤害增加。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 80
		,wp_7 = 0
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xBDD4BF97
		,wp_13 = 0xAFF8536F
		}
	ItemData["琉璃灯"]={
		wp_1 = "燃灯古佛借予孙悟空之宝灯，据说此灯恒燃不灭，可照彻过去、现在、未来三世。拥有者可见天地洞明，对方弱点尽在眼中，从而提升自身物理暴击能力。"
		,wp_2 = 1000
		,wp_3 = 2
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 80
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "aaa.wdf"
		,wp_12 = 0x11100011
		,wp_13 = 0x11100011

		--三级法宝
		}
	ItemData["鬼泣"]={
		wp_1 = "在十八层地狱深处锻造之铃，吸收地府冤怨之气，摇之如闻听百鬼魂群号，可震慑敌方召唤兽，使其丧失斗志试图逃离战场。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xF600EEBC
		,wp_13 = 0xEAF4BEB0
		}
	ItemData["照妖镜"]={
		wp_1 = "此镜一出,妖魔鬼怪无处通形。无需佩戴,在战斗中主动对对方使用,有很大几率识破对方的幻化效果。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xA4E6ECB0
		,wp_13 = 0x9F83D4D7
		}
	ItemData["月光宝盒"]={
		wp_1 = "神奇的宝盒，可以前去500年，后回500年。对着月光念出咒语，你就可以到达想去的地方。可以在任意地点定下标记，在非战斗中使用直接到达。半小时限使用一次。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 2
		,wp_6 = 100
		,wp_7 = 3
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x95DC9FE9
		,wp_13 = 0x10ADFCD8
		}
	ItemData["缩地尺"]={
		wp_1 = "某个神仙制造的逃跑工具，战斗中使用后可以迅速离开战斗逃至其他地方，有可能逃跑失败哟。\n#C门派限制：#R无"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 3
		,wp_8 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x58C421DC
		,wp_13 = 0x8C891F83
		}
	ItemData["影蛊"]={
		wp_1 = "苗疆的奇特宝贝,只要在敌人的影子里投放蛊虫,就可以在一段时间内获知他所在的位置,非战斗中使用,无需佩戴。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 2
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x63E46E78
		,wp_13 = 2781675225
		}
	ItemData["混元伞"]={
		wp_1 = "多闻天王的巨伞，撑起后可遮天蔽日。它能随机将自己承受的部分伤害反弹给对方单个成员。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x7729A9E5
		,wp_13 = 0x4110011C
		}
	ItemData["落宝金钱"]={
		wp_1 = "金钱过处,法宝落地。它可以将法宝击落,取消目标主动法宝所增加的临时效果,是战场上强有力的威胁,无需佩戴,需要在战斗中主动使用。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x1E296612
		,wp_13 = 0x32003A2B
		}
	ItemData["无魂傀儡"]={
		wp_1 = "眼神涣散、毫无生机的傀儡，他们的魂魄已经消失，只有机械的吸引目标对其发起攻击。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x05896BCC
		,wp_13 = 0x32F92F8A
		}
	ItemData["苍白纸人"]={
		wp_1 = "符纸制成的纸人，看起来单薄羸弱，在主人受到伤害时会自动现身护主。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 6
		,wp_8 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0xB91E0707
		,wp_13 = 0x46EC6216
		}
	ItemData["乾坤玄火塔"]={
		wp_1 = "托塔天王的另一件宝贝，祭起后可增加斗志与杀气，使勇者更勇。使用后可以在一定回合内增加愤怒值。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 10
		,wp_8 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0xF5601CC2
		,wp_13 = 0x1824AF14
		}
	ItemData["无尘扇"]={
		wp_1 = "不沾染尘世间恩怨的扇子，可以使人心情大悦。在战斗中祭起后可以在一定回合内减少对目标的愤怒。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 10
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xA1224711
		,wp_13 = 0x9F92A376
		}
	ItemData["七宝玲珑灯"]={
		wp_1 = "佛门至宝,佛祖当年以大雷音寺内玉池内白莲所制,携带此宝者气定神闲,不受七情六欲之苦。此灯一旦佩带,战斗中每回合自动对拥有法宝异常状态的成员进行解除,有一定几率解除状态失"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x6099C4D3
		,wp_13 = 0x10B360A3
		}
	ItemData["无字经"]={
		wp_1 = "无字无画的经书，据说只有开启天眼之人才可以看到竹简上的文字。战斗中祭起经书有很高几率使目标丧失心神，无法使用主动法宝。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x7E0AC2BC
		,wp_13 = 0x83A634D9
		}
	ItemData["干将莫邪"]={
		wp_1 = "采五山之精铁，六合之金英，七七四十九日以身赴铜水，血凝剑气而成，削金如泥，吹毛得过，佩带在身上就已剑气横溢，令人心生怯意。战斗中祭起后杀气冲天，三回合内法宝携带者增加极高的伤害。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 5
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B5B81EF
		,wp_13 = 0x5723DCC0
		}
	ItemData["慈悲"]={
		wp_1 = "佛门之人慈悲为怀，有普度救世之心，因而得名以广佛门善心。佩带后可以提升恢复效果。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xA68AB260
		,wp_13 = 0x880E0979
		}
	ItemData["曼陀罗"]={
		wp_1 = "精巧的银制匣子,内藏百花之毒，是女儿村的镇山法宝,佩带此宝的女儿村弟子通过师门技能或者暗器使目标中毒后受到的伤害增加。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x9E4D4D2A
		,wp_13 = 0x546D7271
		}
	ItemData["救命毫毛"]={
		wp_1 = "当年观音大士赠予孙悟空取经路上救急之用的宝贝，孙悟空修成正果后把此宝转增方寸山弟子，佩带毫毛在战斗中死亡后每回合有一定几率复活，每场战斗最多允许复活三次。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xCD4EA3D4
		,wp_13 = 0xE95997AD
		}
	ItemData["伏魔天书"]={
		wp_1 = "上面记载着降魔伏妖的秘法，可以大幅度提升天宫弟子的法术威力。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x36E1F4B7
		,wp_13 = 0x00A48670
		}
	ItemData["普渡"]={
		wp_1 = "观音大士流传下的至宝，佩戴此法宝后在战斗中使用普渡众生法术时有一定几率额外增加一个目标。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 3 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 100 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	-- 持续回合
		,wp_11 = "item.wdf"
		,wp_12 = 0xF4E2C1E9
		,wp_13 = 0x1F73D09F
		}
	ItemData["镇海珠"]={
		wp_1 = "以大禹治水时的石尺炼化而成，祭起此珠再大的风浪都要平息。佩戴此法宝的龙宫弟子可以领会本门神通的精髓，使自己的法术在战斗中发挥更大的威力。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 4
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x9FB5513B
		,wp_13 = 0xE73D5164
		}
	ItemData["奇门五行令"]={
		wp_1 = "镇元大仙的信物，可号令九州土地，其本身还有特殊的功效，战斗中祭起一定几率使目标两回合内神志不清，法术攻击失去准头。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 3
		,wp_5 = 1
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x3463ADAD
		,wp_13 = 0x85774C73
		}
	ItemData["失心钹"]={
		wp_1 = "以玄铁为材料，在畜生道中历练千年的霸道妖器。祭起后鬼哭狼嚎，可减少自身所收到的召唤兽伤害。"
		,wp_2 = 1000 -- 类型
		,wp_3 = 3 -- 等级
		,wp_4 = 5
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xA2FE6F68
		,wp_13 = 0xFAB633D8
		}
	ItemData["五火神焰印"]={
		wp_1 = "一祭风沙起,再祭烈火燃,三祭浓烟蔽日。红孩儿以内丹在离火内修炼数百年的印章,以龙子狻猊为印饰。佩带此宝能增加“神焰”的几率。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 2
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x2890FFA9
		,wp_13 = 0xC36E1F99
		}
	ItemData["九幽"]={
		wp_1 = "孟婆的茶盏，沉淀着每个鬼魂投胎转世前的怨恨与无奈，其怨之深，其恨之毒，天下无双。此物佩戴者在战斗中可通过尸腐毒造成的伤害为本方玩家成员治疗当前气血，包括持续伤害。每人每回合气血回复血量最多不超过等级*3。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 1
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x7E21AF3F
		,wp_13 = 0xB47273A0
		}
	ItemData["忘情"]={
		wp_1 = "永远有多远,拿一世来衡量。我许你三生三世,你给我一点惆怅。此扇为冰冰姑娘之物,佩带者能感受到她已经忘却的情伤,佩带后可以在使用盘丝洞封系法术可以使目标身中情毒,受到的治疗效果下降。"
		,wp_2 = 1000
		,wp_3 = 3
		,wp_4 = 5
		,wp_5 = 0
		,wp_6 = 100
		,wp_7 = 1
		,wp_8 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xB7113AA0
		,wp_13 = 0xB664DE8F
		}
	ItemData["月影"]={
		wp_1 = "此物为冬夜极寒之时，神木林祭师亲自前往神木之顶采集残月之月华凝结而成。佩戴此法宝可增加法术攻击的连击率。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 3 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 100 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	-- 持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xDBDE982D
		,wp_13 = 0x365A8D06
		}
	ItemData["神木宝鼎"]={
		wp_1 = "神木林祭师祭天地所用之物。在战斗中祭起此鼎临时提升增加三回合内大量法术伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 2 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 80 -- 等级
		,wp_7 = 3 --回合限制
		,wp_8 = 3 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x93A0FC49
		,wp_13 = 0xF07197ED
		}
	ItemData["斩魔"]={
		wp_1 = "物理攻击时额外增加物理伤害结果。随法宝等级提升而提升。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 3 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 100 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xB941589C
		,wp_13 = 0x5760394B
		}
	ItemData["金箍棒"]={
		wp_1 = "本是大禹治水时传下的定海神针、后被花果山孙悟空取走，成为齐天大圣的随身兵器。佩戴者可以使花果山法术造成的部分伤害转化为伤势。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 3 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 100 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "aaa.wdf"
		,wp_12 = 0xA0000003
		,wp_13 = 0xA0000004
		}
	ItemData["天煞"]={
		wp_1 = "每回合恢复魔法值，持续3回合，满层的情况下在法宝回合结束时恢复1点战意值。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 2 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 80 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 3 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x690B67CD
		,wp_13 = 0xE498691F
		}
	ItemData["金蟾"]={
		wp_1 = "祭起妖风傀儡承受与启用者同样的伤害；妖风傀儡最多存在2回合；当妖风傀儡被击飞时，本方队伍所有成员获得妖风傀儡最大气血值一定比例的气血。回复效果随法宝等级提升而提升"
		,wp_2 = 1000 -- 总类
		,wp_3 = 3 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 100 -- 等级
		,wp_7 = 5 --回合限制
		,wp_8 = 2 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xA4727B32
		,wp_13 = 0xA0BCD809
		}
	ItemData["宝烛"]={  -- 没有素材
		wp_1 = "当佩戴者当前气血小于气血最大值的70%时，每回合回复一定的当前气血。效果随法宝等级提升而提升。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 2 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 80 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x044A3417
		,wp_13 = 0x14A6F162
		-- 四级法宝
		}
	ItemData["重明战鼓"]={
		wp_1 = "重明鸟灵所化之战鼓，击之可激扬士气，倍增勇武。佩戴此法宝，可大大提升召唤兽物理伤害和法术伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 2 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x6FA9F9B4
		,wp_13 = 0x6FA9F9B4
		}
	ItemData["梦云幻甲"]={
		wp_1 = "以九天云雾炼制而成的宝甲，轻若无物，如梦似幻，令人目眩神迷。佩戴此法宝，可大大提升召唤兽的物理防御和法术防御。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xA44B6E61
		,wp_13 = 0x09699BC2
		}
	ItemData["河图洛书"]={
		wp_1 = "蕴含易理天地灵宝，透出一股玄奥之感。佩戴此法宝，可大大提升封印命中率和抵抗封印命中率。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xFED28065
		,wp_13 = 0xAFCC206F
		}
	ItemData["炽焰丹珠"]={
		wp_1 = "集人间怒火而成一朵怒焰，再将其炼为丹珠而成的法宝。佩戴此法宝，人物倒地时可保留一定的愤怒值，每场战斗起效3次。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x994F899E
		,wp_13 = 0x11E0DBD5
		}
	ItemData["翡翠芝兰"]={
		wp_1 = "人物倒地时，回复全体队友一定量的魔法。每场战斗最多起效3次"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3D429B7E
		,wp_13 = 0xD7784202
		}
	ItemData["太虚玉液"]={
		wp_1 = "人物倒地时，回复全体队友一定量的气血。每场战斗最多起效3次"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xDECEE2CB
		,wp_13 = 0x20A09432
		}
	ItemData["蟠龙玉璧"]={
		wp_1 = "金色蟠龙所化的玉璧，能自行以龙气护主，佩戴此法宝，受到物理攻击或法术攻击时，一定几率免疫部分伤害，不能与金甲仙玉、降魔斗篷同时佩戴。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 10 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x08BB5755
		,wp_13 = 0x3078DDD7
		}
	ItemData["九梵清莲"]={
		wp_1 = "如来座前生长千年的白莲，因长年浸润圣佛之气而成为了一件法宝。受到召唤兽物理攻击时，一定几率减免部分伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 3
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 15 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x61A6A410
		,wp_13 = 0xF12459F6
		}
	ItemData["苍灵雪羽"]={
		wp_1 = "苍鸾灵气所化成的一片雪羽，有日月光华聚于其上。主动使用此法宝，在当前回合提升全体友方单位的法术伤害结果，并降低全体友方单位的法术防御效果。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 8 --回合限制
		,wp_8 = 1 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xED26751B
		,wp_13 = 0x8639741F
		}
	ItemData["烽火狼烟"]={
		wp_1 = "凝人间杀气、煞气而成的凶物，因战而生，为战而死。主动使用此法宝，在当前回合提升全体友方单位的物理伤害效果，并降低全体友方单位的物理防御效果。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 8 --回合限制
		,wp_8 = 1 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xA996541F
		,wp_13 = 0xB7485B10
		}
	ItemData["舞雪冰蝶"]={
		wp_1 = "降低目标物理攻击时的命中率，持续3回合，冷却回合5回合"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 5
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 5 --回合限制
		,wp_8 = 3 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xFBCFDC2F
		,wp_13 = 0x1ECCABDB
		}
	ItemData["紫火如意"]={
		wp_1 = "对目标召唤兽使用后，造成一定伤害，如果此次攻击成功击飞目标，则回复自身一定气血"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 5 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xC75A72E3
		,wp_13 = 0x88221E08
		}
	ItemData["凌波仙符"]={
		wp_1 = "聚清风为气，锁流云为形，能使人进入战斗状态，神行千里，凌波飞渡。佩戴此法宝，在强烈的战斗欲望驱使下，使得人物速度大大提升。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x14577FB6
		,wp_13 = 0x6B665BCC
		}
	ItemData["归元圣印"]={
		wp_1 = "圣气非凡的一方小印，上书《楞严经》全篇，可助人明心见性，证道菩提。佩戴此法宝，可大幅提升治疗量。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 1
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xEC524D4A
		,wp_13 = 0x127A05ED
		}
	ItemData["落星飞鸿"]={
		wp_1 = "云霄之上有飞鸿，掠影落星下九重。传说中的神物，佩带后可让人在战斗时借用九天星辰之力。佩戴此法宝，进入战斗时，大幅度提升物理伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x1945AAEE
		,wp_13 = 0xA097B923
		}
	ItemData["流影云笛"]={
		wp_1 = "天光流不定，云影共徘徊。以缥缈云竹制成的仙笛，令人在施展法术时事半功倍。佩戴此法宝，进入战斗时，大幅度提升法术伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x198A6291
		,wp_13 = 0x3340D267
		}
	ItemData["软烟罗锦"]={
		wp_1 = "织女以天边晚霞织就，如烟如雾，佩戴后云雾缭绕，消弭术法。佩戴此法宝可以增加法术闪避。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x5B37D7B0
		,wp_13 = 0x7A64822D
		}
	ItemData["谷玄星盘"]={
		wp_1 = "提升吸收4系法术的几率"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x2C726C89
		,wp_13 = 0xCC1C23CC
		}
	ItemData["千斗金樽"]={
		wp_1 = "玉帝心爱的饮酒器皿，常年盛放玉酿仙液，灵气浸染之下，遍体流光。佩戴此法宝，可以随战斗回合数增加物理暴击。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x8B4E9AC5
		,wp_13 = 0xAA6F6118
		}
	ItemData["宿幕星河"]={
		wp_1 = "银河倾泻，夜幕悬垂，星空之万千变化皆在其中。以星河之力激荡本心，源源不绝。佩戴此法宝，可以随战斗回合数增加法术暴击。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 4
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xBCB52ACC
		,wp_13 = 0x85A009F9
		}
	ItemData["北冥巨鳞"]={
		wp_1 = "传说中北冥鲲之巨鳞，佩戴则可获抟扶摇之力，逍遥九天，傲视群雄。佩戴后可增加我方所有人物伤害力，开启阵法且自身伤害高于其他队友时，额外增加自身大量伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x5FFC15F1
		,wp_13 = 0x2F57F1E8
		}
	ItemData["血魄元幡"]={
		wp_1 = "于地府浴千万血魄浸润而成，凶煞无比。祭出则可借鬼神之力，通天彻地。可增加我方所有人物法术伤害力，开启阵法且自身法术伤害高于其他队友时，额外增加自身大量法术伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 1738980812
		,wp_13 = 1394501420
		}
	ItemData["翠碧玉箫"]={
		wp_1 = "吹奏起，则万花丛中过，片叶不沾身。以灵动身法，应万千变化。佩戴后可增加我方所有人物抗封能力，开启阵法且自身速度远高于其他队友时，效果大幅提高。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 2
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x8867ABB2
		,wp_13 = 0xA7BE0228
		}
	ItemData["冷龙石磐"]={
		wp_1 = "增加本方所有人物防御力；队伍人数=5且自身防御大于其他所有队友的防御*130%时，效果大幅提高。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 3
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x5627FA3F
		,wp_13 = 0x160F6A44
		}
	ItemData["琉璃云罩"]={
		wp_1 = "增加本方所有人物法术防御力；队伍人数=5且自身防御大于其他所有队友的防御*130%时，效果大幅提高。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 3
		,wp_5 = 0 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 1 --回合限制
		,wp_8 = 0 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xA18E0EC3
		,wp_13 = 0xFB9618A5
		}
	ItemData["璞玉灵钵"]={
		wp_1 = "空灵空性，无欲无求。以菩提心应万物，以慈悲心护周身。有我不伤人、人不伤我之能。无需佩戴，在战斗中使用此物，可降低我方受到的伤害。"
		,wp_2 = 1000 -- 总类
		,wp_3 = 4 -- 法宝等级
		,wp_4 = 3
		,wp_5 = 1 --0 佩戴战斗生效 1无需佩戴战斗使用 2 无需佩戴非战斗
		,wp_6 = 120 -- 等级
		,wp_7 = 150 --回合限制
		,wp_8 = 1 	--持续回合
		,wp_11 = "common/item.wdf"
		,wp_12 = 1577325226
		,wp_13 = 1674443512
		--=======灵宝
		}
	ItemData["断穹巨剑"]={
		wp_1 = "具有开天辟地威力的巨剑,可直击敌人的灵魂是大唐官府门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "大唐官府"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777477
		,wp_13 = 16777476
		,wp_15 = "对目标造成（伤害力*1.5/2.5/4.5）点气血流失，并对额外3个单位造成25%溅射伤害，伤害结果会有10%上下浮动。"
		}
	ItemData["静心禅珠"]={
		wp_1 = "富含至理的佛珠,散发着令人静心安神的佛光是化生寺派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "化生寺"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777481
		,wp_13 = 16777480
		,wp_15 = "为己方全部单位恢复（施法者等级*6/10/20）点气血，同时消耗道具栏中最多两个百炼金乌丸，每个百炼金乌丸增加（品质*0.4）%治疗结果。"
		}
	ItemData["宁心道符"]={
		wp_1 = "以神秘口诀驱动的符,可令其定神凝气心无旁鹜是方寸山门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "方寸山"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777349
		,wp_13 = 16777348
		,wp_15 = "令目标提升18%/30%/54%抵抗封印能力，持续12回合。"
		}
	ItemData["相思寒针"]={
		wp_1 = "分相思一分决绝,令敌人到无尽寒意的神针是女儿村门派不外传的稀世灵宝。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "女儿村"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777473
		,wp_13 = 16777472
		,wp_15 = "令目标无法使用灵宝，并且封印命中率降低50%，持续2/4/8回合。"
		}
	ItemData["风舞心经"]={
		wp_1 = "描述如何在风中汲取自然力量的心法,是神木林门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "神木林"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777367
		,wp_13 = 16777366
		,wp_15 = "将自己当前风灵层数变为4/8/15（可临时突破上限）。"
		}
	ItemData["锢魂命谱"]={
		wp_1 = "具有操纵生死、锢魂定魄的强大飭力是地府门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "阴曹地府"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777363
		,wp_13 = 16777362
		,wp_15 = "令敌方所有单位身上存在的锢魂术状态延长2/4/8回合。（包括死亡单位）"
		}
	ItemData["青狮獠牙"]={
		wp_1 = "传说中是上古狮王的獠牙,里之即令人心惊胆战是验岭门派不外传的稀世灵宝。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "狮驼岭"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777479
		,wp_13 = 16777478
		,wp_15 = "令目标所有召唤兽和孩子（包括未出战）的最大气血降低10%/20%/50%。"
		}
	ItemData["冥火炼炉"]={
		wp_1 = "保存着上古神焰火种的炼炉,在魔力护持下不衰不灭是魔王襄门派不外传的稀世灵"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "魔王寨"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777365
		,wp_13 = 16777364
		,wp_15 = "令目标每回合开始时受到（施法者等级*2/5/10）点气血流失，持续到战斗结束。"
		}
	ItemData["缚仙蛛丝"]={
		wp_1 = "可束婷仙魔的幻蛛之丝,令对手难以施展全力是盘丝洞门派不外传的稀世灵"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "盘丝洞"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777493
		,wp_13 = 16777492
		,wp_15 = "禁用目标道具栏中随机3/5/20格物品，持续到战斗结束。"
		}
	ItemData["煞魂冥灯"]={
		wp_1 = "可摄人心魄、夺人精血的冥灯是无底洞门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "无底洞"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777489
		,wp_13 = 16777488
		,wp_15 = "令目标最大气血降低9%/20%/50%，持续到战斗结束。"
		}
	ItemData["九霄龙锥"]={
		wp_1 = "龙神之怒威九霄,令敌人丧失对法术的抵抗能力是龙宫门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "龙宫"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777351
		,wp_13 = 16777350
		,wp_15 = "令目标受到的法术伤害增加9%/15%/70%，持续到战斗结束。"
		}
	ItemData["化怨清莲"]={
		wp_1 = "可化解世界一切思笨的洁净莲花洗涤心灵、消除怨恨,是普陀山门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "普陀山"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777361
		,wp_13 = 16777360
		,wp_15 = "令目标当前回合受到伤害和造成伤害同时降低30%/50%/90%，持续2回合。"
		}
	ItemData["真阳令旗"]={
		wp_1 = "上古战场中封存的令旗,可激发斗志、振奋土气是五庄观门派不外传的稀世灵"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "五庄观"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777491
		,wp_13 = 16777490
		,wp_15 = "令己方1/3/10个单位造成的伤害提高4%（80%），持续到战斗结束。（括号中为目标为召唤兽和孩子的效果）"
		}
	ItemData["天雷音鼓"]={
		wp_1 = "附加了唤雷之术的战鼓,酸响后可召唤天雷是天宫门派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "天宫"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777369
		,wp_13 = 16777368
		,wp_15 = "召唤7/13/40道闪电劈向敌方随机单位，每道闪电造成（施法者等级*4）点气血流失并使目标受到的法术伤害增加1%，持续到战斗结束。"
		}
	ItemData["寒霜盾戟"]={
		wp_1 = "进可提戟穿云,退可持盾避锋,有破山碎河之势是凌波城派不外传的稀世灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 1
		,wp_6 = "凌波城"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777353
		,wp_13 = 16777352
		,wp_15 = "令自己受到伤害降低2.5%/7.5%/25%、造成伤害提升2.5%/7.5%/25%，持续到战斗结束。(可叠加)"
		}
	ItemData["乾坤金卷"]={
		wp_1 = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为金。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777335
		,wp_13 = 16777334
		,wp_15 = "目标的攻击五行变为金，持续到战斗结束。"
		}
	ItemData["乾坤木卷"]={
		wp_1 = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为木。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777333
		,wp_13 = 16777332
		,wp_15 = "令目标的攻击五行变为木，持续到战斗结束。"
		}
	ItemData["乾坤水卷"]={
		wp_1 = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为水。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777331
		,wp_13 = 16777330
		,wp_15 = "令目标的攻击五行变为水，持续到战斗结束。"
		}
	ItemData["乾坤火卷"]={
		wp_1 = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为火。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777329
		,wp_13 = 16777328
		,wp_15 = "令目标的攻击五行变为火，持续到战斗结束。"
		}
	ItemData["乾坤土卷"]={
		wp_1 = "一本古籍中的残卷,记录了五行中的生克制化习后可将敌人的五行变为土。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777319
		,wp_13 = 16777320
		,wp_15 = "令目标的攻击五行变为土，持续到战斗结束。"
		}
	ItemData["定神仙琴"]={
		wp_1 = "能发出清净内心的仙界琴音让自己摆脱控制,超然物外"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777347
		,wp_13 = 16777346
		,wp_15 = "解除自己的异常状态，提升50%抵抗封印能力，持续3回合。"
		}
	ItemData["赤炎战笛"]={
		wp_1 = "相传管在上古战场中出现,能令百兽开怒激愤是催发召唤兽潜諓的神奇灵宝"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777345
		,wp_13 = 16777344
		,wp_15 = "令指定召唤兽或孩子单位本回合造成的所有伤害提升150%。(可叠加)"
		}
	ItemData["护体灵盾"]={
		wp_1 = "失传已久的凝光成盾之术可在战斗中激发一个强大的护盾令敌人难以攻破。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777337
		,wp_13 = 16777336
		,wp_15 = "为目标附加目标等级*12点护盾。此护盾持续期间，目标受到所有伤害降低20%。"
		}
	ItemData["惊兽云尺"]={
		wp_1 = "能对召唤曾产生巨大的心灵震慑是克制召唤兽的神奇灵宝。"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 2
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777317
		,wp_13 = 16777318
		,wp_15 = "令目标召唤兽和孩子受到所有伤害提升50%，持续到战斗结束。(可叠加)"
		}
	ItemData["战神宝典"]={
		wp_1 = "记录了上古战神的武学心得潜心参悟后可获得源源不断的战力如战神附体"
		,wp_2 = 1002
		,wp_3 = 1
		,wp_4 = 1
		,wp_5 = 3
		,wp_6 = "通用灵宝"
		,wp_11 = "zdy.rpk"
		,wp_12 = 16777317
		,wp_13 = 16777316
		,wp_15 = "消耗全部灵元，每回合令自己造成的物理和法术伤害提升一定比例，持续到战斗结束。（效果与消耗灵元数量有关）"
		}
	ItemData["如意符"]={
		wp_1 = "用于收回家具"
		,wp_2 = 201
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x56D82E47
		,wp_13 = 0xA2148CBF
		--房屋家具
		}
	ItemData["蝴蝶兰"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xF1AA1CDC
		,wp_13 = 0x3DCA686
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["桦木圆桌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xEA3F791
		,wp_13 = 0x48FAED8
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["五谷轮回桶"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xE14D7033
		,wp_13 = 0x85E408B
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["凤凰傲意图"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9AE42B3
		,wp_13 = 0x4488275C
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["狮子图屏风"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xC15DCDE
		,wp_13 = 0xB77C05F8
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["神仙帐"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7336C5AB
		,wp_13 = 0xE745545
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["麻布地毯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFFC56CAC
		,wp_13 = 0xFFC56CAC
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["虎威太师椅"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDD6A29AE
		,wp_13 = 0x9662814C
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["红木地板"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDD1346DC
		,wp_13 = 0x35997A39
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["桦木立柜"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x40DBF469
		,wp_13 = 0x950DB91E
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["月牙凳"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x36FEC0EE
		,wp_13 = 0x958ACF12
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["银烛台"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1802F06C
		,wp_13 = 0x966FD5CD
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["蓝绸绣花帘"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x43D43BC3
		,wp_13 = 0x59166107
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["波丝地毯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x5FF1A254
		,wp_13 = 0x5FF1A254
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["千佛图"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFD182818
		,wp_13 = 0xA9B71F42
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["双鱼吉庆柜"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7CF14A8C
		,wp_13 = 0xFC060E32
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["仙人掌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3970879B
		,wp_13 = 0xFB18050C
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["雕花马桶"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x264A5EC9
		,wp_13 = 0xF0698B61
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["水仙"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x10ACEF55
		,wp_13 = 0x2BA074EC
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["漆花地板"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBC647367
		,wp_13 = 0x1133B493
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["花鸟图屏风"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x16B2E033
		,wp_13 = 0xA466DED1
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["龟鹤延年灯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x17520E38
		,wp_13 = 0x338882F8
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["壮丽山河"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1C93E78C
		,wp_13 = 0xEABCDF89
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["踏春图"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1D00C78D
		,wp_13 = 0xE14EA35A
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["红木八仙桌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1E3B47E4
		,wp_13 = 0xCE322B80
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["黑麻垂蔓帘"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBB7384E5
		,wp_13 = 0x1F74CEFC
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["漆花竹凳"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2A858ABF
		,wp_13 = 0xDD195E16
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白虎皮地毯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xE873EBDA
		,wp_13 = 0x2B479E5D
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["天山云雪"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2F988214
		,wp_13 = 0xC59023F1
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["桦木靠背椅"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x31FC79B2
		,wp_13 = 0x6FC9A4F8
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["百兽镇邪桌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x33181B3E
		,wp_13 = 0x38B5ADC6
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["八宝呈祥桌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x34F3E6FA
		,wp_13 = 0xD941BC31
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["黄锻锦边帘"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x373D5C17
		,wp_13 = 0xE71A42E5
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["彩绘立柜"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA52D57A2
		,wp_13 = 0x40DC127D
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["夕阳山水图"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x64D8CADE
		,wp_13 = 0xCC5DD99C
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["兽皮地毯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x69CC2D84
		,wp_13 = 0xE3EFB84D
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["麻木地毯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x69CC2D84
		,wp_13 = 0x6A2EADCD
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["红杏闹春帘"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6C7143EF
		,wp_13 = 0x80D12303
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["紫檀雕花椅"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA2F9250A
		,wp_13 = 0x6E1F9949
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["印花屏风"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8D1C9B16
		,wp_13 = 0x6E75C55E
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["玉瓷画瓶"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x72B05C62
		,wp_13 = 0xBD83A424
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["嵌玉虎纹桌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x749A8DE7
		,wp_13 = 0x822EDE52
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["招财聚宝柜"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7EF80073
		,wp_13 = 0xB3589DB5
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["八卦镇邪塌"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9C7E2DE5
		,wp_13 = 0x8479C234
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["龙凤呈祥"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xCA7094E6
		,wp_13 = 0xF001907F
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["文竹"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA3E461E0
		,wp_13 = 0xE6265000
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["金座雕龙屏风"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xBED2AAC0
		,wp_13 = 0xE43EE153
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["木地板"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 42
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xE2A1D30F
		,wp_13 = 0xE2A1D30F
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["长信女宫灯"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9FAC7C21
		,wp_13 = 0xDEC76AF6
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["紫檀雕花柜"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDF3EB09B
		,wp_13 = 0xD78204FC
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["宁安夜梦"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDB9D4A0F
		,wp_13 = 0xA02C51DB
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["彩绘花瓶"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD9438601
		,wp_13 = 0xA3274661
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白鹤展翅帘"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD0522308
		,wp_13 = 0xBA96E2CF
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["桦木地板"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDD1346DC
		,wp_13 = 0x8E5DC844
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["君子兰"]={
		wp_1 = ""
		,wp_2 = 200
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xAE1FE52C
		,wp_13 = 0x8A122388
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["福"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD7FA78E4
		,wp_13 = 0x09D28C2C
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["对联"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x4571DE30
		,wp_13 = 0xD18B523D
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["横批"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7C7DAC27
		,wp_13 = 0xF7E67AE0
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白栅绿竹门"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2DAB0826
		,wp_13 = 0xFAD67DD7
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["篱笆花圃"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6C72DD99
		,wp_13 = 0x8864A0CD
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["篱笆院墙"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8C633A1C
		,wp_13 = 0xA5231FE6
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["石凳"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6E128DF0
		,wp_13 = 0x2C1A8B0E
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["石制宫灯"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA7335624
		,wp_13 = 0x730D86FC
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["石制影壁"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x855CEC56
		,wp_13 = 0x1319D9F2
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["石桌"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA4526D87
		,wp_13 = 0x25B4AC07
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["大理石凳"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xB4BAF8A6
		,wp_13 = 0x9604FFF6
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["大理石花圃"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x76F59455
		,wp_13 = 0x3FD069AF
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["大理石桌"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x5C5CA419
		,wp_13 = 0x4D8638F2
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["红漆雕花门"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x04DD49CD
		,wp_13 = 0x5242BF7B
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["青瓷花盆"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x91444F58
		,wp_13 = 0x993DEAF9
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["青石路砖"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD1194D50
		,wp_13 = 0x8D95A24
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["青铜鼎"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9EC60BCF
		,wp_13 = 0xB84D82E
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["石制院墙"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9166DA38
		,wp_13 = 0x1C09259A
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白玉花圃"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFBCA03F8
		,wp_13 = 0xA981ED59
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白玉狮子"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2DAB0826
		,wp_13 = 0x54465561
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白玉石凳"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x289B58A7
		,wp_13 = 0xD74AAC36
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白玉石桌"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xB9751A7A
		,wp_13 = 0xA2D03958
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["白玉影壁"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x835DDD76
		,wp_13 = 0x85F6F181
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["花岗石路砖"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x36D589DC
		,wp_13 = 0x2F630A54
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["混土砖石院墙"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8BAC864B
		,wp_13 = 0x4680BDAE
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["金丝楠木门"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD7492DA6
		,wp_13 = 0x29115EDF
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["山水盆景"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xB63474A0
		,wp_13 = 0x79C83349
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["四圣兽之白虎"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B08F32E
		,wp_13 = 0xD9D5BAB8
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["四圣兽之青龙"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFEEF9473
		,wp_13 = 0xD2DF07DC
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["四圣兽之玄武"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3E50047F
		,wp_13 = 0xD79EE5DF
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["四圣兽之朱雀"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3CA923F0
		,wp_13 = 0x2A25E1F7
		,wp_15 = "鼠标右键点击使用"
		}
	ItemData["物品柜"]={
		wp_1 = ""
		,wp_2 = 202
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x135D021A
		,wp_13 = 0x44D8C646
		,wp_15 = "鼠标右键点击使用"
		--
		--========坐骑饰品=======
		}
	ItemData["展翅高飞"]={
		wp_1 = "展翅高飞仰望天空，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD7E977F7
		,wp_13 = 0x6F09B32F
		}
	ItemData["旗开得胜"]={
		wp_1 = "凯旋之音，百战百胜，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 1
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xD555E56C
		,wp_13 = 0x942AB7C0
		}
	ItemData["霸王雄风"]={
		wp_1 = "霸气雄风，拥有王者之气魄，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 1
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xDBB13B82
		,wp_13 = 0x01B8900E
		}
	ItemData["独眼观天"]={
		wp_1 = "非常有特色的装饰，装配后个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xAD1A3DAA
		,wp_13 = 0xA8C159D5
		}
	ItemData["威武不屈"]={
		wp_1 = "充满着坚贞顽强的气魄，照射出大丈夫的豪气，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 2
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xB4448E15
		,wp_13 = 0xE11D168A
		}
	ItemData["深藏不露"]={
		wp_1 = "具备神秘的力量，折射着独特的探险家的气味，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 2
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xC210C8A6
		,wp_13 = 0x38BB89C1
		}
	ItemData["异域浓情"]={
		wp_1 = "异国色彩浓浓，装扮个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x21E6E4AD
		,wp_13 = 0x2B3BD5AF
		}
	ItemData["流星天马"]={
		wp_1 = "如流星划过夜空，如天马飞跃彩虹，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 3
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x4E622591
		,wp_13 = 0xE99C9229
		}
	ItemData["威猛将军"]={
		wp_1 = "战场上的最强者，威猛而无畏，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 3
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6734E476
		,wp_13 = 0xCA080495
		}
	ItemData["知情达理"]={
		wp_1 = "相互感知，生死与共，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x42C8E012
		,wp_13 = 0xD84AEFD9
		}
	ItemData["气宇轩昂"]={
		wp_1 = "潇潇洒洒，气宇轩昂，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 4
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xC29077C1
		,wp_13 = 0x153B18EB
		}
	ItemData["如花似玉"]={
		wp_1 = "如花似如梦，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 4
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x56A40A70
		,wp_13 = 0x95F2DAEA
		}
	ItemData["傲视天下"]={
		wp_1 = "群雄傲世英雄盖世，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x399B3F51
		,wp_13 = 0xC124D1F4
		}
	ItemData["铁血豪情"]={
		wp_1 = "铁汉柔情，刚柔并济乃侠之大者，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 5
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xF0ECED8B
		,wp_13 = 0x369C76E3
		}
	ItemData["唯我独尊"]={
		wp_1 = "天大地大唯我独大，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 5
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xD8246960
		,wp_13 = 0x1F226C87
		}
	ItemData["叱咤风云"]={
		wp_1 = "一声怒喝而使风云翻滚，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 6
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x82DBAAF6
		,wp_13 = 0x58DC5C54
		}
	ItemData["异域风情"]={
		wp_1 = "异国色彩浓浓，装扮个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 6
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x22245346
		,wp_13 = 0x7F5AF2ED
		}
	ItemData["假面勇者"]={
		wp_1 = "藏在面具后面的脸，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 6
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x84389440
		,wp_13 = 0x6D92CEB9
		}
	ItemData["霓裳魅影"]={
		wp_1 = "似是天上仙女霓裳飘飘，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 7
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x347CE5F8
		,wp_13 = 0xC3127ABF
		}
	ItemData["披星戴月"]={
		wp_1 = "犹如夜空中最亮的星，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 7
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x7A72E56A
		,wp_13 = 0xFFB05D4D
		}
	ItemData["烈焰燃情"]={
		wp_1 = "热情澎湃，此物必配蒙情英雄，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 7
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x1FFD79EC
		,wp_13 = 0x8B15F395
		}
	ItemData["天雨流芳"]={
		wp_1 = "似是天上流星天雨，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x5B7FC4A3
		,wp_13 = 0x65099256
		}
	ItemData["灵光再现"]={
		wp_1 = "灵光闪动跳跃着智慧和力量，必是侠者不可缺少之物，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 8
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x5E631741
		,wp_13 = 0x0587D5F5
		}
	ItemData["倾国倾城"]={
		wp_1 = "美艳动人，美丽与智慧并存，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		,wp_2 = 112
		,wp_3 = 8
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x208D42ED
		,wp_13 = 0x8138AFE1
		--
		--========召唤兽饰品=======
		}
	ItemData["海星饰品"]={
		wp_1 = "适合海星使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7D676C74
		,wp_13 = 0xEA62CA32
		}
	ItemData["章鱼饰品"]={
		wp_1 = "适合章鱼使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x1B15731D
		,wp_13 = 0x6CD2B633
		}
	ItemData["泡泡饰品"]={
		wp_1 = "适合泡泡使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xE28D168D
		,wp_13 = 0xC0639106
		}
	ItemData["山贼饰品"]={
		wp_1 = "适合山贼使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x4B1A9A48
		,wp_13 = 0x0E709527
		}
	ItemData["进阶蝴蝶仙子饰品"]={
		wp_1 = "适合进阶蝴蝶仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xCF439FF6
		,wp_13 = 0xF6C2E868
		}
	ItemData["进阶黑山老妖饰品"]={
		wp_1 = "适合进阶黑山老妖使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7F0984BC
		,wp_13 = 0xF62D1967
		}
	ItemData["古代瑞兽饰品"]={
		wp_1 = "适合古代瑞兽使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x671967E1
		,wp_13 = 0x36648B93
		}
	ItemData["进阶雷鸟人饰品"]={
		wp_1 = "适合进阶雷鸟人使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x91781353
		,wp_13 = 0xC8DB8181
		}
	ItemData["白熊饰品"]={
		wp_1 = "适合白熊使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x0BFC6BDD
		,wp_13 = 0x61077013
		}
	ItemData["风伯饰品"]={
		wp_1 = "适合风伯使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x518471FD
		,wp_13 = 0x011DF58C
		}
	 ItemData["进阶地狱战神饰品"]={
	 	wp_1 = "适合进阶地狱战神使用的饰品，给予其使用后可以增加新的形态装饰效果。"
	 	,wp_2 = 149
	 	,wp_3 = 1
	 	,wp_11 = ""
	 	,wp_12 = 0xDDEDA244
	 	,wp_13 = 0x0550F690
	 	}
	ItemData["夜罗刹饰品"]={
		wp_1 = "适合夜罗刹使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xDDEDA244
		,wp_13 = 0x0550F690
		}
	ItemData["进阶夜罗刹饰品"]={
		wp_1 = "适合夜罗刹使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xDDEDA244
		,wp_13 = 0x0550F690
		}
	 ItemData["进阶鬼将饰品"]={
	 	wp_1 = "适合进阶鬼将使用的饰品，给予其使用后可以增加新的形态装饰效果。"
	 	,wp_2 = 149
	 	,wp_3 = 1
	 	,wp_11 = ""
	 	,wp_12 = 0xDDEDA244
	 	,wp_13 = 0x0550F690
	 	}
	ItemData["进阶天兵饰品"]={
		wp_1 = "适合进阶天兵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB90799EA
		,wp_13 = 0x794C33D0
		}
	ItemData["机关兽饰品"]={
		wp_1 = "适合机关兽使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x082DF2E8
		,wp_13 = 0xAA6521F9
		}
	ItemData["百足将军饰品"]={
		wp_1 = "适合百足将军使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x5C295A3C
		,wp_13 = 0xC3B83C79
		}
	ItemData["金身罗汉饰品"]={
		wp_1 = "适合金身罗汉使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xA545ABC8
		,wp_13 = 0xD05BA36C
		}
	ItemData["进阶巨力神猿饰品"]={
		wp_1 = "适合进阶巨力神猿使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x07C4984D
		,wp_13 = 0x4A26363A
		}
	ItemData["进阶虬龙饰品"]={
		wp_1 = "进阶虬龙饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x0A7B4FE9
		,wp_13 = 0x34FB2CD2
		}
	ItemData["幽灵饰品"]={
		wp_1 = "适合幽灵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x0A7B4FE9
		,wp_13 = 0x34FB2CD2
		}
	ItemData["进阶雷龙饰品"]={
		wp_1 = "进阶雷龙饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x0A7B4FE9
		,wp_13 = 0x34FB2CD2
		}
	ItemData["雾中仙饰品"]={
		wp_1 = "适合雾中仙使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x0DB6DE65
		,wp_13 = 0x5705837D
		}
	ItemData["进阶灵符女娲饰品"]={
		wp_1 = "适合进阶灵符女娲使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x0EBAA59F
		,wp_13 = 0xEE608A2F
		}
	ItemData["进阶芙蓉仙子饰品"]={
		wp_1 = "适合进阶芙蓉仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x105046E1
		,wp_13 = 0xD977475C
		}
	ItemData["长眉灵猴饰品"]={
		wp_1 = "适合长眉灵猴使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x11CF5CD9
		,wp_13 = 0xAF1E223E
		}
	ItemData["猪八戒饰品"]={
		wp_1 = "适合猪八戒使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x1218BD6F
		,wp_13 = 0x138924C9
		}
	ItemData["机关鸟饰品"]={
		wp_1 = "适合机关鸟使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x12425B20
		,wp_13 = 0x1DE65975
		}
	ItemData["画魂饰品"]={
		wp_1 = "适合画魂使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xADE9E51F
		,wp_13 = 0x13FF213A
		}
	ItemData["进阶百足将军饰品"]={
		wp_1 = "适合进阶百足将军使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xDFCDF195
		,wp_13 = 0x15F647DD
		}
	ItemData["炎魔神饰品"]={
		wp_1 = "适合炎魔神使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xcd208493
		,wp_13 = 0x6ac5801c
		}
	ItemData["进阶炎魔神饰品"]={
		wp_1 = "适合进阶炎魔神使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x17A6BC23
		,wp_13 = 0x9BD59357
		}
	ItemData["碧海夜叉饰品"]={
		wp_1 = "适合碧海夜叉使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x1A80ECB4
		,wp_13 = 0x13725FAD
		}
	ItemData["蝎子精饰品"]={
		wp_1 = "适合蝎子精使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xC184C139
		,wp_13 = 0xBE6B2487
		}
	ItemData["进阶毗舍童子饰品"]={
		wp_1 = "适合进阶毗舍童子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x719F0348
		,wp_13 = 0x1E3090FA
		}
	ItemData["进阶噬天虎饰品"]={
		wp_1 = "适合进阶噬天虎使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB0E4CE03
		,wp_13 = 0x205765E7
		}
    ItemData["进阶司雨饰品"]={
		wp_1 = "进阶司雨饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x2F135077
		,wp_13 = 0xE4D1B1A7
		}
	ItemData["巡游天神饰品"]={
		wp_1 = "适合巡游天神使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x5F195813
		,wp_13 = 0x3773E8DE
		}
	ItemData["进阶巡游天神饰品"]={
		wp_1 = "适合进阶巡游天神使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x3EF393FF
		,wp_13 = 0x82A3FA26
		}
	ItemData["如意仙子饰品"]={
		wp_1 = "适合如意仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x4062E575
		,wp_13 = 0x7C061EBB
		}
	ItemData["进阶如意仙子饰品"]={
		wp_1 = "适合进阶如意仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x43F8CB57
		,wp_13 = 0xD52C3F3E
		}
	ItemData["机关人战车饰品"]={
		wp_1 = "适合机关人战车使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xE9AE67C2
		,wp_13 = 0x45169512
		}
	ItemData["进阶蝎子精饰品"]={
		wp_1 = "适合进阶蝎子精使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB680C138
		,wp_13 = 0x46B334CE
		}
	ItemData["进阶犀牛将军兽饰品"]={
		wp_1 = "适合进阶犀牛将军兽使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x46BC3F59
		,wp_13 = 0x9F407319
		}
	ItemData["进阶凤凰饰品"]={
		wp_1 = "适合进阶凤凰使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xED3634F0
		,wp_13 = 0x484141E4
		}
	ItemData["觉醒涂山雪饰品"]={
		wp_1 = "进阶觉醒涂山雪饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x53C8C818
		,wp_13 = 0x2C22EBCF
		}
	ItemData["进阶涂山雪饰品"]={
		wp_1 = "进阶涂山雪饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x53C8C818
		,wp_13 = 0x2C22EBCF
		}
	ItemData["进阶觉醒涂山雪饰品"]={
		wp_1 = "进阶觉醒涂山雪饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x53C8C818
		,wp_13 = 0x2C22EBCF
		}
	ItemData["金翼饰品"]={
		wp_1 = "适合进阶金翼使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xED3634F0
		,wp_13 = 0x484141E4
		}
	ItemData["进阶金翼饰品"]={
		wp_1 = "适合进阶金翼使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xED3634F0
		,wp_13 = 0x484141E4
		}
	ItemData["进阶机关人饰品"]={
		wp_1 = "适合进阶机关人使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x490C0345
		,wp_13 = 0x76714710
		}
	ItemData["鼠先锋饰品"]={
		wp_1 = "适合鼠先锋使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xC0AB355B
		,wp_13 = 0x4E0CED3B
		}
	ItemData["进阶修罗傀儡妖饰品"]={
		wp_1 = "适合进阶修罗傀儡妖使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7C45DC26
		,wp_13 = 0x4E3E60DF
		}
	ItemData["持国巡守饰品"]={
		wp_1 = "适合持国巡守饰品使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x53C8C818
		,wp_13 = 0x2C22EBCF
		}
	ItemData["进阶鼠先锋饰品"]={
		wp_1 = "适合进阶鼠先锋使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xA8E24F81
		,wp_13 = 0x5925AB70
		}
	ItemData["百足将军饰品"]={
		wp_1 = "适合百足将军使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x5C295A3C
		,wp_13 = 0x5EA142D4
		}
	ItemData["真陀护法饰品"]={
		wp_1 = "适合真陀护法使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x18918659
		,wp_13 = 0x5CD1BDD7
		}
	ItemData["进阶魔化毗舍童子饰品"]={
		wp_1 = "进阶魔化毗舍童子饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x719F0348
		,wp_13 = 0x1E3090FA
		}
	ItemData["进阶自在心猿饰品"]={
		wp_1 = "进阶自在心猿饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7C45DC26
		,wp_13 = 0x4E3E60DF
		}
	ItemData["进阶谛听饰品"]={
		wp_1 = "进阶谛听饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x99E44027
		,wp_13 = 0x8FE46833
		}
	ItemData["进阶猫灵饰品"]={
		wp_1 = "进阶猫灵饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x99E44027
		,wp_13 = 0x8FE46833
		}
	ItemData["进阶有苏鸩饰品"]={
		wp_1 = "进阶有苏鸩饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x11CF5CD9
		,wp_13 = 0xAF1E223E
		}
	ItemData["进阶幻姬饰品"]={
		wp_1 = "适合进阶幻姬使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB680C138
		,wp_13 = 0x46B334CE
		}
	ItemData["进阶月魅饰品"]={
	 	wp_1 = "适合进阶月魅使用的饰品，给予其使用后可以增加新的形态装饰效果。"
	 	,wp_2 = 149
	 	,wp_3 = 1
	 	,wp_11 = ""
	 	,wp_12 = 0xDDEDA244
	 	,wp_13 = 0x0550F690
	 	}
	ItemData["星灵仙子饰品"]={
		wp_1 = "适合星灵仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x6E7B1B52
		,wp_13 = 0x96710CDD
		}
	ItemData["进阶涂山瞳饰品"]={
		wp_1 = "进阶涂山瞳饰品，可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x6E7B1B52
		,wp_13 = 0x96710CDD
		}
	ItemData["吸血鬼饰品"]={
		wp_1 = "适合星灵仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x1D124E01
		,wp_13 = 0x0C01D076
		}
	ItemData["灵符女娲饰品"]={
		wp_1 = "适合灵符女娲使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x43564039
		,wp_13 = 0xDF93EA17
		}
	ItemData["进阶阴阳伞饰品"]={
		wp_1 = "适合进阶阴阳伞使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xD2B5D50A
		,wp_13 = 0x62454D13
		}
	ItemData["进阶律法女娲饰品"]={
		wp_1 = "适合进阶律法女娲使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7E42E492
		,wp_13 = 0xE3675B07
		}
	ItemData["进阶鲛人饰品"]={
		wp_1 = "适合进阶鲛人使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xCEC72909
		,wp_13 = 0xC331017E
		}
	ItemData["进阶蛟龙饰品"]={
		wp_1 = "适合进阶蛟龙使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xA74A167C
		,wp_13 = 0xBB1EA168
		}
	ItemData["进阶执音饰品"]={
		wp_1 = "适合进阶执音使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xA74A167C
		,wp_13 = 0xBB1EA168
		}
	ItemData["进阶司雪饰品"]={
		wp_1 = "进阶司雪饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x2F135077
		,wp_13 = 0xE4D1B1A7
		}
	ItemData["进阶司辰侍者(未来)饰品"]={
		wp_1 = "进阶司辰侍者(未来)饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x2F135077
		,wp_13 = 0xE4D1B1A7
		}
	ItemData["进阶司辰侍者(过去)饰品"]={
		wp_1 = "进阶司辰侍者(过去)饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x2F135077
		,wp_13 = 0xE4D1B1A7
		}
	ItemData["进阶炼丹童子饰品"]={
		wp_1 = "进阶炼丹童子饰品"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x7C45DC26
		,wp_13 = 0x4E3E60DF
		}
	ItemData["进阶雨师饰品"]={
		wp_1 = "适合进阶雨师使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x2F135077
		,wp_13 = 0xE4D1B1A7
		}
	ItemData["进阶碧水夜叉饰品"]={
		wp_1 = "适合进阶碧水夜叉使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x9B4BF70D
		,wp_13 = 0xFFCDFCE7
		}
	ItemData["碧水夜叉饰品"]={
		wp_1 = "适合碧水夜叉使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x1A80ECB4
		,wp_13 = 0x13725FAD
		}
	ItemData["阴阳伞饰品"]={
		wp_1 = "适合阴阳伞使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xA166C299
		,wp_13 = 0xDB57031E
		}
	ItemData["天兵饰品"]={
		wp_1 = "适合天兵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x58E19A2A
		,wp_13 = 0x794C33D0
		}
	ItemData["进阶天兵饰品"]={
		wp_1 = "适合进阶天兵使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB90799EA
		,wp_13 = 0x97C67437
		}
	ItemData["蚌精饰品"]={
		wp_1 = "适合蚌精使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x9C8799D6
		,wp_13 = 0xCE212384
		}
	ItemData["狂豹人形饰品"]={
		wp_1 = "适合狂豹人使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xE7F09028
		,wp_13 = 0x4FF4D46D
		}
	ItemData["进阶连弩车饰品"]={
		wp_1 = "适合进阶连弩车使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x9EF97739
		,wp_13 = 0xB2CBE8EE
		}
	ItemData["巴蛇饰品"]={
		wp_1 = "适合巴蛇使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x97B5C8B3
		,wp_13 = 0xBBDDD02C
		}
	ItemData["狂豹兽形饰品"]={
		wp_1 = "适合狂豹兽使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x05C9E305
		,wp_13 = 0x953F4F60
		}
	ItemData["进阶龙龟饰品"]={
		wp_1 = "适合进阶龙龟使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x70253BD1
		,wp_13 = 0x8B86B3A4
		}
	ItemData["红萼仙子饰品"]={
		wp_1 = "适合红萼仙子使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x4F4DABF2
		,wp_13 = 0x01235F2E
		}
	ItemData["炎魔神饰品"]={
		wp_1 = "适合炎魔神使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xCD208493
		,wp_13 = 0x6AC5801C
		}
	ItemData["幽萤娃娃饰品"]={
		wp_1 = "适合幽萤娃娃使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x5DFF4E29
		,wp_13 = 0xAAEEB373
		}
	ItemData["进阶画魂饰品"]={
		wp_1 = "适合进阶画魂使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xAC637ECB
		,wp_13 = 0x66E9D6B6
		}
	ItemData["画魂饰品"]={
		wp_1 = "适合画魂使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xADE9E51F
		,wp_13 = 0x13FF213A
		}
	ItemData["鬼将饰品"]={
		wp_1 = "适合鬼将使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x107841EB
		,wp_13 = 0x836F2B2D
		}
	ItemData["进阶古代瑞兽饰品"]={
		wp_1 = "适合进阶古代瑞兽使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0x99E44027
		,wp_13 = 0x8FE46833
		}
	ItemData["进阶大力金刚饰品"]={
		wp_1 = "适合进阶大力金刚使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB499FF30
		,wp_13 = 0x693E2418
		}
	ItemData["大力金刚饰品"]={
		wp_1 = "适合进阶大力金刚使用的饰品，给予其使用后可以增加新的形态装饰效果。"
		,wp_2 = 149
		,wp_3 = 1
		,wp_11 = ""
		,wp_12 = 0xB499FF30
		,wp_13 = 0x693E2418
		}
	ItemData["玄天残卷·上卷"]={
		wp_1 = "集齐上中下三卷，在建邺城宠物仙子处可以兑换一颗圣兽丹。"
		,wp_2 = 681
		,wp_11=""
		,wp_12 = 0xC3AF882B
		,wp_13 = 0xCFB770DD
		}
	ItemData["玄天残卷·中卷"]={
		wp_1 = "集齐上中下三卷，在建邺城宠物仙子处可以兑换一颗圣兽丹。"
		,wp_2 = 681
		,wp_11=""
		,wp_12 = 0x559D05B9
		,wp_13 = 0x95C4E6EC
		}
	ItemData["玄天残卷·下卷"]={
		wp_1 = "集齐上中下三卷，在建邺城宠物仙子处可以兑换一颗圣兽丹。"
		,wp_2 = 681
		,wp_11=""
		,wp_12 = 0xF91379E1
		,wp_13 = 0xEC1B5658
		}
	ItemData["大额银票"]={
		wp_1 = "这是一张大额银票打开可随机获得1亿银两"
		,wp_2 = 113
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "kkjn.wdf"
		,wp_12 = 0xFA49DAFD    --小
		,wp_13 = 0x7F1E2D96
		}
	ItemData["5E银票"]={
		wp_1 = "这是一张5E银票打开可获得5亿银两"
		,wp_2 = 113
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "kkjn.wdf"
		,wp_12 = 0xFA49DAFD    --小
		,wp_13 = 0x7F1E2D96
		}
	ItemData["10E银票"]={
		wp_1 = "这是一张10E银票打开可获得10亿银两"
		,wp_2 = 113
		,wp_3 = 3
		,wp_4 = 0
	    ,wp_11 = "kkjn.wdf"
		,wp_12 = 0xFA49DAFD    --小
		,wp_13 = 0x7F1E2D96
		}
	ItemData["小袋银两"]={
		wp_1 = "一小袋金币打开可获得5000W银两"
		,wp_2 = 113
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "nvdi1.wdf"
		,wp_12 = 0x00000024
		,wp_13 = 0xAABB0199
		}
	ItemData["帮派银票"]={
		wp_1 = "这是属于某个帮派的银票，上面的钱可不能随便挪用哦。"
		,wp_2 = 113
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x97C77FD8
		,wp_13 = 0x92F6F4CA
		}
	ItemData["商品盐"]={
		wp_1 = "东海的特产之一，精细的海盐。商品的一种。"
		,wp_2 = 114
		,wp_3 = 1
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x1D1B8623
		,wp_13 = 0x5DA26DF2
		}
	ItemData["商品武器"]={
		wp_1 = "使用上好材料精心制作，是学武之日必备的武器。商品的一种。"
		,wp_2 = 114
		,wp_3 = 2
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x3B723D09
		,wp_13 = 0x5BBC4BD5
		}
	ItemData["商品帽子"]={
		wp_1 = "普通人家使用的布制头冠，在冬天可以起到一定御寒的作用。商品的一种。"
		,wp_2 = 114
		,wp_3 = 3
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x455447CE
		,wp_13 = 0xB3E1E4F1
		}
	ItemData["商品符"]={
		wp_1 = "道士所需的灵符，驱邪镇魔之用。商品的一种。"
		,wp_2 = 114
		,wp_3 = 4
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x4F8A961F
		,wp_13 = 0x583B0F67
		}
	ItemData["商品鹿茸"]={
		wp_1 = "鹿角上长的茸，可强身健体，是上好的药材。商品的一种。"
		,wp_2 = 114
		,wp_3 = 5
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x1881E054
		,wp_13 = 0x518D0F0E
		}
	ItemData["商品纸钱"]={
		wp_1 = "民间用来烧给阴间亲人使用的冥钞。商品的一种。"
		,wp_2 = 114
		,wp_3 = 6
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x1214601C
		,wp_13 = 0xC5D83684
		}
	ItemData["商品佛珠"]={
		wp_1 = "檀香木制的佛珠，佩带在身上可以驱邪镇魔。商品的一种。"
		,wp_2 = 114
		,wp_3 = 7
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x09A396DF
		,wp_13 = 0x0C23AB02
		}
	ItemData["商品酒"]={
		wp_1 = "精心酿制，窖藏多年，是不可多得的好酒。商品的一种。"
		,wp_2 = 114
		,wp_3 = 8
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xF82AAC0F
		,wp_13 = 0x2B2980FB
		}
	ItemData["商品棉布"]={
		wp_1 = "使用上品棉花编织而成的布匹。商品的一种。"
		,wp_2 = 114
		,wp_3 = 9
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x2C2D056A
		,wp_13 = 0x3E45E470
		}
	ItemData["商品面粉"]={
		wp_1 = "用小麦等材料精磨而成，可以制作各种可口的食物。商品的一种。"
		,wp_2 = 114
		,wp_3 = 10
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x7E5D886B
		,wp_13 = 0x3CE911B4
		}
	ItemData["商品珍珠"]={
		wp_1 = "东海珍珠，色泽明润洁白，无论是装饰和入药多可以。商品的一种。"
		,wp_2 = 114
		,wp_3 = 11
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x475C0227
		,wp_13 = 0x4EB56D11
		}
	ItemData["商品人参"]={
		wp_1 = "北方特产，是极好的补品，也可入药。商品的一种。"
		,wp_2 = 114
		,wp_3 = 12
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xD0FEED23
		,wp_13 = 0x75EAFA24
		}
	ItemData["商品木材"]={
		wp_1 = "百年原木，用于修建房屋的，名贵木材。商品的一种。"
		,wp_2 = 114
		,wp_3 = 13
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x2D2B1B01
		,wp_13 = 0xA80295E6
		}
	ItemData["商品蜡烛"]={
		wp_1 = "每家每户必备的照明工具，销路很好。商品的一种。"
		,wp_2 = 114
		,wp_3 = 14
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0xCCA5E33A
		,wp_13 = 0x1111FBA1
		}
	ItemData["商品扇子"]={
		wp_1 = "只是普通的折扇，为文人雅士所喜好。商品的一种。"
		,wp_2 = 114
		,wp_3 = 15
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x10095AF2
		,wp_13 = 0xADE7E512
		}
	ItemData["商品铃铛"]={
		wp_1 = "声音悦耳，为女子所喜，常买回去佩带在身上。商品的一种。"
		,wp_2 = 114
		,wp_3 = 16
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x254F32EB
		,wp_13 = 0xDF6AC41C
		}
	ItemData["商品夜明珠"]={
		wp_1 = "能再夜中放光的明珠，是价值连城的宝物。商品的一种。"
		,wp_2 = 114
		,wp_3 = 17
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x17CDA1A8
		,wp_13 = 0xD6E56581
		}
	ItemData["商品麻线"]={
		wp_1 = "坚韧的麻线，商品的一种"
		,wp_2 = 114
		,wp_3 = 18
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x12E64787
		,wp_13 = 0xEE14FF0E
		}
	ItemData["商品剪刀"]={
		wp_1 = "裁剪衣服所用的剪刀，女儿家常用物品。商品的一种。"
		,wp_2 = 114
		,wp_3 = 19
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x1583132D
		,wp_13 = 0xD55F18BB
		}
	ItemData["商品香油"]={
		wp_1 = "供奉神明的长明灯中所用的香油。商品的一种。"
		,wp_2 = 114
		,wp_3 = 20
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x4B45F754
		,wp_13 = 0x4446AACC
		}
	ItemData["商品首饰"]={
		wp_1 = "佩带在身上增添美观的一些精巧小玩意，价值视做工与材料而定。商品的一种。"
		,wp_2 = 114
		,wp_3 = 21
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x6FFE61EF
		,wp_13 = 0xDBCC855E
		----杂类
		}
	ItemData["五宝礼盒"]={
		wp_1 = ""
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x52a0ec78
		,wp_13 = 0xa609e6a1
		}
	ItemData["鱼缸"]={
		wp_1 = ""
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x7230a023
		,wp_13 = 0x26e742e
		}
	ItemData["紫苑"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x5646a95
		,wp_13 = 0x52863e2f
		}
	ItemData["桔梗"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 2
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x55d756ec
		,wp_13 = 0xfea77c93
		}
	ItemData["何首乌"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xffba1e17
		,wp_13 = 0x6729d9d1
		}
	ItemData["杜仲"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 4
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xc2421e19
		,wp_13 = 0xf5c5a2fb
		}
	ItemData["麻黄"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 5
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x6a8a3f26
		,wp_13 = 0x71c17189
		}
	ItemData["当归"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 6
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3b0cd5aa
		,wp_13 = 0x7fe98aa6
		}
	ItemData["当归"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 17
		,wp_4 = 6
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3b0cd5aa
		,wp_13 = 0x7fe98aa6
		}
	ItemData["紫苑粉末"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 18
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x74515410
		,wp_13 = 0x503fe0bd
		}
	ItemData["何首乌粉末"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 18
		,wp_4 = 2
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xd9164c3d
		,wp_13 = 0x3253b63d
		}
	ItemData["杜仲粉末"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 18
		,wp_4 = 3
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x930bb958
		,wp_13 = 0xf16a46de
		}
	ItemData["当归粉末"]={
		wp_1 = ""
		,wp_2 = 151
		,wp_3 = 18
		,wp_4 = 4
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x537158c8
		,wp_13 = 0xca54d687
		}
	ItemData["灵兽甘露"]={
		wp_1 = ""
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xa34f5b54
		,wp_13 = 0xb86bdaba
		}
	ItemData["灵兽仙饮"]={
		wp_1 = ""
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xb16d7e86
		,wp_13 = 0xe551cc4d
		}
	ItemData["采药工具"]={
		wp_1 = ""
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x8ca65026
		,wp_13 = 0x43c14227
		}
	ItemData["神兜兜"]={
		wp_1 = "三界之内的神兽们最喜欢的玩具，积攒一定数量，可以提高神兽属性。"
		,wp_2 = 100
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x50808141
		,wp_13 = 0x65756770
		}
	ItemData["灵兜兜"]={
		wp_1 = "生肖神兽们最喜欢的玩具，再积攒99个神兜兜，就可以挑一个生肖神兽带回家哦"
		,wp_2 = 100
		,wp_3 = 1
		,wp_4 = 2
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xd6363dd6
		,wp_13 = 0x5fbab8dc
		}
	ItemData["秘制食谱"]={
		wp_1 = "一本记载着神秘食物的食谱"
		,wp_2 = 154
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xeb4073b0
		,wp_13 = 0x46a41c72
		--儿童用品\心态
		}
	ItemData["急就章"]={
		wp_1 = "汉代书籍,是学里的启蒙读物"
		,wp_2 = 115
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x858E664B
		,wp_13 = 0x02A7220C
		}
	ItemData["诗经"]={
		wp_1 = "本书是我国诗歌总集，收集了自西周初年至春秋中叶五百多年的诗歌305篇。"
		,wp_2 = 115
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x85D2EFBA
		,wp_13 = 0x16C00727
		}
	ItemData["道德经"]={
		wp_1 = "春秋时期老子（李耳）的哲学作品"
		,wp_2 = 115
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x35CEF5D7
		,wp_13 = 0x5502A1AB
		}
	ItemData["论语"]={
		wp_1 = "儒家学派的著作,记载着圣人孔子的言行语录"
		,wp_2 = 115
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B17D536
		,wp_13 = 0x8BC893E3
		}
	ItemData["千字文"]={
		wp_1 = "南北朝时期出现的千字文章,构思精巧,文采要然被视为学童的启蒙书籍"
		,wp_2 = 115
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA89B1738
		,wp_13 = 0xE59ACEF6
		--儿童用品\宝物
		}
	ItemData["奇异果"]={
		wp_1 = "不知名的小果子,极为少见,却有着神奇的功效"
		,wp_2 = 116
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x179F7D36
		,wp_13 = 0x0A3F5089
		}
	ItemData["蚩尤武决"]={
		wp_1 = "记载着蚩尤所创的武术心法"
		,wp_2 = 116
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xEEEF73FE
		,wp_13 = 0xFFA98C67
		}
	ItemData["还魂秘术"]={
		wp_1 = "神奇的医书移本,据说书中记载着还魂之法,能够令人起死回生"
		,wp_2 = 116
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7CB8F1DE
		,wp_13 = 0x57E552F8
		}
	ItemData["黄帝内经"]={
		wp_1 = "《黄帝内经》分《灵枢》、《素问》两部分，是中国最早的医学典籍，传统医学四大经典著作之一（其余三者为《难经》、《伤寒杂病论》、《神农本草经》）。"
		,wp_2 = 116
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x79DCE38D
		,wp_13 = 0xA83EBDBE
		--儿童用品\其他
		}
	ItemData["逍遥镜"]={
		wp_1 = "神奇的逍遥宝镜，能方便的查看宝宝的能力和属性，或将宝宝隐藏在镜子中，不允许交易，给予丢弃逍遥镜并不能使子女转移"
		,wp_2 = 117
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA5AE23C8
		,wp_13 = 0x0FCF8535
		}
	ItemData["千年人参"]={
		wp_1 = "给予房屋的管家,用于生小孩。"
		,wp_2 = 117
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x62FFD9C1
		,wp_13 = 0x5A18EB09
		}
	ItemData["孤儿手册"]={
		wp_1 ="记载着一些孤儿名字的手册，常有一些好心人伸出爱心之手，将这些孤儿收养成自己的子女，并培养他们长大成人。如果过期太久孤儿已被领养，名册也将失效"
		,wp_2 = 117
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6F2F8C9D
		,wp_13 = 0x553177FD
		--儿童用品\体质
		}
	ItemData["瑶池蟠桃"]={
		wp_1 = "天宫王母娘娘瑶池中生长的蟠桃,据说有着延年益寿的功效"
		,wp_2 = 118
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x58849704
		,wp_13 = 0x140D0428
		}
	ItemData["玉灵果"]={
		wp_1 = "比较少见的果子,生长在山野之中,味道甘甜"
		,wp_2 = 118
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2351EC3B
		,wp_13 = 0x9B1BF142
		}
	ItemData["糖葫芦"]={
		wp_1 = "将小果子穿在竹签上,并裹上冰糖而制成,是小孩子特别喜欢的食品"
		,wp_2 = 118
		,wp_3 = 1
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xD13112E9
		,wp_13 = 0xE23DDAEF
		--儿童用品\武学悟性
		}
	ItemData["红木短剑"]={
		wp_1 = "木制的短劉,可作为练习武术的兵器"
		,wp_2 = 119
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x5E4CC079
		,wp_13 = 0xB88A499A
		}
	ItemData["弹弓"]={
		wp_1 = "古代的儿童玩具"
		,wp_2 = 119
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x84721CEA
		,wp_13 = 0xF387273F
		}
	ItemData["竹马"]={
		wp_1 = "古代的儿童玩具"
		,wp_2 = 119
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x15620590
		,wp_13 = 0xD826CC47
		}
	ItemData["投掷沙包"]={
		wp_1 = "古代的儿童玩具"
		,wp_2 = 119
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD1CAE6BA
		,wp_13 = 0x95F272C7
		}
	ItemData["猴皮筋"]={
		wp_1 = "古代的儿童玩具"
		,wp_2 = 119
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9F33CFA6
		,wp_13 = 0xCA2790BB
		--儿童用品\法术悟性
		}
	ItemData["百兽图谱"]={
		wp_1 = "记载着常见野兽的形态和习性"
		,wp_2 = 120
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1ED168B4
		,wp_13 = 0xE5912495
		}
	ItemData["山海经"]={
		wp_1 = "古代自然地理著作,记载了大量的远古神话传说"
		,wp_2 = 120
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x43C5D022
		,wp_13 = 0xB0CDA399
		}
	ItemData["列异传"]={
		wp_1 = "魏晋时期的神怪小说"
		,wp_2 = 120
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6A6C8907
		,wp_13 = 0x88F6AAEB
		}
	ItemData["搜神记"]={
		wp_1 = "古代著名的神怪小说,晋朝干宝所著"
		,wp_2 = 120
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xCBE7FC23
		,wp_13 = 0xD8BCD815
		}
	ItemData["启蒙棋谱"]={
		wp_1 = "讲述棋类入门知识的书册"
		,wp_2 = 120
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xB2D45F87
		,wp_13 = 0x9BE9DF11
		--活动道具
		}
	ItemData["七彩礼盒"]={ -- 元旦\礼盒_
		wp_1 = ""
		,wp_2 = 121
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x6853A6ED
		,wp_13 = 0xB0087763
		}
	-- ItemData["雪人眼睛"]={ -- 元旦
	-- 	wp_1 = "在堆雪人中雪人成长最后所需要的物品"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0x5BD31714
	-- 	,wp_13 = 0xCAFDB990
	-- 	}
	-- ItemData["雪人鼻子"]={ -- 元旦
	-- 	wp_1 = "在堆雪人中雪人成长最后所需要的物品"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 1
	-- 	,wp_4 = 2
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0x925F02E3
	-- 	,wp_13 = 0x587AE336
	-- 	}
	-- ItemData["雪人帽子"]={ -- 元旦
	-- 	wp_1 = "在堆雪人中雪人成长最后所需要的物品"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 1
	-- 	,wp_4 = 3
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0xA0502DA4
	-- 	,wp_13 = 0xD487C373
	-- 	}
	-- ItemData["小雪块"]={ -- 元旦
	-- 	wp_1 = "在堆雪人活动上交给雪人可以增加堆雪人进度2点"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 1
	-- 	,wp_4 = 4
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0x9BEE2ED1
	-- 	,wp_13 = 0xBCE0AE05
	-- 	}
	-- ItemData["大雪块"]={ -- 元旦
	-- 	wp_1 = "在堆雪人活动上交给雪人可以增加堆雪人进度4点"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 1
	-- 	,wp_4 = 5
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0x43F99886
	-- 	,wp_13 = 0x1E5C9739
	-- 	}
	ItemData["年糕"]={ -- 春节
		wp_1 = "普陀的年糕看起来味道一般"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x30138619
		,wp_13 = 0x8218381f
		}
	ItemData["饺子"]={
		wp_1 = "一碗热气腾腾的饺子"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xf124d2d6
		,wp_13 = 0x3ebc654f
		}
	ItemData["杂烩粥"]={
		wp_1 = "各种各样材料制成的粥，散发着浓郁的香气"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8da58e2
		,wp_13 = 0x1c704a0e
		}
	ItemData["红烧鲤鱼"]={
		wp_1 = "把鲤鱼用红烧的技法制成的料理"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0x92e700a4
		,wp_13 =0x4d688a82
		}
	ItemData["什锦年糕"]={
		wp_1 = "加入各种各样素材的年糕"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0xad68a1e
		,wp_13 =0xbf47cc4
		}
	ItemData["油焖对虾"]={
		wp_1 = "把对虾用油焖的方式制成的料理"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0xfa7e7b68
		,wp_13 =0x463be847
		}
	ItemData["果蔬羹"]={
		wp_1 = "用果蔬制成的粥，飘着淡淡的香气"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x30138619
		,wp_13 = 0x30138619
		}
	ItemData["白粥"]={
		wp_1 = "用清水和白米制成的粥，虽然清淡但吃下去别有一番滋味"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0x37d755a2
		,wp_13 =0x13af3253
		}
	ItemData["果蔬篮"]={
		wp_1 = "装满各种水果的篮子"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0x7a607753
		,wp_13 =0x75d8da92
		}

	ItemData["药膳粥"]={
		wp_1 = "用名贵药材制成的粥，吃下去有大补的功效"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x6394740
		,wp_13 = 0x24b6e819
		}
	ItemData["红烧鲫鱼"]={
		wp_1 = "把鲫鱼用红烧的技法制成的料理"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0x9d8f8f95
		,wp_13 =0x859fd05e
		}
	ItemData["苹果果脯"]={
		wp_1 = "将苹果用特殊的方法制成的可以保存很长时间"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xb4f1b40a
		,wp_13 = 0xa108ea05
		}
	ItemData["大乱炖"]={
		wp_1 = "将各种各样的食材放进锅里乱炖，谁也不知道下一口是什么滋味"
		,wp_2 = 1
		,wp_3 = 1
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 =0x9785d231
		,wp_13 =0x941c62ff
		}
	ItemData["神奇的年糕"]={ -- 春节
		wp_1 = "神奇的年糕,可以补充天量的气血"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x30138619
		,wp_13 = 0x8218381f
		}
	ItemData["神奇的饺子"]={
		wp_1 = "神奇的饺子,可以补充天量的魔法"
		,wp_2 = 1
		,wp_3 = 4
		,wp_4 = 1
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xf124d2d6
		,wp_13 = 0x3ebc654f
		}
	ItemData["新春导标旗"]={
		wp_1 = "来像是平常的导标旗,但效果却不同凡响"
		,wp_2 = 11
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x3c559d3b
		,wp_13 = 0x1b910784
		}
	ItemData["一生一世礼盒"]={
		wp_1 = "象征一生一世永不分离的爱情礼盒"
		,wp_2 = 121
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xa0458a43
		,wp_13 = 0x2e5a6f4b
		}
	ItemData["茴香"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 1
		,wp_11 = "common/item.wdf"
		,wp_12 =0xabff9e2b
		,wp_13 =0x438eb10d
		}
	ItemData["韭菜"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 =0xa56aeee3
		,wp_13 =0xfb7797a2
		}
	ItemData["蘑菇"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 =0xe28d168d
		,wp_13 =0xc0639106
		}
	ItemData["猪肉"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 4
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xa0542ba
		,wp_13 = 0xadb2ab9b
		}
	ItemData["虾仁"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 =0x6531f84e
		,wp_13 =0x5bf03810
		}
	ItemData["鸡蛋"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 =0xe20938cd
		,wp_13 =0x990c9038
		}
	ItemData["吉庆鱼"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 7
		,wp_11 = "item.wdf"
		,wp_12 =0xbc1a72c9
		,wp_13 =0x739c6d76
		}
	ItemData["羊肉"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 8
		,wp_11 = "item.wdf"
		,wp_12 =0x88be1648
		,wp_13 =0xab4299
		}
	ItemData["福钱"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 9
		,wp_11 = "item.wdf"
		,wp_12 =0x4a0fa9c2
		,wp_13 =0xd5ec3725
		}
	ItemData["面粉"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 10
		,wp_11 = "item.wdf"
		,wp_12 =0x7e5d886b
		,wp_13 =0x3ce911b4
		}
	ItemData["清水"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 11
		,wp_11 = "item.wdf"
		,wp_12 =0x37d755a2
		,wp_13 =0x13af3253
		}
	ItemData["酵母"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 12
		,wp_11 = "common/item.wdf"
		,wp_12 = 0xf6d57eba
		,wp_13 = 0x4b616312
		}
	ItemData["食盒"]={
		wp_1 = "用来新春料理的新鲜食材"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 13
		,wp_11 = "common/item.wdf"
		,wp_12 = 0x56b58d71
		,wp_13 = 0x7d492390
		}
	ItemData["年兽角"]={ -- 春节
		wp_1 = "年兽掉落下来的角可兑换奖励"
		,wp_2 = 151
		,wp_3 = 2
		,wp_4 = 13
		,wp_11 = "item.wdf"
		,wp_12 = 0x192AC668
		,wp_13 = 0x1E4FCFB1
		}
	ItemData["汤圆"]={ -- 元宵
		wp_1 = "香甜可口食用后有意想不到的效果"
		,wp_2 = 122
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x522C3747
		,wp_13 = 0xF04964D3
		}
	ItemData["巧克力"]={ -- 情人节
		wp_1 = "藏有对方满满心意的巧克力"
		,wp_2 = 123
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x606C43F7
		,wp_13 = 0x0073358A
		}
	ItemData["可可豆"]={ -- 情人节
		wp_1 = "制作巧克力的材料"
		,wp_2 = 151
		,wp_3 = 3
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x078632D7
		,wp_13 = 0x5A53D0E4
		}
	ItemData["牛奶"]={ -- 情人节
		wp_1 = "制作巧克力的材料"
		,wp_2 = 151
		,wp_3 = 3
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x89B1BBAB
		,wp_13 = 0x97934F1A
		}
	ItemData["果仁"]={ -- 情人节
		wp_1 = "制作巧克力的材料"
		,wp_2 = 151
		,wp_3 = 3
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x573B1B81
		,wp_13 = 0xBA919B16
		}
	ItemData["星辰碎片"]={ --天罡星奖励
		wp_1 = "天罡星幻影遗留下来的星辰碎片,散发出夺目的光芒，强大的法力在四周环绕"
		,wp_2 = 124
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xC93BEEA5
		,wp_13 = 0x39DF5C8A
		}
	ItemData["雄黄酒"]={ -- 端午
		wp_1 = "蕴含强大能力的酒，子女食用后可提升子女的成长"
		,wp_2 = 125
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x09E7EF9B
		,wp_13 = 0x3FAC5193
		}
	ItemData["粽子"]={ -- 端午
		wp_1 = "香甜可口的粽子蕴藏着惊喜，小心别被甜到。"
		,wp_2 = 126
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0x8BC85C76
		,wp_13 = 0xC3DB289E
		}
	ItemData["梦幻精品粽子"]={ -- 端午
		wp_1 = "散发着奇特香味的粽子据说是用仙米玉露制作而成，使用后随机增加一点人物属性"
		,wp_2 = 127
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0xBCC77E82
		,wp_13 = 0x48D53A2A
		}
	ItemData["粽叶"]={ -- 端午
		wp_1 = "用来制作粽子的新鲜食材"
		,wp_2 = 151
		,wp_3 = 4
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x99D28265
		,wp_13 = 0x3A97F2CC
		}
	ItemData["糯米"]={ -- 端午
		wp_1 = "用来制作粽子的新鲜食材"
		,wp_2 = 151
		,wp_3 = 4
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B36A2AF
		,wp_13 = 0x8B7606F7
		}
	ItemData["豆沙"]={ -- 端午
		wp_1 = "用来制作粽子的新鲜食材"
		,wp_2 = 151
		,wp_3 = 4
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xA0B79BD5
		,wp_13 = 0xC8C0B4B9
		}
	ItemData["鲜肉"]={ -- 端午
		wp_1 = "用来制作粽子的新鲜食材"
		,wp_2 = 151
		,wp_3 = 4
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xB9729D4F
		,wp_13 = 0xA2DDB784
		}
	ItemData["知了"]={ -- 暑假 --交给游方郎中获得经验和金钱奖励
		wp_1 = "夏天出现的昆虫，一般附在树上发出嘹亮的吟唱,是孩子们喜欢捕捉的对象"
		,wp_2 = 151
		,wp_3 = 5
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x05182D45
		,wp_13 = 0xB5AACFF4
		}
	-- ItemData["蟋蟀"]={ -- 暑假
	-- 	wp_1 = "蟋蟀，也叫蛐蛐，好斗。是人们夏天时喜欢捕捉用来娱乐的昆虫"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 5
	-- 	,wp_4 = 2
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0x84CB50EE
	-- 	,wp_13 = 0xFE8489CF
	-- 	}
	-- ItemData["小螃蟹"]={ -- 暑假 --游泳活动掉落
	-- 	wp_1 = "经常在海边出现的小动物，是人们喜欢捕捉的对象"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 5
	-- 	,wp_4 = 3
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0xF8DDDAFE
	-- 	,wp_13 = 0x3CE0DDEB
	-- 	}
	-- ItemData["梦幻瓜子"]={ -- 暑假
	-- 	wp_1 = "被妖怪抢走的西瓜子交给王婆会得到奖励"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 5
	-- 	,wp_4 = 4
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0xFD49CADA
	-- 	,wp_13 = 0xE18A6518
	-- 	}
	-- ItemData["梦幻西瓜"]={ -- 暑假--西瓜妖
	-- 	wp_1 = "被妖怪抢走的西瓜，香甜解渴。交给王婆会得到奖励"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 5
	-- 	,wp_4 = 5
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0x3368A7F6
	-- 	,wp_13 = 0x29128F7E
	-- 	}
	-- ItemData["同心锁"]={ -- 七夕 --
	-- 	wp_1 = "象征爱情的宝物，传说可以锁住世间痴情男女的心"
	-- 	,wp_2 = 151
	-- 	,wp_3 = 6
	-- 	,wp_4 = 1
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0xDCFA1890
	-- 	,wp_13 = 0xB8626423
	-- 	}
	-- ItemData["喜鹊羽毛"]={ -- 七夕
	-- 	wp_1 = "一只漂亮的翎毛，传说是由鹊桥的喜鹊羽化而成，可以带着他到指定的地点寻宝，以增加翎毛的灵气，灵气到达3点后翎毛会化成喜鹊飞回鹊桥。"
	-- 	,wp_2 = 128
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "item.wdf"
	-- 	,wp_12 = 0xB71BFA28
	-- 	,wp_13 = 0x6561427C
	-- 	}
	-- ItemData["七彩羽毛"]={
	-- 	wp_1 = "一只漂亮的翎毛，传说是由鹊桥的喜鹊羽化而成，可以带着他到指定的地点寻宝，以增加翎毛的灵气，灵气到达3点后翎毛会化成喜鹊飞回鹊桥。"
	-- 	,wp_2 = 129
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "common/item.wdf"
	-- 	,wp_12 = 0xe18b12d5
	-- 	,wp_13 = 0x62401e62
	-- 	}
	-- ItemData["黄蓝羽毛"]={
	-- 	wp_1 = "一只漂亮的翎毛，传说是由鹊桥的喜鹊羽化而成，可以带着他到指定的地点寻宝，以增加翎毛的灵气，灵气到达3点后翎毛会化成喜鹊飞回鹊桥。"
	-- 	,wp_2 = 130
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "common/item.wdf"
	-- 	,wp_12 = 0xe044774a
	-- 	,wp_13 = 0x68cdf262
	-- 	}
	-- ItemData["粉色羽毛"]={
	-- 	wp_1 = "一只漂亮的翎毛，传说是由鹊桥的喜鹊羽化而成，可以带着他到指定的地点寻宝，以增加翎毛的灵气，灵气到达3点后翎毛会化成喜鹊飞回鹊桥。"
	-- 	,wp_2 = 131
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "common/item.wdf"
	-- 	,wp_12 = 0x418bac8
	-- 	,wp_13 = 0x7a363ce9
	-- 	}
	-- ItemData["蓝色羽毛"]={
	-- 	wp_1 = "一只漂亮的翎毛，传说是由鹊桥的喜鹊羽化而成，可以带着他到指定的地点寻宝，以增加翎毛的灵气，灵气到达3点后翎毛会化成喜鹊飞回鹊桥。"
	-- 	,wp_2 = 132
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "common/item.wdf"
	-- 	,wp_12 = 0xcb653666
	-- 	,wp_13 = 0x79bebc84
	-- 	}
	-- ItemData["白色羽毛"]={
	-- 	wp_1 = "一只漂亮的翎毛，传说是由鹊桥的喜鹊羽化而成，可以带着他到指定的地点寻宝，以增加翎毛的灵气，灵气到达3点后翎毛会化成喜鹊飞回鹊桥。"
	-- 	,wp_2 = 133
	-- 	,wp_3 = 1
	-- 	,wp_4 = 1
	-- 	,wp_11 = "common/item.wdf"
	-- 	,wp_12 = 0xed26751b
	-- 	,wp_13 = 0x8639741f
	-- 	}
	ItemData["寿桃"]={ -- 三周年
		wp_1 = "一颗上好蟠桃烹制而成的寿桃，让我们共祝梦幻西游生日快乐，服用后受到吉祥如意的祝福，并能获得意想不到的效果"
		,wp_2 = 134
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x8279ED5D
		,wp_13 = 0x53A86671
		}
	ItemData["三千年蟠桃"]={ -- 蟠桃园蟠桃盛会
		wp_1 ="来自于蟠桃园的仙桃，服用后受到吉祥如意的祝福，并能获得意想不到的效果"
		,wp_2 = 100
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x58849704
		,wp_13 = 0x140D0428
		}
	ItemData["六千年蟠桃"]={ -- 蟠桃园蟠桃盛会
		wp_1 ="来自于蟠桃园的仙桃，服用后受到吉祥如意的祝福，并能获得意想不到的效果"
		,wp_2 = 100
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x58849704
		,wp_13 = 0x140D0428
		}
	ItemData["九千年蟠桃"]={ -- 蟠桃园蟠桃盛会
		wp_1 ="来自于蟠桃园的仙桃，服用后受到吉祥如意的祝福，并能获得意想不到的效果"
		,wp_2 = 100
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x58849704
		,wp_13 = 0x140D0428
		}
	ItemData["修炼石"]={ -- 三周年
		wp_1 = "珍贵稀有的炼妖神品，能令召唤兽回到原始状态，并有一定几率点化出神兽"
		,wp_2 = 138
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD7478119
		,wp_13 = 0xE06A6568
		}
	ItemData["梦"]={ -- 三周年
		wp_1 = "字牌，集齐“梦幻西游”四个字牌可以找长安（228，106）喜牌征集使者兑换相应的奖励"
		,wp_2 = 151
		,wp_3 = 7
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x19C1AA78
		,wp_13 = 0xC6E1AA16
		}
	ItemData["幻"]={ -- 三周年
		wp_1 = "字牌，集齐“梦幻西游”四个字牌可以找长安（228，106）喜牌征集使者兑换相应的奖励"
		,wp_2 = 151
		,wp_3 = 7
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xB7894265
		,wp_13 = 0x0C9B4398
		}
	ItemData["西"]={ -- 三周年
		wp_1 = "字牌，集齐“梦幻西游”四个字牌可以找长安（228，106）喜牌征集使者兑换相应的奖励"
		,wp_2 = 151
		,wp_3 = 7
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x0C5361F2
		,wp_13 = 0xEDC77478
		}
	ItemData["游"]={ -- 三周年
		wp_1 = "字牌，集齐“梦幻西游”四个字牌可以找长安（228，106）喜牌征集使者兑换相应的奖励"
		,wp_2 = 151
		,wp_3 = 7
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x2D09DB7B
		,wp_13 = 0x1B3D370B
		}
	ItemData["组合烟花"]={ -- 三周年
		wp_1 = "可以组合成任意样式的烟花"
		,wp_2 = 139
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xB0EA71D1
		,wp_13 = 0x8DF15790
		}
	ItemData["钥匙"]={ -- 帮派迷宫
		wp_1 = ""
		,wp_2 = 1100
		,wp_3 = 1
		,wp_4 = 10001
		,wp_11 = "item.wdf"
		,wp_12 = 0xA4E274FD
		,wp_13 = 0x65649830
		}
	ItemData["情报"]={
		wp_1 = "敌军的情报，速速交给李将军吧！"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_8 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xDDB28CB8 --小 0x5A0E9307
		,wp_13 = 0x63F3C3F2 --大 0x62EB440C8
		}
	ItemData["援军情报"]={ -- 烽火边陲
		wp_1 = "援军的情报，可以上交获得奖励"
		,wp_2 = 151
		,wp_3 = 8
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x22F8AD71
		,wp_13 = 0x37E3FF54
		}
	ItemData["突厥情报"]={ -- 烽火边陲
		wp_1 = "突厥的详细计划，可以上交获得奖励"
		,wp_2 = 151
		,wp_3 = 8
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x5632871B
		,wp_13 = 0x99B68B1D
		}
	ItemData["突厥密令"]={
		wp_1 = "从突厥军中身上截获的令牌，似乎可以混入其中。"
		,wp_2 = 140
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = "右键即可领取突厥入侵任务"
		,wp_11 = "item.wdf"
		,wp_12 = 0x79E9E6B0
		,wp_13 = 0xE84B01F2
		}
	ItemData["军粮"]={ -- 守军之争
		wp_1 = "到本府后勤基地军需官处用军饷来换取军粮。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x43F751CF
		,wp_13 = 0x065D0A25
		}
	ItemData["废弃兵刃"]={ -- 守军之争
		wp_1 = "给予兵器工匠，提升该武器工匠对本府建设支援度。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xDA5DE35B
		,wp_13 = 0x722F282E
		}
	ItemData["调兵令"]={ --守军之争
		wp_1 = "给予本府府帅用于调动相应的兵力攻击敌对阵营，不同的兵力所所需的调兵令也不同。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xE61BCB64
		,wp_13 = 0x2245FC11
		}
	ItemData["遣将令"]={ --守军之争
		wp_1 = "给予本府府帅用于调动猛将，当遣将令达到一定数量时本府的猛将将现身攻击敌方府帅。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xE61BCB64
		,wp_13 = 0x2245FC11
		}
	ItemData["征兵令"]={ --守军之争
		wp_1 = "给予本府后勤基地的征兵长，提升本府的兵力值，但会减少本府的兵器库存量。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0xE61BCB64
		,wp_13 = 0x2245FC11
		}
	ItemData["兵刃令"]={ --守军之争
		wp_1 = "给予本府后勤基地的兵器长，提升本府的兵器存量。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0xE61BCB64
		,wp_13 = 0x2245FC11
		}
	ItemData["离间计谋书"]={ -- 守军之争
		wp_1 = "使用后将获得离间任务，前往敌方征兵长处对其进行离间。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 7
		,wp_11 = "item.wdf"
		,wp_12 = 0xC87B2399
		,wp_13 = 0x4AF99474
		}
	ItemData["折戈计谋书"]={ -- 守军之争
		wp_1 = "使用后将获得折戈任务，前往敌方兵器长处破坏其武器库。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 8
		,wp_11 = "item.wdf"
		,wp_12 = 0xDDB28CB8
		,wp_13 = 0x63F3C3F2
		}
	ItemData["突袭计谋书"]={ -- 守军之争
		wp_1 = "使用后将获得突袭任务，前往敌方府帅处对其进行偷袭。"
		,wp_2 = 151
		,wp_3 = 9
		,wp_4 = 9
		,wp_11 = "item.wdf"
		,wp_12 = 0xE06CA80A
		,wp_13 = 0x7FDDA5A5
		}
	ItemData["小龟点卷"]={ -- 小龟快跑
		wp_1 = "一张画有小乌龟的卡片，拿这张卡片参加小龟赛跑，下注可不需要银两"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xA8E5CBE2
		,wp_13 = 0x3EC79B79
		--幻境寻宝
		}
	ItemData["幻境宝图"]={ -- 活动法宝
		wp_1 = "记载着幻境宝藏的地图。据说有人按图挖宝后一夜暴富，仅在当前活动场景内有效"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 1
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0x08A81EFD
		,wp_13 = 0xDC2ABBE3
		}
	ItemData["幻境银票"]={ -- 活动法宝
		wp_1 = "幻境内唯一通行的银票，存放幻境内的虚拟货币，方便、快捷、易于携带，是幻境寻宝的必备之物"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 2
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xFA49DAFD
		,wp_13 = 0x7F1E2D96
		}
	ItemData["商品红宝石"]={ -- 活动法宝
		wp_1 = "幻境特有的商品，颜色各异，材质多样，造型独特，光彩夺目"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 3
		,wp_8 = "幻境内的宝石商店找“宝石商人”买卖"
		,wp_11 = "item.wdf"
		,wp_12 = 0x58A38BB2
		,wp_13 = 0x646BBBBA
		}
	ItemData["商品黄宝石"]={ -- 活动法宝
		wp_1 = "幻境特有的商品，颜色各异，材质多样，造型独特，光彩夺目"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 4
		,wp_8 = "幻境内的宝石商店找“宝石商人”买卖"
		,wp_11 = "item.wdf"
		,wp_12 = 0x5FEB2737
		,wp_13 = 0xBDE0D867
		}
	ItemData["商品绿宝石"]={ -- 活动法宝
		wp_1 = "幻境特有的商品，颜色各异，材质多样，造型独特，光彩夺目"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 3
		,wp_8 = "幻境内的宝石商店找“宝石商人”买卖"
		,wp_11 = "item.wdf"
		,wp_12 = 0xBC9E6C34
		,wp_13 = 0x2B160D85
		}
	ItemData["商品蓝宝石"]={ -- 活动法宝
		wp_1 = "幻境特有的商品，颜色各异，材质多样，造型独特，光彩夺目"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 5
		,wp_8 = "幻境内的宝石商店找“宝石商人”买卖"
		,wp_11 = "item.wdf"
		,wp_12 = 0xC6097F37
		,wp_13 = 0x5991F939
		}
	ItemData["修为符"]={ -- 活动法宝
		wp_1 = "修仙之人飞升后留下的符咒，使用后可随机提高人物某项属性的临时上限。仅在当次活动内有效"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 6
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xD59C29E0
		,wp_13 = 0x778A5F92
		}

		ItemData["精炼之锤中"]={ -- 活动法宝
wp_1= "远古天神遗物，能让装备受到远古天神的庇护。"
,wp_2 = 9
,wp_3 = 11
,wp_4= 0
,wp_8 = 1
,wp_11 = "zdtb.wdf"
,wp_12 = 0x00000098
,wp_13 = 0x00000097
		}
		ItemData["精炼之锤高"]={ -- 活动法宝
wp_1= "远古天神遗物，能让装备受到远古天神的庇护。"
,wp_2 = 9
,wp_3 = 11
,wp_4= 0
,wp_8 = 1
,wp_11 = "zdtb.wdf"
,wp_12 = 0x00000100
,wp_13 = 0x00000099
		}
		ItemData["精炼之锤低"]={ -- 活动法宝
wp_1= "远古天神遗物，能让装备受到远古天神的庇护。"
,wp_2 = 9
,wp_3 = 11
,wp_4= 0
,wp_8 = 1
,wp_11 = "zdtb.wdf"
,wp_12 = 0x00000096
,wp_13 = 0x00000097
		}
	ItemData["一步符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后前进一个场景"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 7
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0x48B93CBB
		,wp_13 = 0x72403D70
		}
	ItemData["二步符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后前进二个场景"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 8
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0x58608968
		,wp_13 = 0xA641FD3A
		}
	ItemData["三步符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后前进三个场景"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 9
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0x5E02FFD5
		,wp_13 = 0x3D0F89F1
		}
	ItemData["四步符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后前进四个场景。"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 10
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xF8B512AD
		,wp_13 = 0xF3CD6A06
		}
	ItemData["五步符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后前进五个场景"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 11
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0x37156C26
		,wp_13 = 0xC27AC1E8
		}
	ItemData["快速符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后以原本速度双倍前进"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 12
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xF0C8205E
		,wp_13 = 0x53AC9EB2
		}
	ItemData["极速符"]={ -- 前进法宝
		wp_1 = "远古奇人研究的一种专门用于寻宝的神奇符咒，使用后以原本速度三倍前进"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 13
		,wp_8 = "直接右键点击使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xDA7D97DF
		,wp_13 = 0x48B97C1F
		}
	ItemData["窃取符"]={ -- 玩家法宝
		wp_1 = "贼王的得意作品，使用后可窃取敌对玩家身上的金钱若干"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 14
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0x85C837C4
		,wp_13 = 0x1A670AB2
		}
	ItemData["定身符"]={ -- 玩家法宝
		wp_1 = "方寸山流传出的一种厉害符咒，使用后可以使敌对玩家停留在该场景一定时间内不能动弹"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 15
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0x1DF8304A
		,wp_13 = 0x8BA4590E
		}
	ItemData["障碍符"]={ -- 玩家法宝
		wp_1 = "一种诡异的符咒，使用后可使敌对玩家重新回到本场景"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 16
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0x296571A3
		,wp_13 = 0xB0B4D2FF
		}
	ItemData["妙手符"]={ -- 玩家法宝
		wp_1 = "贼王的得意作品，使用后可窃取敌对玩家身上的活动道具一件"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 17
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0xE24328EA
		,wp_13 = 0x8BFEA884
		}
	ItemData["捉弄符"]={ -- 玩家法宝
		wp_1 = "以捉弄人为乐的调皮神仙弄出来的实验品，对敌对势力的玩家使用后可以造成莫名的小伤害"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 18
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0xBBC84377
		,wp_13 = 0xB0C25BE8
		}
	ItemData["旋风符"]={ -- 玩家法宝
		wp_1 = "	一种不知来历的莫名符咒，使用后可以使敌对玩家飞向一个任意场景"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 19
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0xD10FC894
		,wp_13 = 0xCCE00F24
		}
	ItemData["占地符"]={ -- 玩家法宝
		wp_1 = "具有神奇功效的符咒，用于占领其他势力对客栈的投资额"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 20
		,wp_8 = "在敌对势力占领的客栈交给“客栈总管”使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xCFE926FA
		,wp_13 = 0xB4048CF6
		}
	ItemData["夺地符"]={ -- 玩家法宝
		wp_1 = "具有神奇功效的符咒，用于抢夺其他势力对客栈的投资额"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 21
		,wp_8 = "在敌对势力占领的客栈交给“客栈总管”使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0x0C189355
		,wp_13 = 0x5AB76F5B
		}
	ItemData["乾坤置换符"]={ -- 玩家法宝
		wp_1 = "穷人一夜暴富的宝贝，对敌对势力的玩家使用，双方的现金会互换"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 22
		,wp_8 = "在敌对势力占领的客栈交给“客栈总管”使用"
		,wp_11 = "item.wdf"
		,wp_12 = 0xCE62BFFE
		,wp_13 = 0x2B356D94
		}
	ItemData["天下大同符"]={ -- 玩家法宝
		wp_1 = "穷人们最喜欢的宝贝。对敌对势力的玩家使用，双方的现金会平均分配两人身"
		,wp_2 = 151
		,wp_3 = 10
		,wp_4 = 23
		,wp_8 = "向敌对势力的玩家执行“给予”操作"
		,wp_11 = "item.wdf"
		,wp_12 = 0x2C17E688
		,wp_13 = 0xD1CF3007
		--剧情道具
		}
	ItemData["枯萎的金莲"]={ --10枯萎的金莲
		wp_1 = "尘世间人性的金莲，已因心魔之灭而焦枯。"
		,wp_2 = 150
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x88DCF8C0
		,wp_13 = 0x3B5F875C
		}
	ItemData["赤叶甘草"]={ --10枯萎的金莲
		wp_1 = "王大嫂的儿子病了，听说这种稀有的赤叶甘草可以救他一命。"
		,wp_2 = 150
		,wp_3 = 10
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x7695864F
		,wp_13 = 0x398835C0
		}
	ItemData["红烧鱼"]={ --10枯萎的金莲
		wp_1 = "王大嫂独家制作，美味极了。"
		,wp_2 = 150
		,wp_3 = 10
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x92E700A4
		,wp_13 = 0x4D688A82
		}
	ItemData["安魂草"]={ --10枯萎的金莲
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 10
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x7695864F
		,wp_13 = 0x398835C0
		}
	ItemData["松风灵芝"]={ --10枯萎的金莲
		wp_1 = "生长在松林之中的珍贵灵芝，十分稀有"
		,wp_2 = 150
		,wp_3 = 10
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x2F7C81CE
		,wp_13 = 0x696C18EE
		}
	ItemData["江州府大印"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2A66316C
		,wp_13 = 0xFEB99962
		}
	ItemData["奏折"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xF5CC975D
		,wp_13 = 0x540ECDBD
		}
	ItemData["般若多罗蜜心经"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5F3521DD
		,wp_13 = 0x16F7E7D7
		}
	ItemData["玄奘的血书"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0xB532CA67
		,wp_13 = 0xD043A5EE
		}
	ItemData["少女的手镯"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0x6843C74C
		,wp_13 = 0xCD8115EF
		}
	ItemData["定颜珠"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 7
		,wp_11 = "item.wdf"
		,wp_12 = 0x904CDC3B
		,wp_13 = 0x84AF9220
		}
	ItemData["殷温娇给殷丞相的信"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 8
		,wp_11 = "item.wdf"
		,wp_12 = 0x71517EA3
		,wp_13 = 0x825E8376
		}
	ItemData["玄奘给殷温娇的信"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 1
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xD0CAB5EC
		,wp_13 = 0x1B63F259
		}
	ItemData["碧水神石（绿）"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 9
		,wp_11 = "item.wdf"
		,wp_12 = 0x73A29905
		,wp_13 = 0xCA99C2CB
		}
	ItemData["孟婆酒"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 10
		,wp_11 = "item.wdf"
		,wp_12 = 0x37D755A2
		,wp_13 = 0x13AF3253
		}
	ItemData["辟水宝珠"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 11
		,wp_11 = "item.wdf"
		,wp_12 = 0x393a2252
		,wp_13 = 0xf1e88f7b
		}
	ItemData["辟水宝珠"]={ -- 025玄奘的身世
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 25
		,wp_4 = 12
		,wp_11 = "item.wdf"
		,wp_12 = 0x393a2252
		,wp_13 = 0xf1e88f7b
		}
	ItemData["琉璃盏的碎片"]={ -- 045寻找四琉璃
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDB545CED
		,wp_13 = 0x4E8477A9
		}
	ItemData["汗巾"]={ -- 045寻找四琉璃
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x6ACA56A7
		,wp_13 = 0x8C05A845
		}
	ItemData["卷帘大将的念珠"]={ -- 045大战心魔
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xE531F74C
		,wp_13 = 0x7834DACF
		}
	ItemData["火尖枪"]={ -- 045大战心魔
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x2E8DE37D
		,wp_13 = 0xCB2BC3DE
		}
	ItemData["仙露"]={ -- 045大战心魔
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0xaba607a9
		,wp_13 = 0x890fa6d3
		}
	ItemData["火尖枪2"]={ -- 045大战心魔
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x7D3B51E5
		,wp_13 = 0xB2E1A982
		}
	ItemData["金击子"]={ -- 045大战心魔
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 45
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0x70457677
		,wp_13 = 0xBA6C1764
		}
	ItemData["白剑"]={ -- 075含冤的小白龙
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 75
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x1FA5FD7B
		,wp_13 = 0x0C9C103B
		}
	ItemData["金箍"]={ -- 075含冤的小白龙
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 75
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x8513C977
		,wp_13 = 0xB53E1C4F
		}
	ItemData["金箍2"]={ -- 075含冤的小白龙
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 75
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xF0E0FADB
		,wp_13 = 0xD2EE535D
		}
	ItemData["玄天铁鞭"]={ -- 075含冤的小白龙
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 75
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xC1ABDBAB
		,wp_13 = 0x6FC2C186
		}
	ItemData["椰子"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x0C905FE8
		,wp_13 = 0xFCCFA495
		}
	ItemData["木偶"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xFDEE2CA7
		,wp_13 = 0x7DEAA627
		}
	ItemData["红线"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xF54F5721
		,wp_13 = 0x644BCB94
		}
	ItemData["玉佩"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x16A1E342
		,wp_13 = 0x03B8B41E
		}
	ItemData["定海珠"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x8AC6FC78
		,wp_13 = 0x408D4F09
		}
	ItemData["破碎的绿烟如梦"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 0xB841243C
		,wp_13 = 0x5767358F
		}
	ItemData["绿烟如梦"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 7
		,wp_11 = "item.wdf"
		,wp_12 = 0xD5DBD78E
		,wp_13 = 0xDA269DD9
		}
	ItemData["婚书"]={ -- 085八戒悟空剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 85
		,wp_4 = 8
		,wp_11 = "item.wdf"
		,wp_12 = 0x85533FE1
		,wp_13 = 0xC78A182B
		}
	ItemData["阴阳二气瓶"]={ -- 095小西天
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 95
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xF10103CD
		,wp_13 = 0xD6D5B24C
		}
	ItemData["混天绫1"]={ -- 100三打白骨精
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 100
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x17E30A79
		,wp_13 = 0x0822BB06
		}
	ItemData["混天绫2"]={ -- 100三打白骨精
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 100
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x4B5B4252
		,wp_13 = 0x94D114F1
		}
	ItemData["白衣人的令牌"]={ -- 100三打白骨精
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 100
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x3DD12EF3
		,wp_13 = 0x8F8DC4AF
		}
		ItemData["抽奖令牌"]={
		wp_1 = "右键使用可以获得一次抽奖机会"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x3DD12EF3
		,wp_13 = 0x8F8DC4AF
		}
	ItemData["抽奖仙令"]={
		wp_1 = "右键使用可以获得十次抽奖机会"
		,wp_2 = 1
		,wp_3 = 11
		,wp_4 = 0
		,wp_11 = "item.wdf"
		,wp_12 = 0x3DD12EF3
		,wp_13 = 0x8F8DC4AF
		}
	ItemData["照妖镜1"]={ -- 100三打白骨精
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 100
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0x8C3FA3A7
		,wp_13 = 0x9CF70E97
		}
	ItemData["锦囊"]={ -- 110真假美猴王
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 110
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x648EC81A
		,wp_13 = 0xF9ADE599
		}
	ItemData["给崔判官的信"]={ -- 110真假美猴王
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 110
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x1536D71E
		,wp_13 = 0xDF8219F7
		}
	ItemData["芭蕉扇"]={ -- 120智取芭蕉扇
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 120
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x39C321EC
		,wp_13 = 0x00A45C99
		}
	ItemData["假芭蕉扇"]={ -- 120智取芭蕉扇
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 120
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x4B324D43
		,wp_13 = 0xEA08F0AE
		}
	ItemData["避火诀"]={ --130飞升剧情
		wp_1 = "仙界的五行秘宝之一，拈此诀处在烈火中也安然无恙"
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x04694A50
		,wp_13 = 0xC3A8BEA9
		}
	ItemData["修篁斧"]={ --130飞升剧情
		wp_1 = "仙界的五行秘宝之一，为普陀山砍伐紫竹之物。"
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x25F0FF04
		,wp_13 = 0x34EF726D
		}
	ItemData["炼金鼎"]={ --130飞升剧情
		wp_1 = "仙界的五行秘宝之一，为五庄观修炼金丹之物。 "
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6BEC70D0
		,wp_13 = 0x45968E54
		}
	ItemData["镇海针"]={ --130飞升剧情
		wp_1 = "仙界的五行秘宝之一，为龙宫的镇海之宝。"
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 4
		,wp_11 = "item.wdf"
		,wp_12 = 0xF524FB0F
		,wp_13 = 0xD75D34DE
		}
	ItemData["不死壤"]={ --130飞升剧情
		wp_1 = ""
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 5
		,wp_11 = "item.wdf"
		,wp_12 = 0x96D2E66D
		,wp_13 = 0x8C14A6D1
		}
	ItemData["紫金冠"]={
		wp_1 = "火神遗留之物。冠上用金雕琢为吉龙盘云，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 447473455
		,wp_13 = 3859378496
		}
	ItemData["开山钺"]={
		wp_1 = "铁铸的巨大战斧，沉重无比，力大者用以开石裂碑"
		,wp_2 = 150
		,wp_3 = 130
		,wp_4 = 7
		,wp_11 = "item.wdf"
		,wp_12 = 2876225806
		,wp_13 = 511692637
		-- 副本物品
		}
	ItemData["玲珑"]={
		wp_1 = "交给观音大士，是锻造照妖镜所需要的材料。"
		,wp_2 = 150
		,wp_3 = 160
		,wp_4 = 1
		,wp_8 = nil
		,wp_11 = "item.wdf"
		,wp_12 = 0xDDA1D3AA
		,wp_13 = 0xD3DC3123
		}
	ItemData["普通木材"]={
		wp_1 = "一种常见的建筑木料，在搭建房屋时必须要用到它。"
		,wp_2 = 150
		,wp_3 = 160
		,wp_4 = 2
		,wp_8 = "在“车迟斗法副本”中可以增加道观建设度8点"
		,wp_11 = "item.wdf"
		,wp_12 = 1192555457
		,wp_13 = 4056791876
		}
	ItemData["高级木材"]={
		wp_1 = "比较稀有的建筑木料，在搭建房屋时必须要用到它。"
		,wp_2 = 150
		,wp_3 = 160
		,wp_4 = 3
		,wp_8 = "在“车迟斗法副本”中可以增加道观建设度20点"
		,wp_11 = "item.wdf"
		,wp_12 = 757799681
		,wp_13 = 2818741734
		}
	ItemData["回梦丹"]={
		wp_1 = "集天地灵气，欲三界之火而成的金丹，使用后两个小时内额外获得100%的经验与40%的储  备金加成奖励"
		,wp_2 = 4
		,wp_3 = 3
		,wp_4 = 1
		,wp_8 = "【使用限制】人物等价>=40。"
		,wp_11 = "item.wdf"
		,wp_12 = 0xd6684ca7
		,wp_13 = 0x9d8591d8
		}
	ItemData["五级镖银"]={
		wp_1 = "五级镖银,极贵的货物:如果—旦失镖了，可嘉要w家活来赔偿的哦。"
		,wp_2 = 150
		,wp_3 = 150
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x4bc6eac
		,wp_13 = 0xb8cda2ee
		}
	ItemData["红色玲珑石"]={
		wp_1 = "红色玲珑石，里面蕴藏着充裕的天地灵气。"
		,wp_2 = 151
		,wp_3 = 13
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2ce8ffb0
		,wp_13 = 0x5fb79e1b
		}
	ItemData["长安战报"]={
		wp_1 = "记录长安保卫战战况，右键点击使用可以及时查看当前局势"
		,wp_2 = 170
		,wp_3 = 1
		,wp_4 = 1
		,wp_8 = "【有效期限】下线消失，可向镖旗大将军领取。"
		,wp_11 = "item.wdf"
		,wp_12 = 0xe06ca80a
		,wp_13 = 0x99b68b1d
		}
	ItemData["进阶夜罗刹"]={
		wp_1 = "物理系的发动机"
		,wp_2 = 170
		,wp_3 = 2
		,wp_4 = 1
		,wp_8 = ""
		,wp_11 = "item.wd1"
		,wp_12 = 0xAB1EFFB3
		,wp_13 = 0xe5dd5555
		}
	ItemData["腾蛇炫卡"]={
		wp_1 = "使用腾蛇卡，变身为超级无敌可爱的腾蛇。"
		,wp_2 = 170
		,wp_3 = 2
		,wp_4 = 1
		,wp_8 = ""
		,wp_11 ="common/item.wdf"
		,wp_12 = 0x66e05e50
		,wp_13 = 0xfc2930d6
		}
	ItemData["雪人炫卡"]={
		wp_1 = "使用雪人卡，变身为超级无敌可爱的雪人。"
		,wp_2 = 170
		,wp_3 = 2
		,wp_4 = 1
		,wp_8 = ""
		,wp_11 = "item.wdf"
		,wp_12 = 0x6328756e
		,wp_13 = 0xa2371213
		}
	ItemData["房契"]={
		wp_1 = "记载着某处房屋，是进行房产交易的凭证，购买后即可获得相应的房屋。"
		,wp_2 = 170
		,wp_3 = 3
		,wp_4 = 1
		,wp_8 = ""
		,wp_11 = "item.wdf"
		,wp_12 = 0x88229120
		,wp_13 = 0x71ea0299
		}
	ItemData["主题牧场契约"]={
		wp_1 = "将契约交给牧场看守后，就可以随意更换牧场环境。"
		,wp_2 = 170
		,wp_3 = 4
		,wp_4 = 1
		,wp_8 = ""
		,wp_11 = "item.wdf"
		,wp_12 = 0x88229120
		,wp_13 = 0x71ea0299
		}
	ItemData["九霄清心丸"]={
		wp_1 = "采用秘方炼制而成的药丸服用后可以大幅提高修炼效率,停是由于药效太强所以不能多吃。"
		,wp_2 = 4
		,wp_3 = 3
		,wp_4 = 1
		,wp_8 = "【功效】购买后可以获得1小时的修行双倍经验"
		,wp_11 = "item.wdf"
		,wp_12 = 0xbd04a615
		,wp_13 = 0xb20a43c1
		}
	ItemData["天机培元丹"]={
		wp_1 = "采里秘方炼制而或的药丸，可以固本培元，增进修为。_"
		,wp_2 = 4
		,wp_3 = 3
		,wp_4 = 1
		,wp_8 = "【功效】购买后可以额外获得3小时修行时间。"
		,wp_11 = "item.wdf"
		,wp_12 = 0x69ff178a
		,wp_13 = 0xfb97d758
		------
		}
	ItemData["冰符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x934E9733
		,wp_13 = 0x6A962ED6
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"
		,wp_21 = {体质=1}
		}
	ItemData["土符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x3E964C29
		,wp_13 = 0x7E78A604
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"
		,wp_21 = {耐力=1}
		}
	ItemData["雷符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x67B1F794
		,wp_13 = 0x953A5574
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"--颜色
		,wp_21 = {敏捷=1}
		}
	ItemData["电符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xFCCD6BDA
		,wp_13 = 0x45E07435
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"--颜色
		,wp_21 = {法术防御=1}
		}
	ItemData["风符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x9D282EE9
		,wp_13 = 0x4180FB8D
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黄色"--颜色
		,wp_21 = {魔力=1}
		}
	ItemData["少阳符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x9D282EE9
		,wp_13 = 0x4180FB8D
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黄色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
	ItemData["炎符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x21B13715
		,wp_13 = 0xEEAF3D8E
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黄色"--颜色
		,wp_21 = {力量=1}
		}
	ItemData["火符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0xDC81D311
		,wp_13 = 0x71E54CDB
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黄色"--颜色
		,wp_21 = {法术伤害=1}
		--
		--二级符石----
		}
	ItemData["红云符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x76BEE0E4
		,wp_13 = 0x74261456
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"--颜色
		,wp_21 = {气血=10}
		}
	ItemData["碧玉符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x43676CDF
		,wp_13 = 0x74261456
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"--颜色
		,wp_21 = {防御=3}
		}
	ItemData["太阳符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x43676CDF
		,wp_13 = 0x74261456
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "红色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
	ItemData["金光符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x5737526C
		,wp_13 = 0x727F812B
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {命中=4}
		}
	ItemData["天神符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x81D8C883
		,wp_13 = 0x24549F76
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {伤害=1.5}
		}
	ItemData["飘渺符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x6B9B8016
		,wp_13 = 0x463956C5
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "绿色"--颜色
		,wp_21 = {灵力=1.5}
		}
	ItemData["天仙符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xE059F69F
		,wp_13 = 0xCC940789
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "绿色"--颜色
		,wp_21 = {魔法=6}
		}
	ItemData["霞光符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0xC32FCFBF
		,wp_13 = 0xC94732AA
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "绿色"--颜色
		,wp_21 = {速度=1.5}
		}
	ItemData["逍遥符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 2
		,wp_11 = "item.wdf"
		,wp_12 = 0x96B0982
		,wp_13 = 0x8CCCA725
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "绿色"--颜色
		,wp_21 = {躲避=3}
		}
	ItemData["太阴符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"   --新三级符石
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x96B0982
		,wp_13 = 0x8CCCA725
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "绿色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
		--三级符石
	ItemData["虹珀符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5CF34122
		,wp_13 = 0xDF8358B
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,魔法=6}
		}
	ItemData["陌影符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6CCF8F49
		,wp_13 = 0x2207D0E7
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,命中=4}
		}
	ItemData["北冥符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x90B92A2C
		,wp_13 = 0x8197B629
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,伤害=1.5}
		}
	ItemData["灵月符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xFEA25D6F
		,wp_13 = 0xD83B95B5
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,防御=3}
		}
	ItemData["锦瑟符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x22CBF322
		,wp_13 = 0xA9D94F23
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,速度=1.5}
		}
	ItemData["银光符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xFC3CDE97
		,wp_13 = 0x23F7A22E
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,躲避=3}
		}
	ItemData["少阴符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xFC3CDE97
		,wp_13 = 0x23F7A22E
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
	ItemData["清心符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5610AE50
		,wp_13 = 0x2E6B730A
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,灵力=1.5}
		}
	ItemData["星辰符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x2E893EE4
		,wp_13 = 0x41C0E80A
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,法术伤害=2}
		}
	ItemData["雪月符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xEF64D308
		,wp_13 = 0x1088694D
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,法术防御=2}
		}
	ItemData["玄魂符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x35232317
		,wp_13 = 0xBCA29B7A
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {体质=1,固定伤害=2}
		}
	ItemData["乾坤符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x7F4F2A9
		,wp_13 = 0x44861CDA
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,气血=10}
		}
	ItemData["珍珀符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5CF34122
		,wp_13 = 0x0DF8358B
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,魔法=6}
		}
	ItemData["银竹符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x3C1B72B
		,wp_13 = 0xCCE17B90
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,命中=4}
		}
	ItemData["神川符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xF95B369D
		,wp_13 = 0x240C05AE
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,伤害=1.5}
		}
	ItemData["玲珑符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6AACFD5
		,wp_13 = 0x22F35AB7
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,速度=1.5}
		}
	ItemData["暮影符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x66A5CAF
		,wp_13 = 0xA1EFCBCD
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,躲避=3}
		}

	ItemData["天珍符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xDD550E98
		,wp_13 = 0x5A1058B4
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,灵力=1.5}
		}
	ItemData["九影符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xC14E158C
		,wp_13 = 0x74570AD9
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,法术伤害=2}
		}
	ItemData["百冥符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xE7C31FAB
		,wp_13 = 0x204A7770
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,法术防御=2}
		}
	ItemData["莫念符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x35232317
		,wp_13 = 0x7E8A4D54
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "蓝色"--颜色
		,wp_21 = {耐力=1,固定伤害=2}
		}
	ItemData["醉魂符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xDF29F445
		,wp_13 = 0x684A5B33
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,气血=10}
		}
	ItemData["玄羽符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x2BFB0E6E
		,wp_13 = 0xFD8EB3CF
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,命中=4}
		}
	ItemData["霸风符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x579C9F2A
		,wp_13 = 0x5AA0CA98
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,伤害=1.5}
		}
	ItemData["无相符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x4ADA8502
		,wp_13 = 0x5FBDBE85
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,防御=3}
		}
	ItemData["无极符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x1ED49DA6
		,wp_13 = 0x8A6D58ED
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,速度=1.5}
		}
	ItemData["紫晶符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x53616D8A
		,wp_13 = 0xA7782996
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,躲避=3}
		}
	ItemData["圣火符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xCA106E2F
		,wp_13 = 0x74D36FFF
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,固定伤害=2}
		}
	ItemData["阳仪符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xCA106E2F
		,wp_13 = 0x74D36FFF
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
	ItemData["昔光符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6FC365B8
		,wp_13 = 0xCBD03425
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,魔法=6}
		}
	ItemData["子蚀符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xF688BFDE
		,wp_13 = 0x93C04775
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,法术防御=2}
		}
	ItemData["流风符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x9D0D30EF
		,wp_13 = 0x9B44A508
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "白色"--颜色
		,wp_21 = {魔力=1,法术伤害=1.5}
		}
	ItemData["地炎符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x9577140F
		,wp_13 = 0x2B2257FF
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,气血=10}
		}
	ItemData["素影符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xED15475A
		,wp_13 = 0x17DE2A61
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,魔法=6}
		}
	ItemData["燕灵符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xEE41CD63
		,wp_13 = 0xD5F14ADC
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,防御=3}
		}
	ItemData["降龙符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xEA2DFDAF
		,wp_13 = 0x7F18A6FB
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,速度=1.5}
		}
	ItemData["苍玉符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x867985EB
		,wp_13 = 0x5336983C
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,躲避=3}
		}
	ItemData["阴仪符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x867985EB
		,wp_13 = 0x5336983C
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
	ItemData["流魂符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xF0888E17
		,wp_13 = 0xF21E1F30
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,灵力=1.5}
		}
	ItemData["九凤符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x7CCD1DFA
		,wp_13 = 0xEC558958
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,法术防御=2}
		}
	ItemData["墨陀符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x3F791B1
		,wp_13 = 0x44ED9122
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,法术伤害=2}
		}
	ItemData["南夕符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5DBC1A4E
		,wp_13 = 0xBAB64C34
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "黑色"--颜色
		,wp_21 = {力量=1,固定伤害=2}
		}
	ItemData["引幽符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xA3130920
		,wp_13 = 0xAC5683E0
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,气血=10}
		}
	ItemData["波涛符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5DA7088A
		,wp_13 = 0xDFD1841C
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,魔法=6}
		}
	ItemData["太极符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x5DA7088A
		,wp_13 = 0xDFD1841C
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {气血=15,速度=1.5}
		}
	ItemData["铃星符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0xAC6C9B58
		,wp_13 = 0x7D44AFFC
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,命中=4}
		}
	ItemData["狂念符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x64DD0A08
		,wp_13 = 0x5D8AFACD
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,伤害=1.5}
		}
	ItemData["乱花符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x9722DD59
		,wp_13 = 0xFAE16C2E
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,灵力=1.5}
		}
	ItemData["幽月符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x8EDB338
		,wp_13 = 0x5C16DDD5
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,法术伤害=2}
		}
	ItemData["两仪符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x6149F028
		,wp_13 = 0xB0A5618D
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,法术防御=2}
		}
	ItemData["七情符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x4FBA3175
		,wp_13 = 0x35DC8D80
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,固定伤害=2}
		}
	ItemData["召影符石"]={
		wp_1 = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		,wp_2 = 889
		,wp_3 = 88
		,wp_4 = 3
		,wp_11 = "item.wdf"
		,wp_12 = 0x7AF9E2F7
		,wp_13 = 0xF28A91D
		,wp_15 = "可以镶嵌在有开运孔数的装备上"
		,wp_20 = "紫色"--颜色
		,wp_21 = {敏捷=1,防御=3}
		}

	ItemData["未激活的符石"]={
		wp_1 = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
		,wp_2 = 889
		,wp_3 = 89
		,wp_4 = 1
		,wp_12 = 0x580E0DE1
		,wp_13 = 0xC45E19C4
		,wp_15 = "鼠标右键点击使用激活"
		,wp_11 = "item.wdf"
		}
	ItemData["未激活的星石"]={
		wp_1 = "以符文六棱石紧紧包裹住星石，防止其灵气逸散。里面的星石一直在蠢蠢欲动！"
		,wp_2 = 889
		,wp_3 = 90
		,wp_4 = 1
		,wp_12 = 0x6F4932B8
		,wp_13 = 0xE305DAF3
		,wp_15 = "鼠标右键点击使用激活"
		,wp_11 = "item.wd1"
		}
	ItemData["符石卷轴"]={
		wp_1 = "一张记载高级符石合成方式的卷轴。"
		,wp_2 = 889
		,wp_3 = 89
		,wp_4 = 6
		,wp_12 = 0xF9DD83C6
		,wp_13 = 0xDF3E0DDE
		,wp_11 = "item.wdf"
		}
	ItemData["云荒"]={
		wp_1 = "以符文六棱石紧紧包裹住星石，防止其灵气逸散。里面的星石一直在蠢蠢欲动！"
		,wp_2 = 889
		,wp_3 = 91
		,wp_4 = 1
		,wp_11 = "item.wd1"
		,wp_12 = 0xA2E438B8
		,wp_13 = 0x457CA6AB
		}
	ItemData["暮霭"]={
		wp_1 = "正反两面为不同颜色的陨星。双面绯蓝二色,暮沉沉,楚天辽阔。"
		,wp_2 = 889
		,wp_3 = 91
		,wp_4 = 2
		,wp_11 = "item.wd1"
		,wp_12 = 0XF53294B4
		,wp_13 = 0XF91B9A26
		}
	ItemData["落日"]={
		wp_1 = "正反两面为不同颜色的陨星。双面金赤二色，落日熔金，山河沐血。"
		,wp_2 = 889
		,wp_3 = 91
		,wp_4 = 3
		,wp_11 = "item.wd1"
		,wp_12 = 0x0C940FE8
		,wp_13 = 0x9A9DB0F8
		}
	ItemData["晓天"]={
		wp_1 = "正反两面为不同色的陨星。双面黑白二色,晓天迷雾,江川双寥。"
		,wp_2 = 889
		,wp_3 = 91
		,wp_4 = 4
		,wp_11 = "item.wd1"
		,wp_12 = 0X6DC88994
		,wp_13 = 0x155DBB4A
		}
	ItemData["林海"]={
		wp_1 = "正反两面为不同颜色的陨星。双面翠青二色，林海叠翠，远峰数青。"
		,wp_2 = 889
		,wp_3 = 91
		,wp_4 = 5
		,wp_11 = "item.wd1"
		,wp_12 = 0xA61A5027
		,wp_13 = 0x3B34F66E
		}
	ItemData["流霞"]={
		wp_1 = "正反两面为不同颜色的陨星。双面绯蓝二色,流霞浴火,枫舞霜天。"
		,wp_2 = 889
		,wp_3 = 91
		,wp_4 = 6
		,wp_11 = "item.wd1"
		,wp_12 = 0X5F22903A
		,wp_13 = 0x8DA4F07E
		}
	ItemData["储灵袋"]={
		wp_1 = "古董商人收藏的神仙宝贝，用以储存灵气，使用后可为法宝补充15点灵气。"
		,wp_2 = "可使用"
		,wp_3 = 15
		,wp_4 = 6
		,wp_11 = "item.wdf"
		,wp_12 = 2193348990
		,wp_13 = 1989581720
		}
	ItemData["驱邪扇芝"]={
		wp_1 = "产自地府路边的扇形灵芝，得到地府善良阴魂的灵气滋润长成，可以恢复心智被邪恶力量所控的灵魂。"
		,wp_2 = 54
		,wp_3 = 54
		,wp_4 = 2
		,wp_8 = 1
		,wp_11 = "item.wdf"
		,wp_12 = 0x2F7C81CE
		,wp_13 = 0x696C18EE
		,wp_14 = 1000
		}
		-- if 全局游戏标题~="大唐-官府" then
		    ItemData["60灵饰指南书"]={
				wp_1 = "记载各种灵饰制造方法的古老书卷"
				,wp_2 = 5
				,wp_3 = 20
				,wp_4 = 0
				,wp_11 = "item.wd1"
				,wp_12 = 0xAEB5E00E
				,wp_13 = 0xD7E29586
				}
			ItemData["80灵饰指南书"]={
				wp_1 = "记载各种灵饰制造方法的古老书卷"
				,wp_2 = 5
				,wp_3 = 20
				,wp_4 = 0
				,wp_11 = "item.wd1"
				,wp_12 = 0xAEB5E00E
				,wp_13 = 0xD7E29586
				}
			ItemData["100灵饰指南书"]={
				wp_1 = "记载各种灵饰制造方法的古老书卷"
				,wp_2 = 5
				,wp_3 = 20
				,wp_4 = 0
				,wp_11 = "item.wd1"
				,wp_12 = 0xAEB5E00E
				,wp_13 = 0xD7E29586
				}
			ItemData["60元灵晶石"]={
				wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
				,wp_2 = 5
				,wp_3 = 21
				,wp_4 = 0
				,wp_11 = "item.wd1"
				,wp_12 = 0x321116AF
				,wp_13 = 0x13A717B5
				}
			ItemData["80元灵晶石"]={
				wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
				,wp_2 = 5
				,wp_3 = 21
				,wp_4 = 0
				,wp_11 = "item.wd1"
				,wp_12 = 0x321116AF
				,wp_13 = 0x13A717B5
				}
			ItemData["100元灵晶石"]={
				wp_1 = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
				,wp_2 = 5
				,wp_3 = 21
				,wp_4 = 0
				,wp_11 = "item.wd1"
				,wp_12 = 0x321116AF
				,wp_13 = 0x13A717B5
				}
            ItemData["拘魂镜"]={
		        wp_1 = "从鬼差处得来的镜子，可震慑从地府逃走的鬼魂。点击鼠标右键使用。"
		       ,wp_2 = "蒲扇"
		       ,wp_3 = 7
		       ,wp_4 = 0
		       ,wp_11 = "item.wdf"
		       ,wp_12 = 0x8C3FA3A7
		       ,wp_13 = 0x9CF70E97
		        }
			ItemData["蒲扇"]={
				wp_1 = "前往指定坐标附近，右键使用蒲扇即可！"
				,wp_2 = "蒲扇"
				,wp_3 = 7
				,wp_4 = 0
				,wp_11 = "item.wdf"
				,wp_12 = 0x6EA31DE4
				,wp_13 = 0xD3F4F8DB
			    }
			ItemData["大闹小铲子"]={
				wp_1 = "前往指定坐标附近，右键使用大闹小铲子即可！"
		 		,wp_2 = "大闹小铲子"
		  		,wp_3 = 7
		   		,wp_4 = 0
		  		,wp_11 = "item.wdf"
				,wp_12 = 0x42573F81
				,wp_13 = 0xFD352F4F
				}
			ItemData["秘境降妖卡"]={
				wp_1 = "#W可以开启#R【开启秘境降妖副本】#W的卡片 注：此卡片只可以使用一次\n #Y【使用方式】鼠标右键使用"
				,wp_2 = 151
				,wp_3 = 10
				,wp_4 = 1
				,wp_11 = "item.wdf"
				,wp_12 = 0xA8E5CBE2
				,wp_13 = 0x3EC79B79
				}
end

function 复制物品(物品)
	local 道具数据 = 物品类()
	道具数据:置对象(物品.名称)
	道具数据.总类 = 物品.总类
	道具数据.分类 = 物品.分类
	道具数据.子类 = 物品.子类
	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end
	if 物品.气血 ~= nil then
		道具数据.气血 = 物品.气血
	end
	if 物品.魔法 ~= nil then
		道具数据.魔法 = 物品.魔法
	end
	if 物品.愤怒 ~= nil then
		道具数据.愤怒 = 物品.愤怒
	end
	if 物品.体力 ~= nil then
		道具数据.体力 = 物品.体力
	end
	if 物品.活力 ~= nil then
		道具数据.活力 = 物品.活力
	end
	if 物品.命中 ~= nil then
		道具数据.命中 = 物品.命中
	end
	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end
	if 物品.防御 ~= nil then
		道具数据.防御 = 物品.防御
	end
	if 物品.速度 ~= nil then
		道具数据.速度 = 物品.速度
	end
	if 物品.躲避 ~= nil then
		道具数据.躲避 = 物品.躲避
	end
	if 物品.灵力 ~= nil then
		道具数据.灵力 = 物品.灵力
	end
	if 物品.体质 ~= nil then
		道具数据.体质 = 物品.体质
	end
	if 物品.魔力 ~= nil then
		道具数据.魔力 = 物品.魔力
	end
	if 物品.力量 ~= nil then
		道具数据.力量 = 物品.力量
	end
	if 物品.耐力 ~= nil then
		道具数据.耐力 = 物品.耐力
	end
	if 物品.敏捷 ~= nil then
		道具数据.敏捷 = 物品.敏捷
	end
	if 物品.品质 ~= nil then
		道具数据.品质 = 物品.品质
	end
	if 物品.附带技能 ~= nil then
		道具数据.附带技能 = 物品.附带技能
	end
	if 物品.锻炼等级 ~= nil then
		道具数据.锻炼等级 = 物品.锻炼等级
	end
	if 物品.镶嵌宝石 ~= nil then
		道具数据.镶嵌宝石 = 物品.镶嵌宝石
	end
	if 物品.级别限制 ~= nil then
		道具数据.级别限制 = 物品.级别限制
	end
	if 物品.特效 ~= nil then
		道具数据.特效 = 物品.特效
	end
	if 物品.特技 ~= nil then
		道具数据.特技 = 物品.特技
	end
	if 物品.价格 ~= nil then
		道具数据.价格 = 物品.价格
	end
	if 物品.五行 ~= nil then
		道具数据.五行 = 物品.五行
	end
	if 物品.数量 ~= nil and 物品.可叠加 then
		道具数据.数量 = 物品.数量
	end
	if 物品.制造者 ~= nil then
		道具数据.制造者 = 物品.制造者
	end
	if 物品.耐久  ~= nil then
		道具数据.耐久 = 物品.耐久
	end
	return 道具数据
end
