-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-16 17:54:10

function 取随机怪物(dr)
    local ls = {}
    if dr == "一级" then
        ls ={"树怪","大蝙蝠","大海龟","野猪","羊头怪","老虎","黑熊","花妖","牛妖","狼","虾兵","兔子怪","黑熊精","雷鸟人","小龙女","海毛虫","巨蛙"}
    elseif dr == "二级" then
        ls ={"牛头","马面","古代瑞兽","白熊","黑山老妖","地狱战神","蛟龙","凤凰","鬼将","吸血鬼"}
    elseif dr == "三级" then
        ls = {"天兵","天将","蝴蝶仙子","风伯","雨师","芙蓉仙子","星灵仙子","律法女娲","灵符女娲"}
    elseif dr == "四级" then
        ls ={"大力金刚","雾中仙","灵鹤","夜罗刹","炎魔神","噬天虎","野猪精","鼠先锋","百足将军","踏云兽","红萼仙子","龙龟"}
    elseif dr == "五级" then
        ls = {"阴阳伞","机关兽","机关鸟","机关人","连弩车","巴蛇","蚌精","鲛人","碧水夜叉","锦毛貂精","千年蛇魅","机关人车","犀牛将军人形","犀牛将军兽形"}
    elseif dr == "六级" then
        ls = {"葫芦宝贝","猫灵人形","猫灵兽形","狂豹人形","蝎子精","混沌兽","画魂","巨力神猿","修罗傀儡鬼","藤蔓妖花","蜃气妖","修罗傀儡妖","修罗傀儡妖","曼珠沙华"}
      elseif dr == "七级"  then
        ls ={"超级人参娃娃","超级泡泡","超级大熊猫","超级金猴","进阶超级金猴","超级大象","超级白泽","超级灵鹿","超级赤焰兽","超级大鹏","善财童子","超级筋斗云","超级神牛","超级神虎","超级海豚","超级神兔","超级神柚","超级飞廉","超级红孩儿"}
    end
    local fhz = ls[取随机数(1,#ls)]
    return fhz
end