-- @Author: baidwwy
-- @Date:   2024-04-14 22:24:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-13 04:44:52
-- @Author: baidwwy
-- @Date:   2023-08-31 23:34:34
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-05-03 14:43:55

local 战斗计算 = class()
local jhf = string.format
local random = math.random
local qz=math.floor
local sj = 取随机数

function 战斗计算:初始化()
	self.Fengyinmz={
		催眠符=90,
		失心符=80,
		落魄符=80,
		失忆符=80,
		追魂符=80,
		离魂符=80,
		失魂符=80,
		定身符=80,
		莲步轻舞=80,
		如花解语=80,
		似玉生香=80,
		碎玉弄影=100,
		娉婷袅娜=90,
		摄魂=90,
		日月乾坤=60,
		侵蚀·日月乾坤·钻心=70,
		侵蚀·日月乾坤·噬魂=70,
		侵蚀·日月乾坤·刻骨=70,
		秘传封印=100,
		毁灭之光=100,
		一笑倾城=50,
	}
end

function 战斗计算:删除并重置技能属性(战斗数据,单位,zq,jh)
	if 单位==nil then return end
	-- for k,v in pairs(单位.主动技能) do
	-- 	if v == zq or v.名称 == zq then
	-- 		table.remove(单位.主动技能,k)
	-- 	end
	-- end
	-- for k,v in pairs(单位.技能) do
	-- 	if v == zq or v.名称 == zq then
	-- 		table.remove(单位.技能,k)
	-- 	end
	-- end
	-- for k,v in pairs(单位.已加技能) do
	-- 	if v == zq or v.名称 == zq then
	-- 		table.remove(单位.已加技能,k)
	-- 	end
	-- end
	if 单位.超级敏捷==nil then
		单位.超级敏捷={概率=0,触发=0,执行=false,指令={}}
	end
	--------------清除超级属性
	if zq == "超级遗志"  then --因为是升级的技能，那它必定有高级技能，只要把超级去掉、再把技能加成属性改回高级的就好
		单位.遗志 = 2
	elseif zq == "超级进击必杀" then
		单位.进击必杀 = 30
	elseif zq == "超级进击法暴" then
		单位.进击法暴 = 20
	elseif zq == "超级反击" then
		单位.反击 = 1
		单位.超级反击 = nil
	elseif zq == "超级反震" then
		单位.反震 = 0.5
	elseif zq == "超级吸血" then
		单位.吸血 = 0.3
		单位.超级吸血 = nil
	elseif zq == "超级连击" then
		单位.连击 = 55
		单位.超级连击 = nil
	elseif zq == "超级飞行" then
		单位.超级飞行 = nil
	elseif zq == "超级夜战" then
		单位.夜战 = 2
		单位.超级夜战 = 0
	elseif zq == "超级强力" then
		单位.强力 = 1
		单位.超强力 = nil
	elseif zq == "超级防御" then
		单位.防御技能 = 2
		单位.超级防御 = nil
	elseif zq == "超级隐身" then
		单位.隐身 = 2
		单位.超级隐身 = nil
	elseif zq == "超级感知" then
		单位.感知 = 0.55
		战斗数据:增删主人技能属性(单位.主人序号,"超级感知")
	elseif zq == "超级再生" then
		单位.再生 = 单位.等级
		单位.超级再生 = nil
	elseif zq == "超级冥思" then
		单位.冥思 = qz(单位.等级/3)
		战斗数据:增删主人技能属性(单位.主人序号,"超级冥思")
	elseif zq == "超级慧根" then
		单位.慧根 = 0.5
		单位.超级慧根 = nil
	elseif zq == "超级必杀" then
		单位.超级必杀 = 0
	elseif zq == "超级合纵" then
		单位.合纵 = qz(战斗数据:取合纵加成(单位.主人序号)  * 单位.等级/4)
		单位.超级合纵 = nil
	elseif zq == "超级幸运" then
		单位.幸运 = 1
		单位.超级幸运 = nil
	elseif zq == "超级神迹" then
		单位.神迹 = 2
		单位.超级神迹 = nil
	elseif zq == "超级招架" then
		单位.招架 = 0.8
		单位.超级招架=nil
	elseif zq == "超级敏捷" then
		单位.超级敏捷={概率=0,触发=0,执行=false,指令={}}
	elseif zq == "超级偷袭" then
		单位.偷袭 = 2
		单位.超级偷袭=false
	elseif zq == "超级毒" then
		单位.毒 = 20
		单位.高级毒=1
		单位.超级毒=nil
	elseif zq == "超级驱鬼" then
		单位.驱鬼 = 2
		单位.超级驱鬼 = nil
	elseif zq == "超级魔之心" then
		单位.魔之心 = 1.2
	elseif zq == "超级精神集中" then
		单位.超级精神集中 = nil
	elseif zq == "超级否定信仰" then
		单位.超信仰 = nil
		单位.超信清 = nil
		if 单位.超信增~= nil then
			for k,v in pairs(单位.超信增) do
				if 单位[k]~=nil then
					单位[k]=v
				end
			end
			单位.超信增 = nil
		end
	elseif zq == "超级法术暴击" then
		单位.法暴 = 单位.法暴 - 5
	elseif zq == "超级法术连击" then
		-- 单位.法连 = 30 --无需写
	elseif zq == "超级法术波动" then
		单位.法波上 = 150
		单位.法波下 = 50
	elseif zq == "超级法术抵抗" then
		单位.法术抵抗 = 0.9
		单位.超法抵抗 = nil
	elseif zq == "超级盾气" then
		单位.盾气 = 2
		战斗数据:增删主人技能属性(单位.主人序号,"超级盾气")
	elseif zq == "超级水属性吸收" then
		单位.水吸 = 2
        单位.超水吸 = nil
	elseif zq == "超级雷属性吸收" then
		单位.雷吸 = 2
		单位.超雷吸 = nil
	elseif zq == "超级火属性吸收" then
		单位.火吸 = 2
		单位.超火吸 = nil
	elseif zq == "超级土属性吸收" then
		单位.土吸 = 2
		单位.超土吸 = nil
	end
	-------------- 添加超级属性
	if jh == "超级遗志"  then --因为是升级的技能，那它必定有高级技能，只要把超级去掉、再把技能加成属性改回高级的就好
		单位.遗志 = 3
	elseif jh == "超级进击必杀" then
		单位.进击必杀 = 31
	elseif jh == "超级进击法暴" then
		单位.进击法暴 = 21
	elseif jh == "超级反击" then
		单位.反击 = 1
		单位.超级反击 = 1
	elseif jh == "超级反震" then
		单位.反震 = 0.6
	elseif jh == "超级吸血" then
		单位.吸血 = 0.3
		单位.超级吸血 = true
	elseif jh == "超级连击" then
		单位.连击 = 55
		单位.超级连击 = true
	elseif jh == "超级飞行" then
		单位.超级飞行 = true
	elseif jh == "超级夜战" then
		单位.夜战 = 2
		单位.超级夜战 = 1
	elseif jh == "超级强力" then
		单位.强力 = 1
		单位.超强力 = true
	elseif jh == "超级防御" then
		单位.防御技能 = 2
		单位.超级防御 = true
	elseif jh == "超级隐身" then
		单位.隐身 = 3
		单位.超级隐身 = true
	elseif jh == "超级感知" then
		单位.感知 = 0.55
		战斗数据:增删主人技能属性(单位.主人序号,"超级感知",0.55)
	elseif jh == "超级再生" then
		单位.再生 = 单位.等级
		单位.超级再生 = true
	elseif jh == "超级冥思" then
		单位.冥思 = qz(单位.等级/2)
		战斗数据:增删主人技能属性(单位.主人序号,"超级冥思",1)
	elseif jh == "超级慧根" then
		单位.慧根 = 0.5
		单位.超级慧根 = true
	elseif jh == "超级必杀" then
		单位.超级必杀 = 25
	elseif jh == "超级合纵" then
		单位.合纵 = nil
		单位.超级合纵 = 战斗数据:取合纵加成(单位.主人序号)
	elseif jh == "超级幸运" then
		单位.幸运 = 1
		单位.超级幸运 = true
	elseif jh == "超级神迹" then
		单位.神迹 = 2
		单位.超级神迹 = true
	elseif jh == "超级招架" then
		单位.招架 = 0.8
		单位.超级招架=true
	elseif jh == "超级敏捷" then
		单位.超级敏捷={概率=5,触发=0,执行=false,指令={}}
	elseif jh == "超级偷袭" then
		单位.偷袭 = 3
		单位.超级偷袭=true
	elseif jh == "超级毒" then
		单位.毒 = 20
		单位.高级毒=1
		单位.超级毒=1
	elseif jh == "超级驱鬼" then
		单位.驱鬼 = 2
		单位.超级驱鬼 = true
	elseif jh == "超级魔之心" then
		单位.魔之心 = 1.25
	elseif jh == "超级精神集中" then
		单位.超级精神集中 = true
	elseif jh == "超级否定信仰" then
		单位.超信仰 = true
		单位.超信清 = {}
		单位.超信增 = {}
		战斗数据:添加超级否定信仰属性(单位)
	elseif jh == "超级法术暴击" then
		单位.法暴 = 单位.法暴 + 5
	elseif jh == "超级法术连击" then
		-- 单位.法连 = 30 --无需写
	elseif jh == "超级法术波动" then
		单位.法波上 = 200
		单位.法波下 = 50
	elseif jh == "超级法术抵抗" then
		单位.法术抵抗 = 0.9
		单位.超法抵抗 = true
	elseif jh == "超级盾气" then
		单位.盾气 = 3
		战斗数据:增删主人技能属性(单位.主人序号,"超级盾气",1)
	elseif jh == "超级水属性吸收" then
		单位.水吸 = 2
        单位.超水吸 = true
	elseif jh == "超级雷属性吸收" then
		单位.雷吸 = 2
		单位.超雷吸 = true
	elseif jh == "超级火属性吸收" then
		单位.火吸 = 2
		单位.超火吸 = true
	elseif jh == "超级土属性吸收" then
		单位.土吸 = 2
		单位.超土吸 = true
	end

end

function 战斗计算:超信清恢复(战斗数据,单位)
	local 战斗单位=战斗数据.参战单位
	if 单位.超信清 ~= nil and type(单位.超信清)=="table" then
		for k,v in pairs(单位.超信清) do
			if 战斗单位[k]~=nil then
				for kn,vn in pairs(v) do
					if 战斗单位[k][kn] == nil then
						战斗单位[k][kn] = vn
						if kn=="隐身" then
							战斗数据:增益技能计算(k, "修罗隐身", 战斗单位[k].等级)
						end
					end
				end
			end
		end
	end
end

function 战斗计算:回合结束重置(单位)
	单位.无心插柳 = false
	单位.附加必杀 = 0
	单位.附加必杀伤害 = 0
	单位.戏珠触发 = nil
	单位.威吓 = nil
	单位.嗜血幡 = nil
	单位.断线木偶 = nil
	单位.招架一 = nil
	单位.逍遥游 = nil
	单位.嗜血触发 = nil
	单位.乘胜追击 = 0
	单位.触发拘魂 = nil
	单位.生死决减防 = nil
	单位.爪印触发 = nil
	单位.焰威=nil
	单位.伏毒=nil
	单位.蜜润翻倍=nil
	单位.触发追加=nil
	单位.风起云墨=nil


	if 单位.递增伤害 then
		单位.伤害 = math.floor(单位.伤害*1.02)
	end

	if 单位.首次被伤~=nil then --每回合都重置
		单位.首次被伤.每回物理 = 0
		单位.首次被伤.每回法术 = 0
	end
	if 单位.感知回合~=nil then
		单位.感知回合=单位.感知回合-1
		if 单位.感知回合 <= 0 then
			单位.感知回合=nil
			单位.感知=nil
		end
	end
	if 单位.冥思回合~=nil then
		单位.冥思回合=单位.冥思回合-1
		if 单位.冥思回合 <= 0 then
			单位.冥思回合=nil
			单位.冥思=nil
		end
	end
	if 单位.法术状态 and 单位.法术状态["超级永恒"] and 单位.法术状态["超级永恒"].回溯 then
		if 单位.气血 > 0 then
			单位.气血 = 单位.法术状态["超级永恒"].回溯.气血
			单位.魔法 = 单位.法术状态["超级永恒"].回溯.魔法
		end
	end
	if 单位.超级敏捷~=nil then
		单位.超级敏捷.触发=0
		单位.超级敏捷.执行=false
		单位.超级敏捷.指令={}
	end
	-----------------

	if 单位.气血 < 0 then 单位.气血 = 0 end
	if 单位.魔法 < 0 then 单位.魔法 = 0 end
	if 单位.JM.磐石 then
		单位.JM.磐石 =0
		单位.磐石 = nil
	end
	if 单位.催迫==2 then
		单位.催迫=nil
	end
	if 单位.灵能==2 then
		单位.灵能=nil
	end
	if 单位.苍鸾怒击==2 then
		单位.苍鸾怒击=1
	end
	if 单位.死地 == 2 then 单位.死地=nil end
	if 单位.shenqi then
	    if 单位.shenqi.name=="澄明" then
	        单位.抵抗封印等级 = 单位.抵抗封印等级 + (3*单位.shenqi.lv)
	    elseif 单位.shenqi.name=="弦外之音" then
	    	单位.愤怒 = 单位.愤怒 + (3*单位.shenqi.lv)
	    	if 单位.愤怒>=150 then
	    	    单位.愤怒=150
	    	end
		end
	end
end

function 战斗计算:附加施法(战斗数据,攻击方,挨打方,伤害,伤害类型,名称,特效,全屏)
	if #战斗数据.战斗流程==0 then
	    战斗数据.战斗流程[1]={}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程].附加施法 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].附加施法={{攻击方=攻击方,挨打方={}}}
	end
	local 当前流程
	if 战斗数据.战斗流程[#战斗数据.战斗流程].附加施法[#战斗数据.战斗流程[#战斗数据.战斗流程].附加施法].攻击方 == 攻击方 then
		当前流程 = 战斗数据.战斗流程[#战斗数据.战斗流程].附加施法[#战斗数据.战斗流程[#战斗数据.战斗流程].附加施法]
		当前流程.挨打方[#当前流程.挨打方+1]={挨打方=挨打方,特效=特效}
	elseif 战斗数据.战斗流程[#战斗数据.战斗流程].附加施法[#战斗数据.战斗流程[#战斗数据.战斗流程].附加施法].攻击方 ~= 攻击方 then
		战斗数据.战斗流程[#战斗数据.战斗流程].附加施法[#战斗数据.战斗流程[#战斗数据.战斗流程].附加施法+1]={攻击方=攻击方,挨打方={}}
		当前流程 = 战斗数据.战斗流程[#战斗数据.战斗流程].附加施法[#战斗数据.战斗流程[#战斗数据.战斗流程].附加施法]
		当前流程.挨打方[#当前流程.挨打方+1]={挨打方=挨打方,特效=特效}
	end
	if 伤害类型 == 1 or 伤害类型 == 2 or 伤害类型 == 3 or 伤害类型 == 3.5 then
		当前流程.挨打方[#当前流程.挨打方].伤害=伤害
		当前流程.挨打方[#当前流程.挨打方].类型=伤害类型
		if 伤害类型 == 2 then
			战斗数据:增加气血(挨打方,伤害)
		else
			当前流程.挨打方[#当前流程.挨打方].死亡=战斗数据:减少气血(挨打方,伤害,攻击方,名称)
		end
	end
	--战斗数据.战斗流程[#战斗数据.战斗流程].附加施法={攻击方=攻击方,挨打方=挨打方,名称=名称,方式=方式}
	--战斗数据.战斗流程[#战斗数据.战斗流程].附加施法全屏 = 全屏
end

function 战斗计算:添加掉血(战斗数据,目标,伤害,编号,名称)
	if 伤害 == nil or 伤害 < 1 then
		伤害 = 1
	end
	if #战斗数据.战斗流程==0 then
	    战斗数据.战斗流程[1]={}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程].溅射 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].溅射 = {}
	end
	伤害=qz(伤害)
	local  死亡 = 战斗数据:减少气血(目标,伤害,编号,名称)
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].溅射,{挨打方=目标,攻击方=编号,伤害=伤害,死亡=死亡})
end

function 战斗计算:不击退掉血(战斗数据,目标,伤害,编号,名称)
	if 伤害 == nil or 伤害 < 1 then
		伤害 = 1
	end
	if #战斗数据.战斗流程==0 then
	    战斗数据.战斗流程[1]={}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程].无动作掉血 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].无动作掉血 = {}
	end
	local  死亡 = 战斗数据:减少气血(目标,伤害,编号,名称)
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].无动作掉血,{挨打方=目标,攻击方=编号,伤害=伤害,死亡=死亡})
end

function 战斗计算:添加护盾(战斗数据,目标,num)
	if #战斗数据.战斗流程==0 then
	    战斗数据.战斗流程[1]={}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程].添加护盾 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].添加护盾 = {}
	end
	if 战斗数据.参战单位[目标].护盾+num>=战斗数据.参战单位[目标].气血*0.3 then
	    num = 战斗数据.参战单位[目标].气血*0.3-战斗数据.参战单位[目标].护盾
	end
	num = qz(num)
	战斗数据.参战单位[目标].护盾 = 战斗数据.参战单位[目标].护盾+num
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].添加护盾,{挨打方=目标,护盾=num})
end

function 战斗计算:添加护盾2(战斗数据,目标,num)
	if #战斗数据.战斗流程==0 then
	    战斗数据.战斗流程[1]={}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程].添加护盾 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].添加护盾 = {}
	end
	if 战斗数据.参战单位[目标].护盾+num>=战斗数据.参战单位[目标].最大气血*0.4 then
	    num = 战斗数据.参战单位[目标].最大气血*0.4-战斗数据.参战单位[目标].护盾
	end
	num = qz(num)
	战斗数据.参战单位[目标].护盾 = 战斗数据.参战单位[目标].护盾+num
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].添加护盾,{挨打方=目标,护盾=num})
end


function 战斗计算:同步魔法(战斗数据,目标)
	if #战斗数据.战斗流程==0 then
	    战斗数据.战斗流程[1]={}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程] == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程] = {}
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程].减少魔法 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].减少魔法 = {}
	end
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].减少魔法,{挨打方=目标,魔法=战斗数据.参战单位[目标].魔法})
end

function 战斗计算:物理技能掉血计算(战斗数据,编号,num,目标,名称)
	if 名称=="惊心一剑" then
		战斗数据:减少魔法(目标,qz(num/10+(战斗数据.参战单位[目标].等级/2)*1.25))
	elseif 名称=="破碎无双" then
		战斗数据:减少魔法(目标,qz(num))
	elseif 名称=="普通攻击" then --标记，火甲术被普攻反击写这里，普攻算物理技能，此问题未改
		if 战斗数据.参战单位[目标].法术状态.火甲术 then
			local 伤害系数 = 0.5
			local shangh,法伤系数,法暴倍率 = 战斗技能:三昧真火(战斗数据,目标,编号,1,1)
			if 战斗数据.参战单位[目标].法术状态.火甲术.返火 then
				伤害系数 = 1
			end
			local 伤害,伤害类型 = 战斗法术计算:法术结算(战斗数据,shangh,法暴倍率,编号,目标,nil,nil) --修，传数据位置不对
			-- local 伤害,伤害类型 = 战斗法术计算:法术结算(战斗数据,shangh,法伤系数,法暴倍率,1,目标,编号,nil,nil)
			self:附加施法(战斗数据,目标,编号,伤害.伤害,伤害类型,名称,{"三昧真火"})
		end
	end
	-- if 战斗数据.参战单位[目标].门派 == "方寸山" then
	-- 	if 战斗数据:取经脉(目标,"不舍")and 战斗数据:取法术状态(目标) and 战斗数据:取行动状态(目标) and num > 战斗数据.参战单位[目标].气血上限*0.2 then
	-- 		local 数值 = 战斗技能:归元咒(战斗数据,目标,目标)
	-- 		if 数值 > 0 then
	-- 			self:附加施法(战斗数据,目标,目标,数值,2,"归元咒",{"归元咒"})
	-- 		end
	-- 	end
	-- -- elseif 战斗数据.参战单位[目标].门派 == "狮驼岭"  then
	-- end
end

function 战斗计算:法术技能掉血计算(战斗数据,编号,num,目标,名称)
	local 掉血编号,掉血目标,shangh,法伤系数,法暴倍率,伤害系数,特效,施法流程
	-- if 名称=="飞符炼魂" and 战斗数据.参战单位[目标].气血 > 0 and 取随机数() < 70 then
	-- 	掉血编号=编号
	-- 	掉血目标=目标
	-- 	特效={"落魄符"}
	-- 	施法流程 = true
	-- 	伤害系数 = 1
	-- 	shangh,法伤系数,法暴倍率 = qz(250+战斗数据:取技能等级(编号,"斜月步")*2),1,1
	-- 	战斗数据:添加状态("落魄符", 战斗数据.参战单位[目标], 战斗数据.参战单位[编号], 战斗数据.参战单位[编号].等级)
	-- 	战斗数据.参战单位[目标].法术状态.落魄符.回合=4
	if 战斗数据:取行动状态(目标) and 战斗数据.参战单位[目标].法术状态.火甲术 then
		掉血编号=目标
		掉血目标=编号
		特效={"三昧真火"}
		施法流程 = true
		if 战斗数据.参战单位[掉血编号].法术状态.火甲术.返火 then
			伤害系数 = 1
		else
			伤害系数 = 0.5
		end
		shangh,法伤系数,法暴倍率 = 战斗技能:三昧真火(战斗数据,掉血编号,掉血目标,1,1)
	end
	-- if 战斗数据.参战单位[目标].法术状态.诸天看护 and 战斗数据.参战单位[目标].法术状态.诸天看护.反弹次数>0 then
	-- 	战斗数据.参战单位[目标].法术状态.诸天看护.反弹次数 = 战斗数据.参战单位[目标].法术状态.诸天看护.反弹次数-1
	-- 	local 溅射目标=战斗数据:取单个敌方目标(目标)
	-- 		if 溅射目标 ~= 0 then
	-- 			self:添加掉血(战斗数据,溅射目标,num,编号)
	-- 		end
	-- end

	if 施法流程 then
		local 伤害,伤害类型 = 战斗法术计算:法术结算(战斗数据,shangh,法暴倍率,掉血编号,掉血目标,名称,nil,nil,名称)
		-- local 伤害,伤害类型 = 战斗法术计算:法术结算(战斗数据,shangh,法伤系数,法暴倍率,伤害系数,掉血编号,掉血目标,nil,nil)
		self:附加施法(战斗数据,掉血编号,掉血目标,伤害.伤害,伤害类型,名称,特效)
	end

end
function 战斗计算:取封印限制(名称)
	if self.Fengyinmz[名称] then
		return self.Fengyinmz[名称],10
	end
	return 75,10
end

function 战斗计算:封印命中率(战斗数据,名称,等级,攻击方,挨打方) --写完全部重新 检查一遍
    -- 重写的话，进入战斗先把所有属性都计算完，然后直接调用即可，如，封印命中等级这些，直接计算成成功率，这样就不用每回合都重复计算
	-- if 挨打方.精神 or 挨打方.信仰 then  --这里直接返回0
	-- 	return  0
	-- end
	local 封印基础 = 等级
	local 抵抗基础 = 挨打方.等级
	local 封印上限,封印下限 = self:取封印限制(名称)

	if 攻击方.封印命中等级 == nil then 攻击方.封印命中等级 = 0 end
	if 挨打方.抵抗封印等级 == nil then 挨打方.抵抗封印等级 = 0 end
	local 命中等级 = 攻击方.封印命中等级
	local 抗封等级 = 挨打方.抵抗封印等级
    if 攻击方.队伍 ~=0 then --直接把怪的流程给排除
    if 攻击方.法术状态.顾盼生姿 then
		    命中等级 = 命中等级 + 攻击方.法术状态.顾盼生姿.层数*攻击方.等级*0.5
		end
		if 攻击方.门派 == "方寸山" then
			if 战斗数据:取经脉(攻击方.序号, "方寸山", "制约") then
				if 名称 == "催眠符" then
					封印基础 = 封印基础 + 5
				else
					封印基础 = 封印基础 + 15
				end
			end
			if 战斗数据:取被动(攻击方.序号, "奔雷") then
			    封印基础=封印基础-15
			end
		elseif 攻击方.门派 == "女儿村" then
			if 攻击方.法术状态.自矜 then
				if 名称 ~= "一笑倾城" then
					封印基础 = 封印基础 + 48
				end
			end
			if 战斗数据:取经脉(攻击方.序号, "女儿村", "毒雾") and 取随机数() < 30 then
				战斗数据:添加状态("毒", 挨打方,攻击方,69)
			end
			if 名称 == "一笑倾城" then
				if 战斗数据:取经脉(攻击方.序号, "女儿村", "嫣然") and 挨打方.序号==攻击方.指令.目标 then
					封印基础 = 封印基础+8
				elseif 战斗数据:取经脉(攻击方.序号, "女儿村", "倾国") then
					封印基础 = 封印基础+8
				end
			end
		elseif 攻击方.门派 == "天宫" then
			if 战斗数据:取经脉(攻击方.序号, "天宫", "缭乱") then
				if 名称 == "错乱" and 取随机数() < 30 then
				    攻击方.缭乱=1
				end
			end
			if 攻击方.法术状态.趁虚 then
			    封印基础 = 封印基础+8
			end
	    elseif 攻击方.门派 == "阴曹地府" then
	    	if 战斗数据:取经脉(攻击方.序号, "阴曹地府", "伤魂") and  挨打方.法术状态.尸腐毒 then
	    		命中等级 = 命中等级 + 200
	    	end
	    elseif 攻击方.门派 == "五庄观" then
	    	if 战斗数据:取经脉(攻击方.序号, "五庄观", "存思") and (名称 == "日月乾坤" or 名称 == "侵蚀·日月乾坤·钻心" or 名称 == "侵蚀·日月乾坤·噬魂" or 名称 == "侵蚀·日月乾坤·刻骨")and  战斗数据.回合数/3==qz(战斗数据.回合数/3) then
	    		命中等级 = 命中等级 + 150
	    	end
	    	if 攻击方.法术状态.心随意动 and 攻击方.法术状态.心随意动.经脉流派~="乾坤力士" then
	    		命中等级 = 命中等级 + 攻击方.法术状态.心随意动.封印等级
	    	end

    	elseif 攻击方.门派 == "无底洞" then
	        if 名称 == "惊魂掌" and 战斗数据:取经脉(攻击方.序号, "无底洞", "持戒") then
				封印上限 = 100
				封印基础 = 封印基础  * 3
			end
			if 战斗数据:取经脉(攻击方.序号,"无底洞","萦魄") and 攻击方.增益 and 攻击方.增益>2 then
				命中等级 = 命中等级 + qz(战斗数据.参战单位[攻击方.序号].装备伤害*0.15)
			end
			if 名称 == "夺魄令" and 攻击方.法术状态.燃血术 and 攻击方.法术状态.燃血术.椎骨~=nil then
				命中等级 = 命中等级 + 120
			end
		end
	end


	if 挨打方.门派 == "大唐官府" then
		封印基础 = 封印基础-10 --反间之计命中率，本无
		if 挨打方.法术状态.干将莫邪 then
			if 战斗数据:取经脉(挨打方.序号, "大唐官府","干将")==false then
			    抵抗基础 = 抵抗基础 + 挨打方.法术状态.干将莫邪.境界*5
			elseif 战斗数据:取经脉(挨打方.序号, "大唐官府", "神凝") then
				抵抗基础 = 抵抗基础 + 挨打方.法术状态.干将莫邪.境界*5 + 30
			end
		end
	elseif 挨打方.门派 == "龙宫" and 战斗数据:取经脉(挨打方.序号, "龙宫","凛然") then --这个再议 这个是固定的
		if 挨打方.法术状态.龙骇 then
			抵抗基础 = 抵抗基础 + 80
		end
		if 挨打方.法术状态.龙魂 then
			抵抗基础 = 抵抗基础 + 80
		end
	elseif 挨打方.门派 == "方寸山" then
		if 挨打方.法术状态.凝神术 and 战斗数据:取经脉(挨打方.序号, "方寸山", "专神") then
		    抵抗基础 = 抵抗基础 + 4
		end
		if 挨打方.shenqi.name=="金汤之固" and 挨打方.气血<挨打方.最大气血*0.3 then
	        抗封等级 = 抗封等级 + 240*挨打方.shenqi.lv
	    end
    elseif 挨打方.门派 == "女儿村" then
    	if 挨打方.shenqi.name=="盏中晴雪" and 挨打方.速度>攻击方.速度 then
	        抗封等级 = 抗封等级 + (挨打方.速度-攻击方.速度)*0.5*挨打方.shenqi.lv
	    end
	elseif 挨打方.门派 == "化生寺" then
		if 攻击方.指令.参数 and 攻击方.指令.参数~="碎玉弄影" then  --女色
			if 攻击方.门派 == "女儿村" or 攻击方.门派 == "盘丝洞"  then
			    抵抗基础 = 抵抗基础 * 2
			end
		end
    elseif 挨打方.门派 == "阴曹地府" then
    	if 挨打方.法术状态.轮回 then
    		抗封等级 = 抗封等级 + 60
    	end
	end

	if 挨打方.法术状态.佛法无边 and 挨打方.法术状态.佛法无边.佛法~=nil then
		抵抗基础 = 抵抗基础 + 10
	end
	if 挨打方.法术状态.花护 then
		抵抗基础 = 抵抗基础 + 50
	end
	if 挨打方.法术状态.清净 then
		抵抗基础 = 抵抗基础 + 30
	end

    --计算公式
	local 修炼差   = qz(攻击方.法术修炼*150/攻击方.等级) - qz(挨打方.法术修炼*150/挨打方.等级) --69=19,175=21
	local 命中转换 = qz(命中等级*10/(攻击方.等级+25) - 抗封等级*10/(挨打方.等级+25))  --154 点封印命中 69=16 129 = 10 --到时候去角色里面改
    local 几率 = 40 + 封印基础 - 抵抗基础 + 修炼差 + qz(命中等级*10/(攻击方.等级+25)-抗封等级*10/(挨打方.等级+25)) --同理得出 物理和法暴概率 = 物理宝鸡等级*10/攻击方.等级

    if 攻击方.门派 == "女儿村" then --结果以后 直接加几率了
		if 战斗数据:取经脉(攻击方.序号, "女儿村", "抑怒") and 名称=="娉婷袅娜" then
			几率 = 几率 + 10
		end
		if 战斗数据:取经脉(攻击方.序号, "女儿村", "涂毒") then
			几率 = 几率 - 10
		elseif 战斗数据:取经脉(攻击方.序号, "女儿村", "杏花") then
			几率 = 几率 - 10
		end
		if 攻击方.法术状态.淬芒 then
			几率 = 几率 + (攻击方.法术状态.淬芒.层数 * 8)
		end
	elseif 攻击方.门派 == "天宫" then
		if 战斗数据:取被动(攻击方.序号, "电芒") then
			几率 = 几率 - 15
		end
	elseif 攻击方.门派 == "盘丝洞" then
		if 名称 == "天罗地网" then
			if 战斗数据:取经脉(攻击方.序号, "盘丝洞", "迷瘴") then
				几率 = 几率 + 20
				封印上限 = 封印上限 + 10
			end
			if 挨打方.法术状态.瘴气 and  战斗数据:取经脉(攻击方.序号, "盘丝洞", "忘川") then
				几率 = 几率 + 10
				封印上限 = 封印上限 + 10
			end
		elseif 名称 == "魔音摄魂" then
			if 战斗数据:取经脉(攻击方.序号, "盘丝洞", "鼓乐") then
				几率 = 几率 + 20
				封印上限 = 封印上限 + 10
			end
			if 挨打方.法术状态.瘴气 and  战斗数据:取经脉(攻击方.序号, "盘丝洞", "忘川") then
				几率 = 几率 + 10
				封印上限 = 封印上限 + 10
			end
		end
	elseif 攻击方.门派 == "五庄观" then
    	if (名称 == "日月乾坤" or 名称 == "侵蚀·日月乾坤·钻心" or 名称 == "侵蚀·日月乾坤·噬魂" or 名称 == "侵蚀·日月乾坤·刻骨") then
    		if 战斗数据:取经脉(攻击方.序号, "五庄观", "乾坤") then --不写那么复杂了
	    		几率 = 几率 + 4
	    	end
	    	if 战斗数据:取经脉(攻击方.序号, "五庄观", "陌宝") then
				几率 = 几率 + 2
			end
			if 战斗数据:取经脉(攻击方.序号, "五庄观", "玄机") and #战斗数据:解除状态结果(挨打方, 初始技能计算:取异常状态法术(挨打方.法术状态),1)>0 then
				几率 = 几率 + 5
			end
			if 攻击方.法术状态.生命之泉 and 攻击方.shenqi.name=="斗转参横" then
	    		几率 = 几率 + 4*攻击方.shenqi.lv
	    	end
    	end
    elseif 攻击方.门派 == "无底洞" then
	    if 战斗数据:取被动(攻击方.序号,"金莲") then
		    几率 = 几率 - 30
		end
	end

    if 挨打方.法术状态.空灵 then --这里是结果直接下调百分比了
		几率 = 几率 - 14
	end
	if 攻击方.法术状态.画地为牢 then
		几率 = 几率 - 24
	elseif 挨打方.法术状态.画地为牢 then
		几率 = 几率 + 18
	end
	if 挨打方.静心~=nil then
	    几率 = 几率 - 3
	end
	if 挨打方.门派=="阴曹地府" then
		if 时辰信息.昼夜 == 1 then
			几率 = qz(几率 * 0.7)
		end
		if 战斗数据:取经脉(挨打方.序号, "阴曹地府", "百爪狂杀") then
			几率 = 几率 + 20
		end
    elseif 挨打方.门派 == "五庄观" then
    	if 战斗数据:取经脉(挨打方.序号, "五庄观", "三元") and 挨打方.人参果.枚==3 then
    	    几率 = 几率 - 15
    	end
    elseif 挨打方.门派 == "凌波城" then
    	if not 战斗数据:取经脉(挨打方.序号, "凌波城", "怒火") then
    		几率 = 几率 - 挨打方.战意*挨打方.战意/2
    	end
    elseif 挨打方.门派 == "花果山" then
    	if 挨打方.法术状态.齐天神通 then
    		几率 = 几率 - 30
    	end
    elseif 挨打方.队伍~=0 and 挨打方.类型 == "bb" then
    	if 挨打方.慧心~=nil then
    	    几率 = 几率 - 挨打方.慧心
    	end
    elseif 挨打方.门派 == "狮驼岭" then
		if 挨打方.法术状态.狂怒 and 挨打方.法术状态.狂怒.不羁~=nil then
		    几率 = 几率 - 10
		end
	elseif 挨打方.门派 == "女儿村" and 战斗数据:取经脉(挨打方.序号, "女儿村", "清澈") and 挨打方.法术状态.自矜 then
        几率 = 几率 - 10
	end

	if 挨打方.法术状态.幽冥鬼眼 then
		几率 = 几率 - 10
		if 挨打方.法术状态.幽冥鬼眼.冥视~=nil then
			几率 = 几率 - 2
		end
	end
	if 挨打方.合纵 then
	    几率 = 几率 + 10
	end

	if 几率 > 封印上限 then
		几率 = 封印上限
	elseif 几率 < 封印下限 then
	  	几率 = 封印下限
	end

    if 攻击方.门派 == "方寸山" then
		if 攻击方.法术状态.凝神术 then
			几率 = 几率 + 10 --这里已经算是增加封印上限了
		end
		if 战斗数据:取经脉(攻击方.序号, "方寸山", "必果") and 攻击方.等级>=挨打方.等级 and 攻击方.必果==nil then
			攻击方.必果 = 1
			几率 = 100
		end
		if 名称 == "顺势而为" then
			几率 = 100
		end
	end
	if 名称 == "妖风四起" then
		几率 = 几率 + 40
	end
	return 几率
	-- 	elseif 名称 == "含情脉脉" and 战斗数据:取经脉(攻击方.序号, "忘川") and (挨打方.力量 > 挨打方.等级*4 or 挨打方.魔力 > 挨打方.等级*4) then
	-- 		封印几率 = 封印几率 + 8
	-- 	end
	-- elseif 攻击方.门派 == "无底洞" then
	-- 	if 战斗数据:取经脉(攻击方.序号, "回敬") and 攻击方.气血 < 攻击方.气血上限*0.5 then
	-- 		封印几率 = 封印几率 + (15*(1-(攻击方.气血/攻击方.最大气血)))
	-- 	end
	-- end
	-- if 攻击方.法术状态.相思寒针 then
	-- 	封印几率 = 封印几率-攻击方.法术状态.相思寒针.境界
	-- end
	-- if 名称 == "毁灭之光" then
	-- 	封印几率 = 9999
	-- elseif 名称 == "秘传封印" then
	-- 	封印几率 = 封印几率 + 10
	-- elseif 名称 == "毒" then
	-- 	封印几率 = 9999
	-- 	封印上限 = 9999
	-- end
end

function 战斗计算:封印命中计算(战斗数据,名称,等级,攻击方,挨打方)
	if 挨打方.门派 == "无底洞" then
		if 战斗数据:取经脉(挨打方.序号,"无底洞", "忍辱") then
			战斗数据:增加愤怒(挨打方.序号, 15)
		end
	end
	local 成功几率 = self:封印命中率(战斗数据,名称,等级,攻击方,挨打方)+10
	if 挨打方.百无禁忌 then
	    成功几率=成功几率-挨打方.百无禁忌
	end
	local ZJ=0
	local JS=0
	if 攻击方.FYMZ then
	    ZJ=攻击方.FYMZ
	    if not 战斗数据.PK战斗 and 攻击方.队伍~=0 then --给玩家增加点封印命中
	        ZJ=ZJ+10
	    end
	elseif 挨打方.DKFY then
	    JS=挨打方.DKFY
	end
	if  名称 == "侵蚀·失魂符·刻骨" then
		成功几率=成功几率*1.05
	end
	if  名称 == "侵蚀·失魂符·钻心" then
		成功几率=成功几率*1.08
	end
	if  名称 == "侵蚀·失魂符·噬魂" then
		成功几率=成功几率*1.10
	end
	if  名称 == "侵蚀·幽夜无明·刻骨" then
		成功几率=999
	end
	if  名称 == "侵蚀·幽夜无明·噬魂" then
		成功几率=999
	end
	if  名称 == "侵蚀·幽夜无明·钻心" then
		成功几率=999
	end
	成功几率=成功几率+ZJ-JS
	if 成功几率 >= 取随机数() then --成功
		if 攻击方.法术状态.自矜 and 攻击方.JM.当前流派=="绝代妖娆" then
			if 战斗数据:取经脉(攻击方.序号, "女儿村", "重明") then
				if 50 >= 取随机数() then
				    战斗数据:取消状态("自矜", 攻击方) --单体封印
				end
		    else
		    	战斗数据:取消状态("自矜", 攻击方)
			end
		end
		if 攻击方.法术状态.顾盼生姿 then
		    战斗数据:取消状态("顾盼生姿", 攻击方)
		end

        if 挨打方.法术状态.身似菩提 then
			return true
		end

		if 战斗数据:取经脉(攻击方.序号,"盘丝洞","迷梦") and 60 >= 取随机数() and not 挨打方.法术状态.瘴气 then
		    战斗数据:添加状态("瘴气",挨打方,攻击方, 69)
		elseif 战斗数据:取经脉(挨打方.序号,"盘丝洞","迷梦") and 60 >= 取随机数() and not 攻击方.法术状态.瘴气 then
		    战斗数据:添加状态("瘴气",攻击方,挨打方, 69)
		end
		if 攻击方.门派=="盘丝洞" and 攻击方.JM.当前流派~="百媚魔姝" then --神迷被动
	    	战斗数据:增加愤怒(攻击方.序号,4)
	    	if 挨打方.愤怒 then
	    	    挨打方.愤怒=挨打方.愤怒-4
		    	if 挨打方.愤怒<=0 then
		    	    挨打方.愤怒 = 0
		    	end
	    	end
		end
        if (名称 == "日月乾坤" or 名称 == "侵蚀·日月乾坤·钻心" or 名称 == "侵蚀·日月乾坤·噬魂" or 名称 == "侵蚀·日月乾坤·刻骨") then
			if 60 >= 取随机数() and  战斗数据:取经脉(攻击方.序号,"五庄观","归本") then
				local lszy = 战斗数据:解除状态结果(战斗数据.参战单位[目标], 初始技能计算:取法宝增益状态(), 1)
		        if #lszy>0 then
		            local jczt = lszy[取随机数(1,#lszy)]
		            战斗数据:取消状态(jczt, 战斗数据.参战单位[目标])
		        end
		    end
		    if 攻击方.法术状态.心随意动 and 攻击方.法术状态.心随意动.经脉流派~="乾坤力士" then
		    	for k, v in pairs(攻击方.主动技能) do
					if v.名称 == "日月乾坤" then
						v.剩余冷却回合=1
						break
					end
				end
		    end
		end
		return true
	else
		if 战斗数据:取被动(攻击方.序号, "自矜") and 名称 ~= "一笑倾城" and 攻击方.JM.当前流派=="绝代妖娆" then
			local gl = 40
			if 战斗数据:取经脉(攻击方.序号, "女儿村", "独尊") then
			    gl = 100
			end
			if sj()<=gl then
				战斗数据:添加状态("自矜",攻击方,攻击方, 69)
			end
		end
		return false
	end
end

function 战斗计算:减少气血(战斗数据,挨打,num,攻击,名称,友伤)
	num = qz(num)

		if 战斗数据.参战单位[挨打].法术状态.催眠符 and num > 战斗数据.参战单位[挨打].法术状态.催眠符.附加参数 then
			战斗数据:取消状态("催眠符",战斗数据.参战单位[挨打])
		end

	if 战斗数据.战斗类型==100224 and 战斗数据.参战单位[挨打].队伍 == 0 and 战斗数据.参战单位[攻击] and 战斗数据.参战单位[攻击].玩家id and 战斗数据.参战单位[挨打].主怪 then
    local 玩家id = 战斗数据.参战单位[攻击].玩家id
    if 玩家数据[玩家id] then
      刷新妖王排行(玩家id,战斗数据.参战单位[挨打].名称,num)
    end
  end
	if 友伤==nil and 战斗数据.参战单位[挨打].护盾 ~= 0 and 名称~="致命" then
		if 战斗数据.参战单位[挨打].护盾 >= num then --是否要等于
			战斗数据.参战单位[挨打].护盾 = 战斗数据.参战单位[挨打].护盾 - num
			num = 0
		else
			num = num - 战斗数据.参战单位[挨打].护盾
			战斗数据.参战单位[挨打].护盾 = 0
			if 战斗数据.参战单位[挨打].法术状态.铜头铁臂 then
			    战斗数据:取消状态("铜头铁臂", 战斗数据.参战单位[挨打])
			end
		end
	end
	----------------沉默分身
	if 战斗数据.战斗类型 == 134871 and 战斗数据.参战单位[挨打].玩家id == 0 and 战斗数据.参战单位[挨打].类型 == "bb" and 沉默分身[战斗数据.任务id] ~= nil and 战斗数据.参战单位[攻击].玩家id ~= 0 then
		local 队伍id = 玩家数据[战斗数据.参战单位[攻击].玩家id].队伍
		if 沉默分身[战斗数据.任务id][队伍id] == nil then
		   沉默分身[战斗数据.任务id][队伍id]={造成伤害=0,战斗回合=0}
		end
		沉默分身[战斗数据.任务id][队伍id].造成伤害 = 沉默分身[战斗数据.任务id][队伍id].造成伤害 + num
		沉默分身类:实时更新排行(战斗数据.任务id)
	end
	----------------
	战斗数据.参战单位[挨打].气血 = 战斗数据.参战单位[挨打].气血 - num

	if 战斗数据:取目标类型(挨打) == "玩家" then
		local bfb = qz(num/战斗数据.参战单位[挨打].最大气血*100)
		local num = 1
		if bfb >= 3 and bfb <= 10 then
			num = 3
		elseif bfb >10 and bfb <= 20 then
		 	num = 10
		elseif bfb >20 and bfb <= 30 then
			num = 15
		elseif bfb >30 and bfb <= 50 then
			num = 25
		elseif bfb >50 and bfb <= 80 then
			num = 40
		elseif bfb >80 and bfb <= 100 then
			num = 55
		end
		if 战斗数据:取经脉(挨打, "天宫","怒火") and num>=10 then
			num=num+4
		end
		战斗数据:增加愤怒(挨打, num+2) --额外增加的
		if 名称~=nil and (名称 == "靛沧海" or 名称 == "日光华" or 名称 == "地裂火" or 名称 == "苍茫树" or 名称 == "巨岩破" or 名称 == "阎罗令" or 名称 == "阎罗拘魂" or 名称 == "判官令" or 名称 == "尘土刃") then
			local num = qz(num/3)
			if 战斗数据.参战单位[挨打].苍埃~=nil then
			    num = num + qz(num/2)
			    战斗数据.参战单位[挨打].苍埃=nil
			else
				num = 0
			end
			if 战斗数据.参战单位[挨打].气血上限 ~= nil then
				战斗数据.参战单位[挨打].气血上限 = 战斗数据.参战单位[挨打].气血上限 - num
				if 战斗数据.参战单位[挨打].气血上限 < 0 then
					战斗数据.参战单位[挨打].气血上限 = 0
					if 战斗数据:取经脉(攻击, "普陀山","秘术") then
					    战斗数据.参战单位[挨打].气血=0
					    战斗数据:添加状态("秘术", 战斗数据.参战单位[挨打], 战斗数据.参战单位[攻击], 69)
					end
				end
			end
		end
		if 战斗数据.参战单位[挨打].苏醒血量~=nil and 战斗数据.参战单位[挨打].气血 > 0 then --没死
		    战斗数据.参战单位[挨打].苏醒血量=战斗数据.参战单位[挨打].苏醒血量+num
		end
	end
	if 战斗数据.参战单位[挨打].气血 <= 0 then --死亡判断 --死亡过多会陷入循环 就很烦
		if 战斗数据.参战单位[挨打].类型 == 'bb' then
		    if 战斗数据:取经脉(攻击 , '九黎城' , '野蛮') then
		        self.参战单位[攻击].野蛮生效 = 1
		    end
		end
		战斗数据.执行等待 = 战斗数据.执行等待 + 5
		战斗数据.参战单位[挨打].气血 = 0
		if 战斗数据.参战单位[挨打].同门单位 then
			战斗数据.同门死亡 = true
		end
		if 战斗数据.参战单位[挨打].法术状态["凭虚御风"] then --添加状态的时候，再添加一个名称，然后可以直接判断这个名称就可以判断到这个法术状态
		    战斗数据:取消状态("凭虚御风", 战斗数据.参战单位[挨打])
	    elseif 战斗数据.参战单位[挨打].法术状态["惊锋"] then
		    战斗数据:取消状态("惊锋", 战斗数据.参战单位[挨打])
	    elseif 战斗数据.参战单位[挨打].法术状态["狂战"] then
		    战斗数据:取消状态("狂战", 战斗数据.参战单位[挨打])
	    elseif 战斗数据.参战单位[挨打].法术状态["酣战"] then
		    战斗数据:取消状态("酣战", 战斗数据.参战单位[挨打])
	    elseif 战斗数据.参战单位[挨打].法术状态["开辟"] then
		    战斗数据:取消状态("开辟", 战斗数据.参战单位[挨打])
		end

		if 战斗数据:取经脉(挨打, "天宫","电光火石") then
			for k, v in pairs(战斗数据.参战单位[挨打].主动技能) do
				if v.名称 == "电光火石" then
					v.剩余冷却回合=9
					break
				end
			end
		end
		if 战斗数据.参战单位[挨打].法术状态.电芒 and 战斗数据.参战单位[挨打].法术状态.电芒.雷波 then
			local bh = 战斗数据.参战单位[挨打].法术状态.电芒.攻击编号
		    local 目标 = 战斗数据:取多个敌方目标(bh, 战斗数据.参战单位[bh].指令.目标, 15)
		    for n = 1, #目标 do
		    	if not 战斗数据.参战单位[目标[n]].法术状态.电芒 then
		    	    战斗数据:添加状态("电芒", 战斗数据.参战单位[目标[n]], 战斗数据.参战单位[bh], 69,nil,3)
		    	end
		    end
		end
		-----这些不知道会不会叠加到召唤出来的宝宝身上 --以下这些，都要排查  攻击是否为空的情况
		if 攻击~=nil then
			if 战斗数据.参战单位[攻击].自恋 then
				if 取随机数()<=战斗数据.参战单位[攻击].自恋[1] then
					战斗数据:添加自恋发言(战斗数据.参战单位[攻击],战斗数据.参战单位[攻击].玩家id,攻击)
				    战斗数据.参战单位[攻击].自恋=nil
				end
			end
			if 战斗数据.参战单位[挨打].受勇武~=nil then
				战斗数据.参战单位[挨打].受勇武=nil
	        end
	        if 战斗数据.参战单位[挨打].炼魂~=nil then
	            战斗数据:添加状态("练魂", 战斗数据.参战单位[挨打], 战斗数据.参战单位[攻击], 69)
	            战斗数据.参战单位[战斗数据.参战单位[挨打].炼魂.攻击方].炼魂经脉=战斗数据.参战单位[战斗数据.参战单位[挨打].炼魂.攻击方].炼魂经脉-1
	            if 战斗数据.参战单位[战斗数据.参战单位[挨打].炼魂.攻击方].炼魂经脉<=0 then
	                战斗数据:添加状态("炼魂", 战斗数据.参战单位[挨打], 战斗数据.参战单位[攻击], 69)
	            end
	        end
	        if 战斗数据.参战单位[挨打].摧心~=nil then
	            战斗数据:添加状态("摧心", 战斗数据.参战单位[挨打], 战斗数据.参战单位[攻击], 69)
	        end
	        if 战斗数据:取目标类型(挨打) == "召唤兽" then
		        if 战斗数据:取经脉(攻击, "龙宫","骇浪") then
					战斗数据.参战单位[攻击].骇浪=1
				end
				if 战斗数据:取经脉(攻击, "龙宫","戏珠") and 战斗数据.参战单位[攻击].指令.参数=="二龙戏珠" then
					战斗数据.参战单位[攻击].戏珠=1
				end
			end
			if 战斗数据:取经脉(攻击, "普陀山","困兽") and 战斗数据:取五行克制(战斗数据.参战单位[攻击].攻击五行,战斗数据.参战单位[挨打].防御五行) then
				战斗数据:添加状态("困兽", 战斗数据.参战单位[挨打], 战斗数据.参战单位[攻击], 69)
			end
			if 战斗数据:取经脉(攻击, "花果山","荡魔")  then
				战斗数据:添加状态("荡魔", 战斗数据.参战单位[攻击], 战斗数据.参战单位[攻击], 69)
			end
			if 战斗数据:取经脉(攻击, "花果山","战神") then
				战斗数据.参战单位[攻击].战神=1
			end
			if 战斗数据.参战单位[挨打].法术状态.爪印 then
				战斗数据:取消状态("爪印", 战斗数据.参战单位[挨打])
			end
			-----这些不知道会不会叠加到召唤出来的宝宝身上
			if (名称 == "断岳势" or 名称 == "惊涛怒") and 战斗数据:取经脉(攻击,"凌波城","再战") and 战斗数据.参战单位[攻击].法术状态.再战==nil then
				战斗数据:添加状态("再战",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11)
			end
			if (战斗数据.参战单位[攻击].法术状态.天眼 or 战斗数据.参战单位[攻击].法术状态.怒眼  or 战斗数据.参战单位[攻击].法术状态.智眼)and 战斗数据:取经脉(攻击,"凌波城","杀罚") and 战斗数据.参战单位[挨打].法术状态.腾雷==nil then
				战斗数据:添加状态("腾雷",战斗数据.参战单位[挨打],战斗数据.参战单位[挨打],11)
			end
			if 战斗数据.参战单位[攻击].shenqi.name=="静笃" then
			    战斗数据.参战单位[攻击].伤害=战斗数据.参战单位[攻击].伤害+60*战斗数据.参战单位[攻击].shenqi.lv
			end
		end
		if 战斗数据.参战单位[挨打].类型 == "角色" or 战斗数据.参战单位[挨打].类型 =="系统角色" then
			if 攻击~=nil then
				if 战斗数据:取经脉(攻击, "普陀山","无怖") and 名称 == "紧箍咒" and  取随机数() < 35 then
		           战斗数据.战斗发言数据[#战斗数据.战斗发言数据 + 1] = {id = 挨打, 内容 = 战斗数据.参战单位[挨打].名称.."偷偷告诉你我的防御五行为：#Y"..战斗数据.参战单位[挨打].防御五行.."#24"}
				end
		        if 战斗数据.PK战斗 then
					if 战斗数据:取经脉(攻击, "大唐官府","傲视") then
					    战斗数据:添加状态("傲视",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],69)
					end
					if 战斗数据.参战单位[攻击].七杀~=nil then
						战斗数据.参战单位[攻击].七杀 = 战斗数据.参战单位[攻击].七杀 + 0.02
						if 战斗数据.参战单位[攻击].七杀>=0.06 then
						    战斗数据.参战单位[攻击].七杀 = 0.06
						end
					end
				end
				if 战斗数据:取经脉(攻击,"狮驼岭","狩猎") and 战斗数据.参战单位[攻击].法术状态.狩猎==nil then
					战斗数据:添加状态("狩猎",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],69)
				end
				if 名称 == "困兽之斗" then
				    战斗数据:添加状态("狂怒",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11,nil,5)
				end
				local zhsid = 战斗数据:取玩家召唤兽(挨打)
				if zhsid ~= 0 and 战斗数据.参战单位[zhsid].复仇 and 战斗数据.参战单位[zhsid].复仇[3] <3  and 取随机数() < 战斗数据.参战单位[zhsid].复仇[1] then
					战斗数据.参战单位[zhsid].复仇[3] = 战斗数据.参战单位[zhsid].复仇[3] +1
					战斗数据.附加流程 = {挨打=zhsid,方式="物理攻击",目标=攻击}
				end
			end

			--以上为攻击不为空的情况
			if 战斗数据:取经脉(挨打,"狮驼岭","死地") then
				战斗数据.参战单位[挨打].死地 = 1
			end
			if 战斗数据.参战单位[挨打].门派=="凌波城" then
				local num = qz(战斗数据.参战单位[挨打].战意/2)
				if 战斗数据.参战单位[挨打].战意<=3 and 战斗数据:取经脉(挨打,"凌波城","不动") then
				    num = num - 1
				end
				战斗数据.参战单位[挨打].战意 = 战斗数据.参战单位[挨打].战意 - num
				战斗数据.参战单位[挨打].超级战意 = 战斗数据.参战单位[挨打].超级战意 - num
				if 战斗数据.参战单位[挨打].战意 <=0 then 战斗数据.参战单位[挨打].战意 = 0 end
				if 战斗数据.参战单位[挨打].超级战意 <=0 then 战斗数据.参战单位[挨打].超级战意 = 0 end
			end

			if 战斗数据:取指定法宝(挨打, "炽焰丹珠") then
				local 境界 = 战斗数据:取指定法宝境界(挨打, "炽焰丹珠")
				战斗数据.参战单位[挨打].愤怒 = qz(战斗数据.参战单位[挨打].愤怒 * (境界 * 2.5 + 3)*0.01)
				if 战斗数据.参战单位[挨打].愤怒>=29 then
				    战斗数据.参战单位[挨打].愤怒=29
				end
			else
				if 战斗数据:取经脉(挨打, "化生寺","舍利") and 战斗数据.参战单位[挨打].舍利==nil then
					local 目标 = 战斗数据:取多个友方目标(挨打,挨打,5,"角色队友")
					local zz=qz(战斗数据.参战单位[挨打].愤怒*0.65)
					if #目标~=0 then
						for i=1,#目标 do
							if 战斗数据.参战单位[目标[i]].愤怒 < 120 then
								if 战斗数据.参战单位[目标[i]].愤怒+zz>=120 then
								    zz=120-战斗数据.参战单位[目标[i]].愤怒
								end
								战斗数据:增加愤怒(目标[i],zz)
							end
						end
					end
					战斗数据.参战单位[挨打].舍利=1
				end

				战斗数据.参战单位[挨打].愤怒 = 0
			end
			if 战斗数据:取指定法宝(挨打, "翡翠芝兰") and 战斗数据.参战单位[挨打].翡翠芝兰==nil then
				战斗数据.参战单位[挨打].翡翠芝兰=1
				local  mf  = qz(战斗数据.参战单位[挨打].等级*1.5 + 战斗数据:取指定法宝境界(挨打, "翡翠芝兰")*10)
				local 目标 = 战斗数据:取多个友方目标(挨打, 挨打,10,"推气过宫")
				for n = 1, #目标 do
					战斗数据:增加魔法(目标[n],mf)
	            end
			end
			if 战斗数据:取指定法宝(挨打, "太虚玉液") and 战斗数据.参战单位[挨打].太虚玉液==nil then
				战斗数据.参战单位[挨打].太虚玉液=1
				local 境界 = 战斗数据:取指定法宝境界(挨打, "太虚玉液")
				local qx = qz(战斗数据.参战单位[挨打].等级*(境界*3+6)*0.1)
				local 目标 = 战斗数据:取多个友方目标(挨打, 挨打,10,"推气过宫")
				for n = 1, #目标 do
					战斗数据:动画加血流程(目标[n],qx)
				end
			end
			-----------地府处理
			if 战斗数据:取全场状态("无间地狱") ~= false then
				战斗数据.参战单位[挨打].无间地狱=1
			end

			if 战斗数据.参战单位[挨打].法术状态.魂飞 then
				战斗数据:添加状态("锢魂术", 战斗数据.参战单位[挨打], 战斗数据.参战单位[战斗数据.参战单位[挨打].法术状态.魂飞.攻击编号], 11,nil,2)
			end
			local bh=nil
	        for k,v in pairs(战斗数据.友方经脉统计) do
	        	if v.汲魂 then
	        	    bh=v.汲魂.触发id
	        	    break
	        	end
	        end
	        if bh~=nil and 战斗数据:取目标状态(bh, bh, 2) then
        	    战斗数据:动画加血流程(bh,战斗数据.参战单位[bh].等级*6)
        	end

			战斗数据.参战单位[挨打].愤怒=0
			战斗数据.参战单位[挨打].死亡击飞 = false
			return 2
		else
			-- if 战斗数据.参战单位[挨打].抗物 and 战斗数据.参战单位[挨打].抗物[1] then
			-- 	战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].抗物 = 战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].抗物-战斗数据.参战单位[挨打].抗物[1]
			-- end
			-- if 战斗数据.参战单位[挨打].抗法 and 战斗数据.参战单位[挨打].抗法[1] then
			-- 	战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].抗法 = 战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].抗法-战斗数据.参战单位[挨打].抗法[1]
			-- end
	        local bh=nil
	        for k,v in pairs(战斗数据.友方经脉统计) do
	        	if v.阎罗 then
	        	    bh=v.阎罗.触发id
	        	    break
	        	end
	        end
	        if bh~=nil and 战斗数据.参战单位[bh].阎罗==nil and 战斗数据.参战单位[挨打].队伍~=战斗数据.参战单位[bh].队伍 then
	            战斗数据.参战单位[bh].阎罗=战斗数据.回合数
	        end
			if 战斗数据.参战单位[挨打].鬼魂 then
				if 攻击 == nil and 名称 == nil then
					战斗数据:添加状态("复活", 战斗数据.参战单位[挨打],战斗数据.参战单位[挨打], 11)
					-- 战斗数据.参战单位[挨打].法术状态.复活 = {回合 = 战斗数据.参战单位[挨打].鬼魂}
					战斗数据.参战单位[挨打].死亡击飞 = false
					return 2
				-- elseif 名称 == "五雷咒" or 名称 == "落雷符" then
				-- 	战斗数据.参战单位[挨打].死亡击飞 = true
				-- 	return 1
				elseif 攻击 == nil then
					战斗数据.参战单位[挨打].法术状态.复活 = {回合 = 战斗数据.参战单位[挨打].鬼魂}
					战斗数据.参战单位[挨打].死亡击飞 = false
					return 2
				elseif 战斗数据.参战单位[攻击].驱鬼 or 战斗数据.参战单位[攻击].法术状态.灵断 or (战斗数据.参战单位[攻击].风卷残云 and 取随机数()<=战斗数据.参战单位[攻击].风卷残云) then
					战斗数据.参战单位[挨打].死亡击飞 = true
					if 战斗数据:取经脉(攻击,"阴曹地府","恶焰") and 战斗数据.参战单位[挨打].法术状态.尸腐毒 then
					    战斗数据:添加状态("恶焰",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11)
				    elseif 战斗数据:取经脉(攻击, "女儿村", "花骨") then
			    		战斗数据:添加状态("自矜",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11)
		    		elseif 战斗数据.参战单位[攻击].添加木精 and 战斗数据.参战单位[攻击].添加木精~=0 then
		    			战斗数据:添加状态("木精",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11,nil,战斗数据.参战单位[攻击].添加木精)
		    			战斗数据.参战单位[攻击].添加木精=0 --重置
					end
					if 战斗数据.血债偿统计[战斗数据.参战单位[挨打].队伍]~=nil then
					    local 目标 = 战斗数据:取多个友方bb目标(挨打, 挨打, 5)
						for n = 1, #目标 do
							if 战斗数据.参战单位[目标[n]].血债偿~=nil then
							    战斗数据:添加状态("血债偿", 战斗数据.参战单位[目标[n]], 战斗数据.参战单位[目标[n]], 战斗数据.参战单位[目标[n]].血债偿)
							end
						end
					end
					if 战斗数据.全场属性[战斗数据.参战单位[挨打].队伍] and 战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].狂战 then
						战斗数据:添加状态("狂战",战斗数据.参战单位[战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].狂战],战斗数据.参战单位[战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].狂战],11)
					end
					return 1
				else
					战斗数据:添加状态("复活", 战斗数据.参战单位[挨打],战斗数据.参战单位[挨打], 11)
					-- 战斗数据.参战单位[挨打].法术状态.复活 = {回合 = 战斗数据.参战单位[挨打].鬼魂}
					战斗数据.参战单位[挨打].死亡击飞 = false
					return 2
				end
			else
				if 战斗数据.参战单位[挨打].类型 ~= "角色" and 战斗数据.参战单位[挨打].类型 ~="系统角色" then
					战斗数据.参战单位[挨打].死亡击飞 = true
					if 攻击~=nil then
						if 战斗数据.参战单位[攻击].门派=="大唐官府" and 战斗数据:取经脉(攻击,"大唐官府","灵能") then
						    战斗数据.参战单位[攻击].灵能=1
						elseif 战斗数据.参战单位[攻击].门派=="方寸山" and 战斗数据:取经脉(攻击,"方寸山","神机") then
							攻击方.法术状态.符咒.层数=攻击方.法术状态.符咒.层数+1
						elseif 战斗数据:取经脉(攻击,"阴曹地府","恶焰")and 战斗数据.参战单位[挨打].法术状态.尸腐毒 then
						    战斗数据:添加状态("恶焰",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11)
						elseif 战斗数据:取经脉(攻击,"无底洞","牵动") then
						    战斗数据:添加状态("裂魂",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11)
						elseif 战斗数据.参战单位[攻击].添加木精 and 战斗数据.参战单位[攻击].添加木精~=0 then
			    			战斗数据:添加状态("木精",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11,nil,战斗数据.参战单位[攻击].添加木精)
			    			战斗数据.参战单位[攻击].添加木精=0
						end
						if 战斗数据.PK战斗 then
						    if 战斗数据:取经脉(攻击,"狮驼岭","狂啸") then
							    战斗数据:添加状态("狂怒",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11,nil,3)
							end
						end
						if 战斗数据:取经脉(攻击, "女儿村", "花骨") then
				    		战斗数据:添加状态("自矜",战斗数据.参战单位[攻击],战斗数据.参战单位[攻击],11)
						end
					end
					if 战斗数据.全场属性[战斗数据.参战单位[挨打].队伍] and 战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].狂战 then
						战斗数据:添加状态("狂战",战斗数据.参战单位[战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].狂战],战斗数据.参战单位[战斗数据.全场属性[战斗数据.参战单位[挨打].队伍].狂战],11)
					end
					return 1
				else
					战斗数据.参战单位[挨打].死亡击飞 = false
					return 2
				end
			end

			战斗数据.参战单位[挨打].死亡 = true

		end
	else
		return
	end
end

-- function 战斗计算:宝石等级(战斗数据,编号,部位)
-- 	if 战斗数据.参战单位[编号] and 战斗数据.参战单位[编号].类型=="角色" then
-- 		if 玩家数据[战斗数据.参战单位[编号].玩家id] then
-- 			if 玩家数据[战斗数据.参战单位[编号].玩家id].角色.装备[部位] and 玩家数据[战斗数据.参战单位[编号].玩家id].道具.数据[玩家数据[战斗数据.参战单位[编号].玩家id].角色.装备[部位]] and 玩家数据[战斗数据.参战单位[编号].玩家id].道具.数据[玩家数据[战斗数据.参战单位[编号].玩家id].角色.装备[部位]].锻炼等级 then
-- 				return 玩家数据[战斗数据.参战单位[编号].玩家id].道具.数据[玩家数据[战斗数据.参战单位[编号].玩家id].角色.装备[部位]].锻炼等级
-- 			end
-- 		end
-- 	end
-- 	return 0
-- end

function 战斗计算:取敌方气血最低召唤兽(战斗数据,编号)
	local lsb = 战斗数据:取敌对阵营数据(战斗数据.参战单位[编号].队伍)
	if #lsb==0 then return false end
	table.sort(lsb, function(a, b) return a.气血 < b.气血 and a.类型 < b.类型 end) --类型小的时候是宝宝
	return lsb[1]
end

function 战斗计算:取敌方气血最低角色(战斗数据,编号)
	local lsb = 战斗数据:取敌对阵营数据(战斗数据.参战单位[编号].队伍)
	if #lsb==0 then return false end
	table.sort(lsb, function(a, b) return a.气血 < b.气血 and a.类型 > b.类型 end)
	return  lsb[1]
end

function 战斗计算:取敌方气血最低(战斗数据,编号,类型)
	local lsb = 战斗数据:取敌对阵营数据(战斗数据.参战单位[编号].队伍)
	if #lsb==0 then return false end
	table.sort(lsb, function(a, b) return a.气血 < b.气血 end)
	return  lsb[1]
end

function 战斗计算:取敌方防御最低(战斗数据,编号,类型)
	local lsb = 战斗数据:取敌对阵营数据(战斗数据.参战单位[编号].队伍)
	if #lsb==0 then return false end
	table.sort(lsb, function(a, b) return a.防御 < b.防御 end)
	return  lsb[1]
end

function 战斗计算:取敌对愤怒最高角色(战斗数据,编号)
	local lsb = 战斗数据:取敌对阵营数据(战斗数据.参战单位[编号].队伍)
	if #lsb==0 then return false end
	table.sort(lsb, function(a, b) return a.愤怒 > b.愤怒 and a.类型 > b.类型 end)
	return  lsb[1]
end

function 战斗计算:取阵营气血最低(战斗数据,编号)
	local lsb = 战斗数据:取阵营数据(战斗数据.参战单位[编号].队伍)
	if #lsb==0 then return false  end
	table.sort(lsb, function(a, b) return a.气血 < b.气血 end)
	return lsb[1]
end

function 战斗计算:取阵营信息(战斗数据,编号)
	local lsb = 战斗数据:取阵营数据(战斗数据.参战单位[编号].队伍)
	return  lsb
end

return 战斗计算