-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-12 19:21:07
-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-06 07:48:20
local 战斗法术计算 = class()
local jhf = string.format
local random = math.random
local qz=math.floor
local sj = 取随机数
function 战斗法术计算:初始化() end
-- 龙腾=技能（龙腾）×2.5+灵力差×1.0+武器伤害×0.3+28.5
-- 龙卷雨击=（技能（龙卷）×2.0+灵力差×1.0+武器伤害×0.3）×（10-作用人数）/10
-- 二龙戏珠=（技能（二龙）×2.5+灵力差×1.0+武器伤害×0.3）×（10-作用人数）/10（待证）
-- 三味真火=技能（三味）×3.0+灵力差×1.0+武器伤害×0.3+20（待证）
-- 飞沙走石=（技能（飞沙）×2.0+灵力差×1.0+武器伤害×0.3）×（10-作用人数）/10
-- 唧唧歪歪=（技能（JJ）×1.5+灵力差×1.0+武器伤害×0.3）×（10-作用人数）/10
-- 雷霆万钧=（技能（雷霆）×2.0+灵力差×1.0+武器伤害×0.3）×（10-作用人数）/10（待证）
-- 五雷咒=技能（五雷）×1.5+灵力差×1.05+武器伤害/3（或×0.34）+22.5
-- 法宠(单法)=等级×3+灵力差×1.2+20
-- 法宠(群法)=(等级×3+灵力差×1.2+10)×（10-作用人数）/10
-- 流影云笛:增加54法伤。
-- 血魄元幡:增加75法伤。
-- local 破防 = 攻击方法伤/挨打方法防 or 灵力 --这个我可能要加进去，不然法伤的高低对伤害没啥太大影响

function 战斗法术计算:法攻循环前附加流程(编号,名称,伤害系数,战斗数据,目标数)--用在这里效率更高，因为不用循环  需要调用到挨打方的，就要在经脉结果添加了
	if 战斗数据.参战单位[编号].门派 == "化生寺" then
		if 名称 == "唧唧歪歪" then
			if 战斗数据:取经脉(编号, "化生寺","诵经") then
				战斗数据:添加状态("诵经",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				伤害系数 = 伤害系数 * (1+0.02*战斗数据.参战单位[编号].法术状态["诵经"].层数)
			end
			if 战斗数据:取经脉(编号, "化生寺","解惑") then
				for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
					if v.名称 == "谆谆教诲" and v.剩余冷却回合~=nil then
						if v.剩余冷却回合>=3 then
							v.剩余冷却回合=v.剩余冷却回合-3
						else
							v.剩余冷却回合=nil
						end
						break
					end
				end
			end
		elseif 名称 == "谆谆教诲" and 战斗数据.参战单位[编号].法术状态["诵经"] then
			伤害系数 = 伤害系数 * (1+0.02*战斗数据.参战单位[编号].法术状态["诵经"].层数)
			战斗数据:取消状态("诵经", 战斗数据.参战单位[编号])
		end
		if 战斗数据:取经脉(编号, "化生寺","悲悯") and 战斗数据:取指定法宝(编号, "慈悲") then
			伤害系数 = 伤害系数 * (1 + 战斗数据:取指定法宝境界(编号, "慈悲")/1.5/100)
		end
		if 战斗数据:取经脉(编号, "化生寺","坐禅") then
			local fyjn = 战斗数据:解除状态结果(战斗数据.参战单位[编号], 初始技能计算:取增益状态法术(), 1)
			伤害系数 = 伤害系数 * (1 + #fyjn*0.01)
		end

	elseif 战斗数据.参战单位[编号].门派 == "龙宫" then
		if 战斗数据.参战单位[编号].法术状态["龙魂"] then
			local 值 = 0.03
			if 战斗数据:取经脉(编号, "龙宫","叱咤") then
				值 = 0.09
			end
			if 战斗数据.参战单位[编号].法术状态["潜龙在渊"] then
				值 = 值 + 0.01*战斗数据.参战单位[编号].法术状态["潜龙在渊"].层数
			end
			if 战斗数据.参战单位[编号].法术状态["盘龙"] then
				值 = 值 + 0.02*战斗数据.参战单位[编号].法术状态["盘龙"].层数
			end

			伤害系数 = 伤害系数 + 值
		elseif 战斗数据:取被动(编号,"龙魂") or 战斗数据.参战单位[编号].龙魂~=nil and (战斗数据.参战单位[编号].法术状态==nil or 战斗数据.参战单位[编号].法术状态["龙魂"]==nil ) then
			if 战斗数据.参战单位[编号].龙魂 ==nil then
				战斗数据.参战单位[编号].龙魂 = 0
			end
			战斗数据.参战单位[编号].龙魂 = 战斗数据.参战单位[编号].龙魂 + 1
			if 战斗数据.参战单位[编号].龙魂>=3 then
				战斗数据.参战单位[编号].龙魂 = 0
				战斗数据:添加状态("龙魂",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				if 战斗数据:取经脉(编号, "龙宫","盘龙") then
					战斗数据:添加状态("盘龙",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				end
			end
		end
		if 名称 == "龙卷雨击" and 战斗数据:取被动(编号,"龙骇") then
			if 战斗数据.参战单位[编号].法术状态["龙骇"] then
				if 战斗数据.参战单位[编号].法术状态["龙骇"].触发==名称 then
					local 值 = 0.1
					if 战斗数据:取经脉(编号, "龙宫","雨魄") then
						值 = 0.15
					end
					if 战斗数据:取经脉(编号, "龙宫","回灵") and 战斗数据.参战单位[编号].法术状态["龙魂"] then
						值 = 值 + 0.16
					end
					if 战斗数据.参战单位[编号].法术状态["潜龙在渊"] then
						值 = 值 + 0.02*战斗数据.参战单位[编号].法术状态["潜龙在渊"].层数
					end
					伤害系数 = 伤害系数 + 值
					战斗数据:取消状态("龙骇", 战斗数据.参战单位[编号])
				end
			else
				local gl = 25
				if 战斗数据:取经脉(编号, "龙宫","傲岸") then
					gl = 75
				end
				if 战斗数据.参战单位[编号].法术状态.龙魂 then
					gl = 100
				end
				if 取随机数()<=gl then
					战斗数据:添加状态("龙骇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69,nil,"龙腾")
				end
			end
			if 战斗数据.参战单位[编号].骇浪~=nil then
				伤害系数 = 伤害系数 * 1.05
				战斗数据.参战单位[编号].骇浪 = nil
			end
			if 战斗数据:取经脉(编号, "龙宫","斩浪") then
				if 目标数 == 7 then
					if 战斗数据.PK战斗 then
						战斗数据.参战单位[编号].斩浪 = 7
					else
						战斗数据.参战单位[编号].斩浪 = 21
					end
				end
			end
		elseif 名称 == "龙腾" and 战斗数据:取被动(编号,"龙骇") then
			if 战斗数据.参战单位[编号].法术状态["龙骇"] then
				if 战斗数据.参战单位[编号].法术状态["龙骇"].触发==名称 then
					local 值 = 0.2
					if 战斗数据:取经脉(编号, "龙宫","雨魄") then
						值 = 0.3
					end
					if 战斗数据:取经脉(编号, "龙宫","回灵") and 战斗数据.参战单位[编号].法术状态["龙魂"] then
						值 = 值 + 0.16
					end
					if 战斗数据.参战单位[编号].法术状态["潜龙在渊"] then
						值 = 值 + 0.02*战斗数据.参战单位[编号].法术状态["潜龙在渊"].层数
					end
					伤害系数 = 伤害系数 + 值
					战斗数据:取消状态("龙骇", 战斗数据.参战单位[编号])
				end
			else --只要有龙骇我们都不添加
				local gl = 25
				if 战斗数据:取经脉(编号, "龙宫","傲岸") then
					gl = 75
				end
				if 战斗数据.参战单位[编号].法术状态.龙魂 then
					gl = 100
				end
				if 取随机数()<=gl then
					战斗数据:添加状态("龙骇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69,nil,"龙卷雨击")
				end
			end
		end

	elseif 战斗数据.参战单位[编号].门派 == "魔王寨" then
		if 战斗数据.参战单位[编号].法术状态.蚀天 then
			伤害系数 = 伤害系数 * 1.15
		end
		if (名称 == "三昧真火" or 名称 == "飞砂走石") then
			if 战斗数据.回合数>=4 and 取随机数()<=25 then
				for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
					if v.名称 == "风云变色" then
						v.剩余冷却回合=nil
						break
					end
				end
			end
			if 战斗数据:取经脉(编号, "魔王寨","咒言")  then
			for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
				if (v.名称 == "秘传飞砂走石" or v.名称 == "秘传三昧真火")  and v.剩余冷却回合 ~= nil then
						v.剩余冷却回合=v.剩余冷却回合-1
						break
					end
				end
			end
			if 战斗数据:取经脉(编号, "魔王寨","真炎") and 取随机数()<=10 then
				伤害系数 = 伤害系数 * 1.3
			end
		end
		if 战斗数据.参战单位[编号].法术状态.燃魂 then
			伤害系数 = 伤害系数 * 1.12
			战斗数据:取消状态("燃魂", 战斗数据.参战单位[编号])
		end

		if 战斗数据.参战单位[编号].法术状态.燃魂 then
			伤害系数 = 伤害系数 * 1.12
			战斗数据:取消状态("燃魂", 战斗数据.参战单位[编号])
		end

	elseif 战斗数据.参战单位[编号].门派 == "神木林" then
		if 战斗数据:取经脉(编号, "神木林","神木") then
			local  x = 1
			if 战斗数据:取装备五行(编号,3)=="木" then --武器
				x = x + 0.04
			end
			if 战斗数据:取装备五行(编号,4)=="木" then --衣服
				x = x + 0.04
			end
			伤害系数 = 伤害系数 * x
		end
		if 战斗数据:取经脉(编号, "神木林","滋养") and 战斗数据.参战单位[编号].法术状态.蜜润 then
			伤害系数 = 伤害系数 * 1.15
		end
		if 战斗数据.参战单位[编号].法术状态.蔓延 then
			伤害系数 = 伤害系数 *1.15
			战斗数据.参战单位[编号].蔓延=1
		end

		if 名称 == "蛊木迷瘴" and 战斗数据:取经脉(编号, "神木林","伏毒") and 伤害系数<1 and 战斗数据:风灵消耗(战斗数据.参战单位[编号],"蛊木迷瘴",1)==1 then
			战斗数据.参战单位[编号].伏毒=1
		end

		if 战斗数据:取经脉(编号, "神木林","苍风") and 名称 == "落叶萧萧" and 战斗数据:风灵消耗(战斗数据.参战单位[编号],"落叶萧萧",1)==1 then
			伤害系数 = 伤害系数 * 1.06
		end


		if 名称=="风卷残云" then
			local num = 0
			if 战斗数据:取指定法宝(编号,"月影") then
				num = 0.12
			end
			local  fl = 战斗数据:风灵消耗(战斗数据.参战单位[编号],"风卷残云",6)
			num = num + fl*0.16
			if 伤害系数==nil or 伤害系数==0 then
				伤害系数=1
			end
			伤害系数 = 伤害系数 * (1+num)

		end


	elseif 战斗数据.参战单位[编号].门派 == "方寸山" then
		if 战斗数据:取经脉(编号, "方寸山", "怒霆") and  名称 == "五雷咒" then
			战斗数据:添加状态("怒霆", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号], 1)
		end
		if 战斗数据:取经脉(编号, "方寸山", "批亢") and 战斗数据.参战单位[编号].法术状态.分身术 then
			伤害系数 = 伤害系数 * 1.2
		end

	elseif 战斗数据.参战单位[编号].门派 == "天宫" then

		if 战斗数据.参战单位[编号].法术状态.天雷灌注 then
			if (名称=="雷霆万钧" or 名称=="侵蚀·雷霆万钧·钻心"or 名称=="侵蚀·雷霆万钧·噬魂"or 名称=="侵蚀·雷霆万钧·刻骨") and not 战斗数据:取经脉(编号, "天宫", "雷霆汹涌") then
				战斗数据.参战单位[编号].法术状态.天雷灌注.层数 = 战斗数据.参战单位[编号].法术状态.天雷灌注.层数 - 1
				伤害系数 = 伤害系数 * 1.25
				if 战斗数据.参战单位[编号].法术状态.天雷灌注.层数<=0 then
					战斗数据:取消状态("天雷灌注", 战斗数据.参战单位[编号])
				end
			end
		end
--------------------------18奇技天宫1-------------------------------
		if 名称 == "雷霆万钧" then
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"天宫A") >=1 and not 战斗数据.PK战斗 then
  				伤害系数 = 伤害系数 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"天宫A")/100
  			end
  		end
--------------------------18奇技天宫1-------------------------------

	elseif 战斗数据.参战单位[编号].门派 == "花果山" then
		if 名称=="兴风作浪" then
			if 战斗数据.参战单位[编号].威仪~=nil and 战斗数据.参战单位[编号].威仪==名称 then
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "威仪") then
				战斗数据.参战单位[编号].威仪="棒掀北斗"
			end
			if 战斗数据:取经脉(编号, "花果山", "愈勇") then
				战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			end
			if 战斗数据:取经脉(编号, "花果山", "斗志") then
				战斗数据.参战单位[编号].斗志=名称
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "顽性") then
				战斗数据.参战单位[编号].顽性=名称
			end
			if 战斗数据:取经脉(编号, "花果山", "锻炼") then
				if 战斗数据.参战单位[编号].锻炼==nil then
					战斗数据.参战单位[编号].锻炼={回合=2,层数=1}
				else
					战斗数据.参战单位[编号].锻炼={回合=2,层数=战斗数据.参战单位[编号].锻炼.层数+1}
				end
			end
		elseif 名称=="棍打诸神" then
			if 战斗数据:取经脉(编号, "花果山", "愈勇") then
				战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			end
			if 战斗数据:取经脉(编号, "花果山", "斗志") then
				战斗数据.参战单位[编号].斗志=名称
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "顽性") then
				战斗数据.参战单位[编号].顽性=名称
			end
			if 战斗数据:取经脉(编号, "花果山", "锻炼") then
				if 战斗数据.参战单位[编号].锻炼==nil then
					战斗数据.参战单位[编号].锻炼={回合=2,层数=1}
				else
					战斗数据.参战单位[编号].锻炼={回合=2,层数=战斗数据.参战单位[编号].锻炼.层数+1}
				end
			end
		elseif 名称=="意马心猿" then
			if 战斗数据:取经脉(编号, "花果山", "愈勇") then
				战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			end
			if 战斗数据:取经脉(编号, "花果山", "斗志") then
				战斗数据.参战单位[编号].斗志=名称
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "顽性") then
				战斗数据.参战单位[编号].顽性=名称
			end
			if 战斗数据:取经脉(编号, "花果山", "锻炼") then
				if 战斗数据.参战单位[编号].锻炼==nil then
					战斗数据.参战单位[编号].锻炼={回合=2,层数=1}
				else
					战斗数据.参战单位[编号].锻炼={回合=2,层数=战斗数据.参战单位[编号].锻炼.层数+1}
				end
			end
		elseif 名称=="灵彻太虚" then
			if 战斗数据:取经脉(编号, "花果山", "愈勇") then
				战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			end
			if 战斗数据:取经脉(编号, "花果山", "斗志") then
				战斗数据.参战单位[编号].斗志=名称
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "顽性") then
				战斗数据.参战单位[编号].顽性=名称
			end
			if 战斗数据:取经脉(编号, "花果山", "锻炼") then
				if 战斗数据.参战单位[编号].锻炼==nil then
					战斗数据.参战单位[编号].锻炼={回合=2,层数=1}
				else
					战斗数据.参战单位[编号].锻炼={回合=2,层数=战斗数据.参战单位[编号].锻炼.层数+1}
				end
			end
		elseif 名称=="棒掀北斗" then
			if 战斗数据.参战单位[编号].威仪~=nil and 战斗数据.参战单位[编号].威仪==名称 then
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "威仪") then
				战斗数据.参战单位[编号].威仪="兴风作浪"
			end
			if 战斗数据:取经脉(编号, "花果山", "愈勇") then
				战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			end
			if 战斗数据:取经脉(编号, "花果山", "斗志") then
				战斗数据.参战单位[编号].斗志=名称
				伤害系数 = 伤害系数 * 1.06
			end
			if 战斗数据:取经脉(编号, "花果山", "顽性") then
				战斗数据.参战单位[编号].顽性=名称
			end
			if 战斗数据:取经脉(编号, "花果山", "锻炼") then
				if 战斗数据.参战单位[编号].锻炼==nil then
					战斗数据.参战单位[编号].锻炼={回合=2,层数=1}
				else
					战斗数据.参战单位[编号].锻炼={回合=2,层数=战斗数据.参战单位[编号].锻炼.层数+1}
				end
			end
		end
end

	return 伤害系数
end

function 战斗法术计算:法攻技能计算(编号,名称,等级,伤害系数,消耗,战斗数据)--------
	local 目标=战斗数据.参战单位[编号].指令.目标
	local zza = skill.数据[名称]
	local 目标数 = zza.技能人数(等级,战斗数据.参战单位[编号],战斗数据.PK战斗)--skill:取技能人数(名称,等级)
	if 名称=="五雷咒" and 战斗数据:取被动(编号, "奔雷") then
		目标数 = 2
		if 战斗数据:取经脉(编号, "方寸山", "超导") and  时辰信息.天气 ==2 then --执行数 ==1
		伤害系数=伤害系数*1.2
		end
		if 战斗数据.参战单位[编号].法术状态.怒霆 and 战斗数据.参战单位[编号].法术状态.怒霆.层数>=5 then
		   目标数 = 5
		   战斗数据:取消状态("怒霆", 战斗数据.参战单位[编号])
		end
		if 战斗数据.参战单位[编号].法术状态.炼魂 then
			战斗数据.参战单位[编号].炼魂经脉=nil
			目标数 = 目标数 + 2
		end
			elseif 名称=="侵蚀·五雷咒·刻骨" and math.random(100)<= 50 then
			目标数 = 2
				if  战斗数据:取被动(编号, "奔雷") then
					目标数=目标数+1
				end
			if 战斗数据:取经脉(编号, "方寸山", "超导") and  时辰信息.天气 ==2 then --执行数 ==1
			伤害系数=伤害系数*1.2
			end
			if 战斗数据.参战单位[编号].法术状态.怒霆 and 战斗数据.参战单位[编号].法术状态.怒霆.层数>=5 then
			   目标数 = 6
			   战斗数据:取消状态("怒霆", 战斗数据.参战单位[编号])
			end
			if 战斗数据.参战单位[编号].法术状态.炼魂 then
				战斗数据.参战单位[编号].炼魂经脉=nil
				目标数 = 目标数 + 2
			end
			elseif 名称=="侵蚀·五雷咒·钻心" and math.random(100)<= 80 then
			目标数 = 2
				if  战斗数据:取被动(编号, "奔雷") then
					目标数=目标数+1
				end
			if 战斗数据:取经脉(编号, "方寸山", "超导") and  时辰信息.天气 ==2 then --执行数 ==1
			伤害系数=伤害系数*1.2
			end
			if 战斗数据.参战单位[编号].法术状态.怒霆 and 战斗数据.参战单位[编号].法术状态.怒霆.层数>=5 then
			   目标数 = 6
			   战斗数据:取消状态("怒霆", 战斗数据.参战单位[编号])
			end
			if 战斗数据.参战单位[编号].法术状态.炼魂 then
				战斗数据.参战单位[编号].炼魂经脉=nil
				目标数 = 目标数 + 2
			end
			elseif 名称=="侵蚀·五雷咒·噬魂" and math.random(100)<= 100 then
			目标数 = 2
				if  战斗数据:取被动(编号, "奔雷") then
					目标数=目标数+1
				end
			if 战斗数据:取经脉(编号, "方寸山", "超导") and  时辰信息.天气 ==2 then --执行数 ==1
			伤害系数=伤害系数*1.2
			end
			if 战斗数据.参战单位[编号].法术状态.怒霆 and 战斗数据.参战单位[编号].法术状态.怒霆.层数>=5 then
			   目标数 = 6
			   战斗数据:取消状态("怒霆", 战斗数据.参战单位[编号])
			end
			if 战斗数据.参战单位[编号].法术状态.炼魂 then
				战斗数据.参战单位[编号].炼魂经脉=nil
				目标数 = 目标数 + 2
			end
          		 elseif  名称 == "雷法·震煞" then
		    战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=战斗数据.参战单位[编号].法术状态.符咒.层数
		    if 战斗数据:取经脉(编号, "方寸山","符威") then
			    战斗数据:增加愤怒(编号,战斗数据.参战单位[编号].法术状态.雷法·震煞.层数)
		   end
		            if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
			if 战斗数据:取经脉(编号, "方寸山", "五雷·挪移") and  时辰信息.天气 ==1 then --执行数 ==1
			战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=战斗数据.参战单位[编号].法术状态.雷法·震煞.层数+1
			end
		elseif  名称 == "雷法·轰天" then
		    战斗数据.参战单位[编号].法术状态.雷法·轰天.层数=战斗数据.参战单位[编号].法术状态.符咒.层数
		     if 战斗数据:取经脉(编号, "方寸山","符威") then
			    战斗数据:增加愤怒(编号,战斗数据.参战单位[编号].法术状态.雷法·轰天.层数)
		   end
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
		elseif  名称 == "雷法·翻天" then
		    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=战斗数据.参战单位[编号].法术状态.符咒.层数
	   		 if 战斗数据:取经脉(编号, "方寸山","符威") then
			    战斗数据:增加愤怒(编号,战斗数据.参战单位[编号].法术状态.雷法·翻天.层数)
		             end
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
		elseif  名称 == "雷法·崩裂" then
		    战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=战斗数据.参战单位[编号].法术状态.符咒.层数
		    if 战斗数据:取经脉(编号, "方寸山","符威") then
			    战斗数据:增加愤怒(编号,战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数)
		   end
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数+1
			end
		elseif  名称 == "雷法·坤伏" then
		    战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数=战斗数据.参战单位[编号].法术状态.符咒.层数
		    if 战斗数据:取经脉(编号, "方寸山","符威") then
			    战斗数据:增加愤怒(编号,战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数)
		   end
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 3 then
				战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数=战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数+1
			end
		elseif  名称 == "雷法·倒海" then
		    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=战斗数据.参战单位[编号].法术状态.符咒.层数
		    if 战斗数据:取经脉(编号, "方寸山","符威") then
			    战斗数据:增加愤怒(编号,战斗数据.参战单位[编号].法术状态.雷法·倒海.层数)
		   end
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
		elseif  名称 == "五雷正法" then
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
			if 战斗数据:取经脉(编号, "方寸山","震怒") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
			end
			if 战斗数据:取经脉(编号, "方寸山","天篆") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.08
				end
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·震煞~=nil then
			      目标数 = 1+战斗数据.参战单位[编号].法术状态.雷法·震煞.层数
			 end
			if 战斗数据:取目标类型(编号) == "玩家"and  战斗数据.参战单位[编号].法术状态.雷法·倒海 ~=nil and  战斗数据.参战单位[编号].法术状态.雷法·倒海.层数 >0 then
				伤害系数 = 伤害系数 + 0.08*战斗数据.参战单位[编号].法术状态.雷法·倒海.层数
			end
			if 战斗数据:取目标类型(编号) == "召唤兽"and  战斗数据.参战单位[编号].法术状态.雷法·翻天 ~=nil  and 战斗数据.参战单位[编号].法术状态.雷法·翻天.层数 >0 then
				伤害系数 = 伤害系数 + 0.3*战斗数据.参战单位[编号].法术状态.雷法·翻天.层数
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·崩裂~=nil then
			      伤害系数 = 伤害系数 +0.2*战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数
			 end
			 if 战斗数据.参战单位[编号].法术状态.雷法·坤伏~=nil then
			 end
			if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=0
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=0
			end
		    战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=0
		    战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=0
		 elseif   名称 == "侵蚀·五雷正法·刻骨"then
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
			if 战斗数据:取经脉(编号, "方寸山","震怒") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
			end
			if 战斗数据:取经脉(编号, "方寸山","天篆") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.08
				end
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·震煞~=nil then
			      目标数 = 1+战斗数据.参战单位[编号].法术状态.雷法·震煞.层数
			 end
			if 战斗数据:取目标类型(编号) == "玩家"and  战斗数据.参战单位[编号].法术状态.雷法·倒海 ~=nil and  战斗数据.参战单位[编号].法术状态.雷法·倒海.层数 >0 then
				伤害系数 = 伤害系数 + 0.08*战斗数据.参战单位[编号].法术状态.雷法·倒海.层数
			end
			if 战斗数据:取目标类型(编号) == "召唤兽"and  战斗数据.参战单位[编号].法术状态.雷法·翻天 ~=nil  and 战斗数据.参战单位[编号].法术状态.雷法·翻天.层数 >0 then
				伤害系数 = 伤害系数 + 0.3*战斗数据.参战单位[编号].法术状态.雷法·翻天.层数
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·崩裂~=nil then
			      伤害系数 = 伤害系数 +0.2*战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数
			 end
			if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=0
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=0
			end
		    战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=0
		    战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=0
		    if math.random(80)<=20 then--and
		    	战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=1
		    elseif 	 math.random(80)<=40 then
		    	战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=1
		    elseif 	 math.random(80)<=60 then
			    if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
				    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=1
				end
		    elseif 	 math.random(80)<=80 then
			    if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
				    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=1
				end
			end
			elseif   名称 == "侵蚀·五雷正法·钻心"then
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
			if 战斗数据:取经脉(编号, "方寸山","震怒") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
			end
			if 战斗数据:取经脉(编号, "方寸山","天篆") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.08
				end
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·震煞~=nil then
			      目标数 = 1+战斗数据.参战单位[编号].法术状态.雷法·震煞.层数
			 end
			if 战斗数据:取目标类型(编号) == "玩家"and  战斗数据.参战单位[编号].法术状态.雷法·倒海 ~=nil and  战斗数据.参战单位[编号].法术状态.雷法·倒海.层数 >0 then
				伤害系数 = 伤害系数 + 0.08*战斗数据.参战单位[编号].法术状态.雷法·倒海.层数
			end
			if 战斗数据:取目标类型(编号) == "召唤兽"and  战斗数据.参战单位[编号].法术状态.雷法·翻天 ~=nil  and 战斗数据.参战单位[编号].法术状态.雷法·翻天.层数 >0 then
				伤害系数 = 伤害系数 + 0.3*战斗数据.参战单位[编号].法术状态.雷法·翻天.层数
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·崩裂~=nil then
			      伤害系数 = 伤害系数 +0.2*战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数
			 end
			if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=0
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=0
			end
		    战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=0
		    战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=0
		    if math.random(80)<=20 then--and
		    	战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=1
		    elseif 	 math.random(80)<=40 then
		    	战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=1
		    elseif 	 math.random(80)<=60 then
			    if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
				    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=1
				end
		    elseif 	 math.random(80)<=80 then
			    if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
				    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=1
				end
			end
			elseif    名称 == "侵蚀·五雷正法·噬魂"then
			if 战斗数据:取经脉(编号, "方寸山","五雷·挪移") and 时辰信息.天气 == 2 then
				伤害系数=伤害系数*1.03
			end
			if 战斗数据:取经脉(编号, "方寸山","震怒") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
			end
			if 战斗数据:取经脉(编号, "方寸山","天篆") then
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数==0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.16
				end
				if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0 and 战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数==0 and 战斗数据.参战单位[编号].法术状态.雷法·轰天>0 and 战斗数据.参战单位[编号].法术状态.雷法·震煞.层数>0  then
				伤害系数 = 伤害系数 +0.08
				end
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·震煞~=nil then
			      目标数 = 1+战斗数据.参战单位[编号].法术状态.雷法·震煞.层数
			 end
			if 战斗数据:取目标类型(编号) == "玩家"and  战斗数据.参战单位[编号].法术状态.雷法·倒海 ~=nil and  战斗数据.参战单位[编号].法术状态.雷法·倒海.层数 >0 then
				伤害系数 = 伤害系数 + 0.08*战斗数据.参战单位[编号].法术状态.雷法·倒海.层数
			end
			if 战斗数据:取目标类型(编号) == "召唤兽"and  战斗数据.参战单位[编号].法术状态.雷法·翻天 ~=nil  and 战斗数据.参战单位[编号].法术状态.雷法·翻天.层数 >0 then
				伤害系数 = 伤害系数 + 0.3*战斗数据.参战单位[编号].法术状态.雷法·翻天.层数
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·崩裂~=nil then
			      伤害系数 = 伤害系数 +0.2*战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数
			 end
			if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=0
			end
			if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
			    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=0
			end
		    战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=0
		    战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=0
		    if math.random(80)<=20 then--and
		    	战斗数据.参战单位[编号].法术状态.雷法·崩裂.层数=1
		    elseif 	 math.random(80)<=40 then
		    	战斗数据.参战单位[编号].法术状态.雷法·震煞.层数=1
		    elseif 	 math.random(80)<=60 then
			    if 战斗数据.参战单位[编号].法术状态.雷法·倒海~=nil then--"#Y
				    战斗数据.参战单位[编号].法术状态.雷法·倒海.层数=1
				end
		    elseif 	 math.random(80)<=80 then
			    if 战斗数据.参战单位[编号].法术状态.雷法·翻天~=nil then--"#Y
				    战斗数据.参战单位[编号].法术状态.雷法·翻天.层数=1
				end
			end
	elseif (名称=="雷霆万钧" or 名称=="侵蚀·雷霆万钧·钻心"or 名称=="侵蚀·雷霆万钧·噬魂"or 名称=="侵蚀·雷霆万钧·刻骨")and 战斗数据.参战单位[编号].法术状态.怒电 then
		目标数 = 4
		战斗数据:取消状态("怒电", 战斗数据.参战单位[编号])
	elseif 名称=="雷霆汹涌" then
		if 战斗数据.参战单位[编号].法术状态.天雷灌注 then
			战斗数据.参战单位[编号].法术状态.天雷灌注.层数 = 战斗数据.参战单位[编号].法术状态.天雷灌注.层数 - 1
			目标数 = 6
			if 战斗数据.参战单位[编号].法术状态.天雷灌注.层数<=0 then
				战斗数据:取消状态("天雷灌注", 战斗数据.参战单位[编号])
			end
		end
	end


	local 目标=战斗数据:取多个敌方目标(编号,目标,目标数)


	if #目标==0 then return end
	目标数=#目标

	local 消耗1,类型1 = zza.技能消耗(目标数,战斗数据.参战单位[编号])--skill:取技能消耗(名称,目标数)

	if 消耗==nil and 初始技能计算:技能消耗(战斗数据,战斗数据.参战单位[编号],消耗1,类型1,名称)==false then
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=6,战斗提示={内容="行动失败",编号=编号}}
		return
	end

	战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=200,攻击方=编号,挨打方={},提示={允许=true,类型="法术",名称=战斗数据.参战单位[编号].名称.."使用了"..名称}}

	if 战斗数据:取目标类型(编号) == "玩家" then
		伤害系数 = self:法攻循环前附加流程(编号,名称,伤害系数,战斗数据,目标数)
		if not 战斗数据.PK战斗 then
			战斗数据.参战单位[编号].耐久计算.施法=战斗数据.参战单位[编号].耐久计算.施法+1
		end
	elseif 战斗数据:取目标类型(编号) == "召唤兽" then
		if 战斗数据.参战单位[编号].法术状态["龙魂"] then
			伤害系数 = 伤害系数 + 0.45
		end
		战斗技能:顾盼生姿(战斗数据,编号)
		if 战斗数据.参战单位[编号].拘魂索命 and 战斗数据.参战单位[编号].触发拘魂==nil and 战斗数据.参战单位[编号].拘魂索命<4 then
			战斗数据.参战单位[编号].拘魂索命 = 战斗数据.参战单位[编号].拘魂索命 + 1
		end

		if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍]~=nil and 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意~=nil then
			if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.回合~=战斗数据.回合数 then --代表新的回合.做清空处理.必定触发
				战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意={技能={},回合=战斗数据.回合数}
				if 战斗数据.参战单位[编号].出其不意~=nil then

					伤害系数 = 伤害系数 * 1.15
				end
			else
				if 战斗数据.参战单位[编号].出其不意~=nil then
					local go = true
					for k,v in pairs(战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能) do
						if v==名称 then
							go = false
							break
						end
					end
					if go then

						伤害系数 = 伤害系数 * 1.15
					end
				end
			end
			战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能[#战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能+1]=名称
		end
	end

	for n=1,目标数 do
		self:法攻技能计算1(编号,名称,等级,目标[n],目标数,n,伤害系数,战斗数据) --流程附加
	end

	--结尾流程
	战斗数据.参战单位[编号].被反弹=nil --执行完一次循环后清空这个数据
	if 名称=="唧唧歪歪" then
		local 结尾气血 = 5
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
	elseif 名称=="侵蚀·唧唧歪歪·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·唧唧歪歪·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·唧唧歪歪·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
	elseif 名称=="侵蚀·棒掀北斗·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·棒掀北斗·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·棒掀北斗·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·魔化万灵·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·魔化万灵·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·魔化万灵·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·龙卷雨击·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·龙卷雨击·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·龙卷雨击·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
	elseif 名称=="侵蚀·雷霆万钧·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·雷霆万钧·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·雷霆万钧·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·五雷咒·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·五雷咒·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·五雷咒·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
	elseif 名称=="侵蚀·五雷正法·刻骨" then
 		local 结尾气血 =  math.random(715,953)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·五雷正法·钻心" then
 		local 结尾气血 =  math.random(953,1193)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
 	elseif 名称=="侵蚀·五雷正法·噬魂" then
 		local 结尾气血 =  math.random(1193,1430)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
	elseif 名称=="飞砂走石" then
		战斗数据:添加状态("魔冥",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
	elseif 名称=="风云变色" then
		if 战斗数据:取经脉(编号, "魔王寨","燃魂") then
			战斗数据:添加状态("燃魂", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号], 69)
		end
		if 战斗数据:取经脉(编号, "魔王寨", "魔焱") then
			战斗数据:添加状态("炙烤", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号],69,nil,4)
		end
	elseif	战斗数据.参战单位[编号].蔓延 then
		战斗数据:取消状态("蔓延", 战斗数据.参战单位[编号])
	end
	if 战斗数据.参战单位[编号].戏珠~=nil and 战斗数据.参战单位[编号].戏珠触发==nil then
		战斗数据.参战单位[编号].戏珠 = nil
		战斗数据.参战单位[编号].戏珠触发=1
		self:法攻技能计算(编号,"龙卷雨击",等级,伤害系数,消耗,战斗数据)
	end

end
local sawwrf={}
sawwrf["泰山压顶"]={吸收="土",弱点="土"}
sawwrf["奔雷咒"]={吸收="雷",弱点="雷"}
sawwrf["水漫金山"]={吸收="水",弱点="水"}
sawwrf["水漫金山"]={吸收="水",弱点="水"}
sawwrf["地狱烈火"]={吸收="火",弱点="火"}
sawwrf["叱咤风云"]={吸收="水",弱点="水"}
sawwrf["奔雷咒"]={吸收="雷",弱点="雷"}
sawwrf["上古灵符_心火"]={吸收="火",弱点="火"}
sawwrf["上古灵符_怒雷"]={吸收="雷",弱点="雷"}
sawwrf["上古灵符_冰冻"]={吸收="水",弱点="水"}
sawwrf["上古灵符_流沙"]={吸收="土",弱点="土"}
sawwrf["烈火"]={吸收="火",弱点="火"}
sawwrf["超级三昧真火"]={吸收="火",弱点="火"}
sawwrf["雷击"]={吸收="雷",弱点="雷"}
sawwrf["水攻"]={吸收="水",弱点="水"}
sawwrf["落岩"]={吸收="土",弱点="土"}
sawwrf["超级地狱烈火"]={吸收="火",弱点="火"}
sawwrf["超级奔雷咒"]={吸收="雷",弱点="雷"}
sawwrf["超级泰山压顶"]={吸收="土",弱点="土"}
sawwrf["超级水漫金山"]={吸收="水",弱点="水"}

function 战斗法术计算:法攻技能计算1(编号,名称,等级,目标,目标数,执行数,伤害系数,战斗数据)
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数]={特效={},挨打方=目标}
	if 名称=="食指大动" then
		local lsb = {"食指大动_香蕉","食指大动_菠萝","食指大动_西瓜"}
		名称 = lsb[取随机数(1,#lsb)]
	elseif 名称 == "上古灵符" then
		local lsb = {"上古灵符_冰冻", "上古灵符_流沙", "上古灵符_心火", "上古灵符_怒雷"}
		名称 = lsb[取随机数(1,#lsb)]
	elseif 名称 == "天降灵葫" then
		if 目标数 == 1 then
			名称 = "天降灵葫_小"
		elseif 目标数 <= 3 then
			名称 = "天降灵葫_中"
		elseif 目标数 <= 5 then
			名称 = "天降灵葫_大"
		end
	elseif 名称 == "亢龙归海" and 战斗数据.参战单位[编号].法术状态.亢龙归海 then
		名称 = "亢龙归海2"

	end
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,名称)
	local shanghai,法暴倍率=1,2
	local 吸收=nil
	local 弱点=nil
	战斗数据.执行等待=战斗数据.执行等待+10
	local fanbap
	shanghai,fanbap = 战斗技能[名称](战斗技能,战斗数据,编号,目标,目标数,执行数,伤害系数)
	if 战斗数据.参战单位[编号]~=nil and 战斗数据.参战单位[编号].指令~=nil and 战斗数据.参战单位[编号].指令.目标 ~= nil and 战斗数据.参战单位[战斗数据.参战单位[编号].指令.目标] and 战斗数据.参战单位[战斗数据.参战单位[编号].指令.目标].超法抵抗~=nil then
		shanghai = qz(shanghai/2)
	end
	if fanbap then
		法暴倍率=fanbap
	end
	if sawwrf[名称] then
		吸收=sawwrf[名称].吸收
		弱点=sawwrf[名称].弱点
	end

	-- if 名称=="唧唧歪歪" then
	-- 	shanghai = 战斗技能:唧唧歪歪(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="谆谆教诲" then
	-- 	shanghai = 战斗技能:谆谆教诲(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="魔火焚世" then
	-- 	shanghai = 战斗技能:魔火焚世(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="紫火如意" then
	-- 	shanghai = 战斗技能:紫火如意(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="五雷咒" then
	-- 	shanghai = 战斗技能:五雷咒(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="落雷符" then
	-- 	shanghai = 战斗技能:落雷符(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="风雷韵动" then
	-- 	shanghai = 战斗技能:风雷韵动(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="雷霆万钧" then
	-- 	shanghai = 战斗技能:雷霆万钧(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="雷霆汹涌" then
	-- 	shanghai = 战斗技能:雷霆汹涌(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="龙腾" then
	-- 	shanghai = 战斗技能:龙腾(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="荆棘舞" then
	-- 	shanghai,法暴倍率 = 战斗技能:荆棘舞(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="尘土刃" then
	-- 	shanghai,法暴倍率 = 战斗技能:尘土刃(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="冰川怒" then
	-- 	shanghai,法暴倍率 = 战斗技能:冰川怒(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="血雨" then
	-- 	shanghai = 战斗技能:血雨(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="龙卷雨击" then
	-- 	shanghai = 战斗技能:龙卷雨击(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="亢龙归海" or 名称=="亢龙归海2" then
	-- 	shanghai = 战斗技能:亢龙归海(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="落叶萧萧" then
	-- 	shanghai = 战斗技能:落叶萧萧(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="风卷残云" then
	-- 	shanghai = 战斗技能:风卷残云(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="蛊木迷瘴" then
	-- 	shanghai = 战斗技能:蛊木迷瘴(战斗数据,编号,目标,目标数,执行数,伤害系数)
	-- elseif 名称=="古藤秘咒" then
	-- 	shanghai = 战斗技能:古藤秘咒(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="疾风秋叶" then
	-- 	shanghai = 战斗技能:疾风秋叶(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="枯木逢春" then
	-- 	shanghai = 战斗技能:枯木逢春(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="二龙戏珠" then
	-- 	shanghai = 战斗技能:二龙戏珠(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="三昧真火" then
	-- 	shanghai = 战斗技能:三昧真火(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="秘传三昧真火" then
	-- 	shanghai = 战斗技能:秘传三昧真火(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="秘传飞砂走石" then
	-- 	shanghai = 战斗技能:秘传飞砂走石(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="魔焰滔天" then
	-- 	shanghai = 战斗技能:魔焰滔天(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="摇头摆尾" then
	-- 	shanghai = 战斗技能:摇头摆尾(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="飞砂走石" then
	-- 	shanghai = 战斗技能:飞砂走石(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="风云变色" then
	-- 	shanghai = 战斗技能:风云变色(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="月光" then
	-- 	shanghai = 战斗技能:月光(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="泰山压顶" then
	-- 	shanghai = 战斗技能:泰山压顶(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="土"
	-- 	弱点="土"
	-- elseif 名称=="奔雷咒" then
	-- 	shanghai = 战斗技能:奔雷咒(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="雷"
	-- 	弱点="雷"
	-- elseif 名称=="水漫金山" then
	-- 	shanghai = 战斗技能:水漫金山(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="水"
	-- 	弱点="水"
	-- elseif 名称=="地狱烈火" then
	-- 	shanghai = 战斗技能:地狱烈火(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="火"
	-- 	弱点="火"
	-- elseif 名称=="八凶法阵" then
	-- 	shanghai = 战斗技能:八凶法阵(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="流沙轻音" then
	-- 	shanghai = 战斗技能:流沙轻音(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="食指大动_香蕉" then
	-- 	shanghai = 战斗技能:食指大动_香蕉(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="食指大动_菠萝" then
	-- 	shanghai = 战斗技能:食指大动_菠萝(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="食指大动_西瓜" then
	-- 	shanghai = 战斗技能:食指大动_西瓜(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="天降灵葫_大" then
	-- 	shanghai = 战斗技能:天降灵葫_大(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="天降灵葫_中"then
	-- 	shanghai = 战斗技能:天降灵葫_中(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="天降灵葫_小" then
	-- 	shanghai = 战斗技能:天降灵葫_小(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="叱咤风云" then
	-- 	shanghai = 战斗技能:叱咤风云(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="水"
	-- 	弱点="水"
	-- elseif 名称=="上古灵符_心火" then
	-- 	shanghai = 战斗技能:上古灵符_心火(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="火"
	-- 	弱点="火"
	-- elseif 名称=="上古灵符_怒雷" then
	-- 	shanghai = 战斗技能:上古灵符_怒雷(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="雷"
	-- 	弱点="雷"
	-- elseif 名称=="上古灵符_冰冻" then
	-- 	shanghai = 战斗技能:上古灵符_冰冻(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="水"
	-- 	弱点="水"
	-- elseif 名称=="上古灵符_流沙" then
	-- 	shanghai = 战斗技能:上古灵符_流沙(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="土"
	-- 	弱点="土"
	-- elseif 名称=="烈火" then
	-- 	shanghai = 战斗技能:烈火(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="火"
	-- 	弱点="火"
	-- elseif 名称=="雷击" then
	-- 	shanghai = 战斗技能:雷击(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="雷"
	-- 	弱点="雷"
	-- elseif 名称=="水攻" then
	-- 	shanghai = 战斗技能:水攻(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="水"
	-- 	弱点="水"
	-- elseif 名称=="落岩" then
	-- 	shanghai = 战斗技能:落岩(战斗数据,编号,目标,目标数,执行数)
	-- 	吸收="土"
	-- 	弱点="土"
	-- elseif 名称=="扶摇万里" then
	-- 	shanghai = 战斗技能:扶摇万里(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="刀光剑影" then
	-- 	shanghai = 战斗技能:刀光剑影(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="血沸" then
	-- 	shanghai = 战斗技能:血沸(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="寒冰监牢" then
	-- 	shanghai = 战斗技能:寒冰监牢(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="归墟" then
	-- 	shanghai = 战斗技能:归墟(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="电芒" then
	-- 	shanghai = 战斗技能:电芒(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="怒火" then
	-- 	shanghai = 战斗技能:怒火(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="阎罗拘魂" then
	-- 	shanghai = 战斗技能:阎罗拘魂(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="烈火焚原" then
	-- 	shanghai = 战斗技能:烈火焚原(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="冰封千里" then
	-- 	shanghai = 战斗技能:冰封千里(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="兴风作浪" then
	-- 	shanghai = 战斗技能:兴风作浪(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="棍打诸神" then
	-- 	shanghai = 战斗技能:棍打诸神(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="意马心猿" then
	-- 	shanghai,法暴倍率 = 战斗技能:意马心猿(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="灵彻太虚" then
	-- 	shanghai = 战斗技能:灵彻太虚(战斗数据,编号,目标,目标数,执行数)
	-- elseif 名称=="棒掀北斗" then
	-- 	shanghai = 战斗技能:棒掀北斗(战斗数据,编号,目标,目标数,执行数)
	-- end
	if 战斗数据.参战单位[目标].法术状态.天地同寿 or 战斗数据.参战单位[目标].魔法免疫 then
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].免疫=true
		return
	elseif 战斗数据.参战单位[目标].法术状态.分身术~=nil and 战斗数据.参战单位[目标].法术状态.分身术.破解==nil then
		战斗数据.参战单位[目标].法术状态.分身术.破解=1
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].免疫=true
		return
	end

	if 战斗数据.参战单位[编号].门派~="龙宫" and 战斗数据:取被动(编号,"度厄")==false and 装备特技[名称]==nil then
		if 战斗数据.参战单位[目标].门派=="天宫" then
			local gl = 5
			if 战斗数据.参战单位[目标].法术状态.颠倒五行 then
				gl = gl + 5
				if 战斗数据.参战单位[目标].法术状态.颠倒五行.增加躲避 then
					gl = gl + 5
					if gl>=25 then
						gl = 25
					end
				end
			end
			if 战斗数据.参战单位[目标].软烟罗锦 then
				gl = gl + 战斗数据.参战单位[目标].软烟罗锦
			end
			if sj()<=gl then
				战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].躲避=true
				return
			end
		else
			local gl = 1
			if 战斗数据.参战单位[目标].法术状态.颠倒五行 then
				gl = 5
				if 战斗数据.参战单位[目标].法术状态.颠倒五行.增加躲避 then
					gl = 10
				end
			end
			if 战斗数据.参战单位[目标].软烟罗锦 then
				gl = gl + 战斗数据.参战单位[目标].软烟罗锦
			end
			if sj()<=gl then
				战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].躲避=true
				return
			end
		end
	end
	if 伤害系数==nil then 伤害系数=1 end ------------wz添加
	-----------------------------------------
	shanghai = shanghai*伤害系数
	local 伤害,伤害类型 = self:法术结算(战斗数据,shanghai,法暴倍率,编号,目标,名称,弱点,吸收,名称)
	if 战斗数据.参战单位[目标].共生 ~= nil then
		if 执行数==1 then
			战斗技能:法术共生计算(战斗数据,编号,目标,qz(伤害.伤害+1),伤害.特效,执行数,目标数)
		end
		return
	end
	-----------------------------------------
	if 伤害类型==1 then
		-----------------------------------------
		if 战斗数据.参战单位[目标].法术状态.幻镜术 then
			战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].反弹=true
			local 溅射目标=战斗数据:取单个敌方目标(目标)
			if 溅射目标~=编号 and 战斗数据:取经脉(目标, "盘丝洞", "幻镜") and sj()<=30 then
				溅射目标=编号
			end
			战斗计算:添加掉血(战斗数据,溅射目标,伤害.伤害,目标)
			战斗数据.执行等待=战斗数据.执行等待+3
			return
		elseif 战斗数据.参战单位[目标].法术状态.身似菩提 then
			战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].反弹=true
			local 溅射目标=编号
			if 战斗数据.参战单位[编号].被反弹==nil then
				战斗计算:添加掉血(战斗数据,溅射目标,伤害.伤害,目标)
				战斗数据.参战单位[编号].被反弹=true
			end
			战斗数据.执行等待=战斗数据.执行等待+3
			return
		elseif 战斗数据.战斗流程[#战斗数据.战斗流程].反震伤害 ==nil and 伤害.伤害>=4 and 战斗数据.参战单位[目标].法术反震 and 战斗数据.参战单位[编号].法波上 ==nil and 取随机数()<=30 then
			local 反震伤害=math.floor(伤害.伤害*战斗数据.参战单位[目标].法术反震)
			战斗数据.战斗流程[#战斗数据.战斗流程].反震伤害=反震伤害
			战斗数据.战斗流程[#战斗数据.战斗流程].反震死亡=战斗数据:减少气血(编号,反震伤害,目标)
			战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效[#战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效+1]="反震"
			战斗数据.执行等待=战斗数据.执行等待+3
		elseif 伤害.伤害>=4 and 战斗数据.参战单位[目标].法术状态.修罗咒 then
			local 反震伤害=math.floor(伤害.伤害*0.5)
			if 反震伤害>=战斗数据.参战单位[目标].等级*8 then
				反震伤害=战斗数据.参战单位[目标].等级*8
			end
			战斗数据.战斗流程[#战斗数据.战斗流程].反震伤害=反震伤害
			战斗数据.战斗流程[#战斗数据.战斗流程].反震死亡=战斗数据:减少气血(编号,反震伤害,目标)
			战斗数据.执行等待=战斗数据.执行等待+2
		end
	end
	-- 战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].免疫=伤害.免疫
	-- 战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].反弹=伤害.反弹
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].伤害=伤害.伤害
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].类型=伤害类型
	for i=1,#伤害.特效 do
		table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,伤害.特效[i])
	end
	if 伤害类型==2 then --恢复状态
		战斗数据:增加气血(目标,伤害.伤害)

	else
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].死亡=战斗数据:减少气血(目标,伤害.伤害,编号,名称) --这里开始掉血
		战斗技能:凝光炼彩(战斗数据,目标,伤害.伤害)
		战斗计算:法术技能掉血计算(战斗数据,编号,伤害.伤害,目标,名称)
		-- if 名称=="食指大动_西瓜" then
		-- 	local 溅射伤害 = qz(伤害.伤害/10)
		-- 	if 溅射伤害 < 1 then 溅射伤害 = 1 end
		-- 	local 溅射目标=战斗数据:取多个溅射目标(编号,目标,3+1)
		-- 	for i=1,#溅射目标 do
		-- 		if 溅射目标[i] ~= 目标 then
		-- 			战斗计算:添加掉血(战斗数据,溅射目标[i],溅射伤害,编号)
		-- 		end
		-- 	end
		-- end
	end
end

function 战斗法术计算:法术结算(战斗数据,shanghai,法暴倍率,编号,目标,名称,弱点,吸收,技能名称)
	local 法暴成功 = false
	local 法暴几率 = 0
	local 附加法连 = 0
	if 战斗数据.参战单位[编号]~=nil and 战斗数据.参战单位[目标]~=nil and 战斗数据.参战单位[编号].法术暴击等级 and 战斗数据.参战单位[目标].抗法术暴击等级 and 战斗数据.参战单位[目标].等级 then
		法暴几率 = (战斗数据.参战单位[编号].法术暴击等级 - 战斗数据.参战单位[目标].抗法术暴击等级)*10/战斗数据.参战单位[目标].等级
	end
	local 附加几率 = 0
	if 战斗数据.参战单位[编号].法术状态==nil then
	elseif 战斗数据.参战单位[编号].法术状态.超级进击法暴 then
		附加几率 = 附加几率+20
	elseif 战斗数据.参战单位[编号].法术状态.高级进击法暴 then
		附加几率 = 附加几率+20 --战斗数据.参战单位[编号].法术状态.高级进击法暴.加法暴 --底端BUG
	elseif 战斗数据.参战单位[编号].法术状态.进击法暴 then
		附加几率 = 附加几率+10 --战斗数据.参战单位[编号].法术状态.进击法暴.加法暴 --底端BUG
	elseif 战斗数据.参战单位[编号].法术状态.灵彻太虚 then
		附加几率 = 附加几率 - 5
	end
	if 战斗数据.参战单位[编号].斩浪~=nil then
		附加几率 = 附加几率 + 战斗数据.参战单位[编号].斩浪
		战斗数据.参战单位[编号].斩浪 = nil
	elseif 战斗数据.PK战斗 and 战斗数据:取经脉(编号, "呼风") and 战斗数据.参战单位[目标].魔法<战斗数据.参战单位[目标].最大魔法*0.3 then
		附加几率 = 附加几率 + 5
	end

--------------------------18奇技魔王寨1-------------------------------
	if 战斗数据.参战单位[编号].门派 == "魔王寨" then
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"魔王寨A") >=1 and not 战斗数据.PK战斗 then
  				附加几率 = 附加几率 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"魔王寨A")/5
  			end
  	end
--------------------------18奇技魔王寨1-------------------------------
--------------------------18奇技方寸山1-------------------------------
	if 战斗数据.参战单位[编号].门派 == "方寸山" then
		if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"方寸山A") >=1 and not 战斗数据.PK战斗 then
  			shanghai = shanghai * ( 1 + (self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"方寸山A") /100) )
  		end
  	end
--------------------------18奇技方寸山1-------------------------------

	if 战斗数据:取经脉(编号, "魔王寨", "焚尽")  then
		if 战斗数据:取装备五行(编号,3)=="火" then --武器
			附加几率 = 附加几率 + 4
		end
		if 战斗数据:取装备五行(编号,4)=="火" then --衣服
			附加几率 = 附加几率 + 4
		end
	end
	if 战斗数据.参战单位[编号].法身 and 战斗数据.参战单位[编号].法术状态.风灵 then
		附加几率 = 附加几率 + 战斗数据.参战单位[编号].法术状态.风灵.层数 * 2
	end
	if 战斗数据:取经脉(编号, "魔王寨", "焦土") and (名称=="秘传飞砂走石" or 名称=="秘传三昧真火" ) then
		if 战斗数据:取装备五行(编号,3)=="土" then --武器
			法暴几率 = 法暴几率 *1.5
		end
		if 战斗数据:取装备五行(编号,4)=="土" then --衣服
			法暴几率 = 法暴几率 *1.5
		end

	end
	if 名称=="侵蚀·棒掀北斗·刻骨"  then
		法暴几率 = 法暴几率 *1.1
	end
	if 名称=="侵蚀·棒掀北斗·钻心"  then
		法暴几率 = 法暴几率 *1.16
	end
	if 名称=="侵蚀·棒掀北斗·噬魂"  then
		法暴几率 = 法暴几率 *1.2
	end
	if 战斗数据:取经脉(编号, "神木林", "破杀") and (名称=="冰川怒" or 名称=="荆棘舞" or 名称=="尘土刃" ) then
		附加几率 = 附加几率 + 12
	end
	if 战斗数据:取经脉(编号, "方寸山", "雷动") and 名称=="落雷符" and 目标==战斗数据.参战单位[编号].指令.目标 then
		附加几率 = 附加几率 + 15
	end
	if 战斗数据:取经脉(编号, "方寸山", "雷动") and (名称=="五雷正法" or 名称=="侵蚀·五雷正法·钻心" or 名称=="侵蚀·五雷正法·噬魂" or 名称=="侵蚀·五雷正法·刻骨")and 目标==战斗数据.参战单位[编号].指令.目标 then
		附加几率 = 附加几率 + 15
	end
	if 战斗数据:取经脉(编号, "方寸山", "驱雷") and 名称=="五雷咒"  then
		附加几率 = 附加几率 + 3
	end
	if (名称=="五雷正法" or 名称=="侵蚀·五雷正法·钻心" or 名称=="侵蚀·五雷正法·刻骨")and  战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0  then
		附加几率 = 附加几率 + 8*战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数
		战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数=0
	end
	if  名称=="侵蚀·五雷正法·噬魂" then
		if 战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数>0  then
		附加几率 = 附加几率 + 8*战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数
		end
	战斗数据.参战单位[编号].法术状态.雷法·坤伏.层数=1
	end
	if 名称=="食指大动_菠萝" then
		附加几率 = 附加几率 + 30
	end
	法暴几率 = 法暴几率 + 附加几率
	if 战斗数据.参战单位[编号].法暴+法暴几率>=取随机数() then
		法暴成功=true
		if 战斗数据.参战单位[编号].进击法暴==21 then
			法暴倍率 = 法暴倍率 + 0.5
		end
		if 战斗数据:取经脉(目标, "无底洞", "灵身") then
			法暴倍率 = 法暴倍率 - 0.4
		end
		if 战斗数据:取经脉(目标, "凌波城", "神躯") then
			法暴倍率 = 法暴倍率 - 0.2
		end
		if 战斗数据.参战单位[目标].逍遥游~=nil then
			法暴倍率 = 法暴倍率 - 0.5
		end
		if 战斗数据.参战单位[目标].统御属性 and 战斗数据.参战单位[目标].统御属性.铜墙铁壁 then
			法暴倍率 = 法暴倍率 - 战斗数据.参战单位[目标].统御属性.铜墙铁壁
		end
		if 战斗数据.参战单位[目标].shenqi.name=="定风波" then
			法暴倍率 = 法暴倍率 - 0.3*战斗数据.参战单位[目标].shenqi.lv
		end
		if 法暴倍率<1 then
			法暴倍率=1
		end
		shanghai=qz(shanghai*法暴倍率)
		if 战斗数据.参战单位[编号].法术暴击伤害 then
			shanghai = shanghai+qz(shanghai*战斗数据.参战单位[编号].法术暴击伤害)
		end
	end

	local 伤害类型=1
	if 吸收~=nil then --就是这个技能是否能被吸收
		local 触发=nil
		local cjgv=0
		if 吸收=="土" and 战斗数据.参战单位[目标].土吸~=nil then
			触发=1
			if 战斗数据.参战单位[目标].超土吸 then cjgv = 100 end
		elseif 吸收=="水" and 战斗数据.参战单位[目标].水吸~=nil then
			触发=1
			if 战斗数据.参战单位[目标].超水吸 then cjgv = 100 end
		elseif 吸收=="火" and 战斗数据.参战单位[目标].火吸~=nil then
			触发=1
			if 战斗数据.参战单位[目标].超火吸 then cjgv = 100 end
		elseif 吸收=="雷" and 战斗数据.参战单位[目标].雷吸~=nil then
			触发=1
			if 战斗数据.参战单位[目标].超雷吸 then cjgv = 100 end
		end
		if 触发~=nil then
			if 取随机数()<=30 + cjgv then
				shanghai=qz(shanghai*0.3)
				伤害类型=2
			else --吸收失败也可减少法术伤害的30%
				shanghai=qz(shanghai*0.7)
			end
		elseif 战斗数据.参战单位[目标].法术状态.颠倒五行 then
			if 取随机数()<=30 then
				shanghai=qz(shanghai*0.3)
				伤害类型=2
			end
		elseif 战斗数据:取指定法宝(目标,"谷玄星盘") then
			if 取随机数()<= qz(战斗数据:取指定法宝境界(目标, "谷玄星盘")*0.7) then
				shanghai=qz(shanghai*0.3)
				伤害类型=2
			end
		end
	elseif 战斗数据.参战单位[目标].法术状态.分水 ~= nil and  取随机数()<=60 then
		shanghai=取随机数(40,战斗数据.参战单位[目标].法术状态.分水.境界*15)
		伤害类型=2
	end

	-- shanghai = shanghai * (1+((战斗数据.参战单位[编号].法术修炼-战斗数据.参战单位[目标].抗法修炼) * 0.02)) + ((战斗数据.参战单位[编号].法术修炼-战斗数据.参战单位[目标].抗法修炼)*5)
	if 伤害类型==1 then
		if 弱点~=nil then --好像弱点和吸收是冲突的
			if 弱点=="土" and 战斗数据.参战单位[目标].弱点土~=nil and 战斗数据.参战单位[目标].法术状态.弱点土==nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="雷" and 战斗数据.参战单位[目标].弱点雷~=nil and 战斗数据.参战单位[目标].法术状态.弱点土==nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="火" and 战斗数据.参战单位[目标].弱点火~=nil and 战斗数据.参战单位[目标].法术状态.弱点火==nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="水" and 战斗数据.参战单位[目标].弱点水~=nil and 战斗数据.参战单位[目标].法术状态.弱点水==nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="雷" and 战斗数据.参战单位[目标].法术状态.弱点雷~=nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="火" and 战斗数据.参战单位[目标].法术状态.弱点火~=nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="土" and 战斗数据.参战单位[目标].法术状态.弱点土~=nil then
				shanghai=qz(shanghai*1.5)
			elseif 弱点=="水" and 战斗数据.参战单位[目标].法术状态.弱点水~=nil then
				shanghai=qz(shanghai*1.5)
			end
		end
		if 战斗数据.参战单位[编号].法波上~=nil then
			shanghai=qz(shanghai * 取随机数(战斗数据.参战单位[编号].法波下,战斗数据.参战单位[编号].法波上)/100)
		-- else
			-- shanghai=qz(shanghai*取随机数(95,105))
		end
		if 战斗数据.参战单位[编号].狙刺~= nil and 执行数 == 1 then
			shanghai = shanghai + 战斗数据.参战单位[编号].狙刺
		end
	end
	-- local min  = 战斗数据.参战单位[编号].法伤*0.1
	if shanghai < 1 then
		shanghai = 1
	end
	shanghai = qz(shanghai)
	-- 伤害=战斗数据:取伤害结果(编号,目标,伤害,法暴成功,nil,3)
	if 伤害类型==1 then
		shanghai=战斗数据:取伤害结果(编号,目标,shanghai,法暴成功,nil,3,技能名称)
		伤害类型=shanghai.类型
	else
		伤害类型=2
		shanghai={伤害=shanghai,类型=伤害类型,特效={}}
	end

	return shanghai,伤害类型
end

function 战斗法术计算:取门派秘籍(id,技能)
	if id == 0 or id == nil or id == "" then return 0 end
  local lv=0
  if id~=nil and 技能~=nil and 玩家数据[id].角色.门派秘籍~=nil and 玩家数据[id].角色.门派秘籍[技能]~=nil then
     lv=玩家数据[id].角色.门派秘籍[技能]
  end
  return lv
end

return 战斗法术计算