-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-04-12 19:20:42
-- @Author: baidwwy
-- @Date:   2024-05-23 06:02:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-04 10:03:48

local 战斗固伤计算 = class()
local jhf = string.format
local random = math.random
local qz=math.floor
local sj = 取随机数
function 战斗固伤计算:初始化() end


function 战斗固伤计算:固伤技能计算(编号,名称,等级,伤害系数,消耗,战斗数据)
	local 目标=战斗数据.参战单位[编号].指令.目标
	local zza = skill.数据[名称]
	local 目标数 = zza.技能人数(等级,战斗数据.参战单位[编号],战斗数据.PK战斗)
	local 目标=战斗数据:取多个敌方目标(编号,目标,目标数)
	if #目标==0 then return end
	目标数=#目标
	local 消耗1,类型1 = zza.技能消耗(目标数,战斗数据.参战单位[编号])

	if 消耗==nil and 初始技能计算:技能消耗(战斗数据,战斗数据.参战单位[编号],消耗1,类型1,名称)==false then
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=6,战斗提示={内容="行动失败",编号=编号}}
		return
	end

	战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=200,攻击方=编号,挨打方={},提示={允许=true,类型="法术",名称=战斗数据.参战单位[编号].名称.."使用了"..名称}}

	--循环前计算
	if 战斗数据:取目标类型(编号) == "玩家" then
		if 名称=="飞花摘叶" then
			local lsmb = 战斗数据:取多个友方目标(编号, 编号, 5, "角色队友")
			local mf = qz(等级/2)
			if 战斗数据:取经脉(编号, "女儿村","飞花") then
				mf = mf * 2
			end
			for i = 1, #lsmb do
				战斗数据:增加魔法(lsmb[i],mf)
			end
		elseif 名称=="云暗天昏" then
			if 战斗数据:取经脉(编号, "花果山", "愈勇") then
				战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			end
		elseif 名称=="侵蚀·五雷轰顶·噬魂" then
	 		local 结尾气血 =  math.random(1193,1430)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·五雷轰顶·钻心" then
	 		local 结尾气血 =  math.random(953,1193)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·五雷轰顶·刻骨" then
	 		local 结尾气血 =  math.random(715,953)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·苍茫树·噬魂" then
	 		local 结尾气血 =  math.random(1193,1430)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·苍茫树·钻心" then
	 		local 结尾气血 =  math.random(953,1193)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·苍茫树·刻骨" then
	 		local 结尾气血 =  math.random(715,953)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·靛沧海·噬魂" then
	 		local 结尾气血 =  math.random(1193,1430)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·靛沧海·钻心" then
	 		local 结尾气血 =  math.random(953,1193)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·靛沧海·刻骨" then
	 		local 结尾气血 =  math.random(715,953)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·地裂火·噬魂" then
	 		local 结尾气血 =  math.random(1193,1430)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·地裂火·钻心" then
	 		local 结尾气血 =  math.random(953,1193)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·地裂火·刻骨" then
	 		local 结尾气血 =  math.random(715,953)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·巨岩破·噬魂" then
	 		local 结尾气血 =  math.random(1193,1430)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·巨岩破·钻心" then
	 		local 结尾气血 =  math.random(953,1193)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·巨岩破·刻骨" then
	 		local 结尾气血 =  math.random(715,953)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·日光华·噬魂" then
	 		local 结尾气血 =  math.random(1193,1430)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·日光华·钻心" then
	 		local 结尾气血 =  math.random(953,1193)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		elseif 名称=="侵蚀·日光华·刻骨" then
	 		local 结尾气血 =  math.random(715,953)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		end
		if 战斗数据.参战单位[编号].门派 == "无底洞" then
			if 战斗数据:取被动(编号,"裂魂")  and  名称 == "追魂刺" and not 战斗数据:取经脉(编号, "无底洞", "分魄") and math.random(100) <=15 then
				战斗数据:添加状态("裂魂", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号], 1)
				if  战斗数据:取经脉(编号, "无底洞", "纠缠") then--"#Y
					战斗数据:增加愤怒(编号,4)
				end
			end
			if 战斗数据:取被动(编号,"裂魂")  and  名称 == "追魂刺" and 战斗数据:取经脉(编号, "无底洞", "分魄")  and 战斗数据.参战单位[编号].法术状态.燃血术 and math.random(100) <=27 then
				战斗数据:添加状态("裂魂", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号], 1)
				if  战斗数据:取经脉(编号, "无底洞", "纠缠") then--"#Y
					战斗数据:增加愤怒(编号,4)
				end
			end
			if 战斗数据:取被动(编号,"裂魂")  and 战斗数据:取经脉(编号, "无底洞", "余咒")  and 名称 == "夺命咒" and math.random(100) <=4 then
				战斗数据:添加状态("裂魂", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号], 1)
				if  战斗数据:取经脉(编号, "无底洞", "纠缠") then--"#Y
					战斗数据:增加愤怒(编号,4)
				end
			end
		end
		if not 战斗数据.PK战斗 then
			战斗数据.参战单位[编号].耐久计算.施法=战斗数据.参战单位[编号].耐久计算.施法+1
		end
	end
	--循环前计算
	for n=1,目标数 do
		self:固伤技能计算1(编号,名称,等级,目标[n],目标数,n,伤害系数,战斗数据) --流程附加
	end
	--结尾流程
	战斗数据.参战单位[编号].被反弹=nil
	if 名称=="自爆" then
		战斗数据.战斗流程[#战斗数据.战斗流程].流程=500
		战斗数据.战斗流程[#战斗数据.战斗流程].伤害=战斗数据.参战单位[编号].气血
		战斗数据.参战单位[编号].气血=0
	end
end

function 战斗固伤计算:固伤技能计算1(编号,名称,等级,目标,目标数,执行数,伤害系数,战斗数据)
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数]={特效={},挨打方=目标}
	table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,名称)
	if 装备特技[名称]~=nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].特技名称=名称
	end
	local 伤害=1
	local 吸收=nil
	local 弱点=nil
	战斗数据.执行等待=战斗数据.执行等待+10
	-- local 类型 = 1
	local 特效 = {}
	local 法暴 = nil

	if 名称=="雨落寒沙" then
		伤害 = 战斗技能:雨落寒沙(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="子母神针" then
		伤害 = 战斗技能:子母神针(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="飞花摘叶" then
		伤害 = 战斗技能:飞花摘叶(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="鸿渐于陆" then
		伤害 = 战斗技能:鸿渐于陆(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="日光华" then
		伤害,法暴 = 战斗技能:日光华(战斗数据,编号,目标,目标数,执行数)
		吸收="金"
		弱点="金"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·日光华·噬魂" then
		伤害,法暴 = 战斗技能:日光华(战斗数据,编号,目标,目标数,执行数)
		吸收="金"
		弱点="金"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·日光华·钻心" then
		伤害,法暴 = 战斗技能:日光华(战斗数据,编号,目标,目标数,执行数)
		吸收="金"
		弱点="金"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·日光华·刻骨" then
		伤害,法暴 = 战斗技能:日光华(战斗数据,编号,目标,目标数,执行数)
		吸收="金"
		弱点="金"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="靛沧海" then
		伤害,法暴 = 战斗技能:靛沧海(战斗数据,编号,目标,目标数,执行数)
		吸收="水"
		弱点="水"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·靛沧海·噬魂" then
		伤害,法暴 = 战斗技能:靛沧海(战斗数据,编号,目标,目标数,执行数)
		吸收="水"
		弱点="水"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·靛沧海·钻心" then
		伤害,法暴 = 战斗技能:靛沧海(战斗数据,编号,目标,目标数,执行数)
		吸收="水"
		弱点="水"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·靛沧海·刻骨" then
		伤害,法暴 = 战斗技能:靛沧海(战斗数据,编号,目标,目标数,执行数)
		吸收="水"
		弱点="水"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="地裂火" then
		伤害,法暴 = 战斗技能:地裂火(战斗数据,编号,目标,目标数,执行数)
		吸收="火"
		弱点="火"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
		elseif 名称=="侵蚀·地裂火·噬魂" then
		伤害,法暴 = 战斗技能:地裂火(战斗数据,编号,目标,目标数,执行数)
		吸收="火"
		弱点="火"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
		elseif 名称=="侵蚀·地裂火·钻心" then
		伤害,法暴 = 战斗技能:地裂火(战斗数据,编号,目标,目标数,执行数)
		吸收="火"
		弱点="火"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
		elseif 名称=="侵蚀·地裂火·刻骨" then
		伤害,法暴 = 战斗技能:地裂火(战斗数据,编号,目标,目标数,执行数)
		吸收="火"
		弱点="火"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="苍茫树" then
		伤害,法暴 = 战斗技能:苍茫树(战斗数据,编号,目标,目标数,执行数)
		吸收="木"
		弱点="木"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·苍茫树·噬魂" then
		伤害,法暴 = 战斗技能:苍茫树(战斗数据,编号,目标,目标数,执行数)
		吸收="木"
		弱点="木"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·苍茫树·钻心" then
		伤害,法暴 = 战斗技能:苍茫树(战斗数据,编号,目标,目标数,执行数)
		吸收="木"
		弱点="木"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="侵蚀·苍茫树·刻骨" then
		伤害,法暴 = 战斗技能:苍茫树(战斗数据,编号,目标,目标数,执行数)
		吸收="木"
		弱点="木"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="巨岩破" then
		伤害,法暴 = 战斗技能:巨岩破(战斗数据,编号,目标,目标数,执行数)
		吸收="土"
		弱点="土"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
		elseif 名称=="侵蚀·巨岩破·噬魂" then
		伤害,法暴 = 战斗技能:巨岩破(战斗数据,编号,目标,目标数,执行数)
		吸收="土"
		弱点="土"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
		elseif 名称=="侵蚀·巨岩破·钻心" then
		伤害,法暴 = 战斗技能:巨岩破(战斗数据,编号,目标,目标数,执行数)
		吸收="土"
		弱点="土"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
		elseif 名称=="侵蚀·巨岩破·刻骨" then
		伤害,法暴 = 战斗技能:巨岩破(战斗数据,编号,目标,目标数,执行数)
		吸收="土"
		弱点="土"
		if 法暴 then --暴击
			伤害=伤害*1.5
			-- 类型 = 3.5
			特效[#特效+1]  = "法术暴击"
		end
	elseif 名称=="自爆" then
		伤害 = 战斗技能:自爆(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="龙吟" then
		伤害 = 战斗技能:龙吟(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="五雷轰顶" then
		伤害 = 战斗技能:五雷轰顶(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="侵蚀·五雷轰顶·刻骨" then
		伤害 = 战斗技能:侵蚀·五雷轰顶·刻骨(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="侵蚀·五雷轰顶·钻心" then
		伤害 = 战斗技能:侵蚀·五雷轰顶·钻心(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="侵蚀·五雷轰顶·噬魂" then
		伤害 = 战斗技能:侵蚀·五雷轰顶·噬魂(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="天罗地网" then
		伤害 = 战斗技能:天罗地网(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="勾魂" then
		local 等级 = 战斗数据:取技能等级(编号,"勾魂")
		local  躲避=false
		local  伤害1 = qz(等级 * 3 + 战斗数据.参战单位[目标].气血 * 0.05)
		if not 战斗数据.参战单位[编号].必中 and 战斗数据.参战单位[编号].命中<战斗数据.参战单位[目标].躲避 then
			local 躲避率 = 战斗数据.参战单位[目标].躲避 /3
			if 躲避率 > 95 then
				躲避率 = 95
			end
			if 取随机数() < 战斗数据.参战单位[目标].躲避 /3 then
				躲避=true
			end
		end
		if 战斗数据:取经脉(编号, "盘丝洞", "媚态") then
			躲避 = false
		elseif 战斗数据:取经脉(编号, "盘丝洞", "绝媚") then
			躲避 = false
			伤害1 = qz(伤害1 * 1.9)
		end
		if 伤害1>战斗数据.参战单位[编号].等级*22 then
			伤害1=战斗数据.参战单位[编号].等级*22
		end

		if 躲避 then
			战斗数据.战斗流程[#战斗数据.战斗流程].流程=907 --要改
			return
		else
			战斗数据:动画加血流程(编号,qz(伤害1 * 0.5))
		end
		伤害=伤害1

	elseif 名称=="尸腐毒" then
		local 气血 = qz(战斗数据.参战单位[目标].气血 * 0.1)

		if 战斗数据.PK战斗 then
			if 气血>等级*8 then
				气血=等级*8
			end
		else
			if 气血>等级*13 then
				气血=等级*13
			end


------------------------18奇技阴曹地府2-------------------------------第一段掉血量
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"阴曹地府A") >=1 and not 战斗数据.PK战斗 then
				气血 = 气血 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"阴曹地府A")*6
  			end
------------------------18奇技阴曹地府2-------------------------------




		end
		if 战斗数据.参战单位[目标].法术状态.百毒不侵 or 战斗数据.参战单位[目标].法术状态[名称] or 战斗数据.参战单位[目标].鬼魂 ~= nil or 战斗数据.参战单位[目标].精神 ~= nil or 战斗数据.参战单位[目标].信仰 ~= nil then
			战斗数据.战斗流程[#战斗数据.战斗流程].流程=907
			return
		end
		if 战斗数据:取指定法宝(编号, "九幽") then
			local lsmb = 战斗数据:取多个友方目标(编号, 编号, 5, "尸腐毒")
			local qx = qz((气血-等级+35) * 0.3)
			qx = 战斗数据:治疗量计算(编号, 目标, qx, "尸腐毒")
			if 战斗数据:取经脉(编号, "阴曹地府", "幽光") then
				qx = qx + 150
			end
			for i = 1, #lsmb do
				战斗数据:动画加血流程(lsmb[i],qx, "尸腐毒")
			end
			战斗数据.参战单位[目标].九幽=战斗数据:取指定法宝境界(编号, "九幽")
		end
		战斗数据:添加状态(名称, 战斗数据.参战单位[目标], 战斗数据.参战单位[编号],等级)
		伤害=气血

	elseif 名称=="摄魄" then --要抖动
		战斗数据.战斗流程[#战斗数据.战斗流程].流程=907
		local 等级 = 战斗数据:取技能等级(编号,"摄魄")
		local mf = qz(等级 * 3 + 战斗数据.参战单位[目标].魔法 * 0.05)
		local 躲避=false
		if not 战斗数据.参战单位[编号].必中 and 战斗数据.参战单位[编号].命中<战斗数据.参战单位[目标].躲避  then
			local 躲避率 = 战斗数据.参战单位[目标].躲避 /3
			if 躲避率 > 95 then
				躲避率 = 95
			end
			if 取随机数() < 战斗数据.参战单位[目标].躲避 /3 then
				躲避=true
			end
		end

		if 战斗数据:取经脉(编号, "盘丝洞", "媚态") then
			躲避 = false
		elseif 战斗数据:取经脉(编号, "盘丝洞", "绝媚") then
			躲避 = false
			mf = qz(mf * 1.9)
		end
		if 躲避==false then
			战斗数据:减少魔法(目标 , mf)
			战斗数据:增加魔法(编号 , mf)
			战斗数据.战斗流程[#战斗数据.战斗流程].成功=true
		end
		return
	elseif 名称 == "姐妹同心" then --等级差
		战斗数据.战斗流程[#战斗数据.战斗流程].流程=907
		local gl = 战斗数据:取技能等级(编号,"姐妹同心")-战斗数据.参战单位[目标].等级 + 60
		local mf = qz(等级 * 3 + 战斗数据.参战单位[目标].魔法 * 0.05)
		if 战斗数据:取经脉(编号, "盘丝洞", "怜心") then
			gl = gl + 12
			mf = qz(mf * 1.1)
			if 战斗数据.参战单位[编号].怜心==nil and 战斗数据:取门派是否唯一(编号,"盘丝洞") then
				gl = 100
				战斗数据.参战单位[编号].怜心=1
			end
		end
		if 战斗数据:取经脉(编号, "盘丝洞", "魔瘴") then
			mf = qz(mf *1.12)
		end
		if 取随机数() < gl then
			战斗数据:减少魔法(目标,mf)
			战斗数据.战斗流程[#战斗数据.战斗流程].成功=true
			if 战斗数据.参战单位[目标].魔法<=0 and 取随机数() <=50 and 战斗数据:取经脉(编号, "盘丝洞", "倾情") then
				战斗数据:单体封印技能计算(编号, "含情脉脉", 战斗数据:取技能等级(编号,"含情脉脉"))
			end
		end
		return
	elseif 名称=="瘴气" then
		战斗数据.战斗流程[#战斗数据.战斗流程].流程=909 --拼接
		战斗数据:添加状态(名称, 战斗数据.参战单位[目标], 战斗数据.参战单位[编号], 战斗数据:取技能等级(编号,"瘴气"))
		if 战斗数据:取经脉(编号, "盘丝洞", "媚态") and 战斗数据.参战单位[目标].法术状态.寡欲令 then
			战斗数据:取消状态("寡欲令",战斗数据.参战单位[目标])
		end
		return
  --   elseif 名称=="同伤式" then
		-- 伤害 = 战斗技能:同伤式(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="阎罗令" then
		伤害 = 战斗技能:阎罗令(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="判官令" then
		伤害 = 战斗技能:判官令(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="黄泉之息" then
		伤害 = 战斗技能:黄泉之息(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="夺命咒" then
		伤害 = 战斗技能:夺命咒(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="追魂刺" then
		伤害 = 战斗技能:追魂刺(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="云暗天昏" then
		伤害 = 战斗技能:云暗天昏(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="诅咒之伤" then
		伤害 = 战斗技能:诅咒之伤(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="吸血特技" then
		伤害 = 战斗技能:吸血(战斗数据,编号,目标,目标数,执行数)
	elseif 名称=="夜舞倾城" then
		伤害 = 战斗技能:夜舞倾城(战斗数据,编号,目标)
	end



	if 战斗数据.参战单位[目标].法术状态.天地同寿 or 战斗数据.参战单位[目标].魔法免疫 then
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].免疫=true
		return
	elseif 战斗数据.参战单位[目标].法术状态.分身术~=nil and 战斗数据.参战单位[目标].法术状态.分身术.破解==nil then
		战斗数据.参战单位[目标].法术状态.分身术.破解=1
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].免疫=true
		return
	end


	if 战斗数据.参战单位[编号].门派~="龙宫" and 装备特技[名称]==nil then
		if 战斗数据.参战单位[目标].门派=="天宫" then
			local gl = 5
			if 战斗数据.参战单位[目标].法术状态.颠倒五行 then
				gl = gl + 5
				if 战斗数据.参战单位[目标].法术状态.颠倒五行.增加躲避 then
					gl = gl + 5
					if gl>=25 then
						gl = 25
					end
				end
			end
			if 战斗数据.参战单位[目标].软烟罗锦 then
				gl = gl + 战斗数据.参战单位[目标].软烟罗锦
			end
			if sj()<=gl then
				战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].躲避=true
				return
			end
		else
			local gl = 1
			if 战斗数据.参战单位[目标].法术状态.颠倒五行 then
				gl = 5
				if 战斗数据.参战单位[目标].法术状态.颠倒五行.增加躲避 then
					gl = 10
				end
			end
			if 战斗数据.参战单位[目标].软烟罗锦 then
				gl = gl + 战斗数据.参战单位[目标].软烟罗锦
			end
			if sj()<=gl then
				战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].躲避=true
				return
			end
		end
	end




	--下面要判断神佑啥的
	-- 伤害=伤害*全局固伤系数

	if 战斗数据.参战单位[目标].法术状态.普渡众生 and 战斗数据.参战单位[目标].法术状态.普渡众生.慈佑 then
		伤害 = 伤害 * (1-0.12)
	end
	if 战斗数据:取经脉(目标, "普陀山", "低眉") and 战斗数据.参战单位[目标].法术状态.剑意莲心 then
		伤害 = 伤害 * (1-0.05)
	end
	if 战斗数据:取经脉(目标, "盘丝洞", "玲珑") and 战斗数据:取指定法宝(目标, "忘情") and sj()<=30 then
		伤害 = 伤害 * (1-0.12)
		战斗数据:增加愤怒(目标,10)
	end
	if 战斗数据:取经脉(目标, "女儿村", "叶护") and 战斗数据:取队伍一速(目标) then
		伤害 = 伤害*(1-0.02)
	end
	if 战斗数据:取经脉(目标, "神木林", "灵佑") then
		伤害 = 伤害 * 0.98
	end
	if 战斗数据.参战单位[目标].法术状态.落花成泥 and 战斗数据.参战单位[目标].法术状态.落花成泥.回合==1 then
		伤害 = 伤害 * (1+0.24)
	end
	if 战斗数据.参战单位[目标].风起云墨 then
		伤害 = qz(伤害 * (1-战斗数据.参战单位[目标].shenqi.lv*0.04))
	end
	if 战斗数据:取经脉(目标, "五庄观", "守中") then
		伤害 = 伤害*0.94
	end
	if 战斗数据.参战单位[目标].法术状态.五彩娃娃 ~= nil then
		伤害 =伤害 * (1 - 战斗数据.参战单位[目标].法术状态.五彩娃娃.境界 * 0.02)
	elseif 战斗数据.参战单位[目标].法术状态.苍白纸人 ~= nil then
		伤害 =伤害 * (1 - 战斗数据.参战单位[目标].法术状态.苍白纸人.境界 * 0.02)
	end

	if 战斗数据.参战单位[目标].受伤百分比 then
		伤害 = qz(伤害 * 战斗数据.参战单位[目标].受伤百分比)
	elseif 战斗数据.参战单位[编号].增伤百分比 then
		伤害 = qz(伤害 * 战斗数据.参战单位[编号].增伤百分比)
	end

	if 战斗数据:取目标类型(目标) == "召唤兽" then
		-- 特性影响 受到的所有伤害增加
		if 战斗数据.参战单位[目标].巧劲 then
			伤害 = 伤害+伤害*战斗数据.参战单位[目标].巧劲[2]
		elseif 战斗数据.参战单位[目标].识药 then
			伤害 = 伤害+伤害*战斗数据.参战单位[目标].识药[2]
		elseif 战斗数据.参战单位[目标].御风 then
			伤害 = 伤害+伤害*战斗数据.参战单位[目标].御风[2]
		end
		-- 特性影响 受到的所有伤害增加
		if 战斗数据.参战单位[目标].统御属性 and 战斗数据.参战单位[目标].统御属性.偃旗息鼓 then
			伤害 = qz(伤害*(1-战斗数据.参战单位[目标].统御属性.偃旗息鼓))
		end
	end
	if 战斗数据.参战单位[编号]~=nil and 战斗数据.参战单位[编号].玄灵珠~=nil and 战斗数据.参战单位[编号].玄灵珠["噬魂"]~=nil then
		伤害 = qz(伤害 * (1+战斗数据.参战单位[编号].玄灵珠["噬魂"]*0.01))  --玄灵珠噬魂
	end
	-- if 战斗数据.参战单位[目标].法术状态.璞玉灵钵 ~= nil then
	-- 	伤害 = qz(伤害 * (1 - 战斗数据.参战单位[目标].法术状态.璞玉灵钵.境界 * 0.01 + 0.02)) --20
	-- elseif 战斗数据.参战单位[编号].法术状态.璞玉灵钵 ~= nil then
	-- 	伤害 = qz(伤害 * (1 - 战斗数据.参战单位[编号].法术状态.璞玉灵钵.境界 * 0.01 + 0.02)) --20
	-- end
	if 战斗数据.参战单位[目标].法术状态.煞气诀 then
		伤害 = qz(伤害 * 0.5)
	end

	if 伤害 < 1 then 伤害 = 1 end
	if 战斗数据.参战单位[目标].共生 ~= nil then
		if 执行数==1 then
			战斗技能:法术共生计算(战斗数据,编号,目标,qz(伤害),特效,执行数,目标数)
		end
		return
	end

	if 战斗数据.参战单位[目标].法术状态.幻镜术 then
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].反弹=true
		local 溅射目标=战斗数据:取单个敌方目标(目标)
		if 溅射目标~=编号 and 战斗数据:取经脉(目标, "盘丝洞", "幻镜") and sj()<=30 then
			溅射目标=编号
		end
		战斗计算:添加掉血(战斗数据,溅射目标,qz(伤害),目标)
		战斗数据.执行等待=战斗数据.执行等待+3
		return
	elseif 战斗数据.参战单位[目标].法术状态.身似菩提 then
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].反弹=true
		local 溅射目标=编号
		if 战斗数据.参战单位[编号].被反弹==nil then
			战斗计算:添加掉血(战斗数据,溅射目标,伤害,目标)
			战斗数据.参战单位[编号].被反弹=true
		end
		战斗数据.执行等待=战斗数据.执行等待+3
		return
	elseif 伤害>=4 and 战斗数据.参战单位[目标].法术状态.修罗咒 then
		local 反震伤害=math.floor(伤害*0.5)
		if 反震伤害>=战斗数据.参战单位[目标].等级*8 then
			反震伤害=战斗数据.参战单位[目标].等级*8
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].反震伤害=反震伤害
		战斗数据.战斗流程[#战斗数据.战斗流程].反震死亡=战斗数据:减少气血(编号,反震伤害,目标)
		战斗数据.执行等待=战斗数据.执行等待+2
	end


	if 战斗数据.参战单位[目标].法术状态.波澜不惊 then
			if 战斗数据.参战单位[目标].法术状态.波澜不惊.次数==nil then
				战斗数据.参战单位[目标].法术状态.波澜不惊.次数=0
			end
		if 战斗数据.参战单位[目标].法术状态.波澜不惊.次数<4 then
			战斗数据.参战单位[目标].法术状态.波澜不惊.次数=战斗数据.参战单位[目标].法术状态.波澜不惊.次数+1
			if 伤害>(战斗数据.参战单位[目标].法术状态.波澜不惊.等级*2+150)*2 then
				伤害=(战斗数据.参战单位[目标].法术状态.波澜不惊.等级*2+150)*2
			end
			if 伤害<1 then
				伤害 = 1
			end
			伤害 = qz(伤害)
			战斗数据:增加气血(目标,伤害)
			战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].伤害=伤害
			战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].类型=2
			for i=1,#特效 do
				table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,特效[i])
			end
			return
		end

	elseif 战斗数据.参战单位[编号].法术状态.灵断==nil and 伤害 >= 战斗数据.参战单位[目标].气血 and 战斗数据.参战单位[目标].神佑 and 战斗数据.参战单位[目标].神佑 >= 取随机数() then
		伤害 = 战斗数据.参战单位[目标].最大气血
		if 战斗数据.参战单位[目标].神佑<30 then
			伤害 = 战斗数据.参战单位[目标].最大气血*0.6
		end
		if 伤害<1 then
			伤害 = 1
		end
		伤害 = qz(伤害)
		if 战斗数据:取目标类型(目标) == "召唤兽" then
			战斗数据.参战单位[目标].神佑复活 = true
		end
		战斗数据:增加气血(目标,伤害)
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].伤害=伤害
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].类型=2
		for i=1,#特效 do
			table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,特效[i])
		end
		return
	elseif 伤害 >= 战斗数据.参战单位[目标].气血 and 战斗数据.参战单位[目标].法术状态.渡劫金身 then
		伤害 = 战斗数据.参战单位[目标].法术状态.渡劫金身.恢复气血
		if 伤害<1 then
			伤害 = 1
		end
		if 战斗数据:取目标类型(目标) == "召唤兽" then
			战斗数据.参战单位[目标].神佑复活 = true
		end
		伤害 = qz(伤害)
		战斗数据:增加气血(目标,伤害)
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].伤害=伤害
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].类型=2
		for i=1,#特效 do
			table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,特效[i])
		end
		战斗数据:取消状态("渡劫金身", 战斗数据.参战单位[目标])
		return
	end





	local 伤害类型 = 1

	if 吸收~=nil then --就是这个技能是否能被吸收
		local 触发=nil
		if 吸收=="土" and 战斗数据.参战单位[目标].土吸~=nil then
			触发=1
		elseif 吸收=="水" and 战斗数据.参战单位[目标].水吸~=nil then
			触发=1
		elseif 吸收=="火" and 战斗数据.参战单位[目标].火吸~=nil then
			触发=1
		elseif 吸收=="雷" and 战斗数据.参战单位[目标].雷吸~=nil then
			触发=1
		end
		if 触发~=nil then
			if 取随机数()<=30 then
				伤害=qz(伤害*0.3)
				伤害类型=2
			else --吸收失败也可减少法术伤害的30%
				伤害=qz(伤害*0.7)
			end
		elseif 战斗数据.参战单位[目标].法术状态.颠倒五行 then
			if 取随机数()<=30 then
				伤害=qz(伤害*0.3)
				伤害类型=2
			end
		elseif 战斗数据:取指定法宝(目标,"谷玄星盘") then
			if 取随机数()<= qz(战斗数据:取指定法宝境界(目标, "谷玄星盘")*0.7) then
				伤害=qz(伤害*0.3)
				伤害类型=2
			end
		end
	elseif 战斗数据.参战单位[目标].法术状态.分水 ~= nil and  取随机数()<=60 then
		伤害=取随机数(40,战斗数据.参战单位[目标].法术状态.分水.境界*15)
		伤害类型=2
	end

	if 伤害类型==1 then
		if 弱点~=nil then --好像弱点和吸收是冲突的
			if 弱点=="土" and 战斗数据.参战单位[目标].弱点土~=nil then
				伤害=qz(伤害*1.5)
			elseif 弱点=="雷" and 战斗数据.参战单位[目标].弱点雷~=nil then
				伤害=qz(伤害*1.5)
			elseif 弱点=="火" and 战斗数据.参战单位[目标].弱点火~=nil then
				伤害=qz(伤害*1.5)
			elseif 弱点=="水" and 战斗数据.参战单位[目标].弱点水~=nil then
				伤害=qz(伤害*1.5)
			end
		end
		if 战斗数据.参战单位[目标].鬼魂 then
			if 战斗数据.参战单位[编号].驱鬼 then
				伤害 = 伤害 * 战斗数据.参战单位[编号].驱鬼
			elseif 战斗数据.参战单位[编号].降妖伏魔 then
				伤害 = 伤害 * 战斗数据.参战单位[编号].降妖伏魔
			end
		end
		if 战斗数据.参战单位[目标].法术状态.护佑 then
			伤害 = 伤害 - 战斗数据.参战单位[目标].法术状态.护佑.等级
		end
		if 战斗数据.参战单位[目标].门派 == "五庄观" then
			if 战斗数据:取指定法宝(目标, "奇门五行令") then
				local 境界 = 战斗数据:取指定法宝境界(目标, "奇门五行令")
				local 伤害比 = 战斗数据.参战单位[目标].气血 / 战斗数据.参战单位[目标].最大气血
				if 伤害比<=0.75 then
					if 伤害比<=0.35 then
						伤害比=0.35
					end
					伤害比 = 伤害比 + (0.3 - 0.02 * 境界)
					伤害 = qz(伤害 * 伤害比)
				end
			end
		elseif 战斗数据.参战单位[目标].门派 == "阴曹地府" then
			if 战斗数据:取经脉(目标, "阴曹地府", "回旋") then
				伤害 = 伤害 - 65
			end
		elseif 战斗数据.参战单位[目标].门派 == "凌波城" then
			if 战斗数据:取经脉(目标,"凌波城", "巧变")  and 战斗数据.参战单位[目标].战意>=4 then
				伤害 = 伤害 - 150
			end
		end
		if 战斗数据.参战单位[目标].法术状态.同舟共济 and 战斗数据.参战单位[目标].法术状态.同舟共济.次数>0 and 战斗数据.参战单位[战斗数据.参战单位[目标].法术状态.同舟共济.攻击编号].气血>0  then
			伤害=qz(伤害*0.25)
			战斗数据.参战单位[目标].法术状态.同舟共济.次数=战斗数据.参战单位[目标].法术状态.同舟共济.次数-1
			战斗计算:添加掉血(战斗数据,战斗数据.参战单位[目标].法术状态.同舟共济.攻击编号,伤害,攻击方)
		end
	end

	if 战斗数据.参战单位[目标].JM.磐石 then
		if 战斗数据.参战单位[目标].磐石==nil then --首个攻击自己的先记录下来
			战斗数据.参战单位[目标].磐石={记录组={}}
			战斗数据.参战单位[目标].磐石.记录组[攻击方]=攻击方
		else
			if 战斗数据.参战单位[目标].磐石.记录组[攻击方]==nil then --下一个攻击自己的没记录才会减伤害
				战斗数据.参战单位[目标].磐石.记录组[攻击方]=攻击方
				战斗数据.参战单位[目标].JM.磐石 = 战斗数据.参战单位[目标].JM.磐石 + 1
				伤害=伤害-(战斗数据.参战单位[目标].JM.磐石 *55)
			end
		end
	end

	if 伤害 < 1 then 伤害 = 1 end
	伤害=qz(伤害+战斗数据.参战单位[编号].法伤结果)
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].伤害=伤害
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].类型=伤害类型
	for i=1,#特效 do
		table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].特效,特效[i])
	end

	if 战斗数据.参战单位[目标].门派 == "女儿村" then
		if 战斗数据:取经脉(目标, "女儿村", "轻霜") and 战斗数据.参战单位[编号].法术状态.毒 == nil  and 取随机数() < 30 then
			战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[目标], 战斗数据:取技能等级(目标,"毒经"))
			战斗数据.参战单位[编号].法术状态.毒.回合掉血 = 战斗数据:取技能等级(目标,"毒经") *3
			战斗数据.参战单位[编号].法术状态.毒.回合 = 4
		end
	end

	if 伤害类型==2 then --恢复状态
		战斗数据:增加气血(目标,伤害)
		-- 战斗数据:动画加血流程(编号,伤害)
	else
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[执行数].死亡=战斗数据:减少气血(目标,伤害,编号,名称)
		战斗计算:法术技能掉血计算(战斗数据,编号,伤害,目标,名称)
	end
end


function 战斗固伤计算:取门派秘籍(id,技能)
	if id == 0 or id == nil or id == "" then return 0 end
  local lv=0
  if id~=nil and 技能~=nil and 玩家数据[id].角色.门派秘籍~=nil and 玩家数据[id].角色.门派秘籍[技能]~=nil then
     lv=玩家数据[id].角色.门派秘籍[技能]
  end
  return lv
end



return 战斗固伤计算