-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-10 14:51:38
-- @Author: baidwwy
-- @Date:   2024-10-20 02:54:08
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-07 02:25:57
-- @Author: baidwwy
-- @Date:   2024-10-20 02:54:08
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-10-21 21:58:07
-- @Author: baidwwy
-- @Date:   2024-09-11 20:07:56
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-10-21 21:52:07

local 物理技能计算 = class()
local jhf = string.format
local random = math.random
local qz=math.floor
local sj = 取随机数

function 物理技能计算:初始化()
end

function 物理技能计算:基础计算(编号,名称,等级,战斗数据,目标,目标数)
	local 返回=nil
	local 重复攻击=false
	local 重复次数=nil
	local 起始伤害=1
	local 叠加伤害=0
	local 重复提示=false
	local 允许保护=true
	if 名称=="烟雨剑法" then
		目标数=2
		重复攻击=true
		起始伤害=1
		if 战斗数据:取经脉(编号, "五庄观","起雨") and 战斗数据.参战单位[编号].骤雨.层数>=3 then
			目标数=3
			战斗数据.参战单位[编号].骤雨.层数=0
		end
	elseif 名称 == '枫影二刃' then
	    if 战斗数据.参战单位[编号].允许返回 then
	        返回 = true
	    else
	    	返回 = false
	    end
	    目标数 = 2
		起始伤害 = 0.7
		重复攻击 = true
		战斗数据.参战单位[编号].枫魂增伤 = nil
		if not 战斗数据.参战单位[编号].法术状态.怒哮 then
			local gl = 40
			if 战斗数据:取经脉(编号,'九黎城', "枫魂") then
				gl = 100
			end
			if 取随机数(1, 100) <= gl then
				战斗数据:添加状态("怒哮", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号])
			end
		elseif 战斗数据:取经脉(编号,'九黎城', "枫魂") then
			战斗数据.参战单位[编号].枫魂增伤 = 1.2
		end
	elseif 名称 == '一斧开天' then
	    if 战斗数据.参战单位[编号].允许返回 then
	        返回 = true
	    else
	    	返回 = false
	    end
	    目标数 = 2
		起始伤害 = 0.7
		重复攻击 = true
	elseif 名称 == "三荒尽灭" then
		起始伤害 = 0.32
		重复提示=true
		返回=true
	elseif 名称 == "铁血生风" then
		起始伤害 = 0.8
		if 战斗数据.参战单位[目标[1]].九黎浮空 ~= nil then
			目标数 = 1 + 取随机数(1,2)
			重复攻击 = true
			叠加伤害 = 0.1

			if 战斗数据:取经脉(编号,'九黎城', "生风") and 取随机数() <= 8 then
				战斗数据:物攻技能计算(编号, "铁血生风", 战斗数据:取技能等级(编号, "铁血生风"),战斗数据, {指定目标 = 目标[1]})
			end
		end
	elseif 名称=="侵蚀·烟雨剑法·刻骨" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		目标数=2
		重复攻击=true
		起始伤害=1.075
		if 战斗数据:取经脉(编号, "五庄观","起雨") and 战斗数据.参战单位[编号].骤雨.层数>=3 then
			目标数=3
			战斗数据.参战单位[编号].骤雨.层数=0
		end
	elseif 名称=="侵蚀·烟雨剑法·钻心" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		目标数=2
		重复攻击=true
		起始伤害=1.12
		if 战斗数据:取经脉(编号, "五庄观","起雨") and 战斗数据.参战单位[编号].骤雨.层数>=3 then
			目标数=3
			战斗数据.参战单位[编号].骤雨.层数=0
		end
	elseif 名称=="侵蚀·烟雨剑法·噬魂" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		目标数=2
		重复攻击=true
		起始伤害=1.15
		if 战斗数据:取经脉(编号, "五庄观","起雨") and 战斗数据.参战单位[编号].骤雨.层数>=3 then
			目标数=3
			战斗数据.参战单位[编号].骤雨.层数=0
		end
	elseif (名称=="侵蚀·鹰击·噬魂" or 名称=="侵蚀·鹰击·刻骨"or 名称=="侵蚀·鹰击·钻心") then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
	elseif 名称=="天命剑法" then
		起始伤害=1.1
		叠加伤害= -0.1
		目标数=取随机数(1,7)
		重复攻击=true
	elseif 名称=="敲金击玉" then
		local jc = 0.3
		if 战斗数据.参战单位[编号].道果 then
			jc = 0.2
		elseif 战斗数据.参战单位[编号].饮露 then
			jc = 0.34
		end
		起始伤害 = 1 + 战斗数据.参战单位[编号].人参果.枚*jc
		if 战斗数据:取经脉(编号, "五庄观","木摧") then
			起始伤害 = 起始伤害 * 1.05
		end
	elseif 名称=="侵蚀·敲金击玉·刻骨" then
		local jc = 0.3
		if 战斗数据.参战单位[编号].道果 then
			jc = 0.2
		elseif 战斗数据.参战单位[编号].饮露 then
			jc = 0.34
		end
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害 = 1 + 战斗数据.参战单位[编号].人参果.枚*jc
		起始伤害 = 起始伤害 * 1.1
		if 战斗数据:取经脉(编号, "五庄观","木摧") then
			起始伤害 = 起始伤害 * 1.05
		end
	elseif 名称=="侵蚀·敲金击玉·钻心" then
		local jc = 0.3
		if 战斗数据.参战单位[编号].道果 then
			jc = 0.2
		elseif 战斗数据.参战单位[编号].饮露 then
			jc = 0.34
		end
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害 = 1 + 战斗数据.参战单位[编号].人参果.枚*jc
		起始伤害 = 起始伤害 * 1.12
		if 战斗数据:取经脉(编号, "五庄观","木摧") then
			起始伤害 = 起始伤害 * 1.05
		end
	elseif 名称=="侵蚀·敲金击玉·噬魂" then
		local jc = 0.3
		if 战斗数据.参战单位[编号].道果 then
			jc = 0.2
		elseif 战斗数据.参战单位[编号].饮露 then
			jc = 0.34
		end
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害 = 1 + 战斗数据.参战单位[编号].人参果.枚*jc
		起始伤害 = 起始伤害 * 1.15
		if 战斗数据:取经脉(编号, "五庄观","木摧") then
			起始伤害 = 起始伤害 * 1.05
		end
	elseif 名称=="落土止息" then
		local jc = 0.3
		if 战斗数据.参战单位[编号].道果 then
			jc = 0.2
		elseif 战斗数据.参战单位[编号].饮露 then
			jc = 0.34
		end
		起始伤害 = 1 + 战斗数据.参战单位[编号].人参果.枚*jc*2
	--====================五庄观
	--====================召唤兽
	elseif 名称=="高级连击" then
		目标数=2
		重复攻击=true
	elseif 名称=="超级连击" then
		目标数=2
		重复攻击=true
	elseif 名称=="理直气壮" then
		目标数=3
		重复攻击=true
	elseif 名称=="乘胜追击" then
		起始伤害=0.4
		目标数=2
		重复攻击=true
	elseif 名称=="剑荡四方" then
		起始伤害=0.8
		叠加伤害=-0.2
	elseif 名称=="水击三千" then
		起始伤害=1.1
	elseif 名称=="惊心一剑" then
		起始伤害=0.9
	elseif 名称=="牛刀小试" then
		返回=true
		起始伤害=1.2
	--====================大唐
	elseif 名称=="横扫千军" then
		起始伤害=0.9
		叠加伤害=0.1
		目标数=3
		重复攻击=true
		if 战斗数据:取经脉(编号, "大唐官府","无敌") then
			起始伤害=0.75
			目标数=4
		end
		if 战斗数据:取经脉(编号,"大唐官府", "突刺") and 战斗数据.参战单位[编号].气血>=战斗数据.参战单位[编号].最大气血*0.9 then
			起始伤害 = 起始伤害 + 0.05
		end
	elseif 名称=="侵蚀·横扫千军·刻骨" then
		起始伤害=0.9
		叠加伤害=0.1
		目标数=3
		重复攻击=true
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "大唐官府","无敌") then
			起始伤害=0.8
			目标数=4
		end
		if 战斗数据:取经脉(编号,"大唐官府", "突刺") and 战斗数据.参战单位[编号].气血>=战斗数据.参战单位[编号].最大气血*0.9 then
			起始伤害 = 起始伤害 + 0.05
		end
	elseif 名称=="侵蚀·横扫千军·钻心" then
		起始伤害=0.9
		叠加伤害=0.1
		目标数=3
		重复攻击=true
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "大唐官府","无敌") then
			起始伤害=0.8
			目标数=4
		end
		if 战斗数据:取经脉(编号,"大唐官府", "突刺") and 战斗数据.参战单位[编号].气血>=战斗数据.参战单位[编号].最大气血*0.9 then
			起始伤害 = 起始伤害 + 0.05
		end
	elseif 名称=="侵蚀·横扫千军·噬魂" then
		起始伤害=0.9
		叠加伤害=0.1
		目标数=3
		重复攻击=true
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "大唐官府","无敌") then
			起始伤害=0.8
			目标数=4
		end
		if 战斗数据:取经脉(编号,"大唐官府", "突刺") and 战斗数据.参战单位[编号].气血>=战斗数据.参战单位[编号].最大气血*0.9 then
			起始伤害 = 起始伤害 + 0.05
		end
	elseif 名称=="破釜沉舟" then
		重复提示=true
		返回=true
	elseif 名称=="披挂上阵" then
		起始伤害=0.95
		叠加伤害=0.1
		目标数=3
		重复攻击=true
	elseif 名称=="翩鸿一击" then
		起始伤害=1
		if 战斗数据:取经脉(编号, "大唐官府","翩鸿") then
			起始伤害=1.35
		end
	elseif 名称=="长驱直入" then
		起始伤害=1.1
	elseif 名称=="摧枯拉朽" then
		起始伤害=1.1
	--====================凌波城
	elseif 名称=="浪涌" then
		起始伤害=0.75--0.65 上调
		if 战斗数据:取经脉(编号, "凌波城","战诀") and not 战斗数据.PK战斗 then
			起始伤害=0.85--0.8
		else
			战斗数据:增加战意(编号,1)
		end
	elseif 名称=="裂石" then
		if 战斗数据:取被动(编号,"吞山") then
			战斗数据.参战单位[编号].附加必杀=5
		end
	elseif 名称=="腾雷" then--1点战意
		if not 战斗数据:取经脉(编号, "凌波城","闪雷") then
			if 战斗数据.参战单位[编号].超级战意>=1 then
				战斗数据.参战单位[编号].超级战意 = 战斗数据.参战单位[编号].超级战意 - 1
				if 战斗数据:取经脉(编号, "凌波城","妙得") then
					战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20
				else
					起始伤害 = 起始伤害 * 1.2
					if 战斗数据:取经脉(编号, "凌波城","惊涛") then
						local num = 0
						if 战斗数据:取装备五行(编号,3)=="水" then --武器
							num = num + 0.04
						end
						if 战斗数据:取装备五行(编号,4)=="水" then --衣服
							num = num + 0.04
						end
						起始伤害 = 起始伤害 * (1 + num)
					end
				end
				if 战斗数据:取经脉(编号,"凌波城","乘势") then
					战斗数据.参战单位[编号].乘势=1
				end
			end
		end
	elseif 名称=="惊涛怒" then--1点战意
		起始伤害=0.7
		if 等级 >= 175 then
			起始伤害=1
		elseif 等级 >= 150 then
			起始伤害=0.95
		elseif 等级 >= 125 then
			起始伤害=0.9
		elseif 等级 >= 100 then
			起始伤害=0.85
		elseif 等级 >= 75 then
			起始伤害=0.8
		elseif 等级 >= 50 then
			起始伤害=0.75
		end
		if 战斗数据.参战单位[编号].法术状态.再战 then
			起始伤害 = 起始伤害 * 1.15
		end
		if 战斗数据.参战单位[编号].超级战意>=1 then
			战斗数据.参战单位[编号].超级战意 = 战斗数据.参战单位[编号].超级战意 - 1
			if 战斗数据:取经脉(编号,"凌波城","乘势") then
				战斗数据.参战单位[编号].乘势=1
			end
			if 战斗数据:取经脉(编号, "凌波城","妙得") then
				战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20
			else
				起始伤害 = 起始伤害 * 1.2
				if 战斗数据:取经脉(编号, "凌波城","惊涛") then
					local num = 0
					if 战斗数据:取装备五行(编号,3)=="水" then --武器
						num = num + 0.04
					end
					if 战斗数据:取装备五行(编号,4)=="水" then --衣服
						num = num + 0.04
					end
					起始伤害 = 起始伤害 * (1 + num)
				end
			end
		end
	elseif 名称=="断岳势" then --1点战意
		目标数=2
		重复攻击=true
		起始伤害=1
		叠加伤害=-0.2
		if 战斗数据:取被动(编号,"吞山") then
			战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 5
		end
		if 战斗数据.参战单位[编号].法术状态.再战 then --相乘切记
			起始伤害 = 起始伤害 * 1.15
		end
		if 战斗数据.参战单位[编号].超级战意>=1 then
			战斗数据.参战单位[编号].超级战意 = 战斗数据.参战单位[编号].超级战意 - 1
			if 战斗数据:取经脉(编号,"凌波城","乘势") then
				战斗数据.参战单位[编号].乘势=1
			end
			if 战斗数据:取经脉(编号, "凌波城","妙得") then
				战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20
			else
				起始伤害 = 起始伤害 * 1.2
				if 战斗数据:取经脉(编号, "凌波城","惊涛") then
					local num = 0
					if 战斗数据:取装备五行(编号,3)=="水" then --武器
						num = num + 0.04
					end
					if 战斗数据:取装备五行(编号,4)=="水" then --衣服
						num = num + 0.04
					end
					起始伤害 = 起始伤害 * (1 + num)
				end
			end
		end
	elseif 名称=="天崩地裂" then--3点战意
		目标数=3
		重复攻击=true
		起始伤害=1
		叠加伤害=-0.1
		if 战斗数据:取被动(编号,"吞山") then
			战斗数据.参战单位[编号].附加必杀=5
		end
		if 战斗数据.参战单位[编号].天神怒斩~=nil then
			for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
				if v.名称 == "天神怒斩" and v.剩余冷却回合~=nil and v.剩余冷却回合>0 then
					v.剩余冷却回合=v.剩余冷却回合-1
					break
				end
			end
		end
	elseif 名称 =="侵蚀·天崩地裂·刻骨"then--3点战意
		目标数=3
		重复攻击=true
		起始伤害=1
		叠加伤害=-0.1
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取被动(编号,"吞山") then
			战斗数据.参战单位[编号].附加必杀=5
		end
		if 战斗数据.参战单位[编号].天神怒斩~=nil then
			for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
				if v.名称 == "天神怒斩" and v.剩余冷却回合~=nil and v.剩余冷却回合>0 then
					v.剩余冷却回合=v.剩余冷却回合-1
					break
				end
			end
		end
		if 战斗数据.参战单位[编号].超级战意>=1 then --要计算数量
			local num = 战斗数据.参战单位[编号].超级战意
			战斗数据.参战单位[编号].超级战意 = 0
			if 战斗数据:取经脉(编号,"凌波城","乘势") then
				战斗数据.参战单位[编号].乘势=1
			end
			if 战斗数据:取经脉(编号, "凌波城","妙得") then
				战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20*num
			else
				起始伤害 = 起始伤害 * (1+0.2*num)
				if 战斗数据:取经脉(编号, "凌波城","惊涛") then
					local num = 0
					if 战斗数据:取装备五行(编号,3)=="水" then --武器
						num = num + 0.04
					end
					if 战斗数据:取装备五行(编号,4)=="水" then --衣服
						num = num + 0.04
					end
					起始伤害 = 起始伤害 * (1 + num)
				end
			end
		end
	elseif 名称 =="侵蚀·天崩地裂·钻心"  then--3点战意
		目标数=3
		重复攻击=true
		起始伤害=1
		叠加伤害=-0.1
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取被动(编号,"吞山") then
			战斗数据.参战单位[编号].附加必杀=5
		end
		if 战斗数据.参战单位[编号].天神怒斩~=nil then
			for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
				if v.名称 == "天神怒斩" and v.剩余冷却回合~=nil and v.剩余冷却回合>0 then
					v.剩余冷却回合=v.剩余冷却回合-1
					break
				end
			end
		end
		if 战斗数据.参战单位[编号].超级战意>=1 then --要计算数量
			local num = 战斗数据.参战单位[编号].超级战意
			战斗数据.参战单位[编号].超级战意 = 0
			if 战斗数据:取经脉(编号,"凌波城","乘势") then
				战斗数据.参战单位[编号].乘势=1
			end
			if 战斗数据:取经脉(编号, "凌波城","妙得") then
				战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20*num
			else
				起始伤害 = 起始伤害 * (1+0.2*num)
				if 战斗数据:取经脉(编号, "凌波城","惊涛") then
					local num = 0
					if 战斗数据:取装备五行(编号,3)=="水" then --武器
						num = num + 0.04
					end
					if 战斗数据:取装备五行(编号,4)=="水" then --衣服
						num = num + 0.04
					end
					起始伤害 = 起始伤害 * (1 + num)
				end
			end
		end
	elseif  名称 =="侵蚀·天崩地裂·噬魂" then--3点战意
		目标数=3
		重复攻击=true
		起始伤害=1
		叠加伤害=-0.1
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取被动(编号,"吞山") then
			战斗数据.参战单位[编号].附加必杀=5
		end
		if 战斗数据.参战单位[编号].天神怒斩~=nil then
			for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
				if v.名称 == "天神怒斩" and v.剩余冷却回合~=nil and v.剩余冷却回合>0 then
					v.剩余冷却回合=v.剩余冷却回合-1
					break
				end
			end
		end
		if 战斗数据.参战单位[编号].超级战意>=1 then --要计算数量
			local num = 战斗数据.参战单位[编号].超级战意
			战斗数据.参战单位[编号].超级战意 = 0
			if 战斗数据:取经脉(编号,"凌波城","乘势") then
				战斗数据.参战单位[编号].乘势=1
			end
			if 战斗数据:取经脉(编号, "凌波城","妙得") then
				战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20*num
			else
				起始伤害 = 起始伤害 * (1+0.2*num)
				if 战斗数据:取经脉(编号, "凌波城","惊涛") then
					local num = 0
					if 战斗数据:取装备五行(编号,3)=="水" then --武器
						num = num + 0.04
					end
					if 战斗数据:取装备五行(编号,4)=="水" then --衣服
						num = num + 0.04
					end
					起始伤害 = 起始伤害 * (1 + num)
				end
			end
		end
	elseif 名称=="翻江搅海" then--3点战意
		起始伤害=0.8
		返回=true
		if 等级 >= 75 then
			起始伤害=1
		elseif 等级 >= 50 then
			起始伤害=0.9
		end
		if 战斗数据.参战单位[编号].天神怒斩~=nil then
			for k, v in pairs(战斗数据.参战单位[编号].主动技能) do
				if v.名称 == "天神怒斩" and v.剩余冷却回合~=nil and v.剩余冷却回合>0 then
					v.剩余冷却回合=v.剩余冷却回合-1
					break
				end
			end
		end
		if 战斗数据.参战单位[编号].超级战意>=1 then --要计算数量
			local num = 战斗数据.参战单位[编号].超级战意
			战斗数据.参战单位[编号].超级战意 = 0
			if 战斗数据:取经脉(编号,"凌波城","乘势") then
				战斗数据.参战单位[编号].乘势=1
			end
			if 战斗数据:取经脉(编号, "凌波城","妙得") then
				战斗数据.参战单位[编号].附加必杀 = 战斗数据.参战单位[编号].附加必杀 + 20*num
			else
				起始伤害 = 起始伤害 * (1+0.2*num)
				if 战斗数据:取经脉(编号, "凌波城","惊涛") then
					local num = 0
					if 战斗数据:取装备五行(编号,3)=="水" then --武器
						num = num + 0.04
					end
					if 战斗数据:取装备五行(编号,4)=="水" then --衣服
						num = num + 0.04
					end
					起始伤害 = 起始伤害 * (1 + num)
				end
			end
		end
	elseif 名称=="天神怒斩" then
		起始伤害=1
		if 战斗数据.参战单位[编号].天神怒斩==nil then
			战斗数据.参战单位[编号].天神怒斩=0
		end
		if 战斗数据.参战单位[编号].战意~=1 then
			战斗数据.参战单位[编号].天神怒斩=战斗数据.参战单位[编号].天神怒斩+0.25
		else
			战斗数据.参战单位[编号].天神怒斩=战斗数据.参战单位[编号].天神怒斩+0.5
		end

		-- if 战斗数据.参战单位[编号].战意==1 then
		--     伤害 = 伤害 * 1.5
		-- else
		-- 	伤害 = 伤害 * 1.25
		-- end
		起始伤害 = 起始伤害 * (1+战斗数据.参战单位[编号].天神怒斩)
	--====================女儿村
	elseif 名称=="满天花雨" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].法术状态.自矜 and 战斗数据.参战单位[编号].JM.当前流派=="花间美人" then
			目标数=2
			重复次数=2
			重复攻击=true
		end
	elseif 名称=="葬玉焚花" then
		起始伤害=0.94
		if 战斗数据:取经脉(编号, "女儿村", "花落") then
			起始伤害 = 1
		end
		if 战斗数据.参战单位[编号].法术状态.自矜 and 战斗数据.参战单位[编号].JM.当前流派=="花间美人" then
			-- 起始伤害=1.15
			-- 重复提示=true
			 目标数=8
			 重复次数=2
			 重复攻击=true
			 重复提示=true
		end
	elseif  名称=="侵蚀·葬玉焚花·刻骨" then
		起始伤害=0.94*1.1
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "女儿村", "花落") then
			起始伤害 = 1*1.1
		end
		if 战斗数据.参战单位[编号].法术状态.自矜 and 战斗数据.参战单位[编号].JM.当前流派=="花间美人" then
			目标数=8
			重复次数=2
			重复攻击=true
			重复提示=true
		end
	elseif  名称=="侵蚀·葬玉焚花·钻心" then
		起始伤害=0.94*1.16
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "女儿村", "花落") then
			起始伤害 = 1*1.16
		end
		if 战斗数据.参战单位[编号].法术状态.自矜 and 战斗数据.参战单位[编号].JM.当前流派=="花间美人" then
			目标数=8
			重复次数=2
			重复攻击=true
			重复提示=true
		end
	elseif 名称=="侵蚀·葬玉焚花·噬魂" then
		起始伤害=0.94*1.2
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "女儿村", "花落") then
			起始伤害 = 1*1.2
		end
		if 战斗数据.参战单位[编号].法术状态.自矜 and 战斗数据.参战单位[编号].JM.当前流派=="花间美人" then
			目标数=8
			重复次数=2
			重复攻击=true
			重复提示=true
		end
	--====================狮驼
	elseif 名称=="连环击" then
		目标数=math.floor(等级/35)+2
		重复攻击=true
		起始伤害=1
		叠加伤害=-0.1
		if 战斗数据.参战单位[编号].法术状态.肝胆 then
			起始伤害 = 起始伤害 * 1.15
			战斗数据.参战单位[编号].法术状态.肝胆.触发=true
		end
	elseif 名称=="狮搏" then
		起始伤害=1.4
		if 战斗数据:取经脉(编号, "狮驼岭","威压") and 战斗数据:取目标类型(目标[1]) == "召唤兽" then
			起始伤害=起始伤害*1.2
		end
	elseif (名称=="鹰击" or 名称=="侵蚀·鹰击·刻骨" or 名称=="侵蚀·鹰击·钻心" or 名称=="侵蚀·鹰击·噬魂" )then
		if (名称=="侵蚀·鹰击·刻骨" or 名称=="侵蚀·鹰击·钻心" or 名称=="侵蚀·鹰击·噬魂") then
			战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		起始伤害=1.1
		重复提示=true
		返回=true
		if 战斗数据.参战单位[编号].九天~=nil then
			起始伤害 = 起始伤害*1.15
		end
		if 战斗数据.参战单位[编号].法术状态.肝胆 then
			起始伤害 = 起始伤害 * 1.15
			战斗数据.参战单位[编号].法术状态.肝胆.触发=true
		end
	elseif 名称=="疯狂鹰击" then
		起始伤害=1.15
		重复提示=true
		返回=true
	elseif 名称=="困兽之斗" then
		起始伤害=1.4
		if 战斗数据.参战单位[编号].法术状态.狂怒 and sj()<=50 then
			目标[2]=目标[1]
			目标数=#目标
			重复提示=true
			返回=true
		end
	--====================地府
	elseif 名称=="百爪狂杀" then
		重复提示=true
		返回=true
		起始伤害=0.8
	elseif 名称=="六道无量" or 名称=="无赦咒令" or 名称=="血影蚀心" then
		起始伤害=1
	elseif 名称=="百鬼噬魂" then
		起始伤害=0.8
	elseif 名称=="生杀予夺" then
		起始伤害=1.3

	--====================盘丝洞
	elseif 名称=="千蛛噬魂" then --0.75-0.8
		起始伤害=0.8
	elseif 名称=="侵蚀·千蛛噬魂·刻骨" then --0.75-0.8
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=0.8*1.15
	elseif 名称=="侵蚀·千蛛噬魂·钻心" then --0.75-0.8
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=0.8*1.24
	elseif 名称=="侵蚀·千蛛噬魂·噬魂" then --0.75-0.8
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=0.8	*1.3
	elseif 名称=="蛛丝缠绕" then
		起始伤害=1.1
	elseif 名称=="绝命毒牙" then
		起始伤害=1.25

	--====================普陀山
	elseif 名称=="侵蚀·五行攻击·刻骨" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=1.2*1.1
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if  (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘")  then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="侵蚀·五行攻击·钻心" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=1.2*1.12
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if  (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘")  then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="侵蚀·五行攻击·噬魂" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=1.2*1.15
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if  (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘")  then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="日光耀" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if 战斗数据:取五行克制("金",战斗数据.参战单位[目标[1]].防御五行) or (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据.参战单位[编号].攻击五行 == "金" then --五行感应
			起始伤害=1.2
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘") and 战斗数据:取五行克制("金",战斗数据.参战单位[目标[1]].防御五行) then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="靛沧啸" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if 战斗数据:取五行克制("金",战斗数据.参战单位[目标[1]].防御五行) or (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据.参战单位[编号].攻击五行 == "水" then
			起始伤害=1.2
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘") and 战斗数据:取五行克制("水",战斗数据.参战单位[目标[1]].防御五行) then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="巨岩击" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if 战斗数据:取五行克制("金",战斗数据.参战单位[目标[1]].防御五行) or (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据.参战单位[编号].攻击五行 == "土" then
			起始伤害=1.2
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘") and 战斗数据:取五行克制("土",战斗数据.参战单位[目标[1]].防御五行) then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="苍茫刺" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if 战斗数据:取五行克制("金",战斗数据.参战单位[目标[1]].防御五行) or (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据.参战单位[编号].攻击五行 == "木" then
			起始伤害=1.2
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘") and 战斗数据:取五行克制("木",战斗数据.参战单位[目标[1]].防御五行) then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end
	elseif 名称=="地裂焚" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].法术状态["剑意莲心"] then
			if 战斗数据:消耗五行珠(编号) then
				目标数=2
				重复攻击=true
			end
		else
			local gl = 50
			if 战斗数据.参战单位[编号].五行珠>=3 and 战斗数据:取经脉(编号, "普陀山", "相生") then
				gl = 75
			end
			if 战斗数据:取五行克制("金",战斗数据.参战单位[目标[1]].防御五行) or (战斗数据.参战单位[编号].五行珠<=0 and 战斗数据:取经脉(编号, "普陀山", "执念")) then
				gl = 100
			end
			if sj()<=gl then
				战斗数据:增加五行珠(编号)
			end
		end
		if 战斗数据.参战单位[编号].攻击五行 == "火" then
			起始伤害=1.2
		end
		if 战斗数据:取经脉(编号, "普陀山", "因缘") and 战斗数据:取五行克制("火",战斗数据.参战单位[目标[1]].防御五行) then
			起始伤害=起始伤害*1.05
		end
		if 战斗数据:取经脉(编号, "普陀山", "万象") and 战斗数据.参战单位[编号].法术状态.颠倒五行 then
			起始伤害=起始伤害*1.08
		end

	--====================天宫
	elseif 名称=="天雷斩" then
		起始伤害 = 1 - 目标数*0.05
	elseif 技能名称=="风雷斩" then
		起始伤害 = 1 - 目标数*0.05
		if 起始伤害<=0.85 then
			起始伤害=0.85
		end
	elseif 技能名称=="风雷斩·飞霆" then --和天雷斩区别是PK可以多秒两个单位
		起始伤害= 1 - 目标数*0.05
		if 起始伤害<=0.8 then
			起始伤害=0.8
		end
		重复提示=true
		返回=true
	elseif 技能名称=="风雷斩·霹雳" then
		起始伤害=1.35
		if 战斗数据.参战单位[编号].法术状态.天雷灌注 and 取随机数()<=65 then
			目标数=2
			重复攻击=true
		end
	elseif 技能名称=="侵蚀·风雷斩·霹雳·刻骨" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=1.35*1.15
		if 战斗数据.参战单位[编号].法术状态.天雷灌注 and 取随机数()<=65 then
			目标数=2
			重复攻击=true
		end
	elseif 技能名称=="侵蚀·风雷斩·霹雳·钻心" then
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		起始伤害=1.35*1.24
		if 战斗数据.参战单位[编号].法术状态.天雷灌注 and 取随机数()<=65 then
			目标数=2
			重复攻击=true
		end
	elseif 技能名称=="侵蚀·风雷斩·霹雳·噬魂" then
		起始伤害=1.35*1.30
		战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据.参战单位[编号].法术状态.天雷灌注 and 取随机数()<=65 then
			目标数=2
			重复攻击=true
		end
	elseif 技能名称=="威仪九霄" then
		起始伤害=0.1*(1+0.03)^战斗数据.参战单位[编号].法术状态.威仪九霄.层数
		重复提示=true
		返回=true
		战斗数据.参战单位[编号].法术状态.威仪九霄.层数=0

	--====================花果山
	elseif (名称=="当头一棒" or 名称=="侵蚀·当头一棒·刻骨"or 名称=="侵蚀·当头一棒·钻心"or 名称=="侵蚀·当头一棒·噬魂") then
		起始伤害=1.4

--------------------------18奇技花果山1-------------------------------
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"花果山A") >=1  and not 战斗数据.PK战斗 then
				起始伤害 = 起始伤害 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"花果山A")/100
  			end
--------------------------18奇技花果山1-------------------------------





		if ( 名称=="侵蚀·当头一棒·刻骨"or 名称=="侵蚀·当头一棒·钻心"or 名称=="侵蚀·当头一棒·噬魂")then
			战斗数据:添加状态("侵蚀",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		if 战斗数据:取经脉(编号, "花果山", "威仪") then
			战斗数据.参战单位[编号].威仪=1
		end
		if 战斗数据:取经脉(编号, "花果山", "愈勇") then
			战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		if 战斗数据:取经脉(编号, "花果山", "斗志") then
			战斗数据.参战单位[编号].斗志=名称
			起始伤害 = 起始伤害 * 1.06
		end
		if 战斗数据:取经脉(编号, "花果山", "贪天") then
			战斗数据.参战单位[编号].贪天=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "压邪") and 战斗数据.参战单位[编号].法术状态.压邪==nil then
			if 战斗数据.参战单位[编号].压邪==nil then
				战斗数据.参战单位[编号].压邪={回合=2,层数=1}
			else
				战斗数据.参战单位[编号].压邪={回合=2,层数=战斗数据.参战单位[编号].压邪.层数+1}
			end
		end
		if 战斗数据:取经脉(编号, "花果山", "自在") then
			战斗数据.参战单位[编号].自在=1
		end
		if 战斗数据:取经脉(编号, "花果山", "变通") then
			战斗数据.参战单位[编号].变通=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "顽性") then
			战斗数据.参战单位[编号].顽性=名称
		end
	elseif 名称=="神针撼海" then
		起始伤害=1.1
		if 战斗数据.参战单位[编号].威仪~=nil then
			战斗数据.参战单位[编号].威仪=nil
			起始伤害=1.16
		end
		if 战斗数据:取经脉(编号, "花果山", "愈勇") then
			战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		if 战斗数据:取经脉(编号, "花果山", "斗志") then
			战斗数据.参战单位[编号].斗志=名称
			起始伤害 = 起始伤害 * 1.06
		end
		if 战斗数据:取经脉(编号, "花果山", "贪天") then
			战斗数据.参战单位[编号].贪天=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "压邪") and 战斗数据.参战单位[编号].法术状态.压邪==nil then
			if 战斗数据.参战单位[编号].压邪==nil then
				战斗数据.参战单位[编号].压邪={回合=2,层数=1}
			else
				战斗数据.参战单位[编号].压邪={回合=2,层数=战斗数据.参战单位[编号].压邪.层数+1}
			end
		end
		if 战斗数据:取经脉(编号, "花果山", "自在") then
			战斗数据.参战单位[编号].自在=1
		end
		if 战斗数据:取经脉(编号, "花果山", "变通") then
			战斗数据.参战单位[编号].变通=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "顽性") then
			战斗数据.参战单位[编号].顽性=名称
		end
	elseif 名称=="杀威铁棒" then
		起始伤害=1.2
		战斗数据:添加状态("杀威铁棒",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],69)
		if 战斗数据:取经脉(编号, "花果山", "愈勇") then
			战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		if 战斗数据:取经脉(编号, "花果山", "斗志") then
			战斗数据.参战单位[编号].斗志=名称
			起始伤害 = 起始伤害 * 1.06
		end
		if 战斗数据:取经脉(编号, "花果山", "贪天") then
			战斗数据.参战单位[编号].贪天=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "压邪") and 战斗数据.参战单位[编号].法术状态.压邪==nil then
			if 战斗数据.参战单位[编号].压邪==nil then
				战斗数据.参战单位[编号].压邪={回合=2,层数=1}
			else
				战斗数据.参战单位[编号].压邪={回合=2,层数=战斗数据.参战单位[编号].压邪.层数+1}
			end
		end
		if 战斗数据:取经脉(编号, "花果山", "自在") then
			战斗数据.参战单位[编号].自在=1
		end
		if 战斗数据:取经脉(编号, "花果山", "变通") then
			战斗数据.参战单位[编号].变通=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "顽性") then
			战斗数据.参战单位[编号].顽性=名称
		end
	elseif 名称=="棒打雄风" then
		起始伤害=1.2
		if 战斗数据:取经脉(编号, "花果山", "愈勇") then
			战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		if 战斗数据:取经脉(编号, "花果山", "斗志") then
			战斗数据.参战单位[编号].斗志=名称
			起始伤害 = 起始伤害 * 1.06
		end
		if 战斗数据:取经脉(编号, "花果山", "贪天") then
			战斗数据.参战单位[编号].贪天=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "压邪") and 战斗数据.参战单位[编号].法术状态.压邪==nil then
			if 战斗数据.参战单位[编号].压邪==nil then
				战斗数据.参战单位[编号].压邪={回合=2,层数=1}
			else
				战斗数据.参战单位[编号].压邪={回合=2,层数=战斗数据.参战单位[编号].压邪.层数+1}
			end
		end
		if 战斗数据:取经脉(编号, "花果山", "自在") then
			战斗数据.参战单位[编号].自在=1
		end
		if 战斗数据:取经脉(编号, "花果山", "变通") then
			战斗数据.参战单位[编号].变通=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "顽性") then
			战斗数据.参战单位[编号].顽性=名称
		end
	elseif 名称=="泼天乱棒" then
		起始伤害=1.1
		if 战斗数据:取经脉(编号, "花果山", "愈勇") then
			战斗数据:添加状态("愈勇",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		if 战斗数据:取经脉(编号, "花果山", "斗志") then
			战斗数据.参战单位[编号].斗志=名称
			起始伤害 = 起始伤害 * 1.06
		end
		if 战斗数据:取经脉(编号, "花果山", "贪天") then
			战斗数据.参战单位[编号].贪天=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "压邪") and 战斗数据.参战单位[编号].法术状态.压邪==nil then
			if 战斗数据.参战单位[编号].压邪==nil then
				战斗数据.参战单位[编号].压邪={回合=2,层数=1}
			else
				战斗数据.参战单位[编号].压邪={回合=2,层数=战斗数据.参战单位[编号].压邪.层数+1}
			end
		end
		if 战斗数据:取经脉(编号, "花果山", "自在") then
			战斗数据.参战单位[编号].自在=1
		end
		if 战斗数据:取经脉(编号, "花果山", "变通") then
			战斗数据.参战单位[编号].变通=名称
		end
		if 战斗数据:取经脉(编号, "花果山", "顽性") then
			战斗数据.参战单位[编号].顽性=名称
		end
	elseif 名称=="威震凌霄" then
		起始伤害=0.9
	--====================特技
	elseif 名称=="破血狂攻" then
		目标[2]=目标[1]
		目标数=#目标
		起始伤害=1
		if 战斗数据:取经脉(编号, "五庄观", "强击") then
			起始伤害 = 1.32
		end
	elseif 名称=="破碎无双" then
		起始伤害=1
		if 战斗数据:取经脉(编号, "五庄观", "强击") then
			起始伤害 = 1.32
		end
	--====================NPC
	elseif 名称=="武神之怒" then
		起始伤害=1
		叠加伤害=0.15
		目标数=6
		重复攻击=true
	elseif 名称=="怒击" then
		起始伤害=1
		叠加伤害=0.15
		目标数=1
	elseif 名称=="猛击" then
		起始伤害=1
		叠加伤害=0.15
		目标数=2
		重复攻击=true
	end
	return 返回,重复攻击,重复次数,起始伤害,叠加伤害,重复提示,允许保护,目标数
end

function 物理技能计算:物攻技能计算(编号,名称,等级,战斗数据) --物理战斗流程添加
	if 名称=="后发制人" then
		if 战斗数据.参战单位[编号].气血<=0 then
				战斗数据:取消状态(名称,战斗数据.参战单位[编号])
				战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=610,攻击方=编号,状态="后发制人",挨打方={{挨打方=1}}}
			return
		else
			if not 战斗数据:取目标状态(编号,战斗数据.参战单位[编号].法术状态.后发制人.目标,1) then
				战斗数据.参战单位[编号].指令.目标 = 战斗数据:取单个敌方目标(编号)
			else
				战斗数据.参战单位[编号].指令.目标=战斗数据.参战单位[编号].法术状态.后发制人.目标
			end
		end
	end
	if 名称=="风雷斩" and 战斗数据:取目标类型(编号) == "玩家" then
		if 战斗数据.参战单位[编号].侵蚀状态==nil then
			if 战斗数据.参战单位[编号].法术状态.雷怒霆激 and 战斗数据.参战单位[编号].法术状态.霹雳弦惊 then
			elseif 战斗数据.参战单位[编号].法术状态.雷怒霆激 then
				名称="风雷斩·飞霆"
			elseif 战斗数据.参战单位[编号].法术状态.霹雳弦惊 then
				名称="风雷斩·霹雳"
			end
		elseif 战斗数据.参战单位[编号].侵蚀状态~=nil and 战斗数据.参战单位[编号].侵蚀.刻骨 then
			名称="侵蚀·风雷斩·霹雳·刻骨"
		elseif 战斗数据.参战单位[编号].侵蚀状态~=nil and 战斗数据.参战单位[编号].侵蚀.钻心 then
			名称="侵蚀·风雷斩·霹雳·钻心"
		elseif 战斗数据.参战单位[编号].侵蚀状态~=nil and 战斗数据.参战单位[编号].侵蚀.噬魂 then
			名称="侵蚀·风雷斩·霹雳·噬魂"
			if 战斗数据.参战单位[编号].法术状态.天雷灌注 then
		          战斗数据.参战单位[编号].法术状态.天雷灌注.层数 = 战斗数据.参战单位[编号].法术状态.天雷灌注.层数 - 1
		          if 战斗数据.参战单位[编号].法术状态.天雷灌注.层数<=0 then
		             战斗数据:取消状态("天雷灌注", 战斗数据.参战单位[编号])
		          end
		    end
		end
	end

	local 目标=战斗数据.参战单位[编号].指令.目标
	local zza = skill.数据[名称]
	local 目标数 = zza.技能人数(等级,战斗数据.参战单位[编号],战斗数据.PK战斗)
	local 目标=战斗数据:取多个敌方目标(编号,目标,目标数)
	local 战意提示=false
	local 返回信息
	for n=1,#目标 do
		if 战斗数据.参战单位[目标[n]].法术状态.分身术~=nil and 战斗数据.参战单位[目标[n]].法术状态.分身术.破解==nil then
			战斗数据.参战单位[目标[n]].法术状态.分身术.破解=1
			table.remove(目标,n)
			break
		end
	end

	if #目标==0 then return end
	目标数=#目标
	local 消耗1,类型1 = zza.技能消耗(目标数,战斗数据.参战单位[编号])
	if 初始技能计算:技能消耗(战斗数据,战斗数据.参战单位[编号],消耗1,类型1,名称)==false then
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=6,战斗提示={内容="行动失败",编号=编号}}
		return
	end

	if 战斗数据:取目标类型(编号) == "召唤兽" then
		战斗技能:顾盼生姿(战斗数据,编号)
	end
	if 名称 == "花谢花飞" then
		名称="满天花雨"
		战斗数据.参战单位[编号].花谢花飞=1
	end
	--------=======================================--------
	local 返回,重复攻击,重复次数,起始伤害,叠加伤害,重复提示,允许保护,目标数 = self:基础计算(编号,名称,等级,战斗数据,目标,目标数)
	--------=======================================--------
	if 战斗数据.参战单位[编号].超级连击==true and 取随机数(1,100) <= 20 then
		目标数=目标数+1
	end

	-- if 重复攻击 then
	-- 	local 临时目标=目标[1]
	-- 	for n=1,目标数 do
	-- 		目标[n]=临时目标
	-- 	end
	-- end
	local mcjc=nil
	if 重复攻击 then
		if 重复次数==nil then
			local 临时目标=目标[1]
			for n=1,目标数 do
				目标[n]=临时目标
			end
		else
			mcjc=名称
			local num = 1
			local S_目标=DeepCopy(目标) --复刻一个重复动作和目标
			for n=1,目标数 do
				local 临时目标=S_目标[num]
				if n%重复次数== 0 then --偶数
					num = num + 1
				end
				目标[n]=临时目标
			end
		end
	end

	--计算流程
	local 战斗终止=false
	local 寄存={}
	for n=1,目标数 do
		寄存[n]=目标[n]
	end
	local cs = 目标数
	if 重复次数~=nil then
		for n=1,目标数 do
			if 战斗终止==false then
				local go = true
				if n%重复次数== 0 and 战斗数据:取目标状态(编号,目标[n],1)==false then --下一个攻击目标切目标为偶数且死亡
					go = false
				end
				if go then
					if n%重复次数== 0 then
						名称="自矜"
					else
						名称=mcjc
					end
					self:物攻技能计算1(编号,目标[n],起始伤害,叠加伤害,返回,允许保护,n,名称,战斗数据)
					if n == 1 then
						战斗数据.战斗流程[#战斗数据.战斗流程].战斗法术 = 名称
						战斗数据.战斗流程[#战斗数据.战斗流程].寄存目标 = 寄存
					end
					战斗数据.战斗流程[#战斗数据.战斗流程].提示={类型="法术",名称=战斗数据.参战单位[编号].名称.."使用了"..名称,允许=true}
					if n==目标数 then
						战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
					elseif 战斗数据:取行动状态(编号)==false then
						战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
						战斗终止=true
					elseif 战斗数据:取目标状态(编号,目标[n+1],1)==false then --下一个目标死亡时结束
						战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
						战斗终止=true
					end
				else
					if n==目标数 then
						战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
					elseif 战斗数据:取行动状态(编号)==false then
						战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
						战斗终止=true
					elseif 战斗数据:取目标状态(编号,目标[n+1],1)==false then --下一个目标死亡时结束
						战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
						战斗终止=true
					end
				end
			end
		end
	else
		for n=1,目标数 do
			if 战斗终止==false then
				-- n=n+2
				--------=======================================--------
				self:物攻技能计算1(编号,目标[n],起始伤害,叠加伤害,返回,允许保护,n,名称,战斗数据)
				cs = n
				--------=======================================--------
				local 提示内容x = ""
				if 名称~= "高级连击" and 名称~= "超级连击" and 名称~= "理直气壮" then
					提示内容x = 战斗数据.参战单位[编号].名称.."使用了"..名称
				end
				if 名称=="武神之怒" and n == 1 then
					战斗数据.战斗流程[#战斗数据.战斗流程].全屏法术 = 名称
				elseif (名称=="翻江搅海" or 名称=="神针撼海") and n == 1 then
					战斗数据.战斗流程[#战斗数据.战斗流程].全屏法术 = 名称
				elseif n == 1 and (名称=="力劈华山" or 名称=="满天花雨" or 名称=="惊涛怒" or 名称=="同伤式" or 名称=="葬玉焚花" or 名称=="千蛛噬魂" or 名称=="侵蚀·千蛛噬魂·刻骨" or 名称=="侵蚀·千蛛噬魂·钻心" or 名称=="侵蚀·千蛛噬魂·噬魂" or 名称=="蛛丝缠绕" ) then
					战斗数据.战斗流程[#战斗数据.战斗流程].战斗法术 = 名称
					战斗数据.战斗流程[#战斗数据.战斗流程].寄存目标 = 寄存
				elseif 名称=="破釜沉舟" and n == 1 then
					战斗数据.战斗流程[#战斗数据.战斗流程].全屏22 = 名称
					战斗数据.战斗流程[#战斗数据.战斗流程].寄存目标 = 寄存
				elseif 名称 == '三荒尽灭' then
				    战斗数据.战斗流程[#战斗数据.战斗流程].全屏11 = 名称
				    战斗数据.战斗流程[#战斗数据.战斗流程].寄存目标 = {}
					for k,v in pairs(寄存) do
						战斗数据.战斗流程[#战斗数据.战斗流程].寄存目标[k] = v
					end
					战斗数据.战斗流程[#战斗数据.战斗流程].攻击目标 = {}
				elseif 名称=="困兽之斗" and n == 1 then
					local qx = qz(战斗数据.参战单位[编号].气血*0.1)
					战斗数据:消耗气血(编号,qx)
					战斗数据.战斗流程[#战斗数据.战斗流程].前摇掉血 = qx
				end
				战斗数据.战斗流程[#战斗数据.战斗流程].提示={类型="法术",名称=提示内容x,允许=true}
				if n>1 and 重复提示==false then
					战斗数据.战斗流程[#战斗数据.战斗流程].提示.允许=false
				end
				if n==目标数 then
					战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
				elseif 战斗数据:取行动状态(编号)==false then
					战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
					战斗终止=true
				elseif 战斗数据:取目标状态(编号,目标[n+1],1)==false then --下一个目标死亡时结束
					战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
					战斗终止=true
				end
				if 战斗数据.参战单位[编号].门派 == '九黎城' then
				    if not 战斗数据.参战单位[编号].允许返回 then
				    	战斗数据.战斗流程[#战斗数据.战斗流程].返回=false
				    elseif 战斗数据.参战单位[编号].允许返回 then
				    	if 重复攻击 then
				    	    if n == 目标数 then
				    	        战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
				    	    else
				    	    	战斗数据.战斗流程[#战斗数据.战斗流程].返回=false
				    	    end
				    	else
				    		战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
				    	end
				    end
				    if 战斗数据.参战单位[编号].允许返回==nil then
				    	战斗数据.战斗流程[#战斗数据.战斗流程].返回=true
				    end
				end

				if 名称 == '枫影二刃' then
					战斗数据.战斗流程[#战斗数据.战斗流程].特殊效果 = 名称..n
				end
			end
		end
	end

	local 超反编号=0
		for n=1,#战斗数据.参战单位 do
			if tonumber(目标)~= nil then
				if 目标 == 战斗数据.参战单位[n].主人序号 then
					超反编号 = n
				end
			else
			   for nv = 1,#目标 do
			   	    if 目标[nv] == 战斗数据.参战单位[n].主人序号 then
						超反编号 = n
					end
			   end
			end
		end
	if tonumber(目标)~= nil then
		if 超反编号 ~= 0 and 战斗数据.参战单位[超反编号] ~= nil and 战斗数据.参战单位[超反编号].超级反击~=nil and 战斗数据.参战单位[目标].首次被伤.物理==0 then
			if 超反编号 ~= 0 and 战斗数据.参战单位[目标].类型 == "角色" then
				local 反击伤害=math.floor(战斗数据:取基础物理伤害(超反编号,编号)*1)
				if 反击伤害<1 then 反击伤害=1 end
				战斗数据.战斗流程[#战斗数据.战斗流程].超反编号 = 超反编号
				战斗数据.战斗流程[#战斗数据.战斗流程].超反击伤害=反击伤害
				战斗数据.战斗流程[#战斗数据.战斗流程].超反击死亡=战斗数据:减少气血(编号,反击伤害,超反编号)
				战斗数据.执行等待=战斗数据.执行等待+5
		    end
		    战斗数据.参战单位[目标].首次被伤.物理 = 战斗数据.参战单位[目标].首次被伤.物理 + 1
	    end
	else
	    for nv=1,#目标 do
	    	if 超反编号 ~= 0 and 战斗数据.参战单位[超反编号] ~= nil and 战斗数据.参战单位[超反编号].超级反击~=nil and 战斗数据.参战单位[目标[nv]].首次被伤.物理==0 then
				if 超反编号 ~= 0 and 战斗数据.参战单位[目标[nv]].类型 == "角色" then
					local 反击伤害=math.floor(战斗数据:取基础物理伤害(超反编号,编号)*1)
					if 反击伤害<1 then 反击伤害=1 end
					战斗数据.战斗流程[#战斗数据.战斗流程].超反编号 = 超反编号
					战斗数据.战斗流程[#战斗数据.战斗流程].超反击伤害=反击伤害
					战斗数据.战斗流程[#战斗数据.战斗流程].超反击死亡=战斗数据:减少气血(编号,反击伤害,超反编号)
					战斗数据.执行等待=战斗数据.执行等待+5
			    end
			    战斗数据.参战单位[目标[nv]].首次被伤.物理 = 战斗数据.参战单位[目标[nv]].首次被伤.物理 + 1
			    战斗数据.参战单位[目标[nv]].首次被伤.每回物理 = 战斗数据.参战单位[目标[nv]].首次被伤.每回物理 + 1
		    end
	    end
	end

	返回信息 = self:结尾附加(战斗数据,名称,编号,目标,等级,cs,mcjc) --cs实际攻击次数
	return 返回信息
end

function 物理技能计算:结尾附加(战斗数据,名称,编号,目标,等级,次数,mcjc)
	-----------------接下来是状态流程处理了
	local 结尾气血
	local 返回信息
	if mcjc then
		名称 = mcjc
	end
	if 名称=="横扫千军" or 名称=="破釜沉舟" or 名称=="侵蚀·横扫千军·刻骨" or 名称=="侵蚀·横扫千军·钻心" or 名称=="侵蚀·横扫千军·噬魂" then -- or 名称=="披挂上阵"
		战斗数据:添加状态(名称,战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
		if 战斗数据:取经脉(编号, "大唐官府","神凝") and 战斗数据.参战单位[编号].法术状态.干将莫邪~=nil then
		else
			结尾气血=qz(战斗数据.参战单位[编号].最大气血*0.05)
			if  战斗数据.参战单位[编号].法术状态.侵蚀~=nil then
				结尾气血=结尾气血+math.random(715,1430)
			end
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
			if 战斗数据.参战单位[编号].shenqi.name=="藏锋敛锐" and 取随机数()<=50*战斗数据.参战单位[编号].shenqi.lv+50 then
				战斗计算:添加护盾(战斗数据,编号,结尾气血)
			end
		end
		if 名称=="横扫千军" or 名称=="侵蚀·横扫千军·刻骨" or 名称=="侵蚀·横扫千军·钻心" or 名称=="侵蚀·横扫千军·噬魂"and 战斗数据.参战单位[编号].类型=="角色" then
			if 战斗数据:取经脉(编号, "大唐官府","破军") then
				战斗数据:添加状态("剑意",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
			end
			if 战斗数据:取经脉(编号, "大唐官府","风刃") and 取随机数()<=50 then
				战斗数据:添加状态("风魂", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号],11)
			end
			if 战斗数据:取被动(编号,"连破") then
				local go = false
				local lp = 1
				if 战斗数据.参战单位[编号].勇进~=nil then
					战斗数据.参战单位[编号].勇进=nil
					go=true
				end
				if 战斗数据:取门派是否唯一(编号,"大唐官府") then
					if 战斗数据:取经脉(编号, "大唐官府","孤勇") and 战斗数据:取目标类型(目标[1]) == "召唤兽" and 战斗数据.参战单位[目标[1]].气血<=0 then
						lp = lp + 25
					elseif 战斗数据:取经脉(编号, "大唐官府","熟练") then
						lp = lp + 17
					end
				end
				if 战斗数据.参战单位[编号].亢强~=nil then
					战斗数据.参战单位[编号].亢强 = 0
					if 取随机数() < lp + 战斗数据.参战单位[编号].亢强 then
						go=true
					end
				end
				if 战斗数据.参战单位[编号].新增连破 and 战斗数据.参战单位[编号].新增连破<2 then
					战斗数据.参战单位[编号].新增连破=战斗数据.参战单位[编号].新增连破+1
					go=true
				end
				if go then
					战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=800,攻击方=编号,挨打方=编号}
					战斗数据:取消状态("横扫千军",战斗数据.参战单位[编号])
				end
			end
		elseif 名称=="破釜沉舟" then
			if 战斗数据:取经脉(编号, "大唐官府","风刃") and 取随机数()<=50 then
				战斗数据:添加状态("风魂", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号],11)
			end
		end
	elseif 名称=="披挂上阵" then
		结尾气血=qz(战斗数据.参战单位[编号].最大气血*0.05)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		战斗数据:添加状态("横扫千军",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
		战斗技能:披坚执锐(战斗数据,编号,目标[1],"披挂上阵")
	elseif 名称=="后发制人" then
		战斗数据:取消状态("后发制人",战斗数据.参战单位[编号])
		if 战斗数据:取经脉(编号, "大唐官府","勇武") then
			local 恢复气血 = qz(战斗数据.参战单位[编号].气血上限*0.15)
			if 恢复气血 > 战斗数据.参战单位[编号].等级*10 then
				恢复气血= qz(战斗数据.参战单位[编号].等级*10)
			end
			战斗数据:动画加血流程(编号,恢复气血)
			战斗数据:增加愤怒(编号,10)
			战斗数据.参战单位[目标[1]].受勇武=编号
		else
			结尾气血=qz(战斗数据.参战单位[编号].气血*0.05)
			if 战斗数据.参战单位[编号].气血<=50 then
				结尾气血=1
			end
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		end

	elseif 名称=="翩鸿一击" then
		战斗数据:添加状态("翩鸿一击",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
		if 战斗数据:取经脉(编号, "大唐官府","翩鸿") then
			local fyjn = 战斗数据:解除状态结果(战斗数据.参战单位[目标[1]], 初始技能计算:取可驱散增益状态())
			if #fyjn > 0 then
				local jczt = fyjn[取随机数(1,#fyjn)]
				战斗数据:取消状态(jczt,战斗数据.参战单位[目标[1]])
			end
		end
	elseif 名称=="棒打雄风" then
		local fyjn = 战斗数据:解除状态结果(战斗数据.参战单位[目标[1]], 初始技能计算:取可驱散增益状态())
		if #fyjn > 0 then
			for i=1,#fyjn do
				table.sort(战斗数据.参战单位[目标[1]].法术状态,function(a,b) return a.回合 < b.回合 end)
				战斗数据:取消状态(fyjn[1],战斗数据.参战单位[目标[1]])
				break
			end
		end

	--====================凌波城====================
	elseif 名称=="裂石" then
		战斗数据:增加战意(编号,1)
	elseif 名称=="浪涌" then
		if not 战斗数据:取经脉(编号, "凌波城","战诀") then
			战斗数据:增加战意(编号,1)
		end
	elseif 名称=="腾雷" then
		if 取随机数()<=60 then
			战斗数据:添加状态("腾雷",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],等级)
		end
		if 战斗数据.参战单位[编号].乘势~=nil then
			战斗数据.参战单位[编号].乘势=nil
			战斗数据:添加状态("强袭",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
		end
	elseif 名称=="断岳势" or 名称=="惊涛怒" then --等会儿看
		if 战斗数据.参战单位[编号].法术状态.再战 then
			战斗数据:取消状态("再战",战斗数据.参战单位[编号])
		end
	elseif 名称=="惊涛怒" or 名称=="断岳势" or 名称=="天崩地裂" or 名称=="翻江搅海" then
		if 战斗数据.参战单位[编号].乘势~=nil then
			战斗数据.参战单位[编号].乘势=nil
			战斗数据:添加状态("强袭",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
			if 战斗数据:取经脉(编号, "凌波城","追袭") then
				for i=1,次数 do
					if 战斗数据.参战单位[目标[i]] and 战斗数据.参战单位[目标[i]].气血<=0 then
						战斗数据:添加状态("腾雷",战斗数据.参战单位[目标[i]],战斗数据.参战单位[编号],11)
					end
				end
			end
		end
		if 名称=="天崩地裂" or 名称=="翻江搅海" then
			if 战斗数据:取经脉(编号, "凌波城","石摧") and 取随机数()<=32 then
				战斗数据:增加超级战意(编号, 1)
			end
			if 战斗数据:取经脉(编号,"凌波城","山破") and 取随机数() < 64 then
				战斗数据:增加战意(编号, 1)
			end
			if 战斗数据:取经脉(编号,"凌波城","强袭") then
				战斗数据:添加状态("强袭",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
			end
		end
	elseif 名称=="天神怒斩" then
		local fyjn = 战斗数据:解除状态结果(战斗数据.参战单位[目标[1]], 初始技能计算:取可驱散增益状态(),1)
		if #fyjn > 0 then
			local jczt = fyjn[取随机数(1,#fyjn)]
			战斗数据:取消状态(jczt,战斗数据.参战单位[目标[1]])
		end
	--====================凌波城====================

	elseif 名称=="长驱直入" and 取随机数()<=60 then
		战斗数据:添加状态("重创",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],等级)
	elseif 名称=="摧枯拉朽" then
		战斗数据.参战单位[编号].指令.类型="法术"
		战斗数据.参战单位[编号].指令.参数=战斗数据.参战单位[编号].披坚执锐[战斗数据.参战单位[编号].披坚执锐.可用编号].名称
		战斗数据:法术计算(编号)
	elseif 名称=="天命剑法" then
		结尾气血 = qz(次数*战斗数据.参战单位[编号].最大气血*0.02)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
		战斗数据:添加状态("天命剑法",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
	elseif 名称=="鹰击" or 名称=="疯狂鹰击" then
		战斗数据:添加状态("鹰击",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
		if 战斗数据.参战单位[编号].法术状态.肝胆 and 战斗数据.参战单位[编号].法术状态.肝胆.触发 then
			战斗数据:取消状态("肝胆",战斗数据.参战单位[编号])
		end
	elseif  名称=="侵蚀·鹰击·刻骨" then
			战斗数据:添加状态("鹰击",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
			if 战斗数据.参战单位[编号].法术状态.肝胆 and 战斗数据.参战单位[编号].法术状态.肝胆.触发 then
			战斗数据:取消状态("肝胆",战斗数据.参战单位[编号])
			end
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·鹰击·钻心" then
			战斗数据:添加状态("鹰击",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
			if 战斗数据.参战单位[编号].法术状态.肝胆 and 战斗数据.参战单位[编号].法术状态.肝胆.触发 then
			战斗数据:取消状态("肝胆",战斗数据.参战单位[编号])
			end
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·鹰击·噬魂" then
			战斗数据:添加状态("鹰击",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
			if 战斗数据.参战单位[编号].法术状态.肝胆 and 战斗数据.参战单位[编号].法术状态.肝胆.触发 then
			战斗数据:取消状态("肝胆",战斗数据.参战单位[编号])
		   	end
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif  名称=="侵蚀·天崩地裂·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·天崩地裂·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·天崩地裂·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif  名称=="侵蚀·千蛛噬魂·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·千蛛噬魂·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·千蛛噬魂·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif  名称=="侵蚀·当头一棒·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·当头一棒·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif   名称=="侵蚀·当头一棒·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif 名称=="象形" then
		战斗数据:添加状态("象形",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],等级)
		战斗数据:添加状态("象形（休息）",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
		if 战斗数据:取经脉(编号,"狮驼岭","怒象") and 战斗数据:判定气血百分比(编号,0.3,"气血上限") and 取随机数() <= 70 then
			if 战斗数据.参战单位[编号].法术状态.变身 then
				战斗数据.参战单位[编号].法术状态.变身.回合 = 战斗数据.参战单位[编号].法术状态.变身.回合+2
			end
		else
			if 战斗数据.参战单位[编号].法术状态.狂怒 and 战斗数据.参战单位[编号].法术状态.狂怒.象踏~=nil then
			else
				战斗数据:取消状态("变身",战斗数据.参战单位[编号])
			end
		end
	elseif 名称=="狮搏" then --or 战斗数据:取行动状态(编号)
		if 战斗数据:取目标状态(编号,目标[1],2)==false then
			if 战斗数据:取被动(编号,"狮吼") then
				返回信息="重复狮搏"
			end
		else
			if 战斗数据:取经脉(编号, "狮驼岭","威压") and 30>=取随机数() and 战斗数据:取目标类型(目标[1]) == "召唤兽" then
				战斗数据:添加状态("威慑",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],11,nil,2)
			end
		end
		if 战斗数据.参战单位[编号].法术状态.狂怒 and 战斗数据.参战单位[编号].法术状态.狂怒.狮噬~=nil and 32>=取随机数() then
			返回信息="重复狮搏"
		end
	elseif 名称=="连环击" then
		战斗数据:添加状态("连环击",战斗数据.参战单位[编号],战斗数据.参战单位[编号],等级)
		if 战斗数据:取经脉(编号, "狮驼岭","乱击") then
			战斗数据.参战单位[编号].法术状态.变身.回合=战斗数据.参战单位[编号].法术状态.变身.回合-2
		elseif 战斗数据.参战单位[编号].法术状态.狂怒 and 战斗数据.参战单位[编号].法术状态.狂怒.雄风~=nil then
		else
			战斗数据:取消状态("变身",战斗数据.参战单位[编号])
		end
		if 战斗数据.参战单位[编号].法术状态.肝胆 and 战斗数据.参战单位[编号].法术状态.肝胆.触发 then
			战斗数据:取消状态("肝胆",战斗数据.参战单位[编号])
		end

	elseif 名称=="满天花雨" then
		战斗数据:添加状态("满天花雨",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		if 战斗数据.参战单位[编号].JM.当前流派=="花间美人" then
			if 战斗数据.参战单位[编号].法术状态.自矜 then
				战斗数据:取消状态("自矜",战斗数据.参战单位[编号])
			else
				local gl = 40
				if 战斗数据:取经脉(编号, "女儿村","汹涌") then
					gl = 55
				end
				if 战斗数据:取指定法宝(编号, "曼陀罗") then
					gl = gl + 战斗数据:取指定法宝境界(编号, "曼陀罗") + 5
				end
				if gl>=取随机数() then
					战斗数据:添加状态("自矜",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
					if 战斗数据:取经脉(编号, "女儿村","怒放") then
						战斗数据:增加愤怒(编号,6)
					end
				end
			end
		end
		if 99>=取随机数() and 战斗数据:取封印成功("毒",战斗数据.参战单位[编号].等级,战斗数据.参战单位[编号],战斗数据.参战单位[目标[1]]) then
			战斗数据:添加状态("毒",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],战斗数据.参战单位[编号].等级,nil,"满天花雨")
			战斗数据.参战单位[目标[1]].法术状态.毒.回合=5
			if 战斗数据.参战单位[编号].JM.淬芒 then
				战斗数据:添加状态("淬芒",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
			elseif 战斗数据.参战单位[编号].JM.天香 then
				战斗数据:增加愤怒(编号,5)
			end
		end
		if 战斗数据.参战单位[编号].花谢花飞~=nil then
			战斗数据.参战单位[编号].花谢花飞=nil
			self:物攻技能计算(编号,名称,11,战斗数据)
		end
	elseif 名称=="葬玉焚花" then
		if 战斗数据.参战单位[编号].法术状态.自矜 then
			战斗数据:取消状态("自矜",战斗数据.参战单位[编号])
		else
			local gl = 40
			if 战斗数据:取经脉(编号, "女儿村","汹涌") then
				gl = 55
			end
			if 战斗数据:取指定法宝(编号, "曼陀罗") then
				gl = gl + 战斗数据:取指定法宝境界(编号, "曼陀罗") + 5
			end
			if gl>=取随机数() then
				战斗数据:添加状态("自矜",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				if 战斗数据:取经脉(编号, "女儿村","怒放") then
					战斗数据:增加愤怒(编号,6)
				end
			end
		end
	elseif  名称=="侵蚀·葬玉焚花·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		if 战斗数据.参战单位[编号].法术状态.自矜 then
			战斗数据:取消状态("自矜",战斗数据.参战单位[编号])
		else
			local gl = 40
			if 战斗数据:取经脉(编号, "女儿村","汹涌") then
				gl = 55
			end
			if 战斗数据:取指定法宝(编号, "曼陀罗") then
				gl = gl + 战斗数据:取指定法宝境界(编号, "曼陀罗") + 5
			end
			if gl>=取随机数() then
				战斗数据:添加状态("自矜",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				if 战斗数据:取经脉(编号, "女儿村","怒放") then
					战斗数据:增加愤怒(编号,6)
				end
			end
		end
		elseif   名称=="侵蚀·葬玉焚花·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		if 战斗数据.参战单位[编号].法术状态.自矜 then
			战斗数据:取消状态("自矜",战斗数据.参战单位[编号])
		else
			local gl = 40
			if 战斗数据:取经脉(编号, "女儿村","汹涌") then
				gl = 55
			end
			if 战斗数据:取指定法宝(编号, "曼陀罗") then
				gl = gl + 战斗数据:取指定法宝境界(编号, "曼陀罗") + 5
			end
			if gl>=取随机数() then
				战斗数据:添加状态("自矜",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				if 战斗数据:取经脉(编号, "女儿村","怒放") then
					战斗数据:增加愤怒(编号,6)
				end
			end
		end
		elseif   名称=="侵蚀·葬玉焚花·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		if 战斗数据.参战单位[编号].法术状态.自矜 then
			战斗数据:取消状态("自矜",战斗数据.参战单位[编号])
		else
			local gl = 40
			if 战斗数据:取经脉(编号, "女儿村","汹涌") then
				gl = 55
			end
			if 战斗数据:取指定法宝(编号, "曼陀罗") then
				gl = gl + 战斗数据:取指定法宝境界(编号, "曼陀罗") + 5
			end
			if gl>=取随机数() then
				战斗数据:添加状态("自矜",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
				if 战斗数据:取经脉(编号, "女儿村","怒放") then
					战斗数据:增加愤怒(编号,6)
				end
			end
		end
		elseif  名称=="侵蚀·敲金击玉·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·敲金击玉·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·敲金击玉·噬魂" then
		    local 侵蚀消耗=math.random(800,100)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif  名称=="侵蚀·烟雨剑法·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·烟雨剑法·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·烟雨剑法·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif  名称=="侵蚀·五行攻击·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·五行攻击·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·五行攻击·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif  名称=="侵蚀·风雷斩·霹雳·刻骨" then
		    local 侵蚀消耗=math.random(500,700)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·风雷斩·霹雳·钻心" then
		    local 侵蚀消耗=math.random(600,800)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
		elseif   名称=="侵蚀·风雷斩·霹雳·噬魂" then
		    local 侵蚀消耗=math.random(800,1000)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,侵蚀消耗,编号)
			战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=侵蚀消耗
	elseif 名称 == "蛛丝缠绕" then
		战斗数据:添加状态("天罗地网",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],69,nil,4)
	elseif (名称=="烟雨剑法" or 名称=="侵蚀·烟雨剑法·刻骨" or 名称=="侵蚀·烟雨剑法·钻心" or 名称=="侵蚀·烟雨剑法·噬魂" )then
		if 战斗数据:取被动(编号, "骤雨") then
			local sx=3
			if 战斗数据:取经脉(编号,"五庄观","滂沱") then
				sx = 5
			end
			if 战斗数据.参战单位[编号].骤雨.层数<sx then
				战斗数据.参战单位[编号].骤雨.层数=战斗数据.参战单位[编号].骤雨.层数+1
			end
			战斗数据.参战单位[编号].骤雨.回合=3
			-- 战斗数据:添加状态("骤雨",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
		end
		-- 战斗数据.参战单位[编号].战意=战斗数据.参战单位[编号].战意+1
	elseif 名称=="落土止息" then
		战斗数据.参战单位[编号].人参果={枚=0,回合=4}
		战斗数据:添加状态("落土止息",战斗数据.参战单位[编号],战斗数据.参战单位[编号],69)
	elseif 名称=="威震凌霄" then
		战斗数据:添加状态("威震凌霄",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],69)
	elseif 战斗数据.参战单位[编号].法术状态.噬毒~=nil and (名称=="六道无量" or 名称=="百爪狂杀") then
		战斗数据:取消状态("噬毒",战斗数据.参战单位[编号])
	elseif 名称=="剑荡四方" then
		结尾气血=qz(战斗数据.参战单位[编号].气血*0.1)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾死亡=战斗数据:减少气血(编号,结尾气血,编号)
		战斗数据.战斗流程[#战斗数据.战斗流程].结尾气血=结尾气血
	elseif 名称=="死亡召唤" and 取随机数() <= 10 and 战斗数据.参战单位[目标[1]].法术状态.死亡召唤 == nil then
		战斗数据:添加状态("死亡召唤",战斗数据.参战单位[目标[1]],战斗数据.参战单位[编号],战斗数据.参战单位[编号].等级)
	--============================特技技能附加================================
	elseif 名称=="破血狂攻" then
		if 战斗数据:取经脉(编号,"盘丝洞","制怒") and 战斗数据.参战单位[目标[1]].法术状态.天罗地网~=nil then
			战斗数据:增加愤怒(编号,12)
		end
	end

	if 战斗数据.参战单位[编号].法术状态.狂袭 and 战斗数据.参战单位[编号].法术状态.狂袭.死亡 then
		战斗计算:添加掉血(战斗数据,编号,战斗数据.参战单位[编号].气血,编号)
	end
	return 返回信息
end



function 物理技能计算:物攻技能计算1(编号,目标,起始伤害,叠加伤害,返回,允许保护,次数,技能名称,战斗数据)
	-- 战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=1,攻击方=编号,挨打方={[1]={挨打方=目标,特效={}}}}
	if 九黎城攻击技能[技能名称] then
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={多次攻击 = 1 , 技能 = 技能名称 , 流程=1,攻击方=编号,挨打方={[1]={挨打方=目标,特效={}}}}
	else
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=1,攻击方=编号,挨打方={[1]={挨打方=目标,特效={}}}}
	end
	local 当前流程 = #战斗数据.战斗流程
	if 装备特技[技能名称]~=nil then
		战斗数据.战斗流程[#战斗数据.战斗流程].特技名称=技能名称
	end
	if 返回 then
		战斗数据.执行等待=战斗数据.执行等待+10
	else
		战斗数据.执行等待=战斗数据.执行等待+5
	end
	-- if 战斗数据.参战单位[目标].法术状态.分身术~=nil and 战斗数据.参战单位[目标].法术状态.分身术.破解==nil then
	-- 	战斗数据.参战单位[目标].法术状态.分身术.破解=1
	-- 	战斗数据.战斗流程[#战斗数据.战斗流程].免疫=true
	-- 	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].动作="待战"
	--     return
 --    end
	local  必杀=false
	local  躲避=false
	local  防御=false
	local  反震=false
	local  必杀几率,暴击倍率 = 0,2
	local 浮空概率 = 0

	--------=======================================--------
	local  伤害=战斗数据:取基础物理伤害(编号,目标,技能名称)
	--------=======================================--------

	伤害 = 伤害*(起始伤害+叠加伤害*(次数-1))


	--这里可以添加状态--这里可以添加状态--这里可以添加状态--这里可以添加目标状态，单次的状态都可以添加在这

	if 技能名称 == "高级连击" then
		if 战斗数据.参战单位[编号].气贯长虹 then
			if 战斗数据.参战单位[编号].连击>=55 then
				伤害 =qz(伤害*1.5)
			else
				伤害 =qz(伤害*1.25)
			end
		end
		if 战斗数据.参战单位[编号].阴伤~=nil and 次数==2 then
			伤害 =伤害 + 战斗数据.参战单位[编号].阴伤
		end
		if 战斗数据.参战单位[编号].碎甲刃~=nil and 20>=取随机数() then
			战斗数据:添加状态("碎甲刃",战斗数据.参战单位[目标],战斗数据.参战单位[编号],战斗数据.参战单位[编号].碎甲刃)
		end
	elseif 技能名称 == "超级连击" then
		if 战斗数据.参战单位[编号].气贯长虹 then
			if 战斗数据.参战单位[编号].连击>=55 then
				伤害 =qz(伤害*1.5)
			else
				伤害 =qz(伤害*1.25)
			end
		end
		if 战斗数据.参战单位[编号].阴伤~=nil and 次数==2 then
			伤害 =伤害 + 战斗数据.参战单位[编号].阴伤
		end
		if 战斗数据.参战单位[编号].碎甲刃~=nil and 20>=取随机数() then
			战斗数据:添加状态("碎甲刃",战斗数据.参战单位[目标],战斗数据.参战单位[编号],战斗数据.参战单位[编号].碎甲刃)
		end
	elseif 技能名称 == "理直气壮" then
		if 战斗数据.参战单位[编号].碎甲刃~=nil and 20>=取随机数() then
			战斗数据:添加状态("碎甲刃",战斗数据.参战单位[目标],战斗数据.参战单位[编号],战斗数据.参战单位[编号].碎甲刃)
		end
	elseif 技能名称 == '枫影二刃' then
	    if 战斗数据.参战单位[目标].类型 == "bb" and 战斗数据.参战单位[编号].枫魂增伤 ~= nil then
			伤害 = 伤害 * 战斗数据.参战单位[编号].枫魂增伤
		end
		if 战斗数据:取经脉(编号,'九黎城' , "怒刃") and not 战斗数据.PK战斗 then
			if 战斗数据.参战单位[编号].铸斧 then
				伤害 = 伤害 * 1.5
			else
				伤害 = 伤害 * 1.25
			end
		end
	elseif 技能名称 == '一斧开天' then
		if 战斗数据:取经脉(编号,'九黎城' , "得势") then
		    伤害 = 伤害 * 1.15
		end
		浮空概率 = 45
		if 战斗数据:取经脉(编号,'九黎城' , "乘风") then
		    浮空概率 = 浮空概率 + 55
		end
	elseif 名称 == "三荒尽灭" then
		if 战斗数据:取经脉(编号,'九黎城' , "俾睨") then
		    伤害 = 伤害 * 1.15
		end
		浮空概率 = 45
		if 战斗数据:取经脉(编号,'九黎城' , "乘风") then
		    浮空概率 = 浮空概率 + 10
		end
	elseif 技能名称 == "力劈华山" then
		local cha = 战斗数据.参战单位[编号].伤害 - 战斗数据.参战单位[目标].伤害
		if cha>= 战斗数据.参战单位[编号].等级 * 8 then
			cha = 战斗数据.参战单位[编号].等级 * 8
		end
		伤害 = 伤害 +  cha
		if 战斗数据.参战单位[目标].玉砥柱 then
			伤害 = 伤害 * (1 - 战斗数据.参战单位[目标].玉砥柱)
		end
	elseif 技能名称 == "死亡召唤" or 技能名称 == "惊心一剑" then
		if 战斗数据.参战单位[目标].玉砥柱 then
			伤害 = 伤害 * (1 - 战斗数据.参战单位[目标].玉砥柱)
		end
	--===================大唐===================
	elseif 技能名称 == "后发制人" then
		if 战斗数据:取经脉(编号, "大唐官府", "目空") then
			伤害 = 伤害 + 战斗数据.参战单位[目标].防御 * 0.1
		end
		if 战斗数据:取经脉(编号, "大唐官府", "勇武") then
			伤害 = 伤害 + 战斗数据.参战单位[目标].防御 * 0.4
		end
	elseif 技能名称 == "披挂上阵" then
		伤害 = 伤害*0.8
	--===================凌波城===================

	elseif 技能名称=="翻江搅海" then
		if 战斗数据:取经脉(编号, "凌波城", "无双") then
			伤害 = 伤害*1.12
		end
	elseif 技能名称 == "天崩地裂" then
		if 战斗数据:取经脉(编号, "凌波城", "无双") then
			必杀几率 = 必杀几率 + 15
		end
		if 战斗数据:取经脉(编号,"凌波城","力战") then
			伤害 = 伤害*1.12
		end
	elseif 技能名称 == "侵蚀·天崩地裂·刻骨" then
		必杀几率 = 必杀几率*1.1
	elseif 技能名称 == "侵蚀·天崩地裂·钻心" then
		必杀几率 = 必杀几率*1.12
	elseif 技能名称 == "侵蚀·天崩地裂·噬魂" then
		必杀几率 = 必杀几率*1.15
	elseif 技能名称=="天神怒斩" then
		必杀几率 = 必杀几率+25

	--===================狮驼岭===================
	elseif 技能名称=="连环击" then
		if 战斗数据:取经脉(编号, "狮驼岭", "乱击") then
			伤害 = 伤害 * 1.1
			伤害 = 伤害 + 战斗数据:取技能等级(编号,"狂兽诀")
		end
	elseif 技能名称=="鹰击" or 技能名称=="侵蚀·鹰击·刻骨" or 技能名称=="侵蚀·鹰击·钻心" or 技能名称=="侵蚀·鹰击·噬魂" then
		if 战斗数据:取经脉(编号,"狮驼岭","鹰啸") and 战斗数据:取目标类型(目标) == "召唤兽" then
			战斗数据:添加状态("鹰啸",战斗数据.参战单位[目标],战斗数据.参战单位[编号],11)
		end
		if 战斗数据.参战单位[编号].死地~=nil then
			战斗数据.参战单位[编号].死地=2
			伤害 = 伤害 + 200
		end

	--===================花果山===================
	elseif 技能名称=="当头一棒" then --一会儿参考当头一棒给出结论倒地是 做物理影响，还是做技能判断
		if 战斗数据.参战单位[目标].气血>=战斗数据.参战单位[目标].最大气血*0.6 and 战斗数据.参战单位[目标].气血<=战斗数据.参战单位[目标].最大气血*0.7 then
			伤害 = 伤害 * 2
		end
		if 战斗数据:取经脉(编号,"花果山", "闹天") then
			伤害 = 伤害 * 1.15
		end
		if 战斗数据:取经脉(编号,"花果山", "通天") and 战斗数据.参战单位[目标].法术状态.显圣~=nil then
			伤害 = 伤害 * 1.15
		end
	elseif 技能名称=="侵蚀·当头一棒·刻骨" then --一会儿参考当头一棒给出结论倒地是 做物理影响，还是做技能判断
		if 战斗数据.参战单位[目标].气血>=战斗数据.参战单位[目标].最大气血*0.6 and 战斗数据.参战单位[目标].气血<=战斗数据.参战单位[目标].最大气血*0.7 then
			伤害 = 伤害 * 2.4
		end
		if 战斗数据:取经脉(编号,"花果山", "闹天") then
			伤害 = 伤害 * 1.15
		end
		if 战斗数据:取经脉(编号,"花果山", "通天") and 战斗数据.参战单位[目标].法术状态.显圣~=nil then
			伤害 = 伤害 * 1.15
		end
	elseif 技能名称=="侵蚀·当头一棒·钻心" then --一会儿参考当头一棒给出结论倒地是 做物理影响，还是做技能判断
		if 战斗数据.参战单位[目标].气血>=战斗数据.参战单位[目标].最大气血*0.6 and 战斗数据.参战单位[目标].气血<=战斗数据.参战单位[目标].最大气血*0.7 then
			伤害 = 伤害 * 2.6
		end
		if 战斗数据:取经脉(编号,"花果山", "闹天") then
			伤害 = 伤害 * 1.15
		end
		if 战斗数据:取经脉(编号,"花果山", "通天") and 战斗数据.参战单位[目标].法术状态.显圣~=nil then
			伤害 = 伤害 * 1.15
		end
	elseif 技能名称=="侵蚀·当头一棒·噬魂" then --一会儿参考当头一棒给出结论倒地是 做物理影响，还是做技能判断
		if 战斗数据.参战单位[目标].气血>=战斗数据.参战单位[目标].最大气血*0.6 and 战斗数据.参战单位[目标].气血<=战斗数据.参战单位[目标].最大气血*0.7 then
			伤害 = 伤害 * 3
		end
		if 战斗数据:取经脉(编号,"花果山", "闹天") then
			伤害 = 伤害 * 1.15
		end
		if 战斗数据:取经脉(编号,"花果山", "通天") and 战斗数据.参战单位[目标].法术状态.显圣~=nil then
			伤害 = 伤害 * 1.15
		end
	elseif 技能名称=="神针撼海" then
		if 战斗数据:取经脉(编号,"花果山", "填海") then
			local gl = 0
			if 战斗数据:取装备五行(编号,3)=="土" then --武器
				gl = gl + 5
			end
			if 战斗数据:取装备五行(编号,4)=="土" then --衣服
				gl = gl + 5
			end
			if 取随机数()<=gl then
				伤害 = 伤害*2
			end
		end
		if 战斗数据:取经脉(编号,"花果山", "通天") and 战斗数据.参战单位[目标].法术状态.显圣~=nil then
			伤害 = 伤害 * 1.15
		end
	--===================盘丝洞===================
	elseif (技能名称 == "千蛛噬魂" or 技能名称 == "侵蚀·千蛛噬魂·刻骨" or 技能名称 == "侵蚀·千蛛噬魂·钻心" or 技能名称 == "侵蚀·千蛛噬魂·噬魂")then
		if 战斗数据.参战单位[目标].法术状态.天罗地网~=nil  then
			伤害 = 伤害 * 1.1
		end
		if 战斗数据:取经脉(编号,"盘丝洞","天网") and sj()<=3 then
			战斗数据:添加状态("天罗地网",战斗数据.参战单位[目标],战斗数据.参战单位[编号],11,nil,4)
		end
		if 战斗数据:取经脉(编号,"盘丝洞","千蛛") and 战斗数据:取目标类型(目标) == "召唤兽" then
			伤害 = 伤害 * 1.12
		end
		if 战斗数据:取经脉(编号, "盘丝洞", "狂击") then
			必杀几率 = 必杀几率 + 4
		end
	elseif 技能名称 == "蛛丝缠绕" then
		if 战斗数据:取经脉(编号,"盘丝洞","引诛") and 战斗数据:取目标类型(目标) == "玩家" then
			伤害 = 伤害 * 1.06
		end
	elseif 名称=="绝命毒牙" then
		if 战斗数据.参战单位[目标].法术状态.天罗地网~=nil  then
			伤害 = 伤害 * (1+战斗数据.参战单位[目标].法术状态.天罗地网.回合*0.1)
		end
	--===================五庄观===================
		elseif 技能名称=="烟雨剑法" or 技能名称=="飘渺式"  or 名称=="侵蚀·烟雨剑法·刻骨" or 名称=="侵蚀·烟雨剑法·钻心" or 名称=="侵蚀·烟雨剑法·噬魂" then
		local lssh = 0
		if 战斗数据.参战单位[编号].烟雨飘摇 then
			lssh=战斗数据.参战单位[编号].烟雨飘摇
		end
		伤害 = 伤害+lssh
		if (名称=="烟雨剑法" or 名称=="侵蚀·烟雨剑法·刻骨" or 名称=="侵蚀·烟雨剑法·钻心" or 名称=="侵蚀·烟雨剑法·噬魂" ) and 战斗数据:取经脉(编号, "五庄观", "雨杀") and 次数==2 and 战斗数据.参战单位[目标].类型~="角色" then
			战斗数据.参战单位[编号].雨杀=1
		end
	elseif 技能名称=="敲金击玉" then
		if 战斗数据:取经脉(编号, "五庄观", "刺果") and 战斗数据:取目标类型(目标) == "召唤兽" then
			伤害 = 伤害 *1.2
		end
		if 战斗数据:取经脉(编号, "五庄观", "还元") and 战斗数据.参战单位[编号].人参果.枚>=3 then
			战斗数据:添加状态("还元",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
		end
		战斗数据:增加人参果(编号)

	elseif 技能名称=="同伤式" then
		local 速度差 = math.abs(战斗数据.参战单位[编号].速度 - 战斗数据.参战单位[目标].速度)
		if 速度差 < 1 then 速度差 = 0 end
		战斗数据:解除状态结果(战斗数据.参战单位[编号], 初始技能计算:取增益状态法术())
		伤害 = 速度差 * 3 + 伤害

	--===================天宫===================
	elseif 技能名称=="天雷斩" then --这里添加状态
		local lssh = 0
		if 战斗数据.参战单位[编号].天雷地火 then
			lssh=lssh+战斗数据.参战单位[编号].天雷地火
		end
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		if 战斗数据:取经脉(编号,"天宫","疾雷") and not 战斗数据.PK战斗 then
			lssh = lssh + (战斗数据.参战单位[编号].敏捷-战斗数据.参战单位[编号].等级)*0.6
		end
		伤害 = 伤害 + lssh
		if 战斗数据.参战单位[目标].法术状态.天雷斩==nil then
			战斗数据:添加状态("天雷斩",战斗数据.参战单位[目标],战斗数据.参战单位[编号],战斗数据:取技能等级(编号,"天雷斩"))
		end
		if 战斗数据.参战单位[编号].shenqi.name=="裂帛" and 次数 ==1 then
			伤害 = 伤害 * (1+0.08*战斗数据.参战单位[编号].shenqi.lv)
		end
	elseif 技能名称=="风雷斩" then
		local lssh = 0
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		if 战斗数据.参战单位[编号].法术状态.雷怒霆激 and 战斗数据.参战单位[编号].法术状态.霹雳弦惊 and 次数==1 then
			伤害 = 伤害 * 1.35
		end
		伤害 = 伤害 + lssh
	elseif 技能名称=="风雷斩·飞霆" then --有天雷灌注会不会取消这个状态》？
		local lssh = 0
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		伤害 = 伤害 + lssh
	elseif 技能名称=="风雷斩·霹雳" then
		local lssh = 0
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		伤害 = 伤害 + lssh
	elseif 技能名称=="侵蚀·风雷斩·霹雳·刻骨" then
		local lssh = 0
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		伤害 = 伤害 + lssh
	elseif 技能名称=="侵蚀·风雷斩·霹雳·噬魂" then
		local lssh = 0
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		伤害 = 伤害 + lssh
	elseif 技能名称=="侵蚀·风雷斩·霹雳·钻心" then
		local lssh = 0
		if 战斗数据:取指定法宝(编号,"伏魔天书") then
			if 战斗数据:取经脉(编号,"天宫","伏魔") then
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30)*1.5)
			else
				lssh=lssh+qz(战斗数据:取指定法宝境界(编号,"伏魔天书")/2*取随机数(20,30))
			end
		end
		伤害 = 伤害 + lssh
	--===================地府===================
	elseif 技能名称=="六道无量" then
		if 战斗数据.参战单位[目标].类型=="角色" then
			local cha = qz((战斗数据.参战单位[编号].防御-战斗数据.参战单位[目标].防御)*0.75)
			cha = math.abs(cha)
			if cha>战斗数据.参战单位[编号].等级*1.6+70 then
				cha=qz(战斗数据.参战单位[编号].等级*1.6+70)
			end
			战斗数据:添加状态("六道无量",战斗数据.参战单位[目标],战斗数据.参战单位[编号],11,nil,cha)
			战斗数据:添加状态("六道无量",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11,nil,cha)
		end
		if 战斗数据.参战单位[编号].阎罗~=nil and 战斗数据.参战单位[编号].阎罗~=战斗数据.回合数 then
			战斗数据.参战单位[编号].阎罗=nil
			伤害 = 伤害 *1.5
		end
		if 战斗数据.参战单位[编号].法术状态.噬毒~=nil then
			必杀几率 = 必杀几率 + 10
			伤害 = 伤害 * 1.6
		end
	elseif 技能名称=="百爪狂杀" then
		if 战斗数据.参战单位[编号].法术状态.噬毒~=nil then
			伤害 = 伤害 * 1.6
		end
	elseif 技能名称=="百鬼噬魂" then
		local gl = 20
		if 战斗数据:取经脉(编号,"阴曹地府","阴翳") then
			gl = gl +12
		end
		if 战斗数据.参战单位[目标].法术状态.摄魂 and 战斗数据.参战单位[目标].法术状态.摄魂.攻击编号==编号 and 战斗数据:取经脉(编号,"阴曹地府","入魂") then
			gl = gl +50
		end
		if 战斗数据:取经脉(编号,"阴曹地府","蚀骨") and 战斗数据:敌方指定状态数量(编号,"尸腐毒")==0 then
			gl = gl +15
		end
		if sj()<=gl then
			战斗数据:添加状态("尸腐毒",战斗数据.参战单位[目标],战斗数据.参战单位[编号],战斗数据:取技能等级(编号,"百鬼噬魂"))
		end
	elseif 技能名称=="血影蚀心" then
		local gl = 30
		if 战斗数据:取经脉(编号,"阴曹地府","阴翳") then
			gl = gl +12
		end
		if 战斗数据.参战单位[目标].法术状态.摄魂 and 战斗数据.参战单位[目标].法术状态.摄魂.攻击编号==编号 and 战斗数据:取经脉(编号,"阴曹地府","入魂") then
			gl = gl +50
		end
		if 战斗数据:取经脉(编号,"阴曹地府","蚀骨") and 战斗数据:敌方指定状态数量(编号,"尸腐毒")==0 then
			gl = gl +15
		end
		if sj()<=gl then
			战斗数据:添加状态("尸腐毒",战斗数据.参战单位[目标],战斗数据.参战单位[编号],战斗数据:取技能等级(编号,"百鬼噬魂"))
		end
	elseif 技能名称=="无赦咒令" then
		local lszy = 战斗数据:解除状态结果(战斗数据.参战单位[目标],初始技能计算:取可驱散增益状态(), 1)
		if #lszy>0 then
			local jczt = lszy[取随机数(1,#lszy)]
			战斗数据:取消状态(jczt, 战斗数据.参战单位[目标])
		end
		if 战斗数据.参战单位[目标].法术状态.尸腐毒 or 战斗数据.参战单位[目标].法术状态.毒 then
			local lszy = 战斗数据:解除状态结果(战斗数据.参战单位[目标],初始技能计算:取可驱散增益状态(), 1)
			if #lszy>0 then
				local jczt = lszy[取随机数(1,#lszy)]
				战斗数据:取消状态(jczt, 战斗数据.参战单位[目标])
			end
		end
	--===================女儿村===================
	elseif 技能名称=="自矜" then
		local xs = 0.6
		if 战斗数据:取经脉(编号, "女儿村","花刺") then
			xs = 0.8
		end
		if 战斗数据.参战单位[目标].法术状态.毒 and 战斗数据.参战单位[目标].法术状态.门派=="女儿村" then
			xs = xs + 0.12
		end
		if 战斗数据:取经脉(编号, "女儿村","乘胜") and 战斗数据.参战单位[目标].气血<=战斗数据.参战单位[目标].最大气血*0.3 then
			xs = xs + 0.1
		end
		伤害 = 伤害 * xs
	elseif 技能名称=="生杀予夺" and 战斗数据.参战单位[目标].法术状态.尸腐毒 then
		暴击倍率 =3.2
	--===================宝宝技能===================
	elseif 技能名称=="水击三千" then
		伤害=伤害+战斗数据.参战单位[编号].等级
		暴击倍率 =2.6
		if 战斗数据.参战单位[编号].唯一鲲鹏~=nil then
			伤害 = 伤害 *1.6
		end
	-------花果山
	-- elseif 技能名称=="杀威铁棒" then
	end
	if 浮空概率 > 0 and 战斗数据:取是否有指定状态(编号, 编号, "怒哮") then
		浮空概率 = 浮空概率 + 30
	end
	if 战斗数据:取经脉(编号,'九黎城', "识破") and 战斗数据:取是否五行相克(战斗数据.参战单位[编号].攻击五行, 战斗数据.参战单位[目标].防御五行) then
		浮空概率 = 浮空概率 + 10
	end


-----------------------------------------18奇技九黎城1---------------------------不包含三荒尽灭的浮空率 三荒单独处理了
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"九黎城A") >=1 and 战斗数据.参战单位[编号].门派=="九黎城" and not 战斗数据.PK战斗 then
				浮空概率 = 浮空概率 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"九黎城A")/4
  			end
-----------------------------------------18奇技九黎城1---------------------------



	if 战斗数据.参战单位[目标].九黎浮空 == nil then
		if 浮空概率 > 0 and 取随机数() <= 浮空概率 then
			战斗数据.参战单位[编号].浮空人数 = (战斗数据.参战单位[编号].浮空人数 or 0) + 1
			战斗数据.参战单位[目标].九黎浮空 = 编号
			-- local 临时状态 = {{浮空 = 1,挨打方 = 目标}}
			-- 战斗数据.战斗流程[#战斗数据.战斗流程 + 1] = {流程 = 1024,攻击方 = 编号,挨打方 = {}}
			-- for i=1,#临时状态 do
			-- 	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[#战斗数据.战斗流程[#战斗数据.战斗流程].挨打方 + 1] = 临时状态[i]
			-- end
			战斗数据.战斗流程[当前流程].浮空目标 = 目标

			战斗数据:取消状态("怒哮", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号])

			if 战斗数据.参战单位[编号].飞扬生效 ~= nil and 战斗数据.参战单位[编号].浮空人数 == 5 and (战斗数据.参战单位[编号].飞扬次数 or 0) < 3 then
				战斗数据.参战单位[编号].飞扬增伤 = (战斗数据.参战单位[编号].飞扬增伤 or 1) + 0.06
				战斗数据.参战单位[编号].飞扬次数 = (战斗数据.参战单位[编号].飞扬次数 or 0) + 1
			end
			if 战斗数据.参战单位[编号].shenqi and 战斗数据.参战单位[编号].shenqi.name == '鸣空' then
			    if 战斗数据.参战单位[编号].神器加成 < 6 then
			        战斗数据.参战单位[编号].神器加成 = 战斗数据.参战单位[编号].神器加成 + 1
			    end
			    必杀几率 = 必杀几率 + 战斗数据.参战单位[编号].shenqi.lv * 12
			end
			if 技能名称 == "一斧开天" then
				战斗数据.战斗流程[当前流程].致使浮空 = true
			end
		else
			if 技能名称 == "一斧开天" then
				战斗数据.战斗流程[当前流程].未浮空 = true
				local gl = 26
				if 战斗数据:取经脉(编号,'九黎城', "震怒") then
					gl = gl * 2
				end
				if 取随机数() <= gl then
					战斗数据:添加状态("怒哮", 战斗数据.参战单位[编号],战斗数据.参战单位[编号])
				end
			end
		end
	end

	伤害=qz(伤害)
	--------=======================================--------
	local  最终伤害=战斗数据:取最终物理伤害(编号,目标,伤害,必杀几率,暴击倍率,技能名称)
	--------=======================================--------
	local  保护=false
	local  保护编号=0
	if 战斗数据.参战单位[目标].类型 == "角色" and 战斗数据.参战单位[目标].气血 < 战斗数据.参战单位[目标].最大气血*0.5 and 最终伤害.伤害*0.3 < 战斗数据.参战单位[目标].气血 and 最终伤害.伤害 > 战斗数据.参战单位[目标].最大气血*0.1  and 取随机数() < 70 and 友伤 == nil then
		local 随机保护 = {}
		for n=1,#战斗数据.参战单位 do
			if 保护编号==0 and 战斗数据:取行动状态(n) and 战斗数据.参战单位[目标].法术状态.惊魂掌==nil and 战斗数据.参战单位[n].队伍==战斗数据.参战单位[目标].队伍 and 战斗数据.参战单位[n].类型 == "角色" and n ~= 目标 then
				table.insert(随机保护,n)
			end
		end
		if #随机保护 >= 1 then
			保护编号 = 随机保护[取随机数(1,#随机保护)]
			保护=true
			战斗数据.执行等待=战斗数据.执行等待+5
		end
	else
		for n=1,#战斗数据.参战单位 do
			if 保护编号==0 and 战斗数据:取行动状态(n) and 战斗数据.参战单位[目标].法术状态.惊魂掌==nil  and 战斗数据.参战单位[n].指令 ~= nil and 战斗数据.参战单位[n].指令.类型=="保护" and  战斗数据.参战单位[n].队伍==战斗数据.参战单位[目标].队伍 and  战斗数据.参战单位[n].指令.目标==目标 then
				保护编号=n
				保护=true
				战斗数据.参战单位[n].指令.类型=""
				战斗数据.执行等待=战斗数据.执行等待+5
			end
		end
	end
	if 战斗数据.参战单位[目标].指令 ~= nil and 战斗数据.参战单位[目标].指令.类型 == "防御" and 战斗数据:取行动状态(目标) and 战斗数据:取可否防御(目标) then
		if 技能名称=="壁垒击破" then
			最终伤害.伤害 = 最终伤害.伤害 * 1.2
		else
			最终伤害.伤害 = 最终伤害.伤害 * 0.5
		end
		最终伤害.动作 = "防御"
		防御 = true
		if 战斗数据.参战单位[目标].点石成金 then
		   最终伤害.伤害=最终伤害.伤害*战斗数据.参战单位[目标].点石成金
		end
		if 战斗数据.参战单位[目标].法术状态.愈勇 then
			战斗数据:取消状态("愈勇",战斗数据.参战单位[目标])
		end
	end
	local csjc = 0
	if 战斗数据:取经脉(编号,'九黎城', "狂暴") then
		for w = 1, #最终伤害.特效 do
			if 最终伤害.特效[i] == "暴击" then
				csjc = csjc + 1
			end
		end
	end
	战斗数据:九黎城连击数处理(编号, 1 + csjc)
	--------=======================================--------
	local  结果 = 战斗数据:取伤害结果(编号,目标,最终伤害.伤害,最终伤害.暴击,保护,2,技能名称,防御)
	--------=======================================--------
	if 战斗数据:取目标类型(编号) == "召唤兽" and 技能名称 then
		if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍]~=nil and 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意~=nil then
			if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.回合~=战斗数据.回合数 then --代表新的回合.做清空处理.必定触发
				战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意={技能={},回合=战斗数据.回合数}
				if 战斗数据.参战单位[编号].出其不意~=nil then
					结果.伤害=qz(结果.伤害*1.15)
				end
			else
				if 战斗数据.参战单位[编号].出其不意~=nil then
					local go = true
					for k,v in pairs(战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能) do
						if v==技能名称 then
							go = false
							break
						end
					end
					if go then
						结果.伤害=qz(结果.伤害*1.15)
					end
				end
			end
			战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能[#战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能+1]=技能名称
		end
	end
	if 战斗数据.参战单位[目标].共生 ~= nil then
		战斗技能:物理共生计算(战斗数据,编号,目标,qz(结果.伤害+1),最终伤害.动作,结果.特效,返回)
		return
	end
	------------------------------------------------------
	if 技能名称=="横扫千军" or 名称=="侵蚀·横扫千军·刻骨" or 名称=="侵蚀·横扫千军·钻心" or 名称=="侵蚀·横扫千军·噬魂"and 战斗数据.参战单位[编号].队伍~=0 then
		if not 战斗数据.PK战斗 and 战斗数据.参战单位[编号].jianshe and 战斗数据:取经脉(编号,"大唐官府", "扶阵") then
			local 目标数 = 3
			local 溅射目标=战斗数据:取多个溅射目标(编号,目标,目标数+1)
			for i=1,#溅射目标 do
				if 溅射目标[i] ~= 目标 and 目标数~=0 then
					战斗计算:添加掉血(战斗数据,溅射目标[i],结果.伤害* 战斗数据.参战单位[编号].jianshe,编号)
				end
			end
		else
			local 溅射比例=0.45
-----------------------------------------18奇技大唐1---------------------------
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"大唐官府A") >=1 and not 战斗数据.PK战斗 then
				溅射比例 = 溅射比例 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"大唐官府A")/300
				if 战斗数据.参战单位[编号].法术状态["剑意"]==nil then
					战斗数据:添加状态("剑意",战斗数据.参战单位[编号],战斗数据.参战单位[编号],11)
					if 战斗数据.参战单位[编号].法术状态["剑意"]  then
						战斗数据.参战单位[编号].法术状态["剑意"].层数=11
  					end
  				end
  			end
-----------------------------------------18奇技大唐1---------------------------
			if 战斗数据.参战单位[编号].法术状态["剑意"] and 战斗数据.参战单位[编号].法术状态["剑意"].层数>=11 then
				保护=false
				for an=1,3 do
					local 目标数 = 3
					local 溅射目标=战斗数据:取多个溅射目标(编号,目标,目标数+1)
					for i=1,2 do
						if 溅射目标[i] ~= 目标 and 目标数~=0 and 溅射目标[i]~=nil and 目标数~=nil then
							战斗计算:添加掉血(战斗数据,溅射目标[i],结果.伤害*溅射比例,编号)
						end
					end
				end
			end
		end
	elseif 名称=="长驱直入" or 名称=="泼天乱棒" then
		保护=false
	end

	if 保护 then
		local x1 = 0.7
		local x2 = 0.3
		if 战斗数据.参战单位[编号].势如破竹 then
			x1 = 0.4
			x2 = 0.6
		end
		if 战斗数据.参战单位[保护编号].阴阳护 then
			x1 = x1 - 战斗数据.参战单位[保护编号].阴阳护
		end
		local 保护伤害=math.floor(结果.伤害*(x1))
		if 保护伤害<1 then 保护伤害=1 end
		local 保护死亡=战斗数据:减少气血(保护编号,保护伤害)
		结果.伤害=math.floor(结果.伤害*(x2))
		if 技能名称=="横扫千军" or 名称=="侵蚀·横扫千军·刻骨" or 名称=="侵蚀·横扫千军·钻心" or 名称=="侵蚀·横扫千军·噬魂"and 战斗数据.参战单位[编号].法术状态["剑意"] and 战斗数据.参战单位[编号].法术状态["剑意"].层数>=2 then
			结果.伤害=math.floor(结果.伤害*1.05)
		end
		if 战斗数据:取经脉(编号,"大唐官府", "破空") then
			结果.伤害=math.floor(结果.伤害*1.1)
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].保护数据={编号=保护编号,伤害=保护伤害,死亡=保护死亡}
	end

	if 技能名称=="善恶有报" then
		if 取随机数()<=30 then
			结果.类型=2
			结果.伤害=math.floor(结果.伤害*0.2)
			if 结果.伤害<1 then
				结果.伤害=1
			end
			if 战斗数据.参战单位[目标].气血==战斗数据.参战单位[目标].最大气血 then
				战斗数据.战斗流程[#战斗数据.战斗流程].假动作 = true
				战斗数据.战斗流程[#战斗数据.战斗流程].返回 = true
				return
			end
		elseif 结果.类型~=2 then
			结果.伤害=qz(结果.伤害*2)
			if 战斗数据.参战单位[目标].玉砥柱 then
				结果.伤害 = 结果.伤害 * (1 - 战斗数据.参战单位[目标].玉砥柱)
			end
		end
	end
	--------------===
		if 技能名称=="特色善恶有报" then
		if 取随机数()<=40 then
			结果.类型=2
			结果.伤害=math.floor(结果.伤害*0.4)
			if 结果.伤害<1 then
				结果.伤害=1
			end
			if 战斗数据.参战单位[目标].气血==战斗数据.参战单位[目标].最大气血 then
				战斗数据.战斗流程[#战斗数据.战斗流程].假动作 = true
				战斗数据.战斗流程[#战斗数据.战斗流程].返回 = true
				return
			end
		elseif 结果.类型~=2 then
			结果.伤害=qz(结果.伤害*3)
			if 战斗数据.参战单位[目标].玉砥柱 then
				结果.伤害 = 结果.伤害 * (1 - 战斗数据.参战单位[目标].玉砥柱)
			end
		end
	end
	-----=============
	结果.伤害=qz(结果.伤害)
	if 结果.伤害<1 or 战斗数据.参战单位[目标].物理免疫 then
		结果.伤害=1
	end

	if 结果.类型==2 then --恢复状态
		战斗数据:增加气血(目标,结果.伤害)
	else
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].死亡=战斗数据:减少气血(目标,结果.伤害,编号,技能名称)
		战斗技能:凝光炼彩(战斗数据,目标,结果.伤害)
		战斗计算:物理技能掉血计算(战斗数据,编号,结果.伤害,目标,技能名称)
	end
	战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].动作=最终伤害.动作
	for i=1,#结果.特效 do
		table.insert(战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效,结果.特效[i])
	end

	if 技能名称~="后发制人" then
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效[#战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效+1]=技能名称
	end

	if 技能名称=="泼天乱棒" and 战斗数据:取目标状态(编号,目标,1) then
		local 目标数 = 3
		local 溅射目标=战斗数据:取多个溅射目标(编号,目标,目标数+1)
		for i=1,#溅射目标 do
			if 溅射目标[i] ~= 目标 and 目标数~=0 then
				战斗计算:添加掉血(战斗数据,溅射目标[i],最终伤害.伤害*0.3,编号)
			end
		end
	end

	local 吸血=战斗数据.参战单位[编号].吸血
	if 吸血==nil and 战斗数据.参战单位[编号].法术状态.移魂化骨 then
		吸血=战斗数据.参战单位[编号].法术状态.移魂化骨.吸血
	end
	if 吸血~=nil and 战斗数据.参战单位[目标].鬼魂==nil  then
		local 吸血伤害=math.floor(结果.伤害*吸血)
		if 吸血伤害<1 then
			吸血伤害=1
		end
		战斗数据:增加气血(编号,吸血伤害)
		战斗数据.战斗流程[#战斗数据.战斗流程].吸血伤害=吸血伤害
		if 吸血<0.3 and 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,目标) then
			战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[目标], 11)
		end
		local ycsh=结果.伤害-吸血
		if ycsh >= 1 and 战斗数据.参战单位[编号].超级吸血 then
			战斗计算:添加护盾(战斗数据,战斗数据.参战单位[编号].序号,ycsh)
		end
	else
		if 战斗数据:取经脉(编号,"狮驼岭","化血") and 取随机数() <=30 then
			local 吸血伤害=math.floor(结果.伤害*0.16)
			if 吸血伤害<1 then
				吸血伤害=1
			end
			战斗数据:增加气血(编号,math.floor(吸血伤害))
			战斗数据.战斗流程[#战斗数据.战斗流程].吸血伤害=math.floor(吸血伤害)
			if 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,目标) then
				战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[目标], 11)
			end
		elseif 战斗数据.参战单位[编号].法术状态.狂怒 and 战斗数据.参战单位[编号].法术状态.狂怒.攫取~=nil and 取随机数() <=50 then
			local 吸血伤害=math.floor(结果.伤害*0.16)
			if 吸血伤害<1 then
				吸血伤害=1
			end
			战斗数据:增加气血(编号,吸血伤害)
			战斗数据.战斗流程[#战斗数据.战斗流程].吸血伤害=吸血伤害
			if 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,目标) then
				战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[目标], 11)
			end
		end
	end

	local 反震=战斗数据.参战单位[目标].反震
	if 结果.伤害>=4 and 战斗数据.参战单位[编号].偷袭==nil and 反震~=nil and 取随机数()<=30 and 保护==false then --触发反震 有保护的情况下不会触发反震
		local 反震伤害=math.floor(结果.伤害*反震)
		if 战斗数据.参战单位[目标].坚甲~=nil then
			反震伤害= 反震伤害 + 战斗数据.参战单位[目标].坚甲
		end
		if 战斗数据:取经脉(编号,"狮驼岭","狂袭") then
			local sh = qz(反震伤害*0.04)
			战斗数据:添加状态("狂袭",战斗数据.参战单位[编号],战斗数据.参战单位[编号],sh)
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].反震伤害=反震伤害
		战斗数据.战斗流程[#战斗数据.战斗流程].反震死亡=战斗数据:减少气血(编号,反震伤害,目标)
		战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效[#战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].特效+1]="反震"
		if 战斗数据.参战单位[编号].法术状态.狂袭 and 战斗数据.参战单位[编号].气血<=0 then --这里写成取目标状态 --反震伤害 > 战斗数据.参战单位[编号].气血+战斗数据.参战单位[编号].护盾
			战斗数据.参战单位[编号].气血=1
			战斗数据.战斗流程[#战斗数据.战斗流程].反震死亡 = false
			战斗数据.参战单位[编号].法术状态.狂袭.死亡=true
		end
		战斗数据.执行等待=战斗数据.执行等待+3
	elseif 结果.伤害>=4 and 战斗数据.参战单位[目标].法术状态.修罗咒 then
		local 反震伤害=math.floor(结果.伤害*0.5)
		if 反震伤害>=战斗数据.参战单位[目标].等级*8 then
			反震伤害=战斗数据.参战单位[目标].等级*8
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].反震伤害=反震伤害
		战斗数据.战斗流程[#战斗数据.战斗流程].反震死亡=战斗数据:减少气血(编号,反震伤害,目标)
		战斗数据.执行等待=战斗数据.执行等待+2
	end
	   战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].伤害=结果.伤害
	   战斗数据.战斗流程[#战斗数据.战斗流程].挨打方[1].伤害类型=结果.类型
	   战斗数据.战斗流程[#战斗数据.战斗流程].返回=返回
end
function 物理技能计算:三荒尽灭处理(编号,名称,等级,战斗数据)
	战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=1000,攻击方=编号,显示气血=显示气血,挨打方={},特效=名称}
	战斗数据.战斗流程[#战斗数据.战斗流程].提示={类型="法术",名称=战斗数据.参战单位[编号].名称.."使用了"..名称,允许=true}
	local zza = skill.数据[名称]
	local 消耗1,类型1 = zza.技能消耗(3,战斗数据.参战单位[编号])
	if 初始技能计算:技能消耗(战斗数据,战斗数据.参战单位[编号],消耗1,类型1,名称)==false then
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=6,战斗提示={内容="行动失败",编号=编号}}
		return
	end
	-- 战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=1000,攻击方=编号,显示气血=显示气血,挨打方={},特效=名称}
	-- 战斗数据.战斗流程[#战斗数据.战斗流程].提示={类型="法术",名称=战斗数据.参战单位[编号].名称.."使用了"..名称,允许=true}
	-- local zza = skill.数据[名称]
	-- local 消耗,类型 = zza.技能消耗(等级,战斗数据.参战单位[编号])
	-- if 初始技能计算:技能消耗(战斗数据,战斗数据.参战单位[编号],消耗,类型,名称)==false then
	-- 	战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=6,战斗提示={内容="行动失败",编号=编号}}
	-- 	return
	-- end
	local 当前流程 = #战斗数据.战斗流程
	local 目标=战斗数据:取多个九黎目标(编号,战斗数据.参战单位[编号].指令.目标,4)
	local 浮空概率 = 45
-----------------------------------------18奇技九黎城1---------------------------
			if self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"九黎城A") >=1 and 战斗数据.参战单位[编号].门派=="九黎城" and not 战斗数据.PK战斗 then
				浮空概率 = 浮空概率 + self:取门派秘籍(战斗数据.参战单位[编号].玩家id,"九黎城A")/4
  			end
-----------------------------------------18奇技九黎城1---------------------------

	if 战斗数据:取经脉(编号,'九黎城' , "乘风") then
        浮空概率 = 浮空概率 + 10
    end
    if 战斗数据:取是否有指定状态(编号, 编号, "怒哮") then
        浮空概率 = 浮空概率 + 30
    end
    if 战斗数据:取经脉(编号,'九黎城', "识破") and 战斗数据:取是否五行相克(战斗数据.参战单位[编号].攻击五行, 战斗数据.参战单位[目标].防御五行) then
        浮空概率 = 浮空概率 + 10
    end
	for i=1,#目标 do
		local 当前目标 = 目标[i]
		战斗数据.战斗流程[当前流程].挨打方[i] = {}
		战斗数据.战斗流程[当前流程].挨打方[i].目标 = 当前目标
		local 伤害 = math.floor(战斗数据:取基础物理伤害(编号,当前目标,名称) * 0.45)
		if 战斗数据:取经脉(编号,'九黎城' , "俾睨") then
            伤害 = 伤害 * 1.15
        end
        if not 战斗数据.参战单位[当前目标].九黎浮空 then
            if 取随机数() <= 浮空概率 then
                战斗数据.参战单位[编号].浮空人数 = (战斗数据.参战单位[编号].浮空人数 or 0) + 1
            	战斗数据.参战单位[当前目标].九黎浮空 = 编号
            	战斗数据.战斗流程[当前流程].挨打方[i].浮空目标 = 当前目标
            	战斗数据:取消状态("怒哮", 战斗数据.参战单位[编号], 战斗数据.参战单位[编号])
            	if 战斗数据.参战单位[编号].飞扬生效 ~= nil and 战斗数据.参战单位[编号].浮空人数 == 5 and (战斗数据.参战单位[编号].飞扬次数 or 0) < 3 then
	                战斗数据.参战单位[编号].飞扬增伤 = (战斗数据.参战单位[编号].飞扬增伤 or 1) + 0.06
	                战斗数据.参战单位[编号].飞扬次数 = (战斗数据.参战单位[编号].飞扬次数 or 0) + 1
	            end
            end
        end
        local 最终伤害=战斗数据:取最终物理伤害(编号,当前目标,伤害,0,2,名称)
        local csjc = 0
		if 战斗数据:取经脉(编号,'九黎城', "狂暴") then
			for w = 1, #最终伤害.特效 do
				if 最终伤害.特效[i] == "暴击" then
					csjc = csjc + 1
				end
			end
		end
		战斗数据:九黎城连击数处理(编号, 1 + csjc)
        if 战斗数据.参战单位[当前目标].指令 ~= nil and 战斗数据.参战单位[当前目标].指令.类型 == "防御" and 战斗数据:取行动状态(当前目标) and 战斗数据:取可否防御(当前目标,战斗数据.参战单位[编号].超级偷袭) then
	        最终伤害.伤害 = 最终伤害.伤害 * 0.5
	        最终伤害.动作 = "防御"
	        防御 = true
	        if 战斗数据.参战单位[当前目标].点石成金 then
	           最终伤害.伤害=最终伤害.伤害*战斗数据.参战单位[当前目标].点石成金
	        end
	        if 战斗数据.参战单位[当前目标].法术状态.愈勇 then
	            战斗数据:取消状态("愈勇",战斗数据.参战单位[当前目标])
	        end
	    end
        local 结果 = 战斗数据:取伤害结果(编号,当前目标,最终伤害.伤害,最终伤害.暴击,nil,2,名称,防御)
        if 战斗数据:取目标类型(编号) == "召唤兽" and 名称 then
	        if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍]~=nil and 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意~=nil then
	            if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.回合~=战斗数据.回合数 then --代表新的回合.做清空处理.必定触发
	                战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意={技能={},回合=战斗数据.回合数}
	                if 战斗数据.参战单位[编号].出其不意~=nil then
	                    结果.伤害=qz(结果.伤害*1.15)
	                end
	            else
	                if 战斗数据.参战单位[编号].出其不意~=nil then
	                    local go = true
	                    for k,v in pairs(战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能) do
	                        if v==名称 then
	                            go = false
	                            break
	                        end
	                    end
	                    if go then
	                        结果.伤害=qz(结果.伤害*1.15)
	                    end
	                end
	            end
	            战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能[#战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能+1]=名称
	        end
	    end
	    结果.伤害=qz(结果.伤害)
	    if 结果.伤害<1 or 战斗数据.参战单位[当前目标].物理免疫 then
	        结果.伤害=1
	    end
	    if 结果.类型==2 then --恢复状态
	        战斗数据:增加气血(当前目标,结果.伤害)
	    else
	        战斗数据.战斗流程[当前流程].挨打方[i].死亡=战斗数据:减少气血(当前目标,结果.伤害,编号,名称)
	        战斗技能:凝光炼彩(战斗数据,当前目标,结果.伤害)
	        战斗计算:物理技能掉血计算(战斗数据,编号,结果.伤害,当前目标,名称)
	    end
	    战斗数据.战斗流程[当前流程].挨打方[i].动作=最终伤害.动作
	    local 吸血=战斗数据.参战单位[编号].吸血
	    if 吸血==nil and 战斗数据.参战单位[编号].法术状态.移魂化骨 then
	        吸血=战斗数据.参战单位[编号].法术状态.移魂化骨.吸血
	    end
	    if 吸血~=nil and 战斗数据.参战单位[当前目标].鬼魂==nil  then
	        local 吸血伤害=math.floor(结果.伤害*吸血)
	        if 吸血伤害<1 then
	            吸血伤害=1
	        end
	        战斗数据:增加气血(编号,吸血伤害)
	        战斗数据.战斗流程[当前流程].吸血伤害=吸血伤害
	        if 吸血<0.3 and 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,当前目标) then
	            战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[当前目标], 11)
	        end
	        if 战斗数据.参战单位[编号].超级吸血 and 战斗数据.参战单位[编号].气血>=战斗数据.参战单位[编号].最大气血 then
	            战斗计算:添加护盾(战斗数据,编号,吸血伤害)
	        end
	    else
	        if 战斗数据:取经脉(编号,"狮驼岭","化血") and 取随机数() <=30 then
	            local 吸血伤害=math.floor(结果.伤害*0.16)
	            if 吸血伤害<1 then
	                吸血伤害=1
	            end
	            战斗数据:增加气血(编号,math.floor(吸血伤害))
	            战斗数据.战斗流程[当前流程].吸血伤害=math.floor(吸血伤害)
	            if 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,当前目标) then
	                战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[当前目标], 11)
	            end
	        elseif 战斗数据.参战单位[编号].法术状态.狂怒 and 战斗数据.参战单位[编号].法术状态.狂怒.攫取~=nil and 取随机数() <=50 then
	            local 吸血伤害=math.floor(结果.伤害*0.16)
	            if 吸血伤害<1 then
	                吸血伤害=1
	            end
	            战斗数据:增加气血(编号,吸血伤害)
	            战斗数据.战斗流程[当前流程].吸血伤害=吸血伤害
	            if 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,当前目标) then
	                战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[当前目标], 11)
	            end
	        end
	    end
	    战斗数据.战斗流程[当前流程].挨打方[i].伤害=结果.伤害
	    战斗数据.战斗流程[当前流程].挨打方[i].伤害类型=结果.类型
	end
	战斗数据.战斗流程[当前流程].返回=战斗数据.参战单位[编号].允许返回
end

function 物理技能计算:力辟苍穹处理(编号,名称,等级,战斗数据)
	local zza = skill.数据[名称]
	战斗数据.参战单位[编号].力辟苍穹可选 = {}
	local 目标
	local  必杀几率,暴击倍率 = 0,2
	if 名称 == '魔神之刃' then
		for i = 1, #战斗数据.参战单位 do
			if 战斗数据.参战单位[i].九黎浮空 ~= nil and 战斗数据.参战单位[i].队伍 ~= 战斗数据.参战单位[编号].队伍 and 战斗数据:取目标状态(i, i, 2) then
				战斗数据.参战单位[编号].力辟苍穹可选[#战斗数据.参战单位[编号].力辟苍穹可选 + 1] = i
				break
			end
		end
		必杀几率 = 10
		暴击倍率 = 3
	else
		for i = 1, #战斗数据.参战单位 do
			if 战斗数据.参战单位[i].九黎浮空 ~= nil and 战斗数据.参战单位[i].队伍 ~= 战斗数据.参战单位[编号].队伍 and 战斗数据:取目标状态(i, i, 2) then
				战斗数据.参战单位[编号].力辟苍穹可选[#战斗数据.参战单位[编号].力辟苍穹可选 + 1] = i
			end
		end
	end
	目标 = DeepCopy(战斗数据.参战单位[编号].力辟苍穹可选)
	if not 目标 or #目标 < 1 then return end
	local 消耗1,类型1 = zza.技能消耗(#目标,战斗数据.参战单位[编号])
	if 初始技能计算:技能消耗(战斗数据,战斗数据.参战单位[编号],消耗1,类型1,名称)==false then
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=6,战斗提示={内容="行动失败",编号=编号}}
		return
	end

	local 攻击次数 = 取随机数(2,3)
	for n=1,攻击次数 do
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=1005,攻击方=编号,显示气血=显示气血,挨打方={},特效=名称}
		local 当前流程 = #战斗数据.战斗流程
		if n == 1 then
		    战斗数据.战斗流程[#战斗数据.战斗流程].提示={类型="法术",名称=战斗数据.参战单位[编号].名称.."使用了"..名称,允许=true}
		end
		for i=1,#目标 do
			if i == 1 then
			    战斗数据.战斗流程[#战斗数据.战斗流程].重复次数 = {n , 攻击次数}
			end
			local 当前目标 = 目标[i]
			战斗数据.参战单位[当前目标].九黎浮空 = nil
			战斗数据.战斗流程[当前流程].挨打方[i] = {}
			战斗数据.战斗流程[当前流程].挨打方[i].挨打方 = 当前目标
			local 伤害 = math.floor(战斗数据:取基础物理伤害(编号,当前目标,名称) * 0.6)

	        local 最终伤害=战斗数据:取最终物理伤害(编号,当前目标,伤害,必杀几率,暴击倍率,名称)
	        local csjc = 0
			if 战斗数据:取经脉(编号,'九黎城', "狂暴") then
				for w = 1, #最终伤害.特效 do
					if 最终伤害.特效[i] == "暴击" then
						csjc = csjc + 1
					end
				end
			end
			战斗数据:九黎城连击数处理(编号, 1 + csjc)
	        if 战斗数据.参战单位[当前目标].指令 ~= nil and 战斗数据.参战单位[当前目标].指令.类型 == "防御" and 战斗数据:取行动状态(当前目标) and 战斗数据:取可否防御(当前目标,战斗数据.参战单位[编号].超级偷袭) then
		        最终伤害.伤害 = 最终伤害.伤害 * 0.4
		        最终伤害.动作 = "防御"
		        防御 = true
		        if 战斗数据.参战单位[当前目标].点石成金 then
		           最终伤害.伤害=最终伤害.伤害*战斗数据.参战单位[当前目标].点石成金
		        end
		        if 战斗数据.参战单位[当前目标].法术状态.愈勇 then
		            战斗数据:取消状态("愈勇",战斗数据.参战单位[当前目标])
		        end
		    end
	        local 结果 = 战斗数据:取伤害结果(编号,当前目标,最终伤害.伤害,最终伤害.暴击,nil,2,名称,防御)
	        if 战斗数据:取目标类型(编号) == "召唤兽" and 名称 then
		        if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍]~=nil and 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意~=nil then
		            if 战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.回合~=战斗数据.回合数 then --代表新的回合.做清空处理.必定触发
		                战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意={技能={},回合=战斗数据.回合数}
		                if 战斗数据.参战单位[编号].出其不意~=nil then
		                    结果.伤害=qz(结果.伤害*1.15)
		                end
		            else
		                if 战斗数据.参战单位[编号].出其不意~=nil then
		                    local go = true
		                    for k,v in pairs(战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能) do
		                        if v==名称 then
		                            go = false
		                            break
		                        end
		                    end
		                    if go then
		                        结果.伤害=qz(结果.伤害*1.15)
		                    end
		                end
		            end
		            战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能[#战斗数据.友方经脉统计[战斗数据.参战单位[编号].队伍].出其不意.技能+1]=名称
		        end
		    end
		    结果.伤害=qz(结果.伤害)
		    if 结果.伤害<1 or 战斗数据.参战单位[当前目标].物理免疫 then
		        结果.伤害=1
		    end
		    if 结果.类型==2 then --恢复状态
		        战斗数据:增加气血(当前目标,结果.伤害)
		    else
		        战斗数据.战斗流程[当前流程].挨打方[i].死亡=战斗数据:减少气血(当前目标,结果.伤害,编号,名称)
		        战斗技能:凝光炼彩(战斗数据,当前目标,结果.伤害)
		        战斗计算:物理技能掉血计算(战斗数据,编号,结果.伤害,当前目标,名称)
		    end
		    战斗数据.战斗流程[当前流程].挨打方[i].动作=最终伤害.动作
		    local 吸血=战斗数据.参战单位[编号].吸血
		    if 吸血==nil and 战斗数据.参战单位[编号].法术状态.移魂化骨 then
		        吸血=战斗数据.参战单位[编号].法术状态.移魂化骨.吸血
		    end
		    if 吸血~=nil and 战斗数据.参战单位[当前目标].鬼魂==nil  then
		        local 吸血伤害=math.floor(结果.伤害*吸血)
		        if 吸血伤害<1 then
		            吸血伤害=1
		        end
		        战斗数据:增加气血(编号,吸血伤害)
		        战斗数据.战斗流程[当前流程].吸血伤害=吸血伤害
		        if 吸血<0.3 and 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,当前目标) then
		            战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[当前目标], 11)
		        end
		        if 战斗数据.参战单位[编号].超级吸血 and 战斗数据.参战单位[编号].气血>=战斗数据.参战单位[编号].最大气血 then
		            战斗计算:添加护盾(战斗数据,编号,吸血伤害)
		        end
		    else
		        if 战斗数据:取经脉(编号,"狮驼岭","化血") and 取随机数() <=30 then
		            local 吸血伤害=math.floor(结果.伤害*0.16)
		            if 吸血伤害<1 then
		                吸血伤害=1
		            end
		            战斗数据:增加气血(编号,math.floor(吸血伤害))
		            战斗数据.战斗流程[当前流程].吸血伤害=math.floor(吸血伤害)
		            if 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,当前目标) then
		                战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[当前目标], 11)
		            end
		        elseif 战斗数据.参战单位[编号].法术状态.狂怒 and 战斗数据.参战单位[编号].法术状态.狂怒.攫取~=nil and 取随机数() <=50 then
		            local 吸血伤害=math.floor(结果.伤害*0.16)
		            if 吸血伤害<1 then
		                吸血伤害=1
		            end
		            战斗数据:增加气血(编号,吸血伤害)
		            战斗数据.战斗流程[当前流程].吸血伤害=吸血伤害
		            if 战斗数据.参战单位[编号].法术状态.毒==nil and 初始技能计算:取吸血异常(战斗数据,当前目标) then
		                战斗数据:添加状态("毒", 战斗数据.参战单位[编号],战斗数据.参战单位[当前目标], 11)
		            end
		        end
		    end
		    战斗数据.战斗流程[当前流程].挨打方[i].伤害=结果.伤害
		    战斗数据.战斗流程[当前流程].挨打方[i].伤害类型=结果.类型
		end
	end
end
function 物理技能计算:取门派秘籍(id,技能)
	if id == 0 or id == nil or id == "" then return 0 end
  local lv=0
  if id~=nil and 技能~=nil and 玩家数据[id].角色.门派秘籍~=nil and 玩家数据[id].角色.门派秘籍[技能]~=nil then
     lv=玩家数据[id].角色.门派秘籍[技能]
  end
  return lv
end

return 物理技能计算
