-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-16 07:33:16
local 状态处理 = class()
local jhf = string.format
local random = math.random
local qz=math.floor
local sj = 取随机数

function 状态处理:初始化()
end

function 状态处理:发送状态数据(战斗数据,名称,挨打方)
	if 战斗数据.战斗流程[#战斗数据.战斗流程] ~= nil then
		if 战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加 == nil then
			战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加 = {}
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加[#战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加 + 1] = {编号 = 挨打方.序号, 名称 = 名称,回合=挨打方.法术状态[名称].回合,颜色=挨打方.法术状态[名称].颜色,层数=挨打方.法术状态[名称].层数}
	end
end

function 状态处理:添加状态(战斗数据,名称,挨打方,攻击方,等级,境界,指定,套装状态)

	local xytg = true
	for an=1,#超级技能状态名称 do
	    if 超级技能状态名称[an] == 名称 then
	    	xytg = false
	    	break
	    end
	end
	if 名称 == nil then
		战斗数据.战斗流程[#战斗数据.战斗流程] = nil
		return
	elseif 挨打方.信仰 and not 挨打方.超级否定信仰  then
		return
	elseif 挨打方.超信仰 and xytg then
		return
	end
	if 攻击方.队伍==0 then
		境界=15
	end

	战斗数据.执行等待 = 战斗数据.执行等待 + 2 --我加的
	local zza = skill.数据[名称]
	if 挨打方.法术状态[名称] ~= nil then
		if 名称 == "莲心剑意" and 攻击方.法术状态[名称] then
			战斗数据:取消状态(名称, 攻击方)
			return
		elseif 名称 == "剑意莲心" and 攻击方.法术状态[名称] then
			战斗数据:取消状态(名称, 攻击方)
			if 战斗数据:取经脉(攻击方.序号, "普陀山", "馀威") then
				战斗数据:增加愤怒(攻击方.序号,15)
			end
			return
		elseif 名称 == "心随意动" and 攻击方.法术状态[名称] then
			战斗数据:取消状态(名称, 攻击方)
			return
		elseif 名称 == "天罗地网" and 指定 then
			挨打方.法术状态[名称].回合=指定
			if 攻击方.门派=="盘丝洞" and 挨打方.类型=="角色" and 攻击方.JM.当前流派=="百媚魔姝" then --神迷被动
				战斗数据:增加愤怒(攻击方.序号,4)
				战斗数据:减少愤怒(挨打方.序号,4)
			end
			return
		elseif 名称 == "电芒" then
			挨打方.法术状态[名称].回合=指定
			return
		elseif 名称 == "天雷灌注" and 战斗数据:取经脉(攻击方.序号, "天宫", "天劫") and 挨打方.法术状态[名称].层数<3 then
			挨打方.法术状态[名称].层数 = 挨打方.法术状态[名称].层数 + 1
			return
		elseif (名称 == "霹雳弦惊" or 名称 == "雷怒霆激") and 战斗数据:取经脉(攻击编号,"天宫", "啸傲") then
		    if 挨打方.法术状态[名称].层数~=nil and 挨打方.法术状态[名称].层数<20 then
			    挨打方.法术状态[名称].层数 = 挨打方.法术状态[名称].层数 + 1
		    end
		    if 挨打方.法术状态[名称].激越 then
		        挨打方.法术状态[名称].回合 = 4
		    else
		    	挨打方.法术状态[名称].回合 = 6
		    end
		    return
		-- elseif 名称 == "骤雨" and 攻击方.法术状态[名称] then
		-- 	攻击方.法术状态[名称].回合 = 3
		-- 	攻击方.法术状态[名称].层数 = 攻击方.法术状态[名称].层数 + 1
		-- 	if 攻击方.法术状态[名称].层数>=攻击方.法术状态[名称].上限 then
		-- 	    攻击方.法术状态[名称].层数=攻击方.法术状态[名称].上限
		-- 	end
		-- 	self:发送状态数据(战斗数据,名称,挨打方)
		-- 	return
		elseif 名称 == "风灵" then
			if 指定 then
				挨打方.法术状态[名称].层数 = 挨打方.法术状态[名称].层数 + 指定
			else
				挨打方.法术状态[名称].层数 = 挨打方.法术状态[名称].层数 + 1
			end
			if 挨打方.法术状态[名称].层数>=6 then
				挨打方.法术状态[名称].层数 = 6
			end
			return
		elseif 名称 == "雾杀" then
			if 指定 then
				挨打方.法术状态[名称].层数 =挨打方.法术状态[名称].层数+指定
			else
				挨打方.法术状态[名称].层数 = 挨打方.法术状态[名称].层数 +1
				if 挨打方.法术状态[名称].层数 >= 3 then
					挨打方.法术状态[名称].层数=3
				end
			end
			挨打方.法术状态[名称].回合 = 4
			return
		end
		if zza and zza.层数上限~=nil and 挨打方.法术状态[名称].层数<zza.层数上限 then
			if 指定 then
				挨打方.法术状态[名称].层数=挨打方.法术状态[名称].层数 + 指定
			else
				挨打方.法术状态[名称].层数 = 挨打方.法术状态[名称].层数 + 1
			end
			if 挨打方.法术状态[名称].层数>zza.层数上限 then
				挨打方.法术状态[名称].层数=zza.层数上限
			end
			if zza.刷新回合 then
				挨打方.法术状态[名称].回合 = zza.刷新回合
			end
			return
		end
		return
	elseif 名称 == "霹雳弦惊" and 挨打方.法术状态.雷怒霆激 and 指定==nil then
		战斗数据:取消状态("雷怒霆激", 挨打方)
		-- return
	elseif 名称 == "雷怒霆激" and 挨打方.法术状态.霹雳弦惊 and 指定==nil then
		战斗数据:取消状态("霹雳弦惊", 挨打方)
		-- return
	elseif 名称 == "碎星诀" and 挨打方.法术状态.镇魂诀 then
		战斗数据:取消状态("镇魂诀", 挨打方)
	elseif 名称 == "镇魂诀" and 挨打方.法术状态.碎星诀 then
		战斗数据:取消状态("碎星诀", 挨打方)
	end
	local 攻击编号 = 攻击方.序号
	-- if not 攻击编号 then
	-- 	战斗监控[#战斗监控+1]=名称
	-- 	攻击编号=挨打方.序号
	-- end
	if 名称 == "毒" and (挨打方.法术状态.百毒不侵 or (挨打方.统御属性 and 挨打方.统御属性.水来土掩  and 取随机数()<=挨打方.统御属性.水来土掩) or (挨打方.高级毒 and not 战斗数据:取经脉(攻击编号,"女儿村","杏花"))) then
		return
	-- elseif (挨打方.鬼魂 and 挨打方.高鬼魂==nil) and 名称~="象形" and not 战斗数据:取经脉(攻击编号,"方寸山","鬼念") then
	-- 	return
	elseif 挨打方.法术状态.心如明镜 then
		return
	end

	if not 等级 then
		等级 = 战斗数据:取技能等级(攻击编号,名称)
	end

	挨打方.法术状态[名称] = {攻击编号 = 攻击编号 , 等级 = 等级 , 境界 = 境界}
	local 伤害1 = 挨打方.伤害
	local 防御1 = 挨打方.防御
	local 速度1 = 挨打方.速度
	local 法防1 = 挨打方.法防
	local 法伤1 = 挨打方.法伤
	local 躲避1 = 挨打方.躲避
	local 命中1 = 挨打方.命中
	local 物理伤害结果1 = 挨打方.物理伤害结果
	local 法术伤害结果1 = 挨打方.法术伤害结果
	local 伤害 = 0
	local 防御 = 0
	local 速度 = 0
	local 法防 = 0
	local 法伤 = 0
	local 躲避 = 0
	local 命中 = 0
	local 物理伤害结果 = 0
	local 法术伤害结果 = 0
	local 参数 = 1
	local 回合 = 1
	local 类型 = 1
	local 是否增益 = false
	local 法宝增益

	local sj = {伤害=伤害1,防御=防御1,速度=速度1,法防=法防1,法伤=法伤1,躲避=躲避1,命中=命中1,物理伤害结果=物理伤害结果1,法术伤害结果=法术伤害结果1}
	if zza and zza.状态属性 then
		local zzb = zza.状态属性(等级,sj,挨打方,攻击方,等级,境界,指定)
		if zza.技能类型=="增益技能" then --or zzb.类型~=nil   后期要完善一下zzb.类型 为空时默认为1减益
			是否增益 = true
		end
		法宝增益=zza.法宝增益
		回合 = zzb.状态回合
		类型 = zzb.类型 or 1
		伤害 = zzb.伤害 or 0
		防御 = zzb.防御 or 0
		速度 = zzb.速度 or 0
		法防 = zzb.法防 or 0
		法伤 = zzb.法伤 or 0
		躲避 = zzb.躲避 or 0
		命中 = zzb.命中 or 0
		物理伤害结果 = zzb.物理伤害结果 or 0
		法术伤害结果 = zzb.法术伤害结果 or 0
		if zzb.层数~=nil then
			挨打方.法术状态[名称].层数 = zzb.层数
		end
		if zzb.负面~=nil then
			挨打方.法术状态[名称].负面 = zzb.负面
		end
	else
		print("未录入脚本状态名称=="..名称)
	end

	if string.find(名称,"超级赐福") then---超级赐福属性-五福
		local 赐福级别 = 0
		for iis=1,#超级技能状态名称 do
		    if 超级技能状态名称[iis] == 名称 then
		    	赐福级别 = iis
		    	break
		    end
		end
		if 赐福级别 then
			命中 = 赐福级别 * 10
			伤害 = 赐福级别 * 10
			防御 = 赐福级别 * 10
            法伤 = 赐福级别 * 10
            法防 = 赐福级别 * 10
            物理伤害结果 = 赐福级别 * 10
            法术伤害结果 = 赐福级别 * 10
            速度 = 赐福级别 * 10
            躲避 = 赐福级别 * 10
            赐福等级=赐福级别
    	end
    end
	-----------------------狮驼岭-----------------------
	if 名称=="变身" then
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "宁息") then
			回合 = 回合 + 2
			挨打方.法术状态[名称].宁息 = true
		elseif 战斗数据:取经脉(攻击编号, "狮驼岭", "屏息") then
			挨打方.法术状态[名称].屏息 = true
		end
		if 指定 and 指定=="迅捷" then
			回合 = 3
			伤害 = 等级
			类型=1
		else
			类型=2
			伤害= qz(等级*0.5)
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "狂躁") then
			回合 = 回合 - 3
			战斗数据:添加状态("狂怒",挨打方,挨打方,69,nil,回合)
		end
	elseif 名称 == "怒哮" then
		回合 = 999
		类型 = 2
		if 境界 then
		    回合 = 2
		end
	elseif 名称 == "炎魂" then
		local jc = qz(防御1 * math.random(0.05, 0.1) )
		伤害 = jc
		防御 = -jc

		if 战斗数据:取经脉(攻击编号, '九黎城', "魂力") then
			伤害 = qz(伤害 * 1.6)
		end
	elseif 名称 == "狂怒" then
		回合 = 指定
		伤害 = qz(等级*2)
		if 战斗数据:取经脉(攻击编号,"狮驼岭","攫取") then
			挨打方.法术状态[名称].攫取 = 1
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "屏息") then
			挨打方.法术状态[名称].屏息 = true
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "狂乱") then
			挨打方.法术状态[名称].狂乱 = 1
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "雄风") then
			挨打方.法术状态[名称].雄风 = 1
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "不羁") then
			挨打方.法术状态[名称].不羁 = 1
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭","狮噬") then
			挨打方.法术状态[名称].狮噬 = 1
		end
		if 战斗数据:取经脉(攻击编号, "狮驼岭","象踏") then
			挨打方.法术状态[名称].象踏 = 1
		end
	elseif 名称 == "魔息术" then
		挨打方.法术状态[名称].恢复魔法 = qz(等级*1.3)
		if 战斗数据:取经脉(攻击编号, "狮驼岭", "魔息") then
			挨打方.法术状态[名称].魔息 = 1
		end
	elseif 名称 == "狂袭" then
		挨打方.法术状态[名称].死亡 = false
		挨打方.法术状态[名称].伤害力 = 等级
	elseif 名称 == "肝胆" then
		挨打方.法术状态[名称].触发 = false
	-----------------------大唐-----------------------
--	elseif 名称 == "重创" then --长驱直入
--		挨打方.法术状态[名称].重创.降疗 = 0.7
	elseif 名称 == "干将莫邪" then
		if 战斗数据:取经脉(攻击编号, "大唐官府","奋战") then
			挨打方.法术状态[名称].物连几率=40
			回合 = 6
		else
			挨打方.法术状态[名称].加伤害 = 1.05 + 境界*0.03
			挨打方.法术状态[名称].递减名称="加伤害"
			挨打方.法术状态[名称].回合递减= 0.1
			if 战斗数据:取经脉(攻击编号, "大唐官府","干将") then
			   挨打方.法术状态[名称].加伤害=挨打方.法术状态[名称].加伤害 + 0.3
			end
		end
	-----------------------化生寺-----------------------
	elseif 名称 == "毒" then
		挨打方.法术状态[名称].等级 = 等级
		if 指定 then
			挨打方.法术状态[名称].满天花雨 = 1
		end
		if 攻击方.门派=="女儿村" then
			挨打方.法术状态[名称].门派 = "女儿村"
			if 战斗数据:取经脉(攻击编号, "女儿村", "毒引") then
				挨打方.法术状态[名称].毒引 = true
			end
			if 战斗数据:取经脉(攻击编号, "女儿村", "余韵") then
				挨打方.法术状态[名称].余韵 = 1
			end
			if 战斗数据:取指定法宝(攻击编号, "曼陀罗") then
				local 境界 = 战斗数据:取指定法宝境界(攻击编号, "曼陀罗")
				挨打方.法术状态[名称].曼陀罗=1 + 境界*0.01
			end
		end
		if 攻击方.超级毒 ~= nil then
			挨打方.法术状态[名称].超级毒 = 取随机数(1,4) --降低 1攻击 2防御 3法伤 4法防
		end
	elseif 名称 == "超级永恒" then
		挨打方.法术状态[名称].回溯={气血=挨打方.气血,魔法=挨打方.魔法}
		挨打方.法术状态[名称].可增回合 = 6
		回合=3
	elseif 名称 == "超级强力" then
	    战斗数据.战斗流程[#战斗数据.战斗流程].超强力=true
	-----------------------化生寺-----------------------
	elseif 名称 == "渡劫金身" then
		挨打方.法术状态[名称].恢复气血=等级*4
	elseif 名称 == "佛法无边" then
		挨打方.法术状态[名称].法连几率 = 30
		if 战斗数据:取经脉(攻击编号, "化生寺", "慧定") then
			回合 = 回合 - 1
			挨打方.法术状态[名称].法连几率 = 50
		end
		if 挨打方.序号==攻击编号 and 战斗数据:取经脉(攻击编号,"化生寺", "佛法") and 战斗数据:取门派是否唯一(攻击编号,"化生寺") then
			挨打方.法术状态[名称].佛法 = 1.3
		end
	elseif 名称 == "金刚护体" then
		if 指定~=nil then
			回合=指定
		end
		防御 = qz(等级 * 1.5)
		if 战斗数据:取经脉(攻击编号, "化生寺", "流刚") then
			防御 = qz(防御*1.18)
		end
		if 战斗数据:取被动(攻击编号,"度厄") then
			防御 = qz(防御*0.5)
		end
	elseif 名称 == "金刚护法" then
		if 指定 then
		   回合 = 指定
		end
  		伤害 = qz(等级*1.3)
		if 战斗数据:取经脉(攻击编号, "化生寺", "佛屠") then
			伤害 = qz(伤害 + (攻击方.装备伤害 * 0.09))
		end
		if 战斗数据:取经脉(攻击编号, "化生寺", "流刚") then
			伤害 = qz(伤害*1.18)
		end
		if 战斗数据:取被动(攻击编号,"度厄") then
			伤害 = qz(伤害*0.5)
		end
--------------------------18奇技化生寺1-------------------------------
			if self:取门派秘籍(攻击方.玩家id,"化生寺A") >=1 and not 战斗数据.PK战斗 then
  				伤害 = qz( 伤害 + self:取门派秘籍(攻击方.玩家id,"化生寺A") * 10     )
  			end
--------------------------18奇技化生寺1-------------------------------

--------------------------18奇技普陀山1-------------------------------
	elseif 名称 == "灵动九天" then
			if self:取门派秘籍(攻击方.数字id,"普陀山A") >=1  and not 战斗数据.PK战斗 then
				法伤 = qz( 法伤1 + self:取门派秘籍(攻击方.数字id,"普陀山A") * 8     )
  			end
--------------------------18奇技普陀山1-------------------------------

	elseif 名称 == "一苇渡江" then
		速度 = qz(等级 / 3)
		if 战斗数据:取经脉(攻击编号, "化生寺", "流刚") then
			速度 = qz(速度*1.18)
		end
		if 战斗数据:取被动(攻击编号,"度厄") then
			速度 = qz(速度*0.5)
		end
	elseif 名称 == "功德无量" then
		local fyjn = 战斗数据:解除状态结果(挨打方, 初始技能计算:取封印状态法术(), 1)
		if #fyjn > 0 then
			local jczt = fyjn[取随机数(1, #fyjn)]
			战斗数据:取消状态(jczt, 挨打方)
		end
		法伤 = qz( 法伤1 * 0.12 )
		if 攻击编号==挨打方.序号 then
			回合 = 6
		end
	-----------------------魔王寨-----------------------
	elseif 名称 == "火甲术" then
		if 战斗数据:取经脉(攻击编号, "魔王寨", "返火") then
			挨打方.法术状态[名称].返火 = true
		end
	elseif 名称 == "牛劲" then
		法术伤害结果 = qz(等级 * 1.8)
		if 战斗数据:取经脉(攻击编号, "魔王寨", "充沛") then
			挨打方.法术状态[名称].充沛 = 1
			法术伤害结果 = qz(法术伤害结果 * 1.2)
		end
		if 战斗数据:取经脉(攻击编号, "魔王寨", "炙烤") then
			回合 = 7
			战斗数据:添加状态("炙烤",挨打方,挨打方,69,nil,7)
		end
	elseif 名称 == "风火燎原" then
		if 战斗数据:取经脉(攻击编号, "魔王寨", "风火燎原") then
			回合 = 6
			战斗数据:添加状态("牛劲",挨打方,挨打方,69,nil,6)
		end
	elseif 名称 == "赤焰" then
		回合 = 3
		挨打方.法术状态[名称].恢复魔法 = 15 + qz(境界*1.25)
		if 战斗数据:取经脉(攻击编号, "魔王寨", "赤暖") then
			挨打方.法术状态[名称].恢复气血 = 挨打方.法术状态[名称].恢复魔法*10
		end
	-----------------------神木林-----------------------
	elseif 名称 == "风灵" then
		回合 = 150
		local fl = qz(等级/60)
		if fl<1 then
			fl=1
		end
		挨打方.法术状态[名称].层数 = fl
		if 指定 then
			挨打方.法术状态[名称].层数 = 指定
		end
	elseif 名称 == "雾杀" then
		回合 = 4
		挨打方.法术状态[名称].层数 = 1
		if 指定 then
			挨打方.法术状态[名称].层数 = 指定
		end
		if 战斗数据:取经脉(攻击编号, "神木林", "迷缚") then
			挨打方.法术状态[名称].迷缚 = 攻击编号
		end
		挨打方.法术状态[名称].等级 = 等级
	elseif 名称 == "炎护" then
		if 战斗数据:风灵消耗(攻击方,"炎护",1)==1 then
			挨打方.法术状态[名称].恢复魔法 = qz(等级*2)
		end
	elseif 名称 == "凋零之歌" then
		挨打方.法术状态[名称].加伤 = 1+(16+2*指定)/100
	elseif 名称 == "蜜润" then
		法伤 = qz(等级)
		if 战斗数据:取经脉(攻击编号, "神木林", "滋养") then
			法伤 = 法伤 + qz(法伤1*0.15)
			挨打方.法术状态[名称].滋养 = 1
		end
		if 攻击方.蜜润翻倍 then
			回合 = 回合 * 2
		end
	-----------------------方寸山-----------------------
	elseif 名称 == "催眠符" then
		挨打方.法术状态[名称].附加参数 = 1
		if 战斗数据:取经脉(攻击编号, "方寸山", "黄粱") then
			挨打方.法术状态[名称].附加参数 = 30
		end
		挨打方.法术状态[名称].当前回合 = 1
	elseif 名称 == "碎甲符" then
		防御 = qz(等级)
		法防 = qz(等级)
		if 战斗数据:取经脉(攻击编号, "方寸山", "碎甲") then
			挨打方.法术状态[名称].减双抗 = 等级
			挨打方.法术状态[名称].递减名称="减双抗"
			挨打方.法术状态[名称].回合递减=qz(等级*0.2)
			挨打方.法术状态[名称].负面="减双抗"
		end
	elseif 名称 == "分身术" then
		if 战斗数据:取经脉(攻击编号, "方寸山", "化身") then
			回合 = 回合 + 1
		end
		if 战斗数据:取经脉(攻击编号, "方寸山", "幻变") then
			挨打方.法术状态[名称].减伤 = 0.2
		elseif 战斗数据:取经脉(攻击编号, "方寸山", "批亢") then
			挨打方.法术状态[名称].减伤 = 0.15
		end
	elseif 	战斗数据:取经脉(攻击编号, "方寸山", "吞雷") then
		挨打方.法术状态[名称].减伤 = 0.05
	-----------------------天宫-----------------------
	elseif 名称 == "天雷灌注" then
		挨打方.法术状态[名称].层数 = 1
		if 战斗数据:取经脉(攻击编号,"天宫", "雷吞") then
			if 战斗数据:取装备五行(攻击编号,3)=="金" then
				挨打方.法术状态[名称].层数 = 2
			end
			if 战斗数据:取装备五行(攻击编号,4)=="金" then
				挨打方.法术状态[名称].层数 = 3
			end
		end
	-----------------------普陀山-----------------------
	elseif 名称 == "普渡众生" then
		挨打方.法术状态[名称].等级 = 等级
		if 战斗数据:取经脉(攻击编号, "普陀山", "普照") then
			挨打方.法术状态[名称].普照 = 攻击编号
			攻击方.防御 = 攻击方.防御 + 15
			攻击方.法防 = 攻击方.法防 + 15
		end
		if 战斗数据:取经脉(攻击编号, "普陀山", "慈佑") and 战斗数据:取目标类型(挨打方.序号) == "召唤兽" then
			挨打方.法术状态[名称].慈佑 = 1
		end
		if 战斗数据:取经脉(攻击编号, "普陀山", "雨润") and 战斗数据:取目标类型(挨打方.序号) == "玩家" then
			挨打方.法术状态[名称].雨润 = 1
		end
		if 指定 then
			回合=指定
			if 回合>=8 then
				回合=8
			end
		end
		挨打方.法术状态[名称].首回合=1
	elseif 名称 == "颠倒五行" then
		if 战斗数据:取经脉(攻击编号, "普陀山", "清净") then
			战斗数据:添加状态("清净",挨打方,攻击方,69)
		end
		if 战斗数据:取经脉(攻击编号, "普陀山", "五行制化") then
			回合 = 回合 + 3
			挨打方.法术状态[名称].增加躲避=true
		end
		if 攻击编号==挨打方.序号 and 战斗数据:取经脉(攻击编号, "普陀山", "万象") then
			回合 = 回合 + 挨打方.五行珠
			挨打方.法术状态[名称].增加躲避=true
		end
	elseif 名称 == "紧箍咒" then
		if 战斗数据:取经脉(攻击编号, "普陀山", "庄严") then
			挨打方.法术状态[名称].庄严 = 攻击编号
			攻击方.防御 = 攻击方.防御 + 15
			攻击方.法防 = 攻击方.法防 + 15
		end
		if 战斗数据:取经脉(攻击编号, "普陀山", "默诵") then
			挨打方.法术状态[名称].默诵 = 1
			回合=回合+3
		end
		挨打方.法术状态[名称].掉血 = 战斗技能:紧箍咒(战斗数据,攻击编号,挨打方.序号)
	elseif 名称 == "剑意莲心" then
		if 战斗数据:取经脉(攻击编号, "普陀山", "莲音") and math.random(1,100)<=50 then
			战斗数据:添加状态("莲音",挨打方,攻击方,69)
		end
	-----------------------盘丝洞-----------------------
	elseif 名称 == "龙骇" then
		回合 = 150
		挨打方.法术状态[名称].触发 = 指定
	-----------------------盘丝洞-----------------------
	elseif 名称 == "天罗地网" then
		速度 = qz(等级*0.3)
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "迷瘴") then
			速度 = qz(速度 + (速度1*0.05))
			伤害 = qz(等级*1.5)
			法伤 = qz(等级*1.5)
		end
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "附骨") then
			挨打方.法术状态[名称].附骨=1
		end
		if 指定 then
			回合=指定
		end
		if 攻击方.门派=="盘丝洞" and 挨打方.类型=="角色" and 攻击方.JM.当前流派=="百媚魔姝" then --神迷被动
			战斗数据:增加愤怒(攻击编号,4)
			战斗数据:减少愤怒(挨打方.序号,4)
		end
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "障眼") then
			挨打方.法术状态[名称].障眼=攻击编号
		end
	elseif 名称 == "含情脉脉" then
		if 战斗数据:取指定法宝(攻击编号, "忘情") then
			挨打方.法术状态[名称].忘情 = 1-(战斗数据:取指定法宝境界(攻击编号, "忘情")+5)*0.01
		end
		if 战斗数据:取经脉(攻击编号,"盘丝洞", "忘忧") then
			挨打方.法术状态[名称].忘忧 = true
		end
	elseif 名称 == "偷龙转凤" then
		挨打方.法术状态[名称].损失魔法 = 挨打方.魔法
		战斗数据:减少魔法(挨打方.序号,挨打方.魔法)
	elseif 名称 == "魔音摄魂" then
		回合 = qz(等级 / 35) + 2
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "魔音") then
			挨打方.法术状态[名称].魔音 = 1
		end
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "绝殇") then
			挨打方.法术状态[名称].绝殇 = 战斗数据.回合数
		end
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "迷意") then
			挨打方.法术状态[名称].迷意 = 1
		end
	elseif 名称 == "瘴气" then
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "忘川") then
			回合 = 回合 + 3
		elseif 战斗数据:取经脉(攻击编号, "盘丝洞", "连绵") then
			回合 = 回合 + 4
		end
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "绝殇") then
			挨打方.法术状态[名称].绝殇 = 战斗数据.回合数
		end
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "意乱") then
			回合 = 回合 - 1
		end
		-- 挨打方.法术状态[名称].降魔 =1
		if 战斗数据:取经脉(攻击编号, "盘丝洞", "迷意") then
			挨打方.法术状态[名称].降魔 = 0.7
		end
	-----------------------阴曹地府-----------------------
	elseif 名称 == "魍魉追魂" then
		local num = 战斗数据:友方指定状态数量(攻击编号,"魍魉追魂")
		挨打方.法术状态[名称].增伤=(4+2*num)*0.01
	elseif 名称 == "尸腐毒" then
		if 战斗数据:取经脉(攻击编号, "阴曹地府", "入骨") then
			挨打方.法术状态[名称].入骨 = 0.05
		end
		if 挨打方.九幽~=nil then
			local 境界 = 挨打方.九幽
			挨打方.法术状态[名称].九幽=2
			挨打方.法术状态[名称].恢复气血=qz(30+(1+境界)*境界/2)
			挨打方.九幽 = nil
		end
	elseif 名称 == "幽冥鬼眼" then
		if 战斗数据:取经脉(攻击编号, "阴曹地府", "幽冥") then
			回合 = 回合 +1
		elseif 战斗数据:取经脉(攻击编号, "阴曹地府", "冥视") then
			挨打方.法术状态[名称].冥视 = 1
		end
		if 战斗数据:取经脉(攻击编号, "阴曹地府", "通瞑") then
			回合 = 回合 + 战斗数据:敌方指定状态数量(攻击编号,"尸腐毒")
		end
	elseif 名称 == "摄魂" then
		回合 = 3
		local num = 境界*0.0125
		if 战斗数据:取经脉(攻击编号, "阴曹地府", "聚魂") then
			num = num *1.045
		end
		if 战斗数据:取经脉(攻击编号, "阴曹地府", "拘魄") then
			num = num *1.06
		end
		if 战斗数据:取经脉(攻击编号, "阴曹地府", "狱火") then
			挨打方.法术状态[名称].狱火=1
		end
		挨打方.法术状态[名称].值 = num
	-----------------------五庄观-----------------------
	elseif (名称 == "日月乾坤" or 名称 == "侵蚀·日月乾坤·钻心" or 名称 == "侵蚀·日月乾坤·噬魂" or 名称 == "侵蚀·日月乾坤·刻骨") then
		if 战斗数据:取经脉(攻击编号, "五庄观", "陌宝") then
			挨打方.法术状态[名称].陌宝 = 1
		end
	elseif 名称 == "天地同寿" then
		if 战斗数据:取经脉(攻击编号,"五庄观","同辉") then
			回合 = 回合 + 2
			挨打方.法术状态[名称].同辉 = 1
		end
		防御=qz(防御1*0.5-防御1)
	elseif 名称 == "心随意动" then
		挨打方.法术状态[名称].经脉流派 = 攻击方.JM.当前流派
		if 攻击方.JM.当前流派=="乾坤力士" then
			伤害 = qz(战斗数据:取技能等级(攻击编号,"七星遁")*2.2)
		else
			挨打方.法术状态[名称].封印等级 = qz(战斗数据:取技能等级(攻击编号,"七星遁")*2.2)
		end
	elseif 名称 == "炼气化神" then
		挨打方.法术状态[名称].恢复魔法 = qz(等级)
		if 战斗数据:取经脉(攻击编号,"五庄观","行气") and 挨打方.序号==攻击编号 then
			回合 = 回合 + 3
		end
	elseif 名称 == "生命之泉" then
		挨打方.法术状态[名称].恢复气血 = qz(等级 + 150)
		挨打方.法术状态[名称].体恤 = 0
		if 战斗数据:取经脉(攻击编号,"五庄观","体恤") then
			挨打方.法术状态[名称].体恤=150
		end
		if 战斗数据:取经脉(攻击编号,"五庄观","运转") then
			回合 = 回合 - 3
			挨打方.法术状态[名称].运转 = 1
		end
--	elseif 名称 == "黑玉云苓膏" then
--			回合 = 2
--	elseif 名称 == "紫心玉露丸" then
--			回合 = 2

	-- elseif 名称 == "骤雨" then
	-- 	挨打方.法术状态[名称].上限 = 3
	-- 	if 战斗数据:取经脉(攻击编号,"五庄观","滂沱") then
	-- 	    挨打方.法术状态[名称].上限 = 5
	-- 	end
	-----------------------无底洞-----------------------
 	elseif 名称 == "裂魂" then
		回合 = 4
		挨打方.法术状态[名称].触发 = 指定
	elseif 名称 == "移魂化骨" then
		挨打方.法术状态[名称].吸血 = 等级/1000+0.05
	elseif 名称 == "夺魄令" then
		if 战斗数据:取被动(攻击编号, "缚魂") and not 战斗数据.PK战斗 then
			挨打方.法术状态[名称].封物理 = true
		end
		if 战斗数据:取经脉(攻击编号, "无底洞", "陷阱") then
			挨打方.法术状态[名称].陷阱 = true
		end
	elseif 名称 == "明光宝烛" then
		挨打方.法术状态[名称].加防 = 等级+15
		if 战斗数据:取经脉(攻击编号, "无底洞", "救人") then
			挨打方.法术状态[名称].加防 = qz(挨打方.法术状态[名称].加防*1.6)
			挨打方.法术状态[名称].救人=1
			回合 = 回合 - 1
		end
		if 战斗数据:取经脉(攻击编号, "无底洞", "精进") then
			挨打方.法术状态[名称].加防 = qz(挨打方.法术状态[名称].加防*2)
			挨打方.法术状态[名称].递减名称="加防"
			挨打方.法术状态[名称].回合递减=qz(挨打方.法术状态[名称].加防*0.4)
			if not 战斗数据.PK战斗 then
				挨打方.法术状态[名称].加防 = qz(挨打方.法术状态[名称].加防*1.5)
				挨打方.法术状态[名称].回合递减=qz(挨打方.法术状态[名称].加防*0.1)
			end
		end
	elseif 名称 == "金身舍利" then
		挨打方.法术状态[名称].加防 = 等级
		if 战斗数据:取经脉(攻击编号, "无底洞", "救人") then
			挨打方.法术状态[名称].加防 = qz(挨打方.法术状态[名称].加防*1.6)
			挨打方.法术状态[名称].救人=1
			回合 = 回合 - 1
		end
		if 战斗数据:取经脉(攻击编号, "无底洞", "精进") then
			挨打方.法术状态[名称].加防 = qz(挨打方.法术状态[名称].加防*2)
			挨打方.法术状态[名称].递减名称="加防"
			挨打方.法术状态[名称].回合递减=qz(挨打方.法术状态[名称].加防*0.4)
			if not 战斗数据.PK战斗 then
				挨打方.法术状态[名称].加防 = qz(挨打方.法术状态[名称].加防*1.5)
				挨打方.法术状态[名称].回合递减=qz(挨打方.法术状态[名称].加防*0.1)
			end
		end
	elseif 名称 == "燃血术" then
		挨打方.法术状态[名称].层数 = 1
		if 指定 then
			挨打方.法术状态[名称].强化 = 1
		end
		if 战斗数据:取经脉(攻击编号, "无底洞", "血潮") then
			挨打方.法术状态[名称].层数 = 2
		end
		if 战斗数据:取经脉(攻击编号, "无底洞", "华光") then
			挨打方.法术状态[名称].华光 = 1
		end
		if 战斗数据:取经脉(攻击编号, "无底洞", "椎骨") then
			挨打方.法术状态[名称].椎骨 = 1
		end
-----------------------凌波城-----------------------
	elseif 名称 == "碎星诀" then
		物理伤害结果 = 等级+10
		-- 挨打方.法术状态[名称].递增=qz((等级+10)/4)
		-- 挨打方.法术状态[名称].递增次数=0
		if 战斗数据:取经脉(攻击编号, "凌波城", "战诀") and 挨打方.序号==攻击编号 then
			战斗数据:增加战意(攻击编号, 1)
		end
	elseif 名称 == "镇魂诀" then
		挨打方.法术状态[名称].加必杀 = 16
		-- 挨打方.法术状态[名称].递增=4
		-- 挨打方.法术状态[名称].递增次数=0
		if 战斗数据:取经脉(攻击编号, "凌波城", "战诀") and 挨打方.序号==攻击编号 then
			战斗数据:增加战意(攻击编号, 1)
		end
	elseif 名称 == "天眼" then
		挨打方.法术状态[名称].加必杀 = 20
            elseif 名称 == "智眼" then
		if math.random(100)<=50 then
			战斗数据:增加战意(攻击编号, 1)
		end
	elseif 名称 == "怒眼" then
		物理伤害结果 = 等级+15
	elseif 名称 == "天眼神通" then
		if 攻击方.JM.当前流派=="风云战将" then
			回合 = 1
			if not 战斗数据:取经脉(攻击编号, "凌波城", "盛势") or 战斗数据:取经脉(攻击编号, "凌波城", "天眼") then
				if math.random(210)<=30 then
				   战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
	elseif math.random(210)<=60 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(210)<=90 then
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(210)<=120 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		 战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif math.random(210)<=150 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(210)<=180 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif math.random(210)<=210 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	 	战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
	end
	elseif 战斗数据:取经脉(攻击编号, "凌波城", "天眼") then
		if math.random(210)<=25 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
	elseif math.random(210)<=50 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(210)<=75 then
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(210)<=100 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif math.random(210)<=125 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(210)<=150 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif math.random(210)<=210 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	 	战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
	end
	elseif 战斗数据:取经脉(攻击编号, "凌波城", "盛势") then
		if math.random(265)<=30 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
	elseif math.random(265)<=60 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(265)<=90 then
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(265)<=135 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif math.random(265)<=175 then
		战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
	elseif  math.random(265)<=220 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	elseif math.random(265)<=265 then
		战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
		战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	 	战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		end
			end
		end
		if 战斗数据:取经脉(攻击编号, "凌波城", "蓄势")  and math.random (100)<=50 then
	               战斗数据:增加战意(攻击编号, 1)
		end
	elseif 名称 == "耳目一新" then
		if 挨打方.法术状态[名称].智眼~=nil then
		    	战斗数据:取消状态("智眼", 挨打方)
		 end
		 if 挨打方.法术状态[名称].天眼~=nil then
		    	战斗数据:取消状态("天眼", 挨打方)
		 end
		 if 挨打方.法术状态[名称].怒眼~=nil then
		    	战斗数据:取消状态("怒眼", 挨打方)
		 end
		  if math.random(265)<=30 then
				   战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
				  elseif math.random(265)<=60 then
				   战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
				  elseif  math.random(265)<=90 then
				   战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
				  elseif  math.random(265)<=135 then
				    战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
				    战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
				  elseif math.random(265)<=175 then
				    战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
				    战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
				  elseif  math.random(265)<=220 then
				    战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
				    战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
				  elseif math.random(265)<=265 then
				    战斗数据:添加状态("智眼",挨打方,挨打方,69,nil,6)
				    战斗数据:添加状态("怒眼",挨打方,挨打方,69,nil,6)
	 			    战斗数据:添加状态("天眼",挨打方,挨打方,69,nil,6)
		   end
	-----------------------花果山-----------------------
	elseif 名称 == "杀威铁棒" then
		挨打方.法术状态[名称].攻击 = 攻击编号
	elseif 名称 == "铜头铁臂" then
		if 攻击方.JM.当前流派=="通天行者" then
			挨打方.法术状态[名称].颜色="青"
		else
			挨打方.法术状态[名称].颜色="红"
		end
	elseif 名称 == "无所遁形" then
		if 战斗数据:取经脉(攻击编号, "花果山", "翻天") then
			回合 = 7
		end
		挨打方.法术状态[名称].层数 = 1
		if 战斗数据:取经脉(攻击编号, "花果山", "添威") and 取随机数()<=20 then
			挨打方.法术状态[名称].层数 = 2
		end
		if 攻击方.JM.当前流派=="通天行者" then
			挨打方.法术状态[名称].颜色="法"
		else
			挨打方.法术状态[名称].颜色="物"
		end
	elseif 名称 == "八戒上身" then
		local fyjn = 战斗数据:解除状态结果(挨打方, 初始技能计算:取可驱散增益状态())
		if #fyjn > 0 then
			local jczt = fyjn[取随机数(1,#fyjn)]
			战斗数据:取消状态(jczt,挨打方)
		end
		战斗数据.执行等待 = 战斗数据.执行等待 + 3 --执行等待是啥 如果时间短 会直接跳过的
		战斗数据.战斗流程[#战斗数据.战斗流程+1]={流程=709,攻击方=攻击编号,挨打方=挨打方.序号,参数="小猪"} --变猪
	----灵宝----------------------
    elseif 名称 == "真阳令旗" then
		类型 = 2
		伤害=qz(伤害1*0.1)
		法伤=qz(法伤1*0.1)
  --   elseif 名称 == "赤炎战笛" then
		-- 类型 = 2
		-- 伤害=qz(伤害1*1.5)
		-- 法伤=qz(法伤1*1.5)
	----宝宝技能----------------------
	elseif 名称 == "进击必杀" then
		挨打方.法术状态[名称].加必杀 = 15
	elseif 名称 == "高级进击必杀" then
		挨打方.法术状态[名称].加必杀 = 30
	elseif 名称 == "进击法暴" then
		挨打方.法术状态[名称].加法暴 = 15
	elseif 名称 == "高级进击法暴" then
		挨打方.法术状态[名称].加法暴 = 30
	----法宝----------------------
	elseif 名称 == "乾坤玄火塔" then
		回合 = 5
		local 愤怒 = 150*0.02 + 境界*1.2 + 1
		if 战斗数据:取法宝五行(攻击编号, 战斗数据.参战单位[攻击编号].玩家id)=="火" then
			愤怒 = 愤怒 + 2
		elseif 战斗数据:取法宝五行(攻击编号, 战斗数据.参战单位[攻击编号].玩家id)=="水" then
			愤怒 = 愤怒 - 2
		end
		战斗数据:增加愤怒(攻击编号,愤怒)
	elseif 名称 == "苍灵雪羽"  then
		回合 = 1
		挨打方.法术状态[名称].加伤 = 境界 * 0.004 + 0.01 --0.08
		法防 = qz(法防1*0.06)
		elseif 名称 == "烽火狼烟"  then
		回合 = 1
		防御 = qz(防御1 * 0.06)
		挨打方.法术状态[名称].加伤 = 境界 * 0.004 + 0.01 --0.08
		elseif 名称 == "无尘扇" then
		回合 = 3
		挨打方.法术状态[名称].减愤怒 = 境界 + 1
		elseif 名称 == "神木宝鼎" then
		回合 = 3
		法伤 = qz(法伤1*(境界*0.01))
		类型 = 2
		elseif 名称 == "赤焰" then
		回合 = 3
		挨打方.法术状态[名称].恢复魔法 = 15 + (境界*1.25)
		if 战斗数据:取经脉(攻击编号, "魔王寨", "赤暖") then
			挨打方.法术状态[名称].恢复气血 = 挨打方.法术状态[名称].恢复魔法*10
		end
	end
	-- if 战斗数据:取经脉(攻击编号, "脱壳") and  初始技能计算:减益技能(名称) and 回合 > 5 then
	-- 	回合 = 5
	-- end
	if 回合==nil or 回合 < 1 then
		回合 =1
	end
	if 套装状态 then
		回合=4
		if 等级>攻击方.等级 then
			回合=8
		end
		if 名称=="楚楚可怜" or 名称=="修罗隐身" then
			回合=2
			if 等级>攻击方.等级 then
				回合=5
			end
		end
	end
	if 是否增益 then
		if 挨打方.永恒~=nil then
			local zj = qz(回合 * 挨打方.永恒)
			if 挨打方.永恒<2 and zj>3 then
				zj = 3
			elseif 挨打方.永恒==2 and zj>6 then
				zj = 6
			end
			回合 = 回合 + zj
		end
		if 挨打方.增益==nil then
			挨打方.增益 = 0
		end
		挨打方.增益=挨打方.增益+1
		if 法宝增益 then
			if 挨打方.法宝增益==nil then
				挨打方.法宝增益 = 0
			end
			挨打方.法宝增益=挨打方.法宝增益+1
		end
	end
	挨打方.法术状态[名称].伤害 = 伤害
	挨打方.法术状态[名称].防御 = 防御
	挨打方.法术状态[名称].速度 = 速度
	挨打方.法术状态[名称].法防 = 法防
	挨打方.法术状态[名称].法伤 = 法伤
	挨打方.法术状态[名称].躲避 = 躲避
	挨打方.法术状态[名称].回合 = 回合
	挨打方.法术状态[名称].命中 = 命中
	挨打方.法术状态[名称].类型 = 类型
	挨打方.法术状态[名称].参数 = 参数
	挨打方.法术状态[名称].物理伤害结果 = 物理伤害结果
	挨打方.法术状态[名称].法术伤害结果 = 法术伤害结果
	-- 挨打方.法术状态[名称].回合初始 = 回合
	if 类型 == 1 then
		挨打方.伤害 = 挨打方.伤害 - 伤害
		挨打方.防御 = 挨打方.防御 - 防御
		挨打方.速度 = 挨打方.速度 - 速度
		挨打方.法防 = 挨打方.法防 - 法防
		挨打方.法伤 = 挨打方.法伤 - 法伤
		挨打方.躲避 = 挨打方.躲避 - 躲避
		挨打方.命中 = 挨打方.命中 - 命中
		挨打方.物理伤害结果 = 挨打方.物理伤害结果 - 物理伤害结果
		挨打方.法术伤害结果 = 挨打方.法术伤害结果 - 法术伤害结果
		-- if 挨打方.序号~=攻击方.序号 then
		--     if 防御~=0 and 法防~=0 then
		-- 	    挨打方.法术状态[名称].双减=true
		--     elseif 防御~=0 and 法防==0 then
		--     	挨打方.法术状态[名称].减防御=true
	 --    	elseif 防御~=0  then
		--     	挨打方.法术状态[名称].减法防=true
		-- 	end
		-- end
	else
		挨打方.伤害 = 挨打方.伤害 + 伤害
		挨打方.防御 = 挨打方.防御 + 防御
		挨打方.速度 = 挨打方.速度 + 速度
		挨打方.法防 = 挨打方.法防 + 法防
		挨打方.法伤 = 挨打方.法伤 + 法伤
		挨打方.躲避 = 挨打方.躲避 + 躲避
		挨打方.命中 = 挨打方.命中 + 命中
		挨打方.物理伤害结果 = 挨打方.物理伤害结果 + 物理伤害结果
		挨打方.法术伤害结果 = 挨打方.法术伤害结果 + 法术伤害结果
	end
	if 战斗数据.战斗流程[#战斗数据.战斗流程] ~= nil then
		if 战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加 == nil then
			战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加 = {}
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加[#战斗数据.战斗流程[#战斗数据.战斗流程].状态处理添加 + 1] = {编号 = 挨打方.序号, 名称 = 名称,回合=挨打方.法术状态[名称].回合,颜色=挨打方.法术状态[名称].颜色,层数=挨打方.法术状态[名称].层数,负面状态=挨打方.法术状态[名称].负面,数据=挨打方.法术状态[名称]}
	end
end

function 状态处理:取消状态(战斗数据, 名称, 挨打方)
	if 挨打方.法术状态[名称] == nil then
		return
	end
	if 挨打方.法术状态[名称].类型 == 2 then --增益
		挨打方.伤害 = 挨打方.伤害 - 挨打方.法术状态[名称].伤害
		挨打方.防御 = 挨打方.防御 - 挨打方.法术状态[名称].防御
		挨打方.速度 = 挨打方.速度 - 挨打方.法术状态[名称].速度
		挨打方.法防 = 挨打方.法防 - 挨打方.法术状态[名称].法防
		挨打方.法伤 = 挨打方.法伤 - 挨打方.法术状态[名称].法伤
		挨打方.躲避 = 挨打方.躲避 - 挨打方.法术状态[名称].躲避
		挨打方.命中 = 挨打方.命中 - 挨打方.法术状态[名称].命中
		挨打方.物理伤害结果 = 挨打方.物理伤害结果 - 挨打方.法术状态[名称].物理伤害结果
		挨打方.法术伤害结果 = 挨打方.法术伤害结果 - 挨打方.法术状态[名称].法术伤害结果
	else
		挨打方.伤害 = 挨打方.伤害 + 挨打方.法术状态[名称].伤害
		挨打方.防御 = 挨打方.防御 + 挨打方.法术状态[名称].防御
		挨打方.速度 = 挨打方.速度 + 挨打方.法术状态[名称].速度
		挨打方.法防 = 挨打方.法防 + 挨打方.法术状态[名称].法伤
		挨打方.法伤 = 挨打方.法伤 + 挨打方.法术状态[名称].法防
		挨打方.躲避 = 挨打方.躲避 + 挨打方.法术状态[名称].躲避
		挨打方.命中 = 挨打方.命中 + 挨打方.法术状态[名称].命中
		挨打方.物理伤害结果 = 挨打方.物理伤害结果 + 挨打方.法术状态[名称].物理伤害结果
		挨打方.法术伤害结果 = 挨打方.法术伤害结果 + 挨打方.法术状态[名称].法术伤害结果
	end
	if 名称=="普渡众生" and 挨打方.法术状态[名称].普照~=nil then
		local bh = 挨打方.法术状态[名称].普照
		战斗数据.参战单位[bh].防御 = 战斗数据.参战单位[bh].防御 - 15
		战斗数据.参战单位[bh].法防 = 战斗数据.参战单位[bh].法防 - 15
	end
	if 名称=="紧箍咒" and 挨打方.法术状态[名称].庄严~=nil then
		local bh = 挨打方.法术状态[名称].庄严
		战斗数据.参战单位[bh].防御 = 战斗数据.参战单位[bh].防御 - 15
		战斗数据.参战单位[bh].法防 = 战斗数据.参战单位[bh].法防 - 15
	end

	local zza = skill.数据[名称]
	if 挨打方.增益~=nil and zza~=nil and zza.技能类型=="增益技能" then
		挨打方.增益=挨打方.增益-1
		if 挨打方.增益<0 then
			挨打方.增益=0
		end
		if zza.法宝增益 then
			if 挨打方.法宝增益~=nil then
				挨打方.法宝增益=挨打方.法宝增益-1
				if 挨打方.法宝增益<0 then
					挨打方.法宝增益=0
				end
			end
		end
	end

	挨打方.法术状态[名称] = nil
	if 战斗数据.战斗流程[#战斗数据.战斗流程] ~= nil then
		if 战斗数据.战斗流程[#战斗数据.战斗流程].状态处理取消 == nil then
			战斗数据.战斗流程[#战斗数据.战斗流程].状态处理取消 = {}
		end
		战斗数据.战斗流程[#战斗数据.战斗流程].状态处理取消[#战斗数据.战斗流程[#战斗数据.战斗流程].状态处理取消 + 1] = {编号 = 挨打方.序号, 名称 = 名称}
	end
end

function 状态处理:取门派秘籍(id,技能)
	if id == 0 or id == nil or id == "" then return 0 end
  local lv=0
  if id~=nil and 技能~=nil and 玩家数据[id].角色.门派秘籍~=nil and 玩家数据[id].角色.门派秘籍[技能]~=nil then
     lv=玩家数据[id].角色.门派秘籍[技能]
  end
  return lv
end


return 状态处理