-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:38
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-16 20:34:35
local 副本_一斛珠 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local npc={老道士="男人_道士",钱庄伙计="男人_店小二",花儿匠="樵夫",看热闹的小姑娘="女人_绿儿",守门狗儿="狼",主婚人="月老",吹鼓手="吹号手",侍女="女随从",新郎="骑马新郎",轿子="轿子",媒婆="媒婆",叶夫人="女人_程夫人",总镖头="罗百万",崔博衙="奸商",老书生="男人_老书生",鸾儿="狐美人",新郎沈唐="逍遥生",崔明珠="英女侠",官兵="天兵",无名人="男人_老伯",夜影迷踪="蛟龙",沈唐="鲛人"} --模型,名字

function 副本_一斛珠:初始化()
	地图处理类.地图数据[7006]={npc={},单位={},传送圈={}} --四方城
	地图处理类.地图玩家[7006]={}
	地图处理类.地图坐标[7006]=地图处理类.地图坐标[1237]
	地图处理类.地图单位[7006]={}
	地图处理类.单位编号[7006]=1000

	地图处理类.地图数据[7007]={npc={},单位={},传送圈={}} --崔府正厅
	地图处理类.地图玩家[7007]={}
	地图处理类.地图坐标[7007]=地图处理类.地图坐标[1056]
	地图处理类.地图单位[7007]={}
	地图处理类.单位编号[7007]=1000

	地图处理类.地图数据[7008]={npc={},单位={},传送圈={}} --沧浪墟
	地图处理类.地图玩家[7008]={}
	地图处理类.地图坐标[7008]=地图处理类.地图坐标[1041]
	地图处理类.地图单位[7008]={}
	地图处理类.单位编号[7008]=1000
end

function 副本_一斛珠:开启副本(id)
	if 服务端参数.小时+0 >= 23 then
		常规提示(id,"#Y/23点后不可做副本任务")
		return
	end
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif  取等级要求(id,50)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于50级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.如梦奇谭之一斛珠.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(690)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
		if not 玩家数据[临时id].道具:判定背包道具(临时id,"癫散戏票·一斛珠",1) then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."没有副本任务道具“癫散戏票·一斛珠”，无法开启副本。")
			常规提示(临时id,"#Y你没有副本任务道具“癫散戏票·一斛珠”，无法开启副本。")
			return
		end
	end
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		玩家数据[临时id].道具:消耗背包道具(玩家数据[临时id].连接id,临时id,"癫散戏票·一斛珠",1)
	end
	副本数据.如梦奇谭之一斛珠.进行[id]={进程=1}
	local 任务id,ZU=取唯一任务(690,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=7200,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		类型=690
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了如梦奇谭之一斛珠副本")
	刷新任务690(id)
end

function 刷新任务690(id)
	local id = 任务处理类:取副本id(id,690)
	if 副本数据.如梦奇谭之一斛珠.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.如梦奇谭之一斛珠.进行[id].进程==1 then
		local 地图=7006 --四方城
		local 任务id=id.."_691_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="老道士",
			模型="男人_道士",
			x=142,
			y=50,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=691
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_691_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="钱庄伙计",
			模型="男人_店小二",
			x=104,
			y=67,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=691
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_691_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="看热闹的小姑娘",
			模型="女人_绿儿",
			x=36,
			y=72,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=691
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_691_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="守门狗儿",
			模型="狼",
			x=45,
			y=75,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=691
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,7006,159,45) --跳转到动画地图
		local text1={{"半生潦倒","唯余荒唐一梦","梦里恍惚","怎记今夕何夕"},{"唯有四方城中","灯火阑珊"}}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="一斛珠序",字体=nil,音乐=nil,背景=nil,横排显示=nil,动画调用=nil})
		end

	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==2 then
		local 地图=7006 --四方城
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="主婚人",
			模型="月老",
			x=15,
			y=36,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="吹鼓手",
			模型="吹号手",
			x=16,
			y=43,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="吹鼓手",
			模型="吹号手",
			x=26,
			y=39,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="侍女",
			模型="女随从",
			x=22,
			y=42,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="新郎",
			模型="骑马新郎",
			x=27,
			y=47,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="轿子",
			模型="轿子",
			x=24,
			y=51,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="媒婆",
			模型="媒婆",
			x=7,
			y=45,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)

		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="总镖头",
			模型="罗百万",
			x=19,
			y=48,
			方向=2,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="崔博衙",
			模型="奸商",
			x=31,
			y=37,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="老书生",
			模型="男人_老书生",
			x=3,
			y=47,
			方向=3,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_692_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="鸾儿",
			模型="狐美人",
			--锦衣="花间梦",
			x=41,
			y=43,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=692
		}
		地图处理类:添加单位(任务id)
		local text1={"砰!  砰!砰!来人呐!","叶夫人和鸾儿姑娘晕倒啦!"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="一斛珠1",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
		end

	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==3 then
			任务处理类:删除副本单位(id,690,691)
			任务处理类:删除副本单位(id,690,692)
			local 任务id=id.."_693_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=7006
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="叶夫人",
				模型="女人_程夫人",
				销毁=true,
				副本重置=true,
				x=13,
				y=52,
				方向=3,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=693
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==4 then
			local 地图=7007 --
			local 任务id=id.."_694_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="新郎沈唐",
				模型="逍遥生",
				武器="星瀚",
				销毁=true,
				副本重置=true,
				x=27,
				y=14,
				方向=4,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=694
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_694_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="崔明珠",
				模型="英女侠",
				销毁=true,
				副本重置=true,
				x=29,
				y=12,
				方向=4,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=694
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_694_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="官兵",
				模型="天兵",
				销毁=true,
				副本重置=true,
				x=42,
				y=22,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=694
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,7007,33,26)
	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==5 then

	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==6 then

	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==7 then
			任务处理类:删除副本单位(id,690,693)
			local 地图=7006
			local 任务id=id.."_697_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="无名人",
				模型="男人_老伯",
				销毁=true,
				副本重置=true,
				x=90,
				y=9,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=697
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,7006,71,27)
			local text1 = {"号外号外！一斛珠是何物制成？","服药人为何失控？尽在大唐时报"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="一斛珠2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end

	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==8 then
			local 地图=7006
			local 任务id=id.."_698_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="新郎沈唐",
				模型="逍遥生",
				武器="星瀚",
				销毁=true,
				副本重置=true,
				x=143,
				y=94,
				方向=3,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=698
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==9 then
			local 地图=7008
		            local 任务id=id.."_699_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				销毁=true,
				副本重置=true,
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="夜影迷踪",
				模型="蛟龙",
				x=35,
				y=72,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=699
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,7008,19,85)
			local text1 = {"沈唐见打不过一溜烟跑了","你也跟着不知道追到了什么地方"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="一斛珠3",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
			end

	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==10 then
			local 地图=7008
		            local 任务id=id.."_700_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				销毁=true,
				副本重置=true,
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="沈唐",
				模型="鲛人",
				x=73,
				y=59,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=700
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.如梦奇谭之一斛珠.进行[id].进程==11 then
		local 任务id=玩家数据[id].角色:取任务(690)
		local text1={{"沈唐倒下后","交代了一切"},{"原来沈唐的妹妹作为鲛人","爱上了崔家老爷","但崔老爷知道真相后","却将沈唐族人屠戮殆尽"},{"也是一个苦命人呐","哎","万事起始必有因果"},{"一斛珠  完"}}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.如梦奇谭之一斛珠.完成[临时id]=true
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="一斛珠结束",字体=nil,音乐=nil,背景=nil,横排显示=nil,动画=nil})
		end
	end
end

function 副本_一斛珠:怪物对话内容(id,类型,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,690)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
		return 对话数据
	end
	if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==1 then --走的这里啊
		if 对话数据.名称=="钱庄伙计" then
			对话数据.对话 = "听你口音是外乡人吧？来的正是时候，今日城里大户崔家大小姐出嫁，你赶得快可以去讨杯酒喝！"
			对话数据.选项 = {"看来今日是来对了！谢过小哥了。"}
		elseif 对话数据.名称=="看热闹的小姑娘" then
			对话数据.对话 = "你是来祝贺明珠姐姐出嫁的吗？快进去吧，婚礼已经开始了！"
			对话数据.选项 = {"嘿嘿，小妹妹你也一同来吧"}
		else
			对话数据.对话="发生肾么事了"
		end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==2 then
		if 对话数据.名称=="鸾儿" then
			对话数据.对话 = "这该死的田百万，骗财骗色，今日老娘终于找到你了！今日这里的所有人都要和你陪葬#4。"
			对话数据.选项 = {"鸾儿姑娘，休要如此鲁莽","有些尴尬。。"}
		end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==3 then
			if 对话数据.名称=="叶夫人" then
				对话数据.对话 = "嘿嘿嘿...崔家明珠小姐，今日是你大喜日子，那我们就热闹一下吧！"
				对话数据.选项 = {"叶夫人不要妄动","这....好尴尬啊"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==4 then
			if 对话数据.名称=="新郎沈唐" then
				对话数据.对话 = "少侠你可来了#52（不等你开口，沈唐就抢先说道）..其实我岳父刚才在婚礼上就被官兵抓走了，我们的铺子，仓库也都被查封了。如今官服咬定我们家出售的“一斛珠”有问题，你看，房内这官兵还说要把我娘子抓起来呢#52"
				对话数据.选项 = {"先拦下官兵，再询问事情真相","活该抓你"}
			elseif 对话数据.名称=="崔明珠" then
				对话数据.对话 = "我们家不可能卖假货啊#15这些货都是夫君搞来的"
				对话数据.选项 = {"。。。。"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==5 then
			if 对话数据.名称=="官兵" then
				对话数据.对话 = "你小子想干嘛？#24不要妨碍公务"
				对话数据.选项 = {"小人先得罪了","没事大爷，我就看看"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==6 then
			if 对话数据.名称=="崔明珠" then
				对话数据.对话 = "我们家不可能卖假货啊#15这些货都是夫君搞来的。怎么办呢，爹爹也被抓了。"
				对话数据.选项 = {"那我就帮崔小姐调查此事的来龙去脉吧","你活该"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==7 then
			if 对话数据.名称=="无名人" then
				对话数据.对话 = "什么一斛珠啊，不过是一些水底的凡物被施了一些小手段，短时间内会让人感觉精神百倍，长久下来，身体会慢慢中毒，腐烂！意识也会模糊，所以服用之人才会看谁都像妖怪！#99应该是崔家那入赘女婿搞的鬼，方才看到他鬼鬼祟祟的在不远处，你去问问他吧。"
				对话数据.选项 = {"多谢老大爷了"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==8 then
			if 对话数据.名称=="新郎沈唐" then
				对话数据.对话 = "如今怕是你也知道一斛珠的事情了，那便不能留你了！#4"
				对话数据.选项 = {"先将他擒下再说","看起来功夫很高的样子,我先溜了"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==9 then
			if 对话数据.名称=="夜影迷踪" then
				对话数据.对话 = "你是何人，为何闯入沧浪墟！"
				对话数据.选项 = {"只能先击败他了","没事，我就闲逛逛"}
			end
	elseif 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==10 then
			if 对话数据.名称=="沈唐" then
				对话数据.对话 = "没想到你竟能追到我族禁地，也罢，只要杀了你就再没人打扰我了，我就可以向崔家复仇了！"
				对话数据.选项 = {"那就手底下见真章吧","我先溜了"}
			end
	end
	return 对话数据
end

function 副本_一斛珠:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,690)
	if 类型 == 691 and 名称=="看热闹的小姑娘" and  事件=="嘿嘿，小妹妹你也一同来吧" then
		副本数据.如梦奇谭之一斛珠.进行[副本id] = {进程=2}
		刷新队伍任务追踪(id)
		刷新任务690(副本id)
	elseif 类型 == 692 and 名称=="鸾儿" and  事件=="鸾儿姑娘，休要如此鲁莽" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190101,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 693 and 名称=="叶夫人" and  事件=="叶夫人不要妄动" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==3 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190102,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 694 and 名称=="新郎沈唐" and  事件=="先拦下官兵，再询问事情真相" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==4 then
			副本数据.如梦奇谭之一斛珠.进行[副本id] = {进程=5}
			刷新队伍任务追踪(id)
			刷新任务690(副本id)
		end
	elseif 类型 == 694 and 名称=="官兵" and  事件=="小人先得罪了" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190103,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 694 and 名称=="崔明珠" and  事件=="那我就帮崔小姐调查此事的来龙去脉吧" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==6 then
			副本数据.如梦奇谭之一斛珠.进行[副本id] = {进程=7}
			刷新队伍任务追踪(id)
			刷新任务690(副本id)
		end
	elseif 类型 == 697 and 名称=="无名人" and  事件=="多谢老大爷了" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==7 then
			副本数据.如梦奇谭之一斛珠.进行[副本id] = {进程=8}
			刷新队伍任务追踪(id)
			刷新任务690(副本id)
		end
	elseif 类型 == 698 and 名称=="新郎沈唐" and  事件=="先将他擒下再说" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==8 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190104,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 699 and 名称=="夜影迷踪" and  事件=="只能先击败他了" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==9 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190105,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 700 and 名称=="沈唐" and  事件=="那就手底下见真章吧" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==10 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190106,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 700 and 名称=="沈唐" and  事件=="只能回去和崔家如实说了" then
		if 副本数据.如梦奇谭之一斛珠.进行[副本id].进程==11 then
			副本数据.如梦奇谭之一斛珠.进行[副本id] = {进程=12}
			刷新队伍任务追踪(id)
			刷新任务690(副本id)
		end
	end
end

function 副本_一斛珠:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,690)
	if 副本id == 0 then return end
	if 战斗类型 == 190101 then
		副本数据.如梦奇谭之一斛珠.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		刷新任务690(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190102 then
		副本数据.如梦奇谭之一斛珠.进行[副本id]={进程=4}
		任务数据[任务id].zhandou = nil
		刷新任务690(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190103 then
		副本数据.如梦奇谭之一斛珠.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		刷新任务690(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190104 then
		副本数据.如梦奇谭之一斛珠.进行[副本id]={进程=9}
		任务数据[任务id].zhandou = nil
		刷新任务690(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190105 then
		副本数据.如梦奇谭之一斛珠.进行[副本id]={进程=10}
		任务数据[任务id].zhandou = nil
		刷新任务690(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190106 then
		副本数据.如梦奇谭之一斛珠.进行[副本id]={进程=11}
		任务数据[任务id].zhandou = nil
		刷新任务690(副本id)
		刷新队伍任务追踪(id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_一斛珠:完成奖励(id组,战斗类型)
	if 战斗类型 == 190101 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2000,2500)
			local 银子=等级*取随机数(150,180)+30000
			玩家数据[cyid].角色:添加经验(经验,"一斛珠鸾儿")
			玩家数据[cyid].角色:添加银子(银子,"一斛珠鸾儿",1)
			if 取随机数()<=20 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        		 if 奖励参数<=20 then
				local 名称=取随机玄灵珠()
				玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=35 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=45 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=65 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=75 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=90 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,30),nil,链接)

				elseif 奖励参数<=95 then
					local 名称="玲珑宝图"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				-- elseif 奖励参数<=80 then
				-- 	local 名称=取宝宝装备()
				-- 	local lv = math.min(qz(等级/10),13)
				-- 	玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190102 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2550,2750)
			local 银子=等级*取随机数(150,180)+25000
			玩家数据[cyid].角色:添加经验(经验,"一斛珠叶夫人")
			玩家数据[cyid].角色:添加银子(银子,"一斛珠叶夫人",1)

			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
       			if 奖励参数<=10 then
				local 名称=取随机玄灵珠()
				玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(15,20),nil,链接)
				elseif 奖励参数<=60 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190103 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2550,2750)
			local 银子=等级*取随机数(150,180)+25000
			玩家数据[cyid].角色:添加经验(经验,"一斛珠官兵")
			玩家数据[cyid].角色:添加银子(银子,"一斛珠官兵",1)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        		if 奖励参数<=10 then
				    local 名称=取随机玄灵珠()
				    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(20,25),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190104 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2550,2800)
			local 银子=等级*取随机数(150,180)+26000
			玩家数据[cyid].角色:添加经验(经验,"一斛珠新郎沈唐")
			玩家数据[cyid].角色:添加银子(银子,"一斛珠新郎沈唐",1)
			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        		if 奖励参数<=10 then
				    local 名称=取随机玄灵珠()
				    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(20,25),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190105 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(2550,2800)
			local 银子=等级*取随机数(150,180)+28000
			玩家数据[cyid].角色:添加经验(经验,"一斛珠夜影迷踪")
			玩家数据[cyid].角色:添加银子(银子,"一斛珠夜影迷踪",1)

			if 取随机数()<=26 then
				local 奖励参数=取随机数(1,100)
				local 链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        		if 奖励参数<=10 then
				    local 名称=取随机玄灵珠()
				    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(20,25),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190106 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		    local 链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[stid].角色.名称),频道="xt",结尾="#Y！"}
			玩家数据[stid].道具:给予超链接书铁(stid,{15,15},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(5888,5999)
			local 银子=等级*取随机数(520,666)+250000
			玩家数据[cyid].角色:添加经验(经验,"一斛珠完成奖励")
			玩家数据[cyid].角色:添加银子(银子,"一斛珠完成奖励",1)
    		玩家数据[cyid].角色:添加副本积分(400)
    		玩家数据[cyid].角色:添加仙玉(500)
    		玩家数据[cyid].角色:添加每日活跃度(cyid, 10)
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(奇谭-一斛珠)#Y荒唐一梦，且诉奇谭，#G/%s#Y少侠在如梦奇谭中跌跌撞撞，竟然得到了珍贵的",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
        		 if 奖励参数<=10 then
				local 名称=取随机玄灵珠()
				玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=28 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="修炼果"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,30),nil,链接)

				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	end
end

function 副本_一斛珠:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.如梦奇谭之一斛珠.进行[副本id]==nil then
		说明={"一斛珠","#L您的副本已经完成"}
	else
		local 进程=副本数据.如梦奇谭之一斛珠.进行[副本id].进程
		if 进程==1 then
			说明={"一斛珠",format("#L先在城里逛逛，和".."#Y/qqq|看热闹的小姑娘*7006*临时npc*36*72/看热闹的小姑娘".."#L以及其他人打声招呼吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"一斛珠",format("#L好像".."#Y/qqq|鸾儿姑娘*7006*临时npc*41*43/鸾儿姑娘".."#L不受大脑控制，在婚礼大闹，前去阻止她。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"一斛珠",format("#L另一侧，".."#Y/qqq|叶夫人*7006*临时npc*13*52/叶夫人".."#L好像也着魔了，快去阻止她。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"一斛珠",format("#L询问，".."#Y/qqq|新郎沈唐*7007*临时npc*27*14/新郎沈唐".."#L到底怎么回事。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==5 then
			说明={"一斛珠",format("#L没办法，只有先拦住，".."#Y/qqq|官兵*7007*临时npc*42*22/官兵".."#L然后再问问崔明珠怎么回事了。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==6 then
			说明={"一斛珠",format("#L官兵被你打跑了，先问问".."#Y/qqq|崔明珠*7007*临时npc*29*12/崔明珠".."#L怎么回事吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==7 then
			说明={"一斛珠",format("#L只能先问问城里的人了，一旁的".."#Y/qqq|无名人*7006*临时npc*90*9/无名人".."#L好像知道些什么。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==8 then
			说明={"一斛珠",format("#L先去追上".."#Y/qqq|新郎沈唐*7006*临时npc*143*94/新郎沈唐".."#L,问问怎么回事。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==9 then
			说明={"一斛珠",format("#L不知这是何处，前方有一蛟龙，只能硬着头皮去问问。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==10 then
			说明={"一斛珠",format("#L原来".."#Y/qqq|沈唐*7008*临时npc*73*59/沈唐".."#L就在前面，快去抓住他。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==11 then
			说明={"一斛珠",format("#L一斛珠完。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_一斛珠
