-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-07 08:26:11
-- @Author: baidwwy
-- @Date:   2024-05-31 22:33:50
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-07-31 18:55:32
-- @Author: baidwwy
-- @Date:   2023-12-03 18:29:52
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-06-07 15:00:02
local 副本_大闹天宫 = class()

function 副本_大闹天宫:初始化()
  地图处理类.地图数据[6033]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6033]={}
  地图处理类.地图坐标[6033]=地图处理类.地图坐标[1511]
  地图处理类.地图单位[6033]={}
  地图处理类.单位编号[6033]=1000

  地图处理类.地图数据[6034]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6034]={}
  地图处理类.地图坐标[6034]=地图处理类.地图坐标[1231]
  地图处理类.地图单位[6034]={}
  地图处理类.单位编号[6034]=1000

  地图处理类.地图数据[6035]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6035]={}
  地图处理类.地图坐标[6035]=地图处理类.地图坐标[1514]
  地图处理类.地图单位[6035]={}
  地图处理类.单位编号[6035]=1000

  地图处理类.地图数据[6036]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6036]={}
  地图处理类.地图坐标[6036]=地图处理类.地图坐标[1007]
  地图处理类.地图单位[6036]={}
  地图处理类.单位编号[6036]=1000

  地图处理类.地图数据[6037]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6037]={}
  地图处理类.地图坐标[6037]=地图处理类.地图坐标[1111]
  地图处理类.地图单位[6037]={}
  地图处理类.单位编号[6037]=1000
end
function 副本_大闹天宫:取大闹天宫次数限制(id,次数)
  if 副本数据.大闹天宫.完成[id] then
    添加最后对话(id,"你今日已经完成过该副本了")
    return true
  elseif 玩家数据[id].队伍 ~= 0 then
    for i=1,#队伍数据[玩家数据[id].队伍].成员数据 do
      local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
      if 副本数据.大闹天宫.完成[lsid]then
        添加最后对话(id,玩家数据[lsid].角色.名称.."今日已经完成过该副本了")
        return true
      end
    end
  end
  return false
end

function 副本_大闹天宫:开启大闹天宫副本(id)
  if 服务端参数.小时+0 >= 23 then
    常规提示(id,"#Y/23点后不可做副本任务")
    return
  end

  if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
    常规提示(id,"#Y/该任务必须组队完成且由队长领取")
    return
  elseif 取队伍人数(id)<1 then
    常规提示(id,"#Y此副本要求队伍人数不低于5人")
    return
  elseif  取等级要求(id,60)==false then
    常规提示(id,"#Y此副本要求角色等级不能低于60级")
    return
  elseif self:取大闹天宫次数限制(id) then
    return
  elseif 取队员任务存在(玩家数据[id].队伍,70) then
    常规提示(id,"#Y/队伍中已有队员正在进行该副本任,无法领取新的副本")
    return
  end
  local 任务id=id.."_70_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  副本数据.大闹天宫.进行[id]={进程=1,主任务id=任务id}
  设置大闹天宫副本(id)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=7200,
    玩家id={},
    队伍组={},
    副本id=id,
    类型=70
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
    玩家数据[临时id].角色:添加任务(任务id)
    常规提示(临时id,"#Y你开启了大闹天宫副本")
  end
end

function 设置大闹天宫副本(id)
  local 地图=0
  local 随机名称={}
  local 随机模型={}
  if 副本数据.大闹天宫.进行[id].进程==1 then
    副本数据.大闹天宫.进行[id].三大力士 = {锄树力士=1,浇水力士=1,修桃力士=1}
  elseif 副本数据.大闹天宫.进行[id].进程==2 then
    副本数据.大闹天宫.进行[id].数量=15
    地图=6033
    for i=1,15 do
      任务id=id.."_74_"..os.time().."_"..随机序列.."_"..取随机数(1,999)..i
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="蟠桃",
        模型="新蟠桃",
        事件="明雷活动",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=74,
      }
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.大闹天宫.进行[id].进程==3 then
    地图 = 6033
    任务id=id.."_75_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
    local xy=地图处理类.地图坐标[地图]:取随机点()
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=7200,
      玩家id=id,
      队伍组={},
      名称="七仙女",
      模型="芙蓉仙子",
      x=xy.x,
      y=xy.y,
      方向=1,
      事件="明雷活动",
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=75,
    }
    地图处理类:添加单位(任务id)
  elseif 副本数据.大闹天宫.进行[id].进程==4 then
    副本数据.大闹天宫.进行[id].战诸神={造酒仙官=false,运水道人=false,烧火童子=false,盘槽力士=false}
  elseif 副本数据.大闹天宫.进行[id].进程==5 then
    副本数据.大闹天宫.进行[id].数量=10
    地图 = 6035
    for i=1,10 do
      任务id=id.."_76_"..os.time().."_"..随机序列.."_"..取随机数(1,9999)..i
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="饥饿的小猴",
        模型="巨力神猿",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        事件="明雷活动",
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=76,
      }
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.大闹天宫.进行[id].进程==6 then
    地图 = 6035
    副本数据.大闹天宫.进行[id].天兵天将 = {天兵=false,天将=false}
    local xy=地图处理类.地图坐标[地图]:取随机点()
    随机名称={"崩将军","芭将军","天兵统领","天将统领"}
    随机模型={"巨力神猿","长眉灵猴","天兵","天将"}
    local 方向 = 0
    for i=1,#随机模型 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      if 随机名称[i]=="崩将军" then
        xy.x=83
        xy.y=19
      elseif 随机名称[i]=="芭将军" then
        xy.x=90
        xy.y=13
      elseif 随机名称[i]=="天兵统领" then
        xy.x=85
        xy.y=105
        方向 = 2
      else
        xy.x=137
        xy.y=108
        方向 = 2
      end
      任务id=id.."_166_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)..i
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称=随机名称[i],
        模型=随机模型[i],
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=77,
      }
      if 随机名称[i]=="天兵统领" then
        任务数据[任务id].战斗关键字="大闹天兵"
      end
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.大闹天宫.进行[id].进程==7 then
    地图 = 6035
    local xy=地图处理类.地图坐标[地图]:取随机点()
    随机名称={"二郎真君"}
    随机模型={"二郎神"}
    for i=1,#随机模型 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务id=id.."_78_"..os.time().."_"..随机序列.."_"..取随机数(1,999)..i
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称=随机名称[i],
        模型=随机模型[i],
        x=xy.x,
        y=xy.y,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=78,
      }
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.大闹天宫.进行[id].进程==8 then

  end
end

__GWdh111[74]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(70)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    完成大闹天宫任务({数字id},标识,74)
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh111[75]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(70)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="大胆弼马温,竟敢偷食蟠桃,待我禀告王母定将你扒皮抽筋."
    对话数据.选项={"定","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[75]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="定" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战大闹天宫最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战大闹天宫至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155576,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[76]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(70)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="大王！大王你终于回来了！"
   完成大闹天宫任务({数字id},标识,76)
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh111[77]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(70)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    if 任务数据[标识].名称 == "崩将军" or 任务数据[标识].名称 == "芭将军" then
      对话数据.对话="大王！大王你终于回来了！"
    else
      对话数据.对话="竟敢欺辱我家猴子猴孙,吃老孙一棒！"
      对话数据.选项={"吃老孙一棒","我只是路过"}
    end
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[77]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="吃老孙一棒" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战大闹天宫最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战大闹天宫至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155581,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[78]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(70)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="我乃二郎真君,听说你七十二变神通广大,我遍与你斗上一斗！"
    对话数据.选项={"放马过来","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[78]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="放马过来" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战大闹天宫最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战大闹天宫至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155582,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

function 结束大闹天宫副本(任务id)
  local 副本id = 任务数据[任务id].副本id
  local 主任务id = 副本数据.大闹天宫.进行[副本id].主任务id
  副本数据.大闹天宫.进行[副本id]=nil
  local id组 = 任务数据[主任务id].队伍组
  任务数据[主任务id]=nil
  for i=1,#id组 do
    副本数据.大闹天宫.完成[id组[i]]=true
    if 玩家数据[id组[i]] then
      玩家数据[id组[i]].角色:取消任务(70)
      玩家数据[id组[i]].角色:刷新任务跟踪()
      if 玩家数据[id组[i]].战斗 ~= 0 and ((战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155576 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155577 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155578 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==100089 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155580 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155581 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155582 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155583) then
        战斗准备类.战斗盒子[玩家数据[id组[i]].战斗]:结束战斗(0,0,1)
      end
    end
  end
  for i in pairs(任务数据) do
    if 任务数据[i].类型 >=70 and 任务数据[i].类型 <=79 and 任务数据[i].副本id == 副本id then
      if 任务数据[i].地图编号 and 任务数据[i].单位编号 then
        地图处理类:删除单位(任务数据[i].地图编号,任务数据[i].单位编号)
      end
      任务数据[i]=nil
    end
  end
end

function 大闹天宫副本失败(任务id)
  if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
    if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
      if  任务数据[任务id].类型== 70 then
        for i=1,#任务数据[任务id].队伍组 do
          if 玩家数据[任务数据[任务id].队伍组[i]] ~= nil then
            玩家数据[任务数据[任务id].队伍组[i]].角色:取消任务(玩家数据[任务数据[任务id].队伍组[i]].角色:取任务(70))
          end
        end
        任务数据[任务id]=nil
      else
        任务处理类:删除单位(任务id)
      end
    end
  end
end


function 副本_大闹天宫:大闹锄树(id)
  if 玩家数据[id].角色:取任务(71) ~= 0 then
    添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
    return
  end
  local 地图=6033
  local xy=地图处理类.地图坐标[地图]:取随机点()
  local 任务id="_71_"..os.time().."_"..随机序列.."_"..取随机数(1,9999)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=1200,
    玩家id=id,
    队伍组={},
    x=xy.x,
    y=xy.y,
    地图编号=地图,
    地图名称=取地图名称(地图),
    类型=71,
    副本id = 任务数据[玩家数据[id].角色:取任务(70)].副本id
  }
  玩家数据[id].角色:添加任务(任务id)
  添加最后对话(id,format("那就请速速前往蟠桃园%s,%s处锄树清草吧！",任务数据[任务id].x,任务数据[任务id].y))
end

function 副本_大闹天宫:大闹浇水(id)
  if 玩家数据[id].角色:取任务(72) ~= 0 then
    添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
    return
  end
  local 目标 = {"一千年桃树","两千年桃树","三千年桃树","四千年桃树","五千年桃树","六千年桃树","七千年桃树","八千年桃树"}
  目标 = 目标[取随机数(1,#目标)]
  local 地图=6033
  local xy=地图处理类.地图坐标[地图]:取随机点()
  local 任务id="_72_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=1200,
    玩家id=id,
    类型=72,
    目标=目标,
    队伍组={},
    副本id = 任务数据[玩家数据[id].角色:取任务(70)].副本id
  }
  玩家数据[id].角色:添加任务(任务id)
  添加最后对话(id,format("少侠拿赶快前往%s处进行浇水吧！",任务数据[任务id].目标))
end

function 副本_大闹天宫:大闹修桃(id)
  if 玩家数据[id].角色:取任务(73) ~= 0 then
    添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
    return
  end
  local 目标 = {"一千年桃树","两千年桃树","三千年桃树","四千年桃树","五千年桃树","六千年桃树","七千年桃树","八千年桃树"}
  目标 = 目标[取随机数(1,#目标)]
  local 地图=6033
  local xy=地图处理类.地图坐标[地图]:取随机点()
  local 任务id="_73_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=1200,
    玩家id=id,
    类型=73,
    目标=目标,
    队伍组={},
    副本id = 任务数据[玩家数据[id].角色:取任务(70)].副本id
  }
  玩家数据[id].角色:添加任务(任务id)
  添加最后对话(id,format("那就清速速前往%s处修整蟠桃树吧！",任务数据[任务id].目标))
end
function 完成大闹天宫任务(id组,任务id,战斗类型)
  local 奖励
  if 任务数据[任务id] then
    local 副本id=任务数据[任务id].副本id
    local 进度刷新=false
    for i=1,#id组 do
      local id = id组[i]
      local 等级 = 玩家数据[id].角色.等级
      local 经验
      local 银子
      local 储备
      if 战斗类型==71 then --大闹锄树
        if 玩家数据[id].角色:取任务(70)~=0 and 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 > 0 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3050)
    local 银子=等级*取随机数(90,120)+50000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,nil,1,链接)
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=42 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
       elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==72 then --大闹锄树
        if 玩家数据[id].角色:取任务(70)~=0 and 副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 > 0 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3050)
    local 银子=等级*取随机数(90,120)+30000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
         if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==155585 then --大闹锄树
        if 玩家数据[id].角色:取任务(70)~=0 and 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 > 0 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3050)
    local 银子=等级*取随机数(90,120)+30000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
          if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==74 then --大闹蟠桃
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(4000,5050)
    local 银子=等级*取随机数(90,120)+20000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
         if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155576 then --大闹七仙女
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==6034 then --大闹四仙官
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
         if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=63 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155577 then
        if not 副本数据.大闹天宫.进行[副本id].战诸神.造酒仙官 then
          副本数据.大闹天宫.进行[副本id].战诸神.造酒仙官=true
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
         if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==155578 then
        if not 副本数据.大闹天宫.进行[副本id].战诸神.运水道人 then
          副本数据.大闹天宫.进行[副本id].战诸神.运水道人=true
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+35000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==155579 then
        if not 副本数据.大闹天宫.进行[副本id].战诸神.烧火童子 then
          副本数据.大闹天宫.进行[副本id].战诸神.烧火童子=true
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==155580 then
        if not 副本数据.大闹天宫.进行[副本id].战诸神.盘槽力士 then
          副本数据.大闹天宫.进行[副本id].战诸神.盘槽力士=true
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==76 then --大闹叛逃
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(4000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
     elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155581 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
         local 名称="高级召唤兽内丹"
         玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155582 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=35 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155583 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5050)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-大闹天宫)#R/%s#Y/在#R/大闹天宫#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝宝装备()
        local lv = math.min(qz(等级/10),13)
        玩家数据[id].道具:给予超链接道具(id,名称,{lv+1,lv+2},nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      end
    end
    if 战斗类型==71 then --大闹锄树
      if 玩家数据[id组[1]].角色:取任务(70) and 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 > 0 then
        副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 = 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 - 1
        if 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 <= 0 then
          取消队伍任务(玩家数据[id组[1]].角色:取任务(70),71)
        else
          玩家数据[id组[1]].角色:取消任务(任务id)
        end
        if 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 <= 0 and 副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 <= 0 and 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 <= 0 then
          local 副本id = 任务数据[任务id].副本id
          副本数据.大闹天宫.进行[副本id].进程 = 2
          设置大闹天宫副本(副本id)
          进度刷新=true
        else
          local id组 = 任务数据[副本数据.大闹天宫.进行[副本id].主任务id].队伍组
          for i=1,#id组 do
            if 玩家数据[id组[i]] then
              玩家数据[id组[i]].角色:刷新任务跟踪()
            end
          end
          return
        end
      end
    elseif 战斗类型==72 then --大闹浇水
      if 玩家数据[id组[1]].角色:取任务(70) and 副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 > 0 then
        副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 = 副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 - 1
        if 副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 <= 0 then
          取消队伍任务(玩家数据[id组[1]].角色:取任务(70),72)
        else
          玩家数据[id组[1]].角色:取消任务(任务id)
        end
        if 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 <= 0 and 副本数据.大闹天宫.进行[副本id].三大力士.浇水力士 <= 0 and 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 <= 0 then
          local 副本id = 任务数据[任务id].副本id
          副本数据.大闹天宫.进行[副本id].进程 = 2
          设置大闹天宫副本(副本id)
          进度刷新=true
        end
        local id组 = 任务数据[副本数据.大闹天宫.进行[副本id].主任务id].队伍组
        for i=1,#id组 do
          if 玩家数据[id组[i]] then
            玩家数据[id组[i]].角色:刷新任务跟踪()
          end
        end
        return
      end
    elseif 战斗类型==155585 then --大闹除虫
      if 玩家数据[id组[1]].角色:取任务(70) and 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 > 0 then
        副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 = 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 - 1
        if 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 <= 0 then
          取消队伍任务(玩家数据[id组[1]].角色:取任务(70),73)
        else
          玩家数据[id组[1]].角色:取消任务(任务id)
        end
        if 副本数据.大闹天宫.进行[副本id].三大力士.锄树力士 <= 0 and 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 <= 0 and 副本数据.大闹天宫.进行[副本id].三大力士.修桃力士 <= 0 then
          local 副本id = 任务数据[任务id].副本id
          副本数据.大闹天宫.进行[副本id].进程 = 2
          设置大闹天宫副本(副本id)
          进度刷新=true
        else
          local id组 = 任务数据[副本数据.大闹天宫.进行[副本id].主任务id].队伍组
          for i=1,#id组 do
            if 玩家数据[id组[i]] then
              玩家数据[id组[i]].角色:刷新任务跟踪()
            end
          end
          return
        end
      end
    elseif 战斗类型==74 then --大闹蟠桃
      副本数据.大闹天宫.进行[副本id].数量=副本数据.大闹天宫.进行[副本id].数量-1
      if 副本数据.大闹天宫.进行[副本id].数量 <= 0 then--15
        副本数据.大闹天宫.进行[副本id].进程=3
        设置大闹天宫副本(副本id)
        进度刷新=true
      end
    elseif 战斗类型==155576 then --大闹七仙女
      副本数据.大闹天宫.进行[副本id].进程=4
      设置大闹天宫副本(副本id)
      if 玩家数据[id组[1]].角色.变身数据~=nil then
        玩家数据[id组[1]].角色.变身数据=nil
        local 任务id = 玩家数据[id组[1]].角色:取任务(1)
        任务数据[任务id]=nil
        玩家数据[id组[1]].角色:取消任务(任务id)
      end
      local 造型 = "菩提老祖"
      玩家数据[id组[1]].角色.变身数据=造型
      玩家数据[id组[1]].角色:刷新信息()
      发送数据(玩家数据[id组[1]].连接id,37,玩家数据[id组[1]].角色.变身数据)
      发送数据(玩家数据[id组[1]].连接id,5506,{玩家数据[id组[1]].角色:取气血数据()})
      发送数据(玩家数据[id组[1]].连接id,12)
      添加变身(id组[1],9)
      地图处理类:更改模型(id组[1],玩家数据[id组[1]].角色.变身数据,1,玩家数据[id组[1]].角色.地图数据.编号)
      进度刷新=true
      任务处理类:副本传送(id组[1],70)
    elseif 战斗类型==6034 or 战斗类型==155577 or 战斗类型==155578 or 战斗类型==155579 or 战斗类型==155580 then --大闹四仙官
      local 完成数据 = {"造酒仙官","运水道人","烧火童子","盘槽力士"}
      local 是否完成 = true
      for i=1,4 do
        if not 副本数据.大闹天宫.进行[副本id].战诸神[完成数据[i]] then
          是否完成 = false
          break
        end
      end
      if 是否完成 then
        副本数据.大闹天宫.进行[副本id].进程 = 5
        设置大闹天宫副本(副本id)
        任务处理类:副本传送(id组[1],70)
      end
      local id组 = 任务数据[副本数据.大闹天宫.进行[副本id].主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          玩家数据[id组[i]].角色:刷新任务跟踪()
          if 是否完成 then
            常规提示(id组[i],"#Y/您的副本进度已经更新")
          end
        end
      end
      return
    elseif 战斗类型==76 then --大闹饥饿的猴子
      副本数据.大闹天宫.进行[副本id].数量=副本数据.大闹天宫.进行[副本id].数量-1
      if 副本数据.大闹天宫.进行[副本id].数量 <= 0 then
        副本数据.大闹天宫.进行[副本id].进程=6
        设置大闹天宫副本(副本id)
        进度刷新=true
      end
    elseif 战斗类型==155581 then
      if 任务数据[任务id].名称=="天兵统领" then
        副本数据.大闹天宫.进行[副本id].天兵天将.天兵=true
      else
        副本数据.大闹天宫.进行[副本id].天兵天将.天将=true
      end
      if 副本数据.大闹天宫.进行[副本id].天兵天将.天兵 and 副本数据.大闹天宫.进行[副本id].天兵天将.天将 then
        副本数据.大闹天宫.进行[副本id].进程=7
        设置大闹天宫副本(副本id)
        进度刷新=true
      end
    elseif 战斗类型==155582 then
      副本数据.大闹天宫.进行[副本id].进程=8
      设置大闹天宫副本(副本id)
      任务处理类:副本传送(id组[1],70)
      进度刷新=true
    elseif 战斗类型==155583 then
      local id组 = 任务数据[副本数据.大闹天宫.进行[副本id].主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          地图处理类:跳转地图(id组[i],1001,358,35)
          更新玩家每日(id组[i],"副本任务","大闹天宫")
          玩家数据[id组[i]].角色:添加副本积分(200)
          玩家数据[id组[i]].角色:添加仙玉(200)
          玩家数据[id组[i]].角色:添加每日活跃度(id组[i], 5)
          常规提示(id组[i],"#Y/恭喜你们完成大闹天宫副本")
        end
      end
      结束大闹天宫副本(任务id)
      return
    end
    local id组 = 任务数据[副本数据.大闹天宫.进行[副本id].主任务id].队伍组
    for i=1,#id组 do
      if 玩家数据[id组[i]] then
       玩家数据[id组[i]].角色:刷新任务跟踪()
        if 进度刷新 then
          常规提示(id组[i],"#Y/您的副本进度已经更新")
        end
      end
    end
    if 任务数据[任务id].地图编号 and 任务数据[任务id].单位编号 then
      地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    end
    任务数据[任务id]=nil
  end
end
function 添加变身(id,变化之术)
  local 任务id=id.."_1_"..os.time()
  local 结束时间=15*(1+变化之术)*60
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=结束时间,
    玩家id=id,
    队伍组={},
    类型=1
  }
  玩家数据[id].角色:添加任务(任务id)
  发送数据(玩家数据[id].连接id,39)
end

return 副本_大闹天宫