-- @Author: baidwwy
-- @Date:   2024-12-14 19:53:28
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-16 20:33:42
local 副本_通天河 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local npc={} --模型,名字

function 副本_通天河:初始化()
	地图处理类.地图数据[7017]={npc={},单位={},传送圈={}} --长寿
	地图处理类.地图玩家[7017]={}
	地图处理类.地图坐标[7017]=地图处理类.地图坐标[1070]
	地图处理类.地图单位[7017]={}
	地图处理类.单位编号[7017]=1000

	地图处理类.地图数据[7018]={npc={},单位={},传送圈={}} --普陀山
	地图处理类.地图玩家[7018]={}
	地图处理类.地图坐标[7018]=地图处理类.地图坐标[1140]
	地图处理类.地图单位[7018]={}
	地图处理类.单位编号[7018]=1000

	地图处理类.地图数据[7019]={npc={},单位={},传送圈={}} --通天河底
	地图处理类.地图玩家[7019]={}
	地图处理类.地图坐标[7019]=地图处理类.地图坐标[1116]
	地图处理类.地图单位[7019]={}
	地图处理类.单位编号[7019]=1000

	地图处理类.地图数据[7020]={npc={},单位={},传送圈={}} --灵感之腹
	地图处理类.地图玩家[7020]={}
	地图处理类.地图坐标[7020]=地图处理类.地图坐标[1202]
	地图处理类.地图单位[7020]={}
	地图处理类.单位编号[7020]=1000
end

function 副本_通天河:更改模型(id,模型)
	玩家数据[id].角色.变身数据=模型
	发送数据(玩家数据[id].连接id,37,玩家数据[id].角色.变身数据)
	设置任务1(id,1,玩家数据[id].角色.变身数据,3600)
	地图处理类:更改模型(id,玩家数据[id].角色.变身数据,1)
end

function 副本_通天河:开启副本(id)
	if 服务端参数.小时+0 >= 23 then
		常规提示(id,"#Y/23点后不可做副本任务")
		return
	end
	if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
		常规提示(id,"#Y/该任务必须组队完成且由队长领取")
		return
	elseif 取队伍人数(id)<5 and 调试模式==false then
		常规提示(id,"#Y此副本要求队伍人数不低于5人")
		return
	elseif  取等级要求(id,69)==false then
		常规提示(id,"#Y此副本要求角色等级不能低于69级")
		return
	end
	local 队伍id=玩家数据[id].队伍
	for n=1,#队伍数据[队伍id].成员数据 do
		local 临时id=队伍数据[队伍id].成员数据[n]
		if 副本数据.通天河.完成[临时id]~=nil then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."本日已经完成过此副本了")
			return
		elseif 玩家数据[临时id].角色:取任务(710)~=0 then
			常规提示(id,"#Y"..玩家数据[临时id].角色.名称.."正在进行副本任务，无法领取新的副本")
			return
		end
	end

	副本数据.通天河.进行[id]={进程=1,答题={}}
	local 任务id,ZU=取唯一任务(710,id)
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=7200,
		玩家id=0,
		DWZ=ZU,
		销毁=true,
		副本重置=true,
		队伍组=ZU,
		副本id=id,
		类型=710
	}
	任务处理类:添加队伍任务(id,任务id,"#Y你开启了通天河副本")
	--任务处理类:副本传送(id,9)
	self:刷新任务710(id)
end

function 副本_通天河:刷新任务710(id) --这是全局方法啊，别用全局，不然调用不到self
	local id = 任务处理类:取副本id(id,710)
	if 副本数据.通天河.进行[id]==nil then
		return
	end
	玩家数据[id].zhandou=0
	local 队伍id=玩家数据[id].队伍
	if 副本数据.通天河.进行[id].进程==1 then
		--if 副本数据.通天河.进行[id].阶段 == 0 then
		local 地图=7017
		local 任务id=id.."_711_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="陈关保",
			模型="小毛头",
			x=94,
			y=192,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=711
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_711_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="一秤金",
			模型="小丫丫",
			x=138,
			y=130,
			方向=1,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=711
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_711_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="陈铁柱",
			模型="小毛头",
			x=67,
			y=72,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=711
		}
		地图处理类:添加单位(任务id)
		地图处理类:跳转地图(id,7017,143,124) --跳转到长寿

	elseif 副本数据.通天河.进行[id].进程==2 then
		local 地图=7017
		local 任务id=id.."_712_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="灵感大王分身",
			模型="神天兵",
			x=19,
			y=172,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=712
		}
		地图处理类:添加单位(任务id)
		local 任务id=id.."_712_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=3600,
			销毁=true,
			副本重置=true,
			玩家id=0,
			队伍组={},
			名称="灵灯",
			模型="灵灯",
			x=27,
			y=177,
			方向=0,
			副本id=id,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=712
		}
		地图处理类:添加单位(任务id)
		local 小孩模型 = {"小毛头","小丫丫"}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			self:更改模型(临时id,小孩模型[math.random(#小孩模型)])
		end
	elseif 副本数据.通天河.进行[id].进程==3 then
			任务处理类:删除副本单位(id,710,711)
			任务处理类:删除副本单位(id,710,712)
			local 任务id=id.."_713_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=7017 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="唐僧",
				模型="唐僧",
				销毁=true,
				副本重置=true,
				x=100,
				y=92,
				方向=3,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=713
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_713_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=7017 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="陈家村村长",
				模型="刘老爹",
				销毁=true,
				副本重置=true,
				x=87,
				y=91,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=713
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_713_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=7017 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="村民",
				模型="男人_书生",
				销毁=true,
				副本重置=true,
				x=110,
				y=96,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=713
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_713_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			local 地图=7017 --
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="村民",
				模型="樵夫",
				销毁=true,
				副本重置=true,
				x=104,
				y=108,
				方向=2,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=713
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.通天河.进行[id].进程==4 then
			local 地图=7018 --
			local 任务id=id.."_714_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="善财童子",
				模型="小魔头",
				销毁=true,
				副本重置=true,
				x=19,
				y=24,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=714
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_714_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="黑熊精",
				模型="黑熊精",
				销毁=true,
				副本重置=true,
				x=26,
				y=20,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=714
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,7018,25,48)
			local text1 = {"河妖太多，师傅被抓走了","通天河太危险，只好去南海求菩萨了"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="通天河1",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end
	elseif 副本数据.通天河.进行[id].进程==5 then
			local 地图=7018
			local 任务id=id.."_715_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="木材",
				模型="木材",
				销毁=true,
				副本重置=true,
				x=55,
				y=15,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=715
			}
			地图处理类:添加单位(任务id)

	elseif 副本数据.通天河.进行[id].进程==6 then
			local 地图=7019
			local 任务id=id.."_716_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="金鱼左将军",
				模型="金鱼",
				销毁=true,
				副本重置=true,
				x=99,
				y=58,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=716
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_716_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="金鱼右将军",
				模型="金鱼",
				销毁=true,
				副本重置=true,
				x=107,
				y=61,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=716
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,7019,86,70)
			local text1 = {"将竹材交给菩萨后得到了避水珠","你同众人来到了通天河底"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="通天河2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end
	elseif 副本数据.通天河.进行[id].进程==7 then

			local 地图=7020
			local 任务id=id.."_717_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="婴灵",
				模型="幽灵",
				销毁=true,
				副本重置=true,
				x=41,
				y=37,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=717
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_717_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="冤魂",
				模型="野鬼",
				销毁=true,
				副本重置=true,
				x=78,
				y=67,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=717
			}
			地图处理类:添加单位(任务id)
			地图处理类:跳转地图(id,7020,48,112)
			local text1 = {"得益于菩萨避水珠的帮助","你打败了强敌，进入了灵感之腹"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="通天河3",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用=nil})
			end
			-- 发送数据(玩家数据[id].连接id,6557,{文本=text1,类型="五更寒渔村2",字体=nil,音乐=nil,背景=nil,横排显示=true,动画={100,5}})
			-- 发送数据(玩家数据[id].连接id,6560,true)
		-- elseif 副本数据.通天河.进行[id].阶段 == 1 then
		-- 	常规提示(id,"#Y/此处为播放动画")
		-- 	return'
		-- end
	elseif 副本数据.通天河.进行[id].进程==8 then
			任务处理类:删除副本单位(id,710,717)
			local 地图=7020
			local 任务id=id.."_718_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="心",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=114,
				y=27,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=718
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_718_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="肝",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=107,
				y=27,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=718
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_718_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="脾",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=118,
				y=32,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=718
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_718_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="肾",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=123,
				y=27,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=718
			}
			地图处理类:添加单位(任务id)
			local 任务id=id.."_718_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="肺",
				模型="钻石",
				销毁=true,
				副本重置=true,
				x=114,
				y=22,
				方向=0,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=718
			}
			地图处理类:添加单位(任务id)
	elseif 副本数据.通天河.进行[id].进程==9 then
			任务处理类:删除副本单位(id,710,718)
			local 地图=7020
		            local 任务id=id.."_719_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_1_"
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				销毁=true,
				副本重置=true,
				结束=3600,
				玩家id=0,
				队伍组={},
				名称="灵感元神",
				模型="帮派妖兽",
				x=171,
				y=121,
				方向=1,
				副本id=id,
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=719
			}
			地图处理类:添加单位(任务id)
			local text1 = {"你解救了灵感腹中的孩子","惊动了灵感大王"}
			for n=1,#队伍数据[队伍id].成员数据 do
				local 临时id=队伍数据[队伍id].成员数据[n]
				发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="通天河4",字体=nil,音乐=nil,背景=nil,横排显示=true,动画=nil})
			end


	elseif 副本数据.通天河.进行[id].进程==10 then
		地图处理类:跳转地图(id,1070,127,178)
		local 任务id=玩家数据[id].角色:取任务(710)
		local text1={{"祸害一方的灵感大王","倒下了"},{"你将活着的孩子","送回了陈家庄","唐僧师徒也继续西行"},{"通天河  完"}}
		for n=1,#队伍数据[队伍id].成员数据 do
			local 临时id=队伍数据[队伍id].成员数据[n]
			玩家数据[临时id].角色:取消任务(任务id)
			副本数据.通天河.完成[临时id]=true
			发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="通天河结束",字体=nil,音乐=nil,背景=nil,横排显示=nil,动画=nil})
		end
	end
	刷新队伍任务追踪(id)
end

function 副本_通天河:怪物对话内容(id,类型,标识,地图)
    	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	local 副本id = 任务处理类:取副本id(id,710)
	if 副本id == 0 or 副本id ~= id  then
		对话数据.对话="只有创建副本的队长才能和我对话"
	end
	if 副本数据.通天河.进行[副本id].进程==1 then
		if 对话数据.名称=="陈关保" or 对话数据.名称=="一秤金" or 对话数据.名称=="陈铁柱" then
			if 副本数据.通天河.进行[副本id].答题[标识] then
				对话数据.对话 = "你已经在我这里答过题了，去找别的小朋友吧！"
				对话数据.选项 = {"好的好的"}
			else
				local 临时题目 = {
					{"旧事王谢堂前( )，飞入寻常百姓家。",{"燕","雁","鸡","鲲"}},
					{"白日依山( )，黄河入海流。",{"傍","尽","近","逝"}},
					{"沉默分身几点开始？",{"七点","七点半","八点","八点半"}},
					{"2+2*2-2=( )",{"4","6","2","8"}},
					{"May the force be with you的中文意思是",{"别太放肆没什么用","愿力量与你同在","五月的力量是你的","我看不懂"}},
					{"西游记中孙悟空在菩提老祖处所习得的技能是？",{"天罡三十六变","地煞七十二变","如来神掌","九阴真经"}},
				}
				local lstk = 临时题目[math.random(#临时题目)]
				对话数据.对话 = lstk[1]
				对话数据.选项 = lstk[2]
			end
		else
			对话数据.对话="发生肾么事了"
		end
	elseif 副本数据.通天河.进行[副本id].进程==2 then
		if 对话数据.名称=="灵感大王分身" then
			对话数据.对话 = "该死的村民终于把童男童女送来了#24"
			对话数据.选项 = {}
		elseif 对话数据.名称=="灵灯" then
			对话数据.对话 = "灵灯发出了不详的光照"
			对话数据.选项 = {"伸手触摸一下"}
		end
	elseif 副本数据.通天河.进行[副本id].进程==3 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="唐僧" then
				对话数据.对话 = "少侠，村子周围出现了很多河妖，你能帮助村民们击退水妖吗？"
				对话数据.选项 = {"没问题","我自身难保先溜了"}
			end
		--end
	elseif 副本数据.通天河.进行[副本id].进程==4 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="善财童子" then
				对话数据.对话 = "好啊，又是孙猴子的朋友，想要菩萨先打败我再说吧！"
				对话数据.选项 = {"那就得罪了","我先溜了..."}
			elseif 对话数据.名称=="黑熊精" then
				对话数据.对话 = "这善财童子阻拦你们我也不好多说话.."
				对话数据.选项 = {"。。。。"}
			end
	elseif 副本数据.通天河.进行[副本id].进程==5 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="木材" then
				对话数据.对话 = "一块被不知道谁处理好的木材在地上发着光"
				对话数据.选项 = {"捡起来"}
			end
	elseif 副本数据.通天河.进行[副本id].进程==6 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="金鱼左将军" then
				对话数据.对话 = "你是何人，尽然能安然来到这通天河底！#24"
				对话数据.选项 = {}
			elseif 对话数据.名称=="金鱼右将军" then
				对话数据.对话 = "你是何人，尽然能安然来到这通天河底！#24"
				对话数据.选项 = {"我是来要你命的人","小弟匆忙中不慎闯入"}
			end
	elseif 副本数据.通天河.进行[副本id].进程==7 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 副本数据.通天河.进行[副本id].怪物[对话数据.名称] then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"...吓死个人"}
			else
				if 对话数据.名称=="婴灵" then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"帮助婴灵解脱","...吓死个人"}
				elseif 对话数据.名称=="冤魂" then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"帮助冤魂解脱","...吓死个人"}
				end
			end
	elseif 副本数据.通天河.进行[副本id].进程==8 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 副本数据.通天河.进行[副本id].怪物[对话数据.名称] then
					对话数据.对话 = "我死的好惨#115"
					对话数据.选项 = {"...吓死个人"}
			else
				if 对话数据.名称=="心" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的心"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="肝" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的肝"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="脾" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的脾"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="肾" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的肾"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				elseif 对话数据.名称=="肺" then
					对话数据.对话 = "解救灵感大王腹中的童男童女的肺"
					对话数据.选项 = {"杀","不知道打不打得过,我先溜了"}
				end
			end
	elseif 副本数据.通天河.进行[副本id].进程==9 then
		--if 副本数据.通天河.进行[副本id].阶段 == 0 then
			if 对话数据.名称=="灵感元神" then
				对话数据.对话 = "原来是你小子在我腹中搅得我无法安宁，受死吧！"
				对话数据.选项 = {"战就战谁怕谁","大王我错了，我给你跪下了。。"}
			end
	end
	return 对话数据
end

function 副本_通天河:对话事件处理(id,名称,事件,类型)
	local 副本id = 任务处理类:取副本id(id,710)
	if 类型 == 711 and (名称=="陈关保" or 名称 =="一秤金" or 名称=="陈铁柱")  then
		if 事件 == "燕" or 事件 == "尽" or  事件 == "两年半" or  事件 == "4" or  事件 == "愿力量与你同在" or  事件 == "地煞七十二变" then
			副本数据.通天河.进行[副本id].答题[玩家数据[id].地图单位.标识] = 1
			if table_leng(副本数据.通天河.进行[副本id].答题) >= 3 then
				副本数据.通天河.进行[副本id] = {进程=2}
				self:刷新任务710(副本id)
			end
			常规提示(id,"#Y/回答正确！")
		elseif 事件 == "好的好的" then
			return
		else
			常规提示(id,"#Y/太笨啦，不对不对")
		end
	elseif 类型 == 712 and 名称=="灵灯" and  事件=="伸手触摸一下" then
		if 副本数据.通天河.进行[副本id].进程==2 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190201,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 713 and 名称=="唐僧" and  事件=="没问题" then
		if 副本数据.通天河.进行[副本id].进程==3 then
			副本数据.通天河.进行[副本id] = {进程=4}
			self:刷新任务710(副本id)
		end
	elseif 类型 == 714 and 名称=="善财童子" and  事件=="那就得罪了" then
		if 副本数据.通天河.进行[副本id].进程==4 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190202,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 715 and 名称=="木材" and  事件=="捡起来" then
		if 副本数据.通天河.进行[副本id].进程==5 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190203,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 716 and 名称=="金鱼右将军" and  事件=="我是来要你命的人" then
		if 副本数据.通天河.进行[副本id].进程==6 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190204,玩家数据[id].地图单位.标识) --暂用8测试
			--从4开始连续战斗至8   战斗准备类:创建战斗(id+0,190204,玩家数据[id].地图单位.标识)
		end
	elseif 类型 == 717 and 副本数据.通天河.进行[副本id].进程 == 7 then
		if 名称=="婴灵" and 事件=="帮助婴灵解脱" then
			if 副本数据.通天河.进行[副本id].怪物[名称] then 常规提示(id,"#Y/该怪物已被超度！") return  end
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190209,玩家数据[id].地图单位.标识)

		elseif 名称=="冤魂" and 事件=="帮助冤魂解脱" then
			if 副本数据.通天河.进行[副本id].怪物[名称] then 常规提示(id,"#Y/该怪物已被超度！") return  end
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190210,玩家数据[id].地图单位.标识)
			-- 副本数据.通天河.进行[副本id] = {进程=8}
			-- 刷新队伍任务追踪(id)
			-- 刷新任务690(副本id)
		end
	elseif 类型 == 718 and 副本数据.通天河.进行[副本id].进程 == 8 then
		if 副本数据.通天河.进行[副本id].怪物[名称] then 常规提示(id,"#Y/该部位已被超度！") return  end
		if 事件=="杀" then
			local ls = {心=190211,肝=190212,脾=190213,肾=190214,肺=190215}
			if ls[名称] ~= nil then
				if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
				if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
				任务数据[玩家数据[id].地图单位.标识].zhandou=true
				战斗准备类:创建战斗(id+0,ls[名称],玩家数据[id].地图单位.标识)
			end
		end
	elseif 类型 == 719 and 名称=="灵感元神" and  事件=="战就战谁怕谁" then
		if 副本数据.通天河.进行[副本id].进程==9 then
			if 任务数据[玩家数据[id].地图单位.标识].zhandou~=nil then 常规提示(id,"#Y/对方正在战斗中") return  end
			if 取队伍人数(id)<1  and 调试模式==false then 常规提示(id,"#Y队伍人数低于3人，无法进入战斗") return  end
			任务数据[玩家数据[id].地图单位.标识].zhandou=true
			战斗准备类:创建战斗(id+0,190216,玩家数据[id].地图单位.标识)
		end
	end
end


function 副本_通天河:战斗胜利处理(id组,战斗类型,任务id)
	local id = id组[1]
	local 副本id = 任务处理类:取副本id(id,710)
	if 副本id == 0 then return end
	if 战斗类型 == 190201 then
		副本数据.通天河.进行[副本id]={进程=3}
		任务数据[任务id].zhandou = nil
		self:刷新任务710(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190202 then
		副本数据.通天河.进行[副本id]={进程=5}
		任务数据[任务id].zhandou = nil
		self:刷新任务710(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190203 then
		副本数据.通天河.进行[副本id]={进程=6}
		任务数据[任务id].zhandou = nil
		self:刷新任务710(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190204 or 战斗类型 == 190205 or 战斗类型 == 190206 or 战斗类型 == 190207 then

	elseif 战斗类型 == 190208 then --204 205 206 207 208
		副本数据.通天河.进行[副本id]={进程=7,怪物={}}
		任务数据[任务id].zhandou = nil
		self:刷新任务710(副本id)
		self:完成奖励(id组,战斗类型)
	elseif 战斗类型 == 190209 then --209
		任务数据[任务id].zhandou = nil
		if  副本数据.通天河.进行[副本id].进程==7 and 副本数据.通天河.进行[副本id].怪物 then
			副本数据.通天河.进行[副本id].怪物["婴灵"] = 1
		end
		if table_leng(副本数据.通天河.进行[副本id].怪物) >= 2 then
			副本数据.通天河.进行[副本id]={进程=8,怪物={}}
			self:刷新任务710(副本id)
			self:完成奖励(id组,战斗类型)
		end
	elseif 战斗类型 == 190210 then
		任务数据[任务id].zhandou = nil
		if 副本数据.通天河.进行[副本id].进程==7 and 副本数据.通天河.进行[副本id].怪物 then
			副本数据.通天河.进行[副本id].怪物["冤魂"] = 1
		end
		if table_leng(副本数据.通天河.进行[副本id].怪物) >= 2 then
			副本数据.通天河.进行[副本id]={进程=8,怪物={}}
			self:刷新任务710(副本id)
			self:完成奖励(id组,战斗类型)
		end
	elseif 战斗类型 >= 190211 and 战斗类型 <= 190215 then
		任务数据[任务id].zhandou = nil
		if 副本数据.通天河.进行[副本id].进程== 8 and 副本数据.通天河.进行[副本id].怪物 then
			副本数据.通天河.进行[副本id].怪物[任务数据[任务id].名称] = 1
		end
		if table_leng(副本数据.通天河.进行[副本id].怪物) >= 5 then
			副本数据.通天河.进行[副本id]={进程=9}
			self:刷新任务710(副本id)
			self:完成奖励(id组,战斗类型)
		end
	elseif 战斗类型 == 190216 then
		副本数据.通天河.进行[副本id]={进程=10}
		任务数据[任务id].zhandou = nil
		self:刷新任务710(副本id)
		self:完成奖励(id组,战斗类型)
	end
end

function 副本_通天河:完成奖励(id组,战斗类型)
	if 战斗类型 == 190201 then
		local 链接
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(150,180)+30000
			玩家数据[cyid].角色:添加经验(经验,"灵感分身")
			玩家数据[cyid].角色:添加银子(银子,"灵感分身",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y击败了灵感分身，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
	            if 奖励参数<=10 then
				local 名称=取随机玄灵珠()
				玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=16 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                   玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190202 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(150,180)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河红孩儿")
			玩家数据[cyid].角色:添加银子(银子,"通天河红孩儿",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y险胜善财童子，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y！"}
	           			 if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=45 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				 elseif 奖励参数<=30 then
				 	local 名称="五宝盒"
				 	玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190203 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(180,180)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河木材")
			玩家数据[cyid].角色:添加银子(银子,"通天河木材",1)
			local 链接
			if 取随机数()<=50 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y打败了竹精，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=16 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				 elseif 奖励参数<=25 then
				 	local 名称="魔兽要诀"
				 	玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=80 then
					local 名称=取宝宝装备()
					local lv = math.min(qz(等级/10),13)
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,{lv+1,lv+2},nil,链接)
				elseif 奖励参数<=81 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190208 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(150,180)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河金鱼")
			玩家数据[cyid].角色:添加银子(银子,"通天河金鱼",1)
			local 链接
			if 取随机数()<=100 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y击败了灵感手下的金鱼将军，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=18 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				 elseif 奖励参数<=25 then
				 	local 名称="魔兽要诀"
				 	玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=35 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=60 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=70 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                 elseif 奖励参数<=80 then
                    local 名称=取随机玄灵珠()
                     玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190209 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1700,1800)+50000
			local 银子=等级*取随机数(150,180)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河婴灵")
			玩家数据[cyid].角色:添加银子(银子,"通天河婴灵",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y超度了婴灵，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=16 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					 local 名称="魔兽要诀"
					 玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
                elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190210 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1600,1800)+50000
			local 银子=等级*取随机数(180,200)+300000
			玩家数据[cyid].角色:添加经验(经验,"通天河冤魂")
			玩家数据[cyid].角色:添加银子(银子,"通天河冤魂",1)
	        		玩家数据[cyid].角色:添加副本积分(200)
	        		玩家数据[cyid].角色:添加仙玉(200)
	        		玩家数据[cyid].角色:添加每日活跃度(cyid, 5)
			if 取随机数()<=90 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y超度了冤魂，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=28 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的星石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190211 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1700,1800)+50000
			local 银子=等级*取随机数(150,180)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河心")
			玩家数据[cyid].角色:添加银子(银子,"通天河心",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y解放了孩童之心，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=65 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190212 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(120,150)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河肝")
			玩家数据[cyid].角色:添加银子(银子,"通天河肝",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y超度了孩童之肝，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=15 then
					local 名称="超级金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190213 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1700)+50000
			local 银子=等级*取随机数(120,150)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河肾")
			玩家数据[cyid].角色:添加银子(银子,"通天河肾",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y超度了孩童之肾，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190214 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(120,150)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河脾")
			玩家数据[cyid].角色:添加银子(银子,"通天河脾",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y超度了孩童之脾，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=75 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
			    elseif 奖励参数<=85 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190215 then
		for n=1,#id组 do
			local cyid=id组[n]
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1600)+50000
			local 银子=等级*取随机数(120,150)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河肺")
			玩家数据[cyid].角色:添加银子(银子,"通天河肺",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y超度了孩童之肺，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
			    elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	elseif 战斗类型 == 190216 then
		local stid=取随机数(1,#id组)
		stid=id组[stid]
		local 链接={提示=format("#S(通天河)#G/%s#R击败了灵感大王，孩童们被解救，获得了村民送出的",玩家数据[stid].角色.名称),频道="xt",结尾="#R！#80"}
		玩家数据[stid].道具:给予超链接书铁(stid,{15,15},nil,链接)
		for n=1,#id组 do
			local cyid=id组[n]
			玩家数据[cyid].角色:添加副本积分(200)
			local 等级=玩家数据[cyid].角色.等级
			local 经验=等级*取随机数(1550,1800)+50000
			local 银子=等级*取随机数(120,150)+40000
			玩家数据[cyid].角色:添加经验(经验,"通天河灵感大王")
			玩家数据[cyid].角色:添加银子(银子,"通天河灵感大王",1)
			local 链接
			if 取随机数()<=30 then
				local 奖励参数=取随机数(1,100)
				链接={提示=format("#S(通天河)#G/%s#Y击败了灵感大王，获得了",玩家数据[cyid].角色.名称),频道="xt",结尾="#Y一个！"}
	            		if 奖励参数<=10 then
					local 名称="金柳露"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=20 then
					local 名称="召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=25 then
					local 名称="魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=26 then
					local 名称="高级魔兽要诀"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=30 then
					local 名称="五宝盒"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=40 then
					local 名称="高级召唤兽内丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,nil,nil,链接)
				elseif 奖励参数<=50 then
					local 名称=取强化石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=55 then
					local 名称="九转金丹"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(10,15),nil,链接)
				elseif 奖励参数<=60 then
					local 名称=取宝石()
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
		        elseif 奖励参数<=75 then
                    local 名称=取随机玄灵珠()
                    玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				elseif 奖励参数<=85 then
					local 名称="神兜兜"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,1,nil,链接)
				else
					local 名称="未激活的符石"
					玩家数据[cyid].道具:给予超链接道具(cyid,名称,取随机数(1,1),nil,链接)
				end
			end
		end
	else
		return
	end
end

function 副本_通天河:任务说明(玩家id,任务id)
	local 说明 = {}
	local 副本id=任务数据[任务id].副本id
	if 副本数据.通天河.进行[副本id]==nil then
		说明={"通天河","#L您的副本已经完成"}
	else
		local 进程=副本数据.通天河.进行[副本id].进程
		if 进程==1 then
			说明={"通天河",format("#L先在庄里逛逛，和".."#Y/qqq|陈关保*7017*临时npc*94*192/陈关保".."#L、".."#Y/qqq|一秤金*7017*临时npc*138*130/一秤金".."#L以及".."#Y/qqq|陈铁柱*7017*临时npc*67*72/陈铁柱".."#L打声招呼吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==2 then
			说明={"通天河",format("#L此时灵感大王已经进入庄内了,前去触摸他面前的".."#Y/qqq|灵灯*7017*临时npc*19*172/灵灯".."#L打探一番吧。触摸(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==3 then
			说明={"通天河",format("#L庄内似乎冲出了很多河妖，快去找".."#Y/qqq|唐僧*7017*临时npc*100*92/唐僧".."#L他似乎有话对你说。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==4 then
			说明={"通天河",format("#L到了南海".."#Y/qqq|善财童子*7018*临时npc*19*24/善财童子".."#L挡住了你的去路。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==5 then
			说明={"通天河",format("#L击败了善财童子，从他口中得知菩萨需要，".."#Y/qqq|木材*7018*临时npc*55*15/木材".."#L,快去帮菩萨找一些来吧。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==6 then
			说明={"通天河",format("#L得到了菩萨的宝物，来到了通天河底。向面前的".."#Y/qqq|金鱼右将军*7019*临时npc*107*61/金鱼右将军".."#L打探一番情报(此处将进行5场连续战斗)。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==7 then
			说明={"通天河",format("#L击败了金鱼将军，却被吸入灵感之腹。远处有不少".."#Y/qqq|冤魂*7020*临时npc*78*67/冤魂".."#L和".."#Y/qqq|婴灵*7020*临时npc*41*37/婴灵".."#L,只好先超度他们了。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==8 then
			说明={"通天河",format("#L在不远处好像有灵感吃下孩童的".."#Y/qqq|心*7020*临时npc*114*27/心、肝、脾、肾、肺".."#L,快去解救未来得及消化的孩童。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==9 then
			说明={"通天河",format("#L你惊动了".."#Y/qqq|灵感元神*7020*临时npc*171*121/灵感元神".."#L,看来只能同他决一死战了。(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		elseif 进程==10 then
			说明={"通天河",format("#L通天河完(剩余时间%s分钟)",取分((任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))))}
		end
	end
	return 说明
end

return 副本_通天河