-- @Author: baidwwy
-- @Date:   2024-12-14 19:53:28
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-07 08:29:24
local 副本_黑风山 = class()

function 副本_黑风山:初始化()
  地图处理类.地图数据[6018]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6018]={}
  地图处理类.地图坐标[6018]=地图处理类.地图坐标[1042]
  地图处理类.地图单位[6018]={}
  地图处理类.单位编号[6018]=1000

  地图处理类.地图数据[6019]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6019]={}
  地图处理类.地图坐标[6019]=地图处理类.地图坐标[1002]
  地图处理类.地图单位[6019]={}
  地图处理类.单位编号[6019]=1000

  地图处理类.地图数据[6020]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6020]={}
  地图处理类.地图坐标[6020]=地图处理类.地图坐标[1210]
  地图处理类.地图单位[6020]={}
  地图处理类.单位编号[6020]=1000

  地图处理类.地图数据[6021]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6021]={}
  地图处理类.地图坐标[6021]=地图处理类.地图坐标[1211]
  地图处理类.地图单位[6021]={}
  地图处理类.单位编号[6021]=1000
end

function 副本_黑风山:取黑风山次数限制(id,次数)
  if 副本数据.黑风山.完成[id] then
    添加最后对话(id,"你今日已经完成过该副本了")
    return true
  elseif 玩家数据[id].队伍 ~= 0 then
    for i=1,#队伍数据[玩家数据[id].队伍].成员数据 do
      local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
      if 副本数据.黑风山.完成[lsid]then
        添加最后对话(id,玩家数据[lsid].角色.名称.."今日已经完成过该副本了")
        return true
      end
    end
  end
  return false
end

function 副本_黑风山:开启黑风山副本(id)
  if 服务端参数.小时+0 >= 23 then
    常规提示(id,"#Y/23点后不可做副本任务")
    return
  end
  if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
    常规提示(id,"#Y/该任务必须组队完成且由队长领取")
    return
  elseif 取队伍人数(id)<1 then
    常规提示(id,"#Y此副本要求队伍人数不低于5人")
    return
  elseif  取等级要求(id,60)==false then
    常规提示(id,"#Y此副本要求角色等级不能低于60级")
    return
  elseif self:取黑风山次数限制(id) then
    return
  elseif 取队员任务存在(玩家数据[id].队伍,80) then
    常规提示(id,"#Y/队伍中已有队员正在进行该副本任,无法领取新的副本")
    return
  end
  local 任务id=id.."_80_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  副本数据.黑风山.进行[id]={进程=1,主任务id=任务id}
  self:设置黑风山副本(id)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=7200,
    玩家id={},
    队伍组={},
    副本id=id,
    类型=80
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
    任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
    玩家数据[临时id].角色:添加任务(任务id)
    常规提示(临时id,"#Y你开启了黑风山副本")
  end
end

function 副本_黑风山:设置黑风山副本(id)
  local 地图=0
  local 随机名称={}
  local 随机模型={}
  if 副本数据.黑风山.进行[id].进程==1 then
    副本数据.黑风山.进行[id].协助任务 = {镇山太保=5,婆婆=5,唐玄奘=5}
  elseif 副本数据.黑风山.进行[id].进程==2 then
    副本数据.黑风山.进行[id].数量=15
    随机名称={"绝望的牛头","懵懂的僵尸","吊死的鬼魂","奇怪的马面"}
    随机模型={"牛头","僵尸","野鬼","马面"}
    地图=6018

    for i=1,15 do
      local sj = 取随机数(1,#随机名称)
      任务id=id.."_83_"..os.time().."_"..随机序列.."_"..取随机数(1,999)..i
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3600,
        玩家id=id,
        队伍组={},
        名称=随机名称[sj],
        模型=随机模型[sj],
        事件="明雷活动",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=83,
      }
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.黑风山.进行[id].进程==3 then
    地图 = 6018
    任务id=id.."_84_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
    local xy=地图处理类.地图坐标[地图]:取随机点()
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=3600,
      玩家id=id,
      队伍组={},
      名称="恶虎",
      模型="噬天虎",
      x=xy.x,
      y=xy.y,
      方向=1,
      事件="明雷活动",
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=84,
    }
    地图处理类:添加单位(任务id)
  elseif 副本数据.黑风山.进行[id].进程==4 then
    地图 = 6018
    任务id=id.."_85_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
    local xy=地图处理类.地图坐标[地图]:取随机点()
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=3600,
      玩家id=id,
      队伍组={},
      名称="鬼鬼祟祟的黑熊精",
      模型="黑熊精",
      x=xy.x,
      y=xy.y,
      方向=1,
      事件="明雷活动",
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=85,
    }
    地图处理类:添加单位(任务id)
  elseif 副本数据.黑风山.进行[id].进程==5 then
    副本数据.黑风山.进行[id].数量=10
    地图 = 6019

    for i=1,5 do
      任务id=id.."_86_"..os.time().."_"..随机序列.."_"..取随机数(1,9999)..i
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="熊熊烈火",
        模型="凤凰",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        事件="明雷活动",
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=86,
      }
      地图处理类:添加单位(任务id)
    end
    for i=1,5 do
      任务id=id.."_86_"..os.time().."_"..随机序列.."_"..取随机数(1,9999)..i
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="星星火光",
        模型="凤凰",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        事件="明雷活动",
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=86,
      }
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.黑风山.进行[id].进程==6 then
    地图 = 6020
    任务id=id.."_87_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
    local xy=地图处理类.地图坐标[地图]:取随机点()
    任务数据[任务id]={
      id=任务id,
      起始=os.time(),
      结束=3600,
      玩家id=id,
      队伍组={},
      名称="黑汉",
      模型="黑熊精",
      x=xy.x,
      y=xy.y,
      方向=1,
      事件="明雷活动",
      副本id=id,
      地图编号=地图,
      地图名称=取地图名称(地图),
      类型=87,
    }
    地图处理类:添加单位(任务id)
  elseif 副本数据.黑风山.进行[id].进程==7 then
    副本数据.黑风山.进行[id].数量=10
    local sj = 取随机数(1,#随机名称)
    地图=6020
    for i=1,10 do
      任务id=id.."_88_"..os.time().."_"..随机序列.."_"..取随机数(1,999)..i
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=3600,
        玩家id=id,
        队伍组={},
        名称="黑熊精队长",
        模型="黑熊精",
        事件="明雷活动",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=88,
      }
      地图处理类:添加单位(任务id)
    end
  elseif 副本数据.黑风山.进行[id].进程==8 then
    地图 = 6021
    local xy=地图处理类.地图坐标[地图]:取随机点()
    随机名称={"黑熊精"}
    随机模型={"黑熊精"}
    for i=1,#随机模型 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务id=id.."_89_"..os.time().."_"..随机序列.."_"..取随机数(1,999)..i
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称=随机名称[i],
        模型=随机模型[i],
        x=41,
        y=19,
        方向=1,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=89,
      }
      地图处理类:添加单位(任务id)
    end
  end
end

__GWdh111[83]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="听说吃了唐僧的肉可以长生不老！"
    对话数据.选项={"送你轮回","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[83]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="送你轮回" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155567,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[84]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="嗷呜！人肉的味道真是鲜美！"
    对话数据.选项={"去死吧","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[84]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="去死吧" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155568,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[85]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="看那袈裟可是个好东西！"
    对话数据.选项={"鬼鬼祟祟的在干嘛","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[85]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="鬼鬼祟祟的在干嘛" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155569,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[86]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="火！火！火！火！火！火！"
    对话数据.选项={"灭火","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[86]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="灭火" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155571,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[87]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="你是谁，你来此作甚！"
    对话数据.选项={"看打","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[87]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="看打" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155572,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[88]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="你是谁，你来此作甚！"
    对话数据.选项={"看打","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[88]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="看打" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155573,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[89]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].战斗==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(80)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="这袈裟真是难得一见的宝物啊！"
    对话数据.选项={"把袈裟交出来","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[89]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="把袈裟交出来" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].战斗~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战黑风山最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战黑风山至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155574,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].战斗=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

function 副本_黑风山:结束黑风山副本(任务id)
  local 副本id = 任务数据[任务id].副本id
  local 主任务id = 副本数据.黑风山.进行[副本id].主任务id
  副本数据.黑风山.进行[副本id]=nil
  local id组 = 任务数据[主任务id].队伍组
  任务数据[主任务id]=nil
  for i=1,#id组 do
    副本数据.黑风山.完成[id组[i]]=true
    if 玩家数据[id组[i]] then
      玩家数据[id组[i]].角色:取消任务(80)
      玩家数据[id组[i]].角色:刷新任务跟踪()
      if 玩家数据[id组[i]].战斗 ~= 0 and ((战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155566 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155567 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155568 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155569 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155570 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155571 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155572 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155573  or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155574) then
        战斗准备类.战斗盒子[玩家数据[id组[i]].战斗]:结束战斗(0,0,1)
      end
    end
  end
  for i in pairs(任务数据) do
    if 任务数据[i].类型 >=80 and 任务数据[i].类型 <=89 and 任务数据[i].副本id == 副本id then
      if 任务数据[i].地图编号 and 任务数据[i].单位编号 then
        地图处理类:删除单位(任务数据[i].地图编号,任务数据[i].单位编号)
      end
      任务数据[i]=nil
    end
  end
end

function 黑风山副本失败(任务id)
  if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
    if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
      if  任务数据[任务id].类型== 80 then
        for i=1,#任务数据[任务id].队伍组 do
          if 玩家数据[任务数据[任务id].队伍组[i]] ~= nil then
            玩家数据[任务数据[任务id].队伍组[i]].角色:取消任务(玩家数据[任务数据[任务id].队伍组[i]].角色:取任务(80))
          end
        end
        任务数据[任务id]=nil
      else
        任务处理类:删除单位(任务id)
      end
    end
  end
end

function 副本_黑风山:黑风山打扫(id)
  if 玩家数据[id].角色:取任务(81) ~= 0 then
    添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
    return
  end
  local 地图=6018
  local xy=地图处理类.地图坐标[地图]:取随机点()
  local 任务id="_81_"..os.time().."_"..随机序列.."_"..取随机数(1,9999)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=1200,
    玩家id=id,
    队伍组={},
    x=xy.x,
    y=xy.y,
    地图编号=地图,
    地图名称=取地图名称(地图),
    类型=81,
    副本id = 任务数据[玩家数据[id].角色:取任务(80)].副本id
  }
  玩家数据[id].角色:添加任务(任务id)
  添加最后对话(id,format("麻烦你帮我到%s,%s处打扫一下吧！",任务数据[任务id].x,任务数据[任务id].y))
end

function 副本_黑风山:黑风山巡逻(id)
  if 玩家数据[id].角色:取任务(82) ~= 0 then
    添加最后对话(id,"少侠身上已经任务，请先完成任务再来！")
    return
  end
  local 地图=6018
  local xy=地图处理类.地图坐标[地图]:取随机点()
  local 任务id="_82_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=1200,
    玩家id=id,
    类型=82,
    队伍组={},
    副本id = 任务数据[玩家数据[id].角色:取任务(80)].副本id
  }
  玩家数据[id].角色:添加任务(任务id)
  添加最后对话(id,format("法会就要开始了，少侠在附近巡逻一番吧！",任务数据[任务id].目标))
end

function 副本_黑风山:完成黑风山任务(id组,任务id,战斗类型)
  local 奖励
  if 任务数据[任务id] then
    local 副本id=任务数据[任务id].副本id
    local 进度刷新=false
    for i=1,#id组 do
      local id = id组[i]
      local 等级 = 玩家数据[id].角色.等级
      local 经验
      local 银子
      local 储备
      if 战斗类型==81 then --黑风山打扫
        if 玩家数据[id].角色:取任务(80)~=0 and 副本数据.黑风山.进行[副本id].协助任务.婆婆 > 0 then
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3250)
    local 银子=等级*取随机数(150,180)+30000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=20 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==100096 then --黑风山巡逻
        if 玩家数据[id].角色:取任务(80)~=0 and 副本数据.黑风山.进行[副本id].协助任务.镇山太保 > 0 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3250)
    local 银子=等级*取随机数(150,180)+20000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=20 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==82 then --黑风山答题
        if 玩家数据[id].角色:取任务(80)~=0 and 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 > 0 then
   local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3250)
    local 银子=等级*取随机数(150,180)+20000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=20 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
        end
      elseif 战斗类型==155567 then
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3250)
    local 银子=等级*取随机数(150,180)+20000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=20 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    elseif 战斗类型==155568 then
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(5000,5250)
        local 银子=等级*取随机数(150,180)+20000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
    if 取随机数()<=20 then
       local 奖励参数=取随机数(1,100)
       链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
    if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
    elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
    elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
    elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
    elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    elseif 战斗类型==155569 then
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(5000,5250)
        local 银子=等级*取随机数(150,180)+20000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
    if 取随机数()<=20 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155571 then
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(5000,5550)
        local 银子=等级*取随机数(150,180)+30000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
    if 取随机数()<=20 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155572 then
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5550)
    local 银子=等级*取随机数(150,180)+30000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=20 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="神兜兜"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="高级召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155573 then
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(5000,5250)
    local 银子=等级*取随机数(150,180)+28000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=20 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=45 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155574 then
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(8000,8250)
    local 银子=等级*取随机数(150,180)+80000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=80 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-黑风山)#R/%s#Y/在#R/黑风山#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=45 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      -- elseif 奖励参数<=75 then
      --   local 名称=取随机玄灵珠()
      --   玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
  end
end
    if 战斗类型==81 then --黑风山打扫
      if 玩家数据[id组[1]].角色:取任务(80) and 副本数据.黑风山.进行[副本id].协助任务.婆婆 > 0 then
        副本数据.黑风山.进行[副本id].协助任务.婆婆 = 副本数据.黑风山.进行[副本id].协助任务.婆婆 - 5
        if 副本数据.黑风山.进行[副本id].协助任务.婆婆 <= 0 then
          取消队伍任务(玩家数据[id组[1]].角色:取任务(80),81)
        else
          玩家数据[id组[1]].角色:取消任务(任务id)
        end
        if 副本数据.黑风山.进行[副本id].协助任务.婆婆 <= 0 and 副本数据.黑风山.进行[副本id].协助任务.镇山太保 <= 0 and 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 <= 0 then
          local 副本id = 任务数据[任务id].副本id
          副本数据.黑风山.进行[副本id].进程 = 2
          self:设置黑风山副本(副本id)
          进度刷新=true
        else
          local id组 = 任务数据[副本数据.黑风山.进行[副本id].主任务id].队伍组
          for i=1,#id组 do
            if 玩家数据[id组[i]] then
              玩家数据[id组[i]].角色:刷新任务跟踪()
            end
          end
          return
        end
      end
    elseif 战斗类型==155566 then --黑风山巡逻
      if 玩家数据[id组[1]].角色:取任务(80) and 副本数据.黑风山.进行[副本id].协助任务.镇山太保 > 0 then
        副本数据.黑风山.进行[副本id].协助任务.镇山太保 = 副本数据.黑风山.进行[副本id].协助任务.镇山太保 - 5
        if 副本数据.黑风山.进行[副本id].协助任务.镇山太保 <= 0 then
          取消队伍任务(玩家数据[id组[1]].角色:取任务(80),82)
        else
          玩家数据[id组[1]].角色:取消任务(任务id)
        end
        if 副本数据.黑风山.进行[副本id].协助任务.婆婆 <= 0 and 副本数据.黑风山.进行[副本id].协助任务.镇山太保 <= 0 and 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 <= 0 then
          local 副本id = 任务数据[任务id].副本id
          副本数据.黑风山.进行[副本id].进程 = 2
          self:设置黑风山副本(副本id)
          进度刷新=true
        end
        local id组 = 任务数据[副本数据.黑风山.进行[副本id].主任务id].队伍组
        for i=1,#id组 do
          if 玩家数据[id组[i]] then
            玩家数据[id组[i]].角色:刷新任务跟踪()
          end
        end
        return
      end
    elseif 战斗类型==82 then --黑风山答题
      if 玩家数据[id组[1]].角色:取任务(80) and 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 > 0 then
        副本数据.黑风山.进行[副本id].协助任务.唐玄奘 = 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 - 5
        if 副本数据.黑风山.进行[副本id].协助任务.婆婆 <= 0 and 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 <= 0 and 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 <= 0 then
          local 副本id = 任务数据[任务id].副本id
          副本数据.黑风山.进行[副本id].进程 = 2
          self:设置黑风山副本(副本id)
          local id组 = 任务数据[副本数据.黑风山.进行[副本id].主任务id].队伍组
          for i=1,#id组 do
            if 玩家数据[id组[i]] then
              玩家数据[id组[i]].角色:刷新任务跟踪()
              常规提示(id组[i],"#Y/您的副本进度已经更新")
            end
          end
        end
        return
      end
    elseif 战斗类型==155567 then
      副本数据.黑风山.进行[副本id].数量=副本数据.黑风山.进行[副本id].数量-1
      if 副本数据.黑风山.进行[副本id].数量 <= 0 then
        副本数据.黑风山.进行[副本id].进程=3
        self:设置黑风山副本(副本id)
        进度刷新=true
      end
    elseif 战斗类型==155568 then
      副本数据.黑风山.进行[副本id].进程=4
      self:设置黑风山副本(副本id)
      进度刷新=true
    elseif 战斗类型==155569 then
      副本数据.黑风山.进行[副本id].进程=5
      self:设置黑风山副本(副本id)
      进度刷新=true
      任务处理类:副本传送(id组[1],80)
    elseif 战斗类型==155571 then
      副本数据.黑风山.进行[副本id].数量=副本数据.黑风山.进行[副本id].数量-1
      if 副本数据.黑风山.进行[副本id].数量 <= 0 then
        副本数据.黑风山.进行[副本id].进程=6
        self:设置黑风山副本(副本id)
        任务处理类:副本传送(id组[1],80)
        进度刷新=true
      end
    elseif 战斗类型==155572 then
      副本数据.黑风山.进行[副本id].进程=7
      self:设置黑风山副本(副本id)
      进度刷新=true
    elseif 战斗类型==155573 then
      副本数据.黑风山.进行[副本id].数量=副本数据.黑风山.进行[副本id].数量-1
      if 副本数据.黑风山.进行[副本id].数量 <= 0 then
        副本数据.黑风山.进行[副本id].进程=8
        self:设置黑风山副本(副本id)
        任务处理类:副本传送(id组[1],80)
        进度刷新=true
      end
    elseif 战斗类型==155574 then
      local id组 = 任务数据[副本数据.黑风山.进行[副本id].主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          地图处理类:跳转地图(id组[i],1001,358,35)
          更新玩家每日(id组[i],"副本任务","黑风山")
          玩家数据[id组[i]].角色:添加副本积分(400)
          玩家数据[id组[i]].角色:添加仙玉(500)
          玩家数据[id组[i]].角色:添加每日活跃度(id组[i], 5)
          常规提示(id组[i],"#Y/恭喜你们完成黑风山副本")
        end
      end
      self:结束黑风山副本(任务id)
      return
    end
    local id组 = 任务数据[副本数据.黑风山.进行[副本id].主任务id].队伍组
    for i=1,#id组 do
      if 玩家数据[id组[i]] then
        玩家数据[id组[i]].角色:刷新任务跟踪()
        if 进度刷新 then
          常规提示(id组[i],"#Y/您的副本进度已经更新")
        end
      end
    end
    if 任务数据[任务id] and 任务数据[任务id].地图编号 and 任务数据[任务id].单位编号 then
      地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    end
    任务数据[任务id]=nil
  end
end



return 副本_黑风山