-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-16 20:34:26
local 副本_齐天大圣 = class()
function 副本_齐天大圣:初始化()
  地图处理类.地图数据[6043]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6043]={}
  地图处理类.地图坐标[6043]=地图处理类.地图坐标[1514]
  地图处理类.地图单位[6043]={}
  地图处理类.单位编号[6043]=1000

  地图处理类.地图数据[6044]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6044]={}
  地图处理类.地图坐标[6044]=地图处理类.地图坐标[1122]
  地图处理类.地图单位[6044]={}
  地图处理类.单位编号[6044]=1000

  地图处理类.地图数据[6045]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6045]={}
  地图处理类.地图坐标[6045]=地图处理类.地图坐标[1111]
  地图处理类.地图单位[6045]={}
  地图处理类.单位编号[6045]=1000

  地图处理类.地图数据[6046]={npc={},单位={},传送圈={}}
  地图处理类.地图玩家[6046]={}
  地图处理类.地图坐标[6046]=地图处理类.地图坐标[1009]
  地图处理类.地图单位[6046]={}
  地图处理类.单位编号[6046]=1000
end
function 副本_齐天大圣:取齐天大圣次数限制(id,次数)
  if 副本数据.齐天大圣.完成[id] then
    添加最后对话(id,"你今日已经完成过该副本了")
    return true
  elseif 玩家数据[id].队伍 ~= 0 then
    for i=1,#队伍数据[玩家数据[id].队伍].成员数据 do
      local lsid = 队伍数据[玩家数据[id].队伍].成员数据[i]
      if 副本数据.齐天大圣.完成[lsid]then
        添加最后对话(id,玩家数据[lsid].角色.名称.."今日已经完成过该副本了")
        return true
      end
    end
  end
  return false
end
function 副本_齐天大圣:开启齐天大圣副本(id)
  if 玩家数据[id].队伍==0 or 玩家数据[id].队长==false  then
    常规提示(id,"#Y/该任务必须组队完成且由队长领取")
    return
  elseif 取队伍人数(id)<3 then
    常规提示(id,"#Y此副本要求队伍人数不低于5人")
    return
  elseif  取等级要求(id,60)==false then
    常规提示(id,"#Y此副本要求角色等级不能低于60级")
    return
  elseif self:取齐天大圣次数限制(id) then
    return
  elseif 取队员任务存在(玩家数据[id].队伍,191) then
    常规提示(id,"#Y/队伍中已有队员正在进行该副本任,无法领取新的副本")
    return
  end
  local 任务id=id.."_191_"..os.time().."_"..随机序列.."_"..取随机数(1,999)
  副本数据.齐天大圣.进行[id]={进程=1,主任务id=任务id}
  设置齐天大圣副本(id)
  任务数据[任务id]={
    id=任务id,
    起始=os.time(),
    结束=7200,
    玩家id={},
    队伍组={},
    副本id=id,
    类型=191
  }
  local 队伍id=玩家数据[id].队伍
  for n=1,#队伍数据[队伍id].成员数据 do
    local 临时id=队伍数据[队伍id].成员数据[n]
      任务数据[任务id].队伍组[#任务数据[任务id].队伍组+1]=临时id
      玩家数据[临时id].角色:添加任务(任务id)
      副本数据.齐天大圣.完成[临时id]=true
      常规提示(临时id,"#Y你开启了齐天大圣副本")
  end
end
function 设置齐天大圣副本(id)
  local 随机名称={}
  local 随机模型={}
    玩家数据[id].zhandou=0
    local 队伍id=玩家数据[id].队伍
  if 副本数据.齐天大圣.进行[id].进程==1 then
    随机名称={"伤心的小猴","临死的老猴"}
    随机模型={"超级金猴","长眉灵猴"}
    副本数据.齐天大圣.进行[id].小猴老猴 = {伤心的小猴=5,临死的老猴=5}
    for i=1,2 do
      for n=1,5 do
        地图 = 6043
        local xy=地图处理类.地图坐标[地图]:取随机点()
        local 任务id="_192_"..os.time().."_"..取随机数(1,999)..n..i
        任务数据[任务id]={
          id=任务id,
          起始=os.time(),
          结束=7200,
          玩家id=id,
          队伍组={},
          名称=随机名称[i],
          模型=随机模型[i],
          x=xy.x,
          y=xy.y,
          副本id=id,
          地图编号=地图,
          地图名称=取地图名称(地图),
          类型=192
        }
        地图处理类:添加单位(任务id)
      end
    end
    地图处理类:跳转地图(id,6043,12,108)
    local text1 = {"齐天大圣 始"}
    for n=1,#队伍数据[队伍id].成员数据 do
      local 临时id=队伍数据[队伍id].成员数据[n]
      发送数据(玩家数据[临时id].连接id,6557,{文本=text1,类型="齐天大圣序",字体=nil,音乐=nil,背景=nil,横排显示=true,动画调用={191,1}})
    end
  elseif 副本数据.齐天大圣.进行[id].进程==2 then
      副本数据.齐天大圣.进行[id].无常 = {黑无常=0,白无常=0}
      任务id=id.."_193_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6043
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="白无常",
        模型="僵尸",
        变异=true,
        x=114,
        y=106,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=193,
      }
      地图处理类:添加单位(任务id)
      任务id=id.."_194_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6043
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="黑无常",
        模型="野鬼",
        变异=true,
        x=31,
        y=20,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=194,
      }
      地图处理类:添加单位(任务id)
  elseif 副本数据.齐天大圣.进行[id].进程==3 then
      任务id=id.."_199_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6044
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="判官",
        模型="男人_判官",
        x=53,
        y=66,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=199,
      }
      地图处理类:添加单位(任务id)
  elseif 副本数据.齐天大圣.进行[id].进程==4 then
      任务id=id.."_200_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6044
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="阎王",
        模型="阎罗王",
        x=33,
        y=54,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=200,
      }
      地图处理类:添加单位(任务id)
  elseif 副本数据.齐天大圣.进行[id].进程==5 then
      任务id=id.."_195_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6043
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="太白金星",
        模型="太白金星",
        x=114,
        y=106,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=195,
      }
      地图处理类:添加单位(任务id)
  elseif 副本数据.齐天大圣.进行[id].进程==6 then
      副本数据.齐天大圣.进行[id].展示实力 = {玉皇大帝=0,四大天王=0}
      任务id=id.."_981_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6045
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="玉皇大帝",
        模型="男人_玉帝",
        x=152,
        y=108,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=981,
      }
      地图处理类:添加单位(任务id)
      任务id=id.."_982_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6045
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="天王",
        模型="大力金刚",
        x=167,
        y=111,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=982,
      }
      地图处理类:添加单位(任务id)
   elseif 副本数据.齐天大圣.进行[id].进程==7 then
      任务id=id.."_983_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6045
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="玉皇大帝",
        模型="男人_玉帝",
        x=152,
        y=108,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=983,
      }
      地图处理类:添加单位(任务id)
   elseif 副本数据.齐天大圣.进行[id].进程==8 then
    地图 = 6045
    随机名称={"盗马贼"}
    随机模型={"强盗"}
    副本数据.齐天大圣.进行[id].盗马贼=10
    for i=1,10 do
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务id=id.."_196_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)..i
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="盗马贼",
        模型="强盗",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=196,
      }
      地图处理类:添加单位(任务id)
    end
elseif 副本数据.齐天大圣.进行[id].进程==9 then
      副本数据.齐天大圣.进行[id].盗马贼=nil
      任务id=id.."_197_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6045
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="调皮的小马",
        模型="超级神马",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=197,
      }
      地图处理类:添加单位(任务id)
   elseif 副本数据.齐天大圣.进行[id].进程==10 then
      任务id=id.."_984_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6045
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="天蓬元帅",
        模型="猪八戒",
        x=246,
        y=105,
        方向=1,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=984,
      }
      地图处理类:添加单位(任务id)
  elseif 副本数据.齐天大圣.进行[id].进程==11 then
      副本数据.齐天大圣.进行[id].百万天兵 = {百万天兵=0,巨灵神=0}
      任务id=id.."_198_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图 = 6043
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="百万天兵",
        模型="天兵",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=198,
      }
      地图处理类:添加单位(任务id)
      任务id=id.."_198_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图 = 6043
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="巨灵神",
        模型="大力金刚",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=198,
      }
      地图处理类:添加单位(任务id)
      任务id=id.."_198_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图 = 6043
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="李靖",
        模型="李靖",
        x=xy.x,
        y=xy.y,
        方向=方向,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=198,
      }
      地图处理类:添加单位(任务id)
   elseif 副本数据.齐天大圣.进行[id].进程==12 then
      任务id=id.."_985_"..os.time().."_"..随机序列.."_"..取随机数(1,99)
      地图=6046
      local xy=地图处理类.地图坐标[地图]:取随机点()
      任务数据[任务id]={
        id=任务id,
        起始=os.time(),
        结束=7200,
        玩家id=id,
        队伍组={},
        名称="镇塔之神",
        模型="男人_将军",
        x=31,
        y=25,
        方向=0,
        副本id=id,
        地图编号=地图,
        地图名称=取地图名称(地图),
        类型=985,
      }
      地图处理类:添加单位(任务id)
  end
end
__GWdh111[199]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
    if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
      对话数据.对话="大仙,生死簿存放在阎王手中,你找小仙也没有用啊！"
      完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,199)
    end
  return 对话数据
end
__GWdh111[200]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="生死簿乃是地府重宝,岂是尔等可以索要的！"
    对话数据.选项={"那就别怪我不客气","我再想办法"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[200]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="那就别怪我不客气" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155602,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end
__GWdh111[981]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    if 副本数据.齐天大圣.进行[数字id].展示实力.四大天王==0  then
     添加最后对话(数字id,"请先挑战天王！！")
    return
    end
    if 副本数据.齐天大圣.进行[数字id].进程==6 then
    对话数据.对话="要想做官得让朕先看看你的本事！"
    对话数据.选项={"那老孙就露两手","我再想办法"}
  else
    对话数据.对话="你已完成任务，请勿打扰。"
  end
  end
  return 对话数据
end

__GWdh222[981]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="那老孙就露两手" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155603,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end
__GWdh111[982]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    if 副本数据.齐天大圣.进行[数字id].进程==6 then
    对话数据.对话="不是什么人，都能在天庭做官的！"
    对话数据.选项={"你算什么东西！","我再想办法"}
  else
    对话数据.对话="你已完成任务，请勿打扰。"
  end
  end
  return 对话数据
end

__GWdh222[982]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="你算什么东西！" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155608,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end
__GWdh111[983]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
    if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
      对话数据.对话="你能穿上朝服，管理天上所有的骏马,还能拥有好听的官名“弼马温”怎么样！"
      完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,983)
    end
  return 对话数据
end
__GWdh111[984]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
    if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
      对话数据.对话="你就是一个不入流的弼马温,专门看马的而已,哈哈哈,知道我是谁么,我乃天庭十万水军元帅,天蓬元帅是也！"
      完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,984)
    end
  return 对话数据
end
__GWdh111[985]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="少侠还是走到这一步了！"
    对话数据.选项={"开打吧！","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[985]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="开打吧！" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155607,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[192]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    if 任务数据[标识].名称=="伤心的小猴" and 副本数据.齐天大圣.进行[副本id].进程 == 1 then
    对话数据.对话="猴爷爷快要不行了,呜呜呜。"
    对话数据.选项={"救救我！","置之不理！"}
   elseif 任务数据[标识].名称=="临死的老猴" and 副本数据.齐天大圣.进行[副本id].进程 == 1  then
    对话数据.对话="大王,我不行了,以后无法再陪伴大王了。"
    对话数据.选项={"哎，可怜","置之不理！"}
  end
  end
  return 对话数据
end
__GWdh222[192]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="救救我！" then
   if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,192)
    玩家数据[数字id].地图单位=nil
    return
  elseif 事件=="哎，可怜" then
   if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,192.1)
    玩家数据[数字id].地图单位=nil
    return
  end
end
__GWdh111[193]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="我等要收走死亡老猴的魂魄,尔等不要挡路！"
    对话数据.选项={"我看谁敢","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[193]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="我看谁敢" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155600,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[194]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    对话数据.对话="我等要收走死亡老猴的魂魄,尔等不要挡路！"
    对话数据.选项={"我看谁敢","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[194]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="我看谁敢" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155601,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end
__GWdh111[195]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
    if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
      对话数据.对话="玉帝天恩浩荡,赦免了您大闹地府之罪,还要授予你官职,且与我一同前往天宫授封吧。"
      完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,195)
    end
  return 对话数据
end
__GWdh111[196]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
      对话数据.对话="天庭的马儿真是好啊！"
      对话数据.选项={"找死","我只是路过"}
  else
    对话数据.对话="我正在战斗中，请勿打扰。"
  end
  return 对话数据
end

__GWdh222[196]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="找死" then
    if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155604,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end

__GWdh111[197]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
    if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
      对话数据.对话="调皮的小马,快点跟着我回去吧！"
      完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,197)
    end
  return 对话数据
end
__GWdh111[198]=function(连接id,数字id,序列,标识,地图)
  local 对话数据 = {}
  if 任务数据[标识].zhandou==nil then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
    if 任务数据[标识].名称=="百万天兵" and 副本数据.齐天大圣.进行[副本id].进程 == 11 then
          对话数据.对话="大胆泼猴,竟敢违逆天命,还不拿命来！"
          对话数据.选项={"口出狂言","我只是路过"}
   elseif 任务数据[标识].名称=="巨灵神" and 副本数据.齐天大圣.进行[副本id].进程 == 11  then
          对话数据.对话="大胆泼猴,竟敢违逆天命,还不拿命来！"
          对话数据.选项={"比划比划","我只是路过"}
   elseif 任务数据[标识].名称 == "李靖" then
    local 副本id=任务数据[标识].副本id
    if (任务数据[玩家数据[数字id].角色:取任务(191)] or {}).副本id ~= 副本id then 添加最后对话(数字id,"我好像不认识你吧？？？") return end
     if  副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵==1 and 副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神==1 then
        完成齐天大圣任务({数字id},玩家数据[数字id].地图单位.标识,198)
        else
          对话数据.对话="哼,连我的手下都没有消灭,还想来战我！"
        end
    end
    end
  return 对话数据
end
__GWdh222[198]=function (连接id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 事件=="口出狂言" then
 if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155605,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  elseif 事件=="比划比划" then
 if 任务数据[玩家数据[数字id].地图单位.标识]==nil then return end
    if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
    if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
    if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/挑战齐天大圣最少要有五人") return  end
    if 取等级要求(数字id,60)==false then 常规提示(数字id,"#Y/挑战齐天大圣至少要达到60级") return  end
    战斗准备类:创建战斗(数字id+0,155606,玩家数据[数字id].地图单位.标识)
    任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
    玩家数据[数字id].地图单位=nil
    return
  end
end
function 齐天大圣副本失败(任务id)
  if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then
    if 任务数据[任务id].zhandou~=true then  --未进入战斗状态
      if  任务数据[任务id].类型== 191 then
        for i=1,#任务数据[任务id].队伍组 do
          if 玩家数据[任务数据[任务id].队伍组[i]] ~= nil then
            玩家数据[任务数据[任务id].队伍组[i]].角色:取消任务(玩家数据[任务数据[任务id].队伍组[i]].角色:取任务(191))
          end
        end
        任务数据[任务id]=nil
      else
        任务处理类:删除单位(任务id)
      end
    end
  end
end
function 完成齐天大圣任务(id组,任务id,战斗类型)
  local 奖励
  if 任务数据[任务id] then
    local 副本id=任务数据[任务id].副本id
    local 进度刷新=false
    for i=1,#id组 do
      local id = id组[i]
      local 等级 = 玩家数据[id].角色.等级
      local 经验
      local 银子
      local 储备
    if 战斗类型==192 then --伤心的小猴
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3200)
    local 银子=等级*取随机数(90,120)+14000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    elseif 战斗类型==192.1 then --临死的老猴
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,5000)
    local 银子=等级*取随机数(90,120)+14000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    elseif 战斗类型==155600 then --白无常
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(10000,12000)
    local 银子=等级*取随机数(90,120)+34000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=35 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=75 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    elseif 战斗类型==155601 then --黑无常
  local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3200)
    local 银子=等级*取随机数(90,120)+30000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=95 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    elseif 战斗类型==155602 then --阎王
  local 等级=玩家数据[id].角色.等级
    local 经验=等级*取随机数(3000,3500)
    local 银子=等级*取随机数(90,120)+40000
    玩家数据[id].角色:添加经验(经验,"初出江湖")
    玩家数据[id].角色:添加银子(银子,"初出江湖",1)
    玩家数据[id].zhandou=0
    if 取随机数()<=30 then
      local 奖励参数=取随机数(1,100)
      链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
            if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="未鉴定的灵犀玉"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
           end
        end
      elseif 战斗类型==155603 then --玉皇大帝
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(14000,16000)
        local 银子=等级*取随机数(90,120)+54000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
        if 取随机数()<=30 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155605 then --百万天兵
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(3000,3200)
        local 银子=等级*取随机数(90,120)+45000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
        if 取随机数()<=30 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="高级魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=95 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155606 then --巨灵神
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(3000,3500)
        local 银子=等级*取随机数(90,120)+45000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
        if 取随机数()<=30 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="未鉴定的灵犀玉"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=65 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=90 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    elseif 战斗类型==155607 then --镇塔
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(3000,3500)
        local 银子=等级*取随机数(90,120)+45000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
        if 取随机数()<=30 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=20 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="未鉴定的灵犀玉"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155608 then --玉皇大帝
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(10000,11000)
        local 银子=等级*取随机数(90,120)+55000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
        if 取随机数()<=80 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=40 then
        local 名称="未鉴定的灵犀玉"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=80 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
      elseif 战斗类型==155604 then --盗马贼
        local 等级=玩家数据[id].角色.等级
        local 经验=等级*取随机数(4000,6000)
        local 银子=等级*取随机数(90,120)+20000
        玩家数据[id].角色:添加经验(经验,"初出江湖")
        玩家数据[id].角色:添加银子(银子,"初出江湖",1)
        玩家数据[id].zhandou=0
        if 取随机数()<=30 then
        local 奖励参数=取随机数(1,100)
        链接={提示=format("#S(副本-齐天大圣)#R/%s#Y/在#R/齐天大圣#Y/表现卓越，额外获得了#G",玩家数据[id].角色.名称),频道="xt",结尾="#Y。"}
        if 奖励参数<=10 then
        local 名称="金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=15 then
        local 名称="超级金柳露"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=16 then
        local 名称="召唤兽内丹"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=30 then
        local 名称="魔兽要诀"
        玩家数据[id].道具:给予超链接道具(id,名称,nil,nil,链接)
      elseif 奖励参数<=35 then
        local 名称="五宝盒"
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=50 then
        local 名称=取强化石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=55 then
        local 名称="九转金丹"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(10,15),nil,链接)
      elseif 奖励参数<=60 then
        local 名称=取宝石()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=70 then
        local 名称=取随机玄灵珠()
        玩家数据[id].道具:给予超链接道具(id,名称,1,nil,链接)
      elseif 奖励参数<=85 then
        local 名称="未激活的符石"
        玩家数据[id].道具:给予超链接道具(id,名称,取随机数(1,1),nil,链接)
      end
    end
    end
    end
    if 战斗类型==192 then
  if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].小猴老猴.伤心的小猴 > 0 then
      副本数据.齐天大圣.进行[副本id].小猴老猴.伤心的小猴=副本数据.齐天大圣.进行[副本id].小猴老猴.伤心的小猴-1
        if 副本数据.齐天大圣.进行[副本id].小猴老猴.伤心的小猴 <= 0 and 副本数据.齐天大圣.进行[副本id].小猴老猴.临死的老猴 <= 0 then
        副本数据.齐天大圣.进行[副本id].进程=2
        设置齐天大圣副本(副本id)
        进度刷新=true
     end
     end
    elseif 战斗类型==192.1 then
  if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].小猴老猴.临死的老猴 > 0 then
      副本数据.齐天大圣.进行[副本id].小猴老猴.临死的老猴=副本数据.齐天大圣.进行[副本id].小猴老猴.临死的老猴-1
        if 副本数据.齐天大圣.进行[副本id].小猴老猴.伤心的小猴 <= 0 and 副本数据.齐天大圣.进行[副本id].小猴老猴.临死的老猴 <= 0 then
        副本数据.齐天大圣.进行[副本id].进程=2
        设置齐天大圣副本(副本id)
        进度刷新=true
     end
     end
    elseif 战斗类型==155600 then
  if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].无常.白无常 < 1 then
      副本数据.齐天大圣.进行[副本id].无常.白无常=副本数据.齐天大圣.进行[副本id].无常.白无常+1
        if 副本数据.齐天大圣.进行[副本id].无常.白无常 >= 1 and 副本数据.齐天大圣.进行[副本id].无常.黑无常 >=  1 then
        副本数据.齐天大圣.进行[副本id].进程=3
        设置齐天大圣副本(副本id)
        进度刷新=true
        任务处理类:副本传送(id组[1],191)
     end
     end
    elseif 战斗类型==155601 then
  if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].无常.黑无常 < 1 then
      副本数据.齐天大圣.进行[副本id].无常.黑无常=副本数据.齐天大圣.进行[副本id].无常.黑无常+1
        if 副本数据.齐天大圣.进行[副本id].无常.白无常 >= 1 and 副本数据.齐天大圣.进行[副本id].无常.黑无常 >= 1 then
        副本数据.齐天大圣.进行[副本id].进程=3
        设置齐天大圣副本(副本id)
        进度刷新=true
        任务处理类:副本传送(id组[1],191)
     end
     end
    elseif 战斗类型==199 then
      local 副本id = 任务数据[任务id].副本id
      副本数据.齐天大圣.进行[副本id].进程=4
      设置齐天大圣副本(副本id)
      进度刷新=true
    elseif 战斗类型==155602 then
      local 副本id = 任务数据[任务id].副本id
      副本数据.齐天大圣.进行[副本id].进程=5
      设置齐天大圣副本(副本id)
      进度刷新=true
      任务处理类:副本传送(id组[1],191)
    elseif 战斗类型==195 then
      local 副本id = 任务数据[任务id].副本id
      副本数据.齐天大圣.进行[副本id].进程=6
      设置齐天大圣副本(副本id)
      进度刷新=true
      任务处理类:副本传送(id组[1],191)
    elseif 战斗类型==155603 then
      if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].展示实力.玉皇大帝 < 1 then
        副本数据.齐天大圣.进行[副本id].展示实力.玉皇大帝 = 副本数据.齐天大圣.进行[副本id].展示实力.玉皇大帝 + 1
        if 副本数据.齐天大圣.进行[副本id].展示实力.玉皇大帝 >= 1 and 副本数据.齐天大圣.进行[副本id].展示实力.四大天王 >= 1  then
          local 副本id = 任务数据[任务id].副本id
          副本数据.齐天大圣.进行[副本id].进程 = 7
          设置齐天大圣副本(副本id)
          进度刷新=true
        else
          local id组 = 任务数据[副本数据.齐天大圣.进行[副本id].主任务id].队伍组
          for i=1,#id组 do
            if 玩家数据[id组[i]] then
              玩家数据[id组[i]].角色:刷新任务跟踪()
            end
          end
          return
        end
      end
    elseif 战斗类型==155608 then
      if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].展示实力.四大天王 < 1 then
        副本数据.齐天大圣.进行[副本id].展示实力.四大天王 = 副本数据.齐天大圣.进行[副本id].展示实力.四大天王 + 1
        if 副本数据.齐天大圣.进行[副本id].展示实力.玉皇大帝 >= 1 and 副本数据.齐天大圣.进行[副本id].展示实力.四大天王 >= 1  then
          local 副本id = 任务数据[任务id].副本id
          副本数据.齐天大圣.进行[副本id].进程 = 7
          设置齐天大圣副本(副本id)
          进度刷新=true
        else
          local id组 = 任务数据[副本数据.齐天大圣.进行[副本id].主任务id].队伍组
          for i=1,#id组 do
            if 玩家数据[id组[i]] then
              玩家数据[id组[i]].角色:刷新任务跟踪()
            end
          end
          return
        end
      end
    elseif 战斗类型==983 then
        副本数据.齐天大圣.进行[副本id].进程=8
        设置齐天大圣副本(副本id)
        进度刷新=true
    elseif 战斗类型==155604 then
       副本数据.齐天大圣.进行[副本id].盗马贼=副本数据.齐天大圣.进行[副本id].盗马贼-1
      if 副本数据.齐天大圣.进行[副本id].盗马贼 <= 0 then
        副本数据.齐天大圣.进行[副本id].进程=9
        设置齐天大圣副本(副本id)
        进度刷新=true
      end
    elseif 战斗类型==197 then
         副本数据.齐天大圣.进行[副本id].进程=10
        设置齐天大圣副本(副本id)
        进度刷新=true
    elseif 战斗类型==984 then
        副本数据.齐天大圣.进行[副本id].进程=11
        设置齐天大圣副本(副本id)
        进度刷新=true
        任务处理类:副本传送(id组[1],191)
    elseif 战斗类型==155605 then
    if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵 < 1 then
      副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵=副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵+1
        if 副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵 >= 1 and 副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神 >= 1 then
        --副本数据.齐天大圣.进行[副本id].进程=12
        --设置齐天大圣副本(副本id)
        --进度刷新=true
     end
     end
    elseif 战斗类型==155606 then
    if 玩家数据[id组[1]].角色:取任务(191) and 副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神 < 1 then
      副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神=副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神+1
        if 副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵 >= 1 and 副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神 >= 1 then
        --副本数据.齐天大圣.进行[副本id].进程=12
        --设置齐天大圣副本(副本id)
        --进度刷新=true
     end
     end
    elseif 战斗类型==198 then
        if 副本数据.齐天大圣.进行[副本id].百万天兵.百万天兵==1 and 副本数据.齐天大圣.进行[副本id].百万天兵.巨灵神==1 then
        副本数据.齐天大圣.进行[副本id].进程=12
        设置齐天大圣副本(副本id)
        进度刷新=true
        任务处理类:副本传送(id组[1],191)
        end
    elseif 战斗类型==155607 then
      local id组 = 任务数据[副本数据.齐天大圣.进行[副本id].主任务id].队伍组
      for i=1,#id组 do
        if 玩家数据[id组[i]] then
          地图处理类:跳转地图(id组[i],1001,358,35)
          更新玩家每日(id组[i],"副本任务","齐天大圣")
          玩家数据[id组[i]].角色:添加副本积分(200)
          玩家数据[id组[i]].角色:添加仙玉(500)
          玩家数据[id组[i]].角色:添加每日活跃度(id组[i], 5)
          常规提示(id组[i],"#Y/恭喜你们完成齐天大圣副本")
        end
      end
      结束齐天大圣副本(任务id)
      return
    end
    local id组 = 任务数据[副本数据.齐天大圣.进行[副本id].主任务id].队伍组
    for i=1,#id组 do
      if 玩家数据[id组[i]] then
        玩家数据[id组[i]].角色:刷新任务跟踪()
        if 进度刷新 then
          常规提示(id组[i],"#Y/您的副本进度已经更新")
        end
      end
    end
    if 任务数据[任务id] and 任务数据[任务id].地图编号 and 任务数据[任务id].单位编号 then
      地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
    end
    任务数据[任务id]=nil
  end
end
function 结束齐天大圣副本(任务id)
  local 副本id = 任务数据[任务id].副本id
  local 主任务id = 副本数据.齐天大圣.进行[副本id].主任务id
  副本数据.齐天大圣.进行[副本id]=nil
  local id组 = 任务数据[主任务id].队伍组
  任务数据[主任务id]=nil
  for i=1,#id组 do
    if 玩家数据[id组[i]] then
      玩家数据[id组[i]].角色:取消任务(191)
      玩家数据[id组[i]].角色:刷新任务跟踪()
      if 玩家数据[id组[i]].战斗 ~= 0 and ((战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155600 or (战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155601 or(战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155602 or(战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155603 or(战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155604 or(战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155605 or(战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155606 or(战斗准备类.战斗盒子[玩家数据[id组[i]].战斗] or {}).战斗类型==155607) then
        战斗准备类.战斗盒子[玩家数据[id组[i]].战斗]:结束战斗(0,0,1)
      end
    end
  end
  for i in pairs(任务数据) do
    if 任务数据[i].类型 >=191 and 任务数据[i].类型 <=205 and 任务数据[i].副本id == 副本id then
      if 任务数据[i].地图编号 and 任务数据[i].单位编号 then
        地图处理类:删除单位(任务数据[i].地图编号,任务数据[i].单位编号)
      end
      任务数据[i]=nil
    end
  end
end
return 副本_齐天大圣