-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-07 18:43:43
-- @Author: baidwwy
-- @Date:   2024-11-01 04:09:49
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-10 01:05:08
-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-09 02:11:03
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-29 23:00:31
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

local function 判定师门(sj)
	local lb = {"方寸山","女儿村","神木林","化生寺","大唐官府","盘丝洞","阴曹地府","无底洞","魔王寨","狮驼岭","天宫","普陀山","凌波城","五庄观","龙宫"}
	local fhz = false
	for i=1,#lb do
		if lb[i] == sj then
			fhz = true
		end
	end
	return fhz
end
local function 判定生肖神兽(sj)
	local lb = {"超级神鼠","超级神牛","超级神虎","超级神兔","超级神龙","超级神蛇","超级神马","超级神羊","超级神猴","超级神鸡","超级神狗","超级神猪"}
	local fhz = false
	for i=1,#lb do
		if lb[i] == sj then
			fhz = true
		end
	end
	return fhz
end


__NPCdh111[1001]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 7 then
		wb[1] = "我这里有一些奇珍异宝，你要买吗？"
		local xx = {"购买","我点错了"}
		return{"男人_道士","罗道人",wb[取随机数(1,#wb)],xx}
		elseif 编号 == 3 then
		wb[1] = "平日里多逛逛街，常会遇到些物美价廉的东西创建商会需要500W银两#89"
		local xx={"系统商店","玩家商店","商会管理","申请商会","我只是路过"}
		return{"仓库保管员","商会总管",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 1 then --PL申请人
		wb[1] = "世事恩怨在所难免，如果你30级以上，想通过武力解决争端，又避免受到官府的管制，可以在这里开启PK开关，与人进行决斗。(这是游戏世界里的特定方式，现实中可不要模仿啊）。"
		local xx={"我想了解更多细节","我要开启PK开关","我要关闭PK开关","我只是路过"}
		return{"男人_马副将","PK申请人",wb[取随机数(1,#wb)],xx}
	-- elseif 编号 == 2 then --宠物仙子
 --                xx = {"我要更换现在的宠物","我来兑换圣兽丹","我什么都不想做","","我想更换召唤兽装饰品的颜色","我要切换进阶召唤兽的造型","我要自定义宝宝造型"}
	-- 	return{"普陀山_接引仙女","宠物仙子","你可以在这里更换携带的#Y宠物#W，宠物可以在战斗中捕捉召唤兽和控制多只召唤兽为你作战。",xx}
	elseif 编号 == 4 then
		wb[1] = "这位少侠，可否替老夫捎一封书信给长寿村的凤凰姑娘#17？"
		wb[2] = "这位朋友是来京城做生意吗，最生意的方式很多，可以摆摊或者开店，开店的话可以找当铺门口的商会总管申请。"
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="陈员外" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		if 玩家数据[数字id].角色:取任务(1163)~=0 and 任务数据[玩家数据[数字id].角色:取任务(1163)].分类==4 then
			xx = {"文韵墨香","我点错了"}
		end
		return{"仓库保管员","陈员外",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 6 then
		wb[1] = "这位少侠，你这里有老夫需要的物品么？"
		wb[2] = "这位朋友是来京城做生意吗，最生意的方式很多，可以摆摊或者开店，开店的话可以找当铺门口的商会总管申请。"
		local xx = {"正好有给你","我点错了"}
		return{"男人_村长","老花农",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 8 then
		wb[1] = "每次进入染色界面需要消耗一颗彩果，你确定吗？"
		local xx = {"我想为人物染色","我点错了"}
		return{"女人_染色师","染色师",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 9 then
		wb[1] = "我可以送你去大唐国境，你要去吗？"
		local xx = {"是的我要去","我还要逛逛"}
		return{"男人_驿站老板","驿站老板",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 10 then
		wb[1] = "平日里多逛逛街，常会遇到些物美价廉的东西#89"
		wb[2] = "那边的威震天真是个大嗓门，得想个办法管管他#54"
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="张老财" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		return{"男人_老财","张老财",wb[取随机数(1,#wb)],xx}
	 elseif 编号 == 11 then
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
			return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 12 then
		wb[1] = "少侠请选择要为你传送的门派"
		local xx = {"方寸山","女儿村","神木林","化生寺","大唐官府","盘丝洞","阴曹地府","无底洞","魔王寨","狮驼岭","天宫","普陀山","凌波城","五庄观","龙宫","花果山","九黎城"}
		if 玩家数据[数字id].角色:取任务(300)~=0 then
			wb[1] = "少侠身上有重要的押镖任务在身，还是走路比较安全吧。"
			xx ={}
		end
		if RpbARGB.序列==3 then
			if 玩家数据[数字id].队伍~=0 then
				wb[1] = "组队时无法为你提供这项服务。"
				xx ={}
			elseif 玩家数据[数字id].角色.等级>60 and 玩家数据[数字id].角色.门派~="无" then
				wb[1] = "请选择你要传送的门派(等级超过60级仅可以传送至自己门派)："
				xx={玩家数据[数字id].角色.门派,"我只是路过"}
			end
		end
		return{"男人_镖头","门派传送人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 13 then
		wb[1] = "我可以送你去战神山，你要去吗？"
		local xx = {"是的我要去","我还要逛逛"}
		return{"男人_太上老君","圣山传送人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 14 then
		local xx={}
		if 门派闯关.活动开关 then
			wb[1] = "欢迎参加门派闯关竞赛活动，活动每天举行一次。你是否已经叫齐伙伴准备闯关了？(少侠是否愿意尝试一下修炼租赁，只要一点费用，即可临时提升角色修炼，还能获得相应的修炼经验，一举两得哦》"
			xx = {"准备好了，请告诉我们第一关的挑战地点","我只是来凑凑热闹"}
		else
			wb[1] = "欢迎参加门派闯关竞赛活动，活动每天举行一次。你是否已经叫齐伙伴准备闯关了？当前不是活动时间，请关注群通知。"
		end
		return{"男人_马副将","门派闯关使者",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 15 then
		wb[1] = " 听人说大唐官府的程咬金将军在广招徒弟，不知道谁能有幸拜在他的门下。大唐官府的入口在长安天台的后面。"
		wb[2] = " 化生寺的空度禅师也在招收徒弟，有兴趣的可以去试试。化生寺的入口就在长安大雁塔后面。"
		--local xx = {"开始四季活动","结束四季活动","查看四季活动积分","兑换四季活动奖励","没有什么想玩的"}
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="刘副将" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		return{"男人_马副将","刘副将",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 16 then
		wb[1] = "这里就是大唐的国都：长安城。皇宫门口可以找马副将领取双倍时间，领取后的时间内打怪经验翻倍。每星期的双倍时间是有限的，可别浪费了哦#2。新玩家一开始如果不知道怎么赚钱可以去铁匠铺或者布店打工。"
		--local xx = {"开始四季活动","结束四季活动","查看四季活动积分","兑换四季活动奖励","没有什么想玩的"}
		-- local xx={"我要学习调息","我只是路过"}
		local xx={"购买竞技药品","我只是看看"}
		return{"男人_兰虎","兰虎",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 17 then
		if 双倍数据[数字id]==nil then
			双倍数据[数字id]={可领=4,冻结=0,间隔=os.time()}
		end
		wb[1] = "奉唐王圣喻，招募外出杀敌的勇士。凡有心效力朝廷者可以在我这里领取雇佣时间，得到双倍经验的奖励，每人每日可以领取#R/4#W/小时。你本日还可领取#R/"..双倍数据[数字id].可领.."#W/小时，当前已冻结双倍时间#R/"..双倍数据[数字id].冻结.."#W/分钟。双倍时间将在每日24点整刷新，已冻结的双倍时间将会直接清空。"
		local xx = {"领取一小时","领取两小时","领取四小时","冻结双倍时间",nil,"恢复双倍时间","什么也不做"}
		return{"男人_马副将","马副将",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 18 then
		if 三倍数据[数字id]==nil then
			三倍数据[数字id]={可领=2,冻结=0,间隔=os.time()}
		end
		wb[1] = "奉唐王圣喻，为嘉奖表现卓越的勇士(≥60级)每人每日可以领取#R/2#W/小时的精修时间。你本日还可领取#R/"..三倍数据[数字id].可领.."#W/小时的精修时间。精修时间将在每日24点整刷新，精修时间一旦领取将无法冻结。"
		local xx = {"领取一小时精修时间","我只是随便瞧瞧"}
		return{"男人_马副将","御林军",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 19 then
		wb[1] = "15<等级<50的玩家在对应的野外场景战斗时，将会获得心魔宝珠。集齐20颗心魔宝珠后可以来我这里换取奖励。每个角色每天最多可以换取20次奖励。"
		local xx = {"上交心魔宝珠","我马上去搜集"}
		return{"护卫","皇宫护卫",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 20 then
		if 玩家数据[数字id].角色:取任务(7)~=0 then
			玩家数据[数字id].科举对话=true
			return{"考官2","礼部侍郎",format("#Y/第%s题：#W/%s",科举数据[数字id].总数, 玩家数据[数字id].科举数据.题目),玩家数据[数字id].科举数据.答案}
		end
		wb[1] = "等级达到30级的玩家每日可以在我这里参加两次科举活动。每轮都会有二十道题目，每道题有十五秒的答题时间。只要在答题时间内正确作答即可获得奖励。如果回答错误数量达到十次，将直接被淘汰掉。#R掌管《文韵墨香》事宜的，是礼部分部（长安城234，168）。"
		local xx = {"我要参加科举","我先回家再看几年书"}
		return{"考官2","礼部侍郎",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 21 then
		wb[1] = "天台的边上就是大雁塔，里面镇压着十万妖魔，是四十级前玩家升级打怪的好去处。"
		local xx={"关于人物洗点","关于剧情技能","“神兜兜”相关","我只是路过"}
		return{"袁天罡","袁天罡",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 22 then
		wb[1] = "宫廷内外有太多事物要处理，你是否愿意帮我处理这些事物？"
		local xx = {"我来帮你","取消任务","领取俸禄","我可没那闲功夫"}
		return{"男人_马副将","李将军",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 23 then
		wb[1] = "当年有志学长生，今日方知道行精。运动乾坤颠倒理，转移日月互为明。"
		local xx = {"请帮我点化装备","更改装备五行","更改法宝五行","更改法宝材料五行","更改召唤兽五行","我点错了"}
		return{"五行大师","五行大师",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 24 then
		wb[1] = "我受朝廷所托，在此召集十五门派的新入门派弟子(15至60级)，帮忙处理江湖之事。江湖总有英雄，也少不了坏人作乱，还需要诸位小心分辨！我要提醒一句：#Y江湖险恶，多找几个人一同前往，总之是没有坏处的。(需要3人以上组队)"
		local xx = {"告诉我要怎么做吧！","我要取消任务","少海你好,少海再见"}
		return{"男人_店小二","杜少海",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 25 then
		local xx={}
		if 皇宫飞贼.开关 then
			wb[1] = "皇宫之内，禁卫森严！竟然有人敢来皇宫盗宝，这群飞贼必然来头不小。我们禁卫军跟他们一场恶战，也伤了他们几个贼头，可惜我们以保护唐王为第一要务，这才让他们趁乱逃跑，少侠可愿意帮助我抓这些飞贼归案？"
			xx = {"真是无法无天！我这就去帮你把他们抓回来","我打算去抓住这次活动的幕后黑手！","我来取消任务","路过！"}
		else
			wb[1]="皇宫飞贼活动在每日中午12-14点才开放。"
		end
		return{"护卫","御林军左统领",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 26 then
			local xx={}
			wb[1]="皇城重地、天子脚下，我劝你为人要善良些。"
			local xx={"我要开启秘境降妖副本","领取长安战报","我什么都不想做"}
			if 玩家数据[数字id].角色:取任务(90)~=0 then
			wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
			xx={"请送我进去","我等会再进去"}
		    end
		return{"护卫","御林军右统领",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 27 then
			wb[1] = "少侠，我这里可是有些稀罕玩意，不知道你是否愿意出高价购买呢？"
			local xx = {"购买","我没钱"}
			return{"珍品商人","长安珍品商人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 28 then
			wb[1] = "我收购一切装备，直接给我就可以估价了。"
			local xx = {"出售","我什么都不想做"}
			return{"男人_苦力","装备收购商",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 30 then
			wb[1] = "正是举国科举期间，今年考生众多，一时忙不过来了，想请少侠帮助一二，少侠是否愿意？"
			  local xx = {"正闲着呢，请吩咐！","我就是来找你聊聊","取消任务"}--,"我找回了被盗考卷","我想了解本次活动","我来使用积分"
			return{"考官2","礼部侍郎嚄",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 31 then
		wb[1] = "各位观众看过来，老夫擅长土木之术，制造的仓库坚固耐用又便宜，为促销现在可赠送你一个免费物品仓库，还可以租借召唤兽仓库，用过觉得好再来光顾老夫，多租借几个吧。"
		local xx={"我要进行仓库操作","离开"}
		return {"仓库保管员","仓库管理员",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 32 then
		wb[1] = "我乃雁塔地宫的看门守卫，少侠可愿进去一探究竟？"
--		local xx={"送我进去（队伍最深层数）","了解地宫规则","地宫近况","查看图鉴","我再想想"}--,"我要去指定层数"
        local xx={"送我进去（队伍最深层数）","了解地宫规则","我再想想"}
		return {"男人_马副将","雁塔地宫守卫",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 33 then
			wb[1] = "人间昌隆，玉帝闻此甚是欣慰，故派十二元辰分影降临人间，并命我前往此处，召集各方侠士前往挑战十二元辰之分影。"
			  local xx = {"我欲前往收服十二元辰","此行甚是疲惫，我想取消任务","路过"}
			return{"天兵","游奕灵官",wb[取随机数(1,#wb)],xx}
	elseif 编号==34 then-->=34 and 编号<=40 then
		wb[1]="我是“#G超级大熊猫使者”".."#W，如果您是游戏活动中中奖的玩家，可以通过我进入神兽乐园寻找对应的神兽领取奖励！欢迎你常来乐园中，与我们的伙伴们一同玩耍！"
		local xx = {"我想进入神兽乐园","我是专程来和神兽进行一次零距离沟通的"}--,"我想兑换随机神兽"
		return{"超级大熊猫","超级大熊猫",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 35 then
		if 玩家数据[数字id].角色:取任务(1163)~=0 and 任务数据[玩家数据[数字id].角色:取任务(1163)].分类==3 and 任务数据[玩家数据[数字id].角色:取任务(1163)].子类==2 then
				文韵墨香:完成文墨护送(数字id)
				wb[1] = "多谢少侠护送。"
			return{"宝象国国王","西域使者",wb[取随机数(1,#wb)],xx}
		else
			 wb[1] = "长安城真是繁华呀！"
			return{"宝象国国王","西域使者",wb[取随机数(1,#wb)],xx}
		end
	elseif 编号 == 58 then
		wb[1] = "坐轿子回家吧，即快速又舒适每次收取费用#R/500#W/两。"
		local xx = {"马上送我回家","我要拜访别人的家","我只是来看看你的轿子，别那么紧张"}
		return{"男人_兰虎","轿夫",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 59 then
			wb[1] = "需要建造房子在我这里购买，取费用#R/5000000#W/两。"
			local xx = {"我想进行房屋相关事宜","我只是来看看你"}
		return{"男人_衙役","建房史",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 60 then
			 wb[1] = "装备需要通过开运增加开运孔数才能进行符石镶嵌,而点化此乃上古秘传道术贫道近期正修炼此法,你有兴趣的话可以来试试。你可考虑清楚,分到虽习得此法,但道行修行尚浅,且需运筹乾坤,难免开运失败。"
						local xx = {"我来给装备开运","点化装备星位","我来合成符石","我什么都不想做"}
		return{"男人_道童","符石道人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 61 then
		wb[1] = "我这里有一些奇珍异宝，你要买吗？"
		local xx = {"购买","我点错了"}
		return{"仓库保管员","贾有才",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 62 then
		wb[1] = "我这里有一些奇珍异宝，你要买吗？"
		local xx = {"购买","我点错了"}
		return{"仓库保管员","贾有道",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 63 then
		wb[1] = "我这里有一些奇珍异宝，你要买吗？"
		local xx = {"购买","我点错了"}
		return{"仓库保管员","贾有德",wb[取随机数(1,#wb)],xx}
	 elseif 编号 == 67 then
		wb[1] = "这里每个周会举办两次帮派比武大赛，#R副帮主#W以上可以为自己的帮派报名参赛，报名费用最高的2个帮派将获得参赛资格。最终获胜的参赛帮派成员将获得大量的修炼经验和物品奖励。#R未报名的帮派或无帮派成员，可以选择单人报名，报名后会随机分配在这2个帮派中"
		xx = {"我要报名参赛（帮派）","我要报名参赛（个人或队伍）","送我去比赛场地--送到赛场","","","我来领取帮战奖励","查看对战表","我只是来看看"}
		return{"男人_将军","帮派竞赛主持人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 74 then
		wb[1] = "我就是所有帮派的总管，你找我有什么事吗？"
		local xx = {"我要回到自己帮派！","新建帮派","加入帮派","没事啦"}
		return{"男人_兰虎","帮派主管",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 75 then
		wb[1] = "我是负责#Y天下英雄大会#W的主持人，你找我有什么事呢？"
		local xx = {"我要参加天下英雄大会","我前来领取比赛奖励","查询英雄榜以及积分","打听天下英雄会消息","进入比赛会场","我没什么事"} --比武
		return{"男人_将军","比武大会主持人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 76 then
		wb[1] = "剑出龙吟，武动风雷！三界之中，谁是英豪！有什么我可以帮助你的吗？"
		local xx = {"我要参加剑会天下","了解剑会天下","查看单挑排行榜","查看团队排行榜","兑换奖励（单挑）","兑换奖励（团队）"}
		return{"蜃气妖","欧冶子之灵",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 84 then
		wb[1] = "千里姻缘一线牵,相遇相知结为连理，是天上神仙也羡慕的事情"
		local xx = {"我们想结为夫妻，此生不弃","我们姻缘已定，愿好聚好散","我来领取夫妻技能"}
		return{"男人_太上老君","月老",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 89 then
		wb[1] = "小龟赛跑每天中午12点开始12点30结束压中奖励丰厚，下注每注10W银两压中奖励返回双倍"
		local xx = {}
		if 小龟赛跑.开关==false  then
			wb[1]="当前不是活动时间。"
			xx={}
		else
		if   小龟赛跑.开始比赛 then
		wb[1]="比赛已开始无法下注"
		xx={}
		else
		xx = {"小龟村一郎5注","小龟蹦二郎5注","小龟驰三郎5注","","","小龟村一郎10注","小龟蹦二郎10注","小龟驰三郎10注","我点错了"}
		end
		end
		return{"男人_兰虎","驯兽艺人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 90 then
		wb[1] = "只有真正的英雄才能获得三足金乌的力量，所以，少侠，你就是我选中的人！"
		local xx = {"我要领取化圣任务","我要提升化圣境界（需战斗，胜利后消耗15亿经验）","我要沐浴金乌光芒","我来看看大英雄"}
		return{"进阶狂豹人形","后裔英魂",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 91 then
		wb[1] = "诞盛曲”以共盛举,同庆同乐。老夫奉命在此召集三界侠士同往庆曲,不知侠是否意参与?"
			local xx = {"我要睹军阵威仪","我要使用十一活动积分","我要查看积分"}
		return{"考官2","礼部尚书",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 92 then
		wb[1] = "中秋月明人尽望,天涯海角共此时。值此中秋佳节,小供喜不妨与本宮一同赏美景、促团圆方能不负佳节良宵"
		local xx = {"月影觅仙踪（奔月）","我要使用中秋积分","我要查看积分"}
		return{"女人_满天星","婵娟",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 103 then
		return{"男人_程咬金","威武大将军",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 106 then
		wb[1] = "三界所有的事我都知道，你要打听点什么消息？"
		local xx = {"跳过剧情任务","我只是路过随便看看"}
		return{"男人_诗中仙","三界包打听",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 108 then
		wb[1] = "金鼠捧金辞旧岁,福牛纳福开新章。祝少侠新的一年家团固,心想事成,万事如意！少侠想要倣点什么呢?"
		return{"进阶小仙灵","福禄童子",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 104 then
		wb[1] = "我是唐王任命专门负责处理副本冒险相关事宜的官员,这方面有什么业务直接我好了。"
		local xx = {"查看所有副本","我要拿物品奖励","我要拿经验奖励","我只是路过随便看看"}
		return{"考官2","副本官员",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 120 then
		wb[1] = "我这里有不少珍品出售不妨来看看"
		local xx = {"我想购买一些珍品","我只是路过随便看看"}
		return{"男人_财主","宝石商人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 131 then
		wb[1] = "老夫潜心修炼，悟得一通天之术，可助你将毕生所学保留，转投其他门派；也可使你重塑造型，改头换面！少侠有兴趣否？"
		-- xx = {"我要进行角色/门派转换","我想了解角色/门派转换设置","申请转换武器造型","申请转换装备造型","我什么都不想做"}
		xx = {"我要进行角色/门派转换","申请转换武器造型","申请转换装备造型","我什么都不想做", "我想合成器灵"}
		return {"男人_太上老君","袁守诚",wb[取随机数(1,#wb)],xx}

	elseif 编号 == 135 then
		wb[1] = "你瞅啥？"
		--local xx = {"关于斩妖活动","关于十八路妖王","告辞"}
		local xx = {"关于十八路妖王","告辞"}
		return {"至尊宝","斩妖使者",wb[1],xx}
	-------------------武神坛
	elseif 编号==138 then
		wb[1] = "在我这里可以进入武神坛，你想要进去吗？"
		local xx={"进入武神坛","查看挑战蚩尤排行榜","领取蚩尤排行榜奖励","积分兑换","我只是路过"}
	--	local xx={"进入武神坛","我只是路过"}
		return {"进阶觉醒涂山雪","武神之战",wb[取随机数(1,#wb)],xx}
-------------------
	elseif 编号 == 141 then
		wb[1] = "盛唐威名三界，令人神往不已。很高兴能来到长安，与少侠们一起庆祝嘉年华！"
		local xx = {"昆仑灵气汇仙境（挂机）","我只是路过随便看看"}
		return{"超级飞天","小飞天",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 142 then
		wb[1] = "这是一个#Y入门级#W木桩，用于习武之人练习。"
		local xx = {"与他切磋","我点错了"}
		return{"","木桩",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 142.1 then
		wb[1] = "这是一个#Y入门级#W木桩，用于习武之人练习。"
		local xx = {"与他切磋","我点错了"}
		return{"","木桩",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 143 then
		wb[1] = "本仙为地仙之祖的旧友，今云游到此，此乃侠士之幸。我手中正有混沌镜，你可通过该镜保存四套当前角色属性点分配方案，有需要更换的话，可以回来找我更换。"
		local xx = {"我想了解属性点更换","我要操作属性方案","我来进行属性点重置","云游是不是到处玩"}
		return{"符石道人","云游仙人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 144 then
		wb[1] = "命中代表一个人的身份和特征，没有什么特别的情况，是万不可随意更改的。如果你确实需要更改名字，也不是不行，只需要付出一点代价就行。你现在是否需要修改名称？"
		local xx = {"我要修改名字","我随便看看而已"}
		return {"考官2","戴胄",wb[1],xx}
	elseif 编号 == 145 then
			if 通天塔数据[数字id] == nil then
            	通天塔数据[数字id] = {名称 = 玩家数据[数字id].角色.名称,层数 = 0}
          	end
		wb[1] = "在我这边可以挑战爬塔，根据自己的实力层层往上每10层难度递增!每周可以重置1次哦，塔层数重置为层。少侠当前塔层数为：#Y第 #R"..通天塔数据[数字id].层数.." #Y层"
		xx = {"开始进塔","重置层数","我就是来看看"}
		    return{"小魔头","镇塔童子",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 146 then
		wb[1] = "采矿是个力气活，长期的劳动可使你体魄强壮，气血充沛"
            --xx={"查询采矿熟练度","上交采矿物品","购买矿产","兑换孩子"}
            xx={"查询采矿熟练度","上交采矿物品","购买矿产"}
		 	return{"男人_武器店老板","采矿大师",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 147 then
		wb[1]="超级魔兽要诀的力量强大而凶暴，贸然学习十分危险。".."#W我可以帮助少侠的召唤兽掌握这股强大的力量，但总要给我点好处才行。"
			local xx = {"可我还没有见过你的能力（购买赐福道具）","我的召唤兽需要你的赐福","超级技能都有哪些？","我想了解下赐福","我只是来找你玩的"}
			return{"超级神柚","超级神柚",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 148 then
		wb[1] = "我可以帮你一键回收背包中所有的特殊兽诀和超级兽诀；\n#G1本特殊兽诀可回收10个特殊兽诀碎片；\n#G1本超级兽诀可回收20个超级兽诀碎片；\n#W想好就点我一键回收吧！"
		local xx = {"回收背包兽诀","告辞"} --选项
		return {"男人_太上老君","兽诀回收",wb[1],xx}
	-----------------------------麻瓜剑会
     elseif 编号 == 149 then
    wb[1] = " 请选择你要进行的操作："
    xx={"领取宠物修炼任务","跳过宠物修炼任务","取消宠物修炼任务","领取人物修炼任务","跳过人物修炼任务","取消人物修炼任务","我只是路过"}
    return {"男人_道士","马真人",wb[sj(1,#wb)],xx}

        elseif 编号 == 180 then
		wb[1] = "剑出龙吟，武动风雷！三界之中，谁是英豪！有什么我可以帮助你的吗？"
		local xx = {"我要参加剑会天下","查看排行榜","积分兑换"} --麻瓜剑会3.7
		return{"男人_道士","华山接引人",wb[取随机数(1,#wb)],xx}
	-----------------------------
	elseif 编号 == 181 then
		wb[1] = "活动太多理不清？老夫前来助你。"
		local xx = {"门派闯关","游泳活动","科举","文韵墨香","彩虹争霸","降妖伏魔","帮派迷宫","天降辰星","长安保卫战","帮战","镖王活动","剑会天下（单挑模式）","剑会天下（团队模式）"} --麻瓜剑会3.7
		return{"自在天魔刀","梦幻百科",wb[取随机数(1,#wb)],xx}
	-----------------------------
        elseif 编号 == 2 then
		local 原所在地图=1501
		local 原地图编号= 1
		return __NPCdh111[原所在地图](原所在地图,原地图编号,页数,已经在任务中,数字id)
	elseif 编号 == 191 then
		wb[1] = "少侠，你确定要前往进去吗？"
         	local xx = {"送我进去","我点错了"}
         	return{"巫师","修业指导师",wb[取随机数(1,#wb)],xx}


	end
	return
end

__NPCdh222[1001]=function(id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]

	if 名称=="修业指导师" then
		if 事件=="送我进去" then
			地图处理类:跳转地图(数字id,1343,110,58)
		end
	end

	if 名称=="梦幻百科" then
			if 事件=="门派闯关" then
				添加最后对话(数字id,事件.."#G开始时间：每日中午12点，时长：2小时")
			elseif 事件=="游泳活动" then
				添加最后对话(数字id,事件.."#G开始时间：全天，限3轮")
			elseif 事件=="科举" then
				添加最后对话(数字id,事件.."#G开始时间：全天，限2轮")
			elseif 事件=="文韵墨香" then
				添加最后对话(数字id,事件.."#G开始时间：每天下午14点，时长：1.5小时")
			elseif 事件=="彩虹争霸" then
				添加最后对话(数字id,事件.."#G开始时间：每天下午18点，时长：1小时#R须开始后的10分钟内报名入场！")
			elseif 事件=="降妖伏魔" then
				添加最后对话(数字id,事件.."#G开始时间：每天下午15:30，时长：1.5小时")
			elseif 事件=="帮派迷宫" then
				添加最后对话(数字id,事件.."#G开始时间：每天下午21:00，时长：1.5小时，可别忘点最后的宝箱哦")
			elseif 事件=="天降辰星" then
				添加最后对话(数字id,事件.."#G开始时间：每天下午17:00，时长：1小时")
			elseif 事件=="长安保卫战" then---未完善
				添加最后对话(数字id,事件.."#G开始时间：每天下午17:30，时长：2小时")
			elseif 事件=="帮战" then
				添加最后对话(数字id,事件.."#G开始时间：每天下午22:00，时长：1.5小时")
			elseif 事件=="镖王活动" then
				添加最后对话(数字id,事件.."#G开始时间：全天，限2轮")
			elseif 事件=="剑会天下（单挑模式）" then
				添加最后对话(数字id,事件.."与团队模式同时开启，自由选择#G开始时间：每天下午20:00，时长：1小时")
			elseif 事件=="剑会天下（团队模式）" then
				添加最后对话(数字id,事件.."与单挑模式同时开启，自由选择#G开始时间：每天下午20:00，时长：1小时")

			end
	end



	if 名称=="罗道人" then
			if 事件=="购买" then
				玩家数据[数字id].商品列表=商店处理类.商品列表[6]
				发送数据(id,9,{商品=商店处理类.商品列表[6],银子=玩家数据[数字id].角色.银子})
			end
	elseif 名称=="长安珍品商人" and 玩家数据[数字id].最后对话.编号==27 then
			if 事件=="购买" then
				玩家数据[数字id].商品列表=商店处理类.商品列表[21]
				发送数据(id,9,{商品=商店处理类.商品列表[21],银子=玩家数据[数字id].角色.银子})
			end
	elseif 名称=="染色师" then
			if 事件=="我想为人物染色" then
				发送数据(id,29)
			end
	elseif 名称=="斩妖使者" then	
			if 事件=="关于十八路妖王" then
			添加最后对话(数字id,"西游路上总会遇到一些魑魅魍魉,需要大能力，大智慧的人,才能斩杀妖王！！！",{"黄风怪","白骨精","狮猁怪","眼魔君","蝎子精","红孩儿","六耳猕猴","玉兔精","独角兕大王","混世魔王","黑风怪","九尾狐狸","妖王之主","我再逛逛"})
	elseif 事件 =="黄风怪" or 事件 =="白骨精" or 事件 =="狮猁怪" or 事件 =="眼魔君" or 事件 =="蝎子精" or 事件 =="红孩儿" or 事件 =="六耳猕猴" or 事件 =="玉兔精" or 事件 =="独角兕大王" or 事件 =="混世魔王" or 事件 =="黑风怪" or 事件 =="九尾狐狸" or 事件 =="妖王之主" then
			 if 玩家数据[数字id].角色.十八路妖王[事件] == nil then
			 	  添加最后对话(数字id,"少侠还未打通该界面传送,需要开通的话请继续点击此选项",{事件,"我再逛逛"})
			 	  玩家数据[数字id].最后操作 = "打通十八路妖王"
			 elseif 玩家数据[数字id].角色.十八路妖王[事件] then
			 	  地图处理类:跳转地图(数字id,取十二地图(事件),43,20)
			 	  -- 十八妖王:十八路妖王()
			 end
			end
elseif 名称=="马真人" then
        if 事件=="领取宠物修炼任务" then
          if 玩家数据[数字id].角色:取任务(13)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            添加最后对话(数字id,"领取宠物修炼任务需要花费50万两银子，并且人物等级必须>=60级方可领取。",{"我要领取宠物修炼任务","我再考虑考虑"})
            return
          end
        elseif 事件=="我要领取宠物修炼任务" then
          if 玩家数据[数字id].角色:取任务(13)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            设置任务13(数字id)
          end
        elseif 事件=="跳过宠物修炼任务" then
          添加最后对话(数字id,"前90次任务均可以在我这里选择跳过本环任务，直接进入下一环任务。但将无法获得修炼经验奖励，且需要扣除50万两银子，只有当前任务积分≥50点时才可使用跳过功能，你需要我帮你跳过本轮任务吗？",{"请帮我跳过本环任务","我再考虑考虑"})
          return
        elseif 事件=="请帮我跳过本环任务" then
          if 玩家数据[数字id].角色:取任务(13)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(13)
            if 玩家数据[数字id].角色.银子<500000 then
              添加最后对话(数字id,"你没有那么多的银子")
              return
            elseif 任务数据[任务id].次数>=100 then
              添加最后对话(数字id,"我这里只能跳过前90环任务。")
              return
            else
              任务数据[任务id].次数=任务数据[任务id].次数+1
              if 玩家数据[数字id].角色:扣除银子(500000,0,0,"跳过宠物修炼任务",1)== false then 常规提示(数字id,"你的银两不足") return end
              local 任务id=玩家数据[数字id].角色:取任务(13)
              完成任务_13(数字id,任务id)
              return
            end
          end
        elseif 事件=="取消宠物修炼任务" then
          if 玩家数据[数字id].角色:取任务(13)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(13)
            玩家数据[数字id].角色:取消任务(任务id)
            任务数据[任务id]=nil
            添加最后对话(数字id,"已帮你取消了宠物修炼任务。")
            return
          end
        end
        if 事件=="领取人物修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            添加最后对话(数字id,"领取人物修炼任务需要花费00万两银子，并且人物等级必须>=60级方可领取。",{"我要领取人物修炼任务","我再考虑考虑"})
            return
          end
        elseif 事件=="我要领取人物修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)~=0 then
            添加最后对话(数字id,"请先完成之前领取的任务。")
            return
          else
            设置任务501(数字id)
          end
        elseif 事件=="跳过人物修炼任务" then
          添加最后对话(数字id,"前90次任务均可以在我这里选择跳过本环任务，直接进入下一环任务。但将无法获得修炼经验奖励，且需要扣除50万两银子，只有当前任务积分≥1点时才可使用跳过功能，你需要我帮你跳过本轮任务吗？",{"请帮我跳过本环修炼任务","我再考虑考虑"})
          return
        elseif 事件=="请帮我跳过本环修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(501)
            if 玩家数据[数字id].角色.银子<500000 then
              添加最后对话(数字id,"你没有那么多的银子")
              return
            elseif 任务数据[任务id].次数>=100 then
              添加最后对话(数字id,"我这里只能跳过前90环任务。")
              return
            else
              任务数据[任务id].次数=任务数据[任务id].次数+1
              if 玩家数据[数字id].角色:扣除银子(500000,0,0,"跳过人物修炼任务",1)== false then 常规提示(数字id,"你的银两不足") return end
              local 任务id=玩家数据[数字id].角色:取任务(501)
              完成任务_501(数字id,任务id)
              -- 添加最后对话(数字id,"你消耗了5点任务积分和10万两银子跳过了本环任务。")
              return
            end
          end
        elseif 事件=="取消人物修炼任务" then
          if 玩家数据[数字id].角色:取任务(501)==0 then
            添加最后对话(数字id,"你有在我这里领取过任务吗？")
            return
          else
            local 任务id=玩家数据[数字id].角色:取任务(501)
            玩家数据[数字id].角色:取消任务(任务id)
            任务数据[任务id]=nil
            添加最后对话(数字id,"已帮你取消了宠物修炼任务。")
            return
          end
        end
	elseif 名称=="五行大师" then
			if 事件=="请帮我点化装备" or 事件=="继续点化" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="点化装备"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="五行大师",类型="NPC",等级="无"})
			elseif 事件=="更改法宝五行" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="更改法宝五行"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要法宝2(数字id,0),名称="金童子",类型="法宝",等级="无"})
			elseif 事件=="更改法宝材料五行" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="更改法宝材料五行"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="五行大师",类型="NPC",等级="无"})
			elseif 事件=="更改装备五行" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="更改装备五行"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="五行大师",类型="NPC",等级="无"})
			elseif 事件=="更改召唤兽五行" then
				添加最后对话(数字id,"请选择五行类型",{"金（更改召唤兽五行）","木（更改召唤兽五行）","水（更改召唤兽五行）","火（更改召唤兽五行）","土（更改召唤兽五行）"})
			elseif 事件== "金（更改召唤兽五行）" then
			    local 编号=玩家数据[数字id].角色:取参战宝宝编号()
			    if 编号~=0 then
			    	if 玩家数据[数字id].召唤兽:是否有装备(编号) then
						常规提示(数字id,"请先卸下召唤兽所穿戴的装备")
						return
					elseif 玩家数据[数字id].召唤兽.数据[编号].统御 ~= nil then
						常规提示(数字id,"该召唤兽处于统御状态，请解除统御后再进行此操作")
						return
					end
					玩家数据[数字id].召唤兽:重置五行("金",编号)
				else
				    常规提示(数字id,"请将要更改五行的召唤兽参战")
			    end
			elseif 事件== "木（更改召唤兽五行）" then
				local 编号=玩家数据[数字id].角色:取参战宝宝编号()
			    if 编号~=0 then
			    	if 玩家数据[数字id].召唤兽:是否有装备(编号) then
						常规提示(数字id,"请先卸下召唤兽所穿戴的装备")
						return
					elseif 玩家数据[数字id].召唤兽.数据[编号].统御 ~= nil then
						常规提示(数字id,"该召唤兽处于统御状态，请解除统御后再进行此操作")
						return
					end
					玩家数据[数字id].召唤兽:重置五行("木",编号)
				else
				    常规提示(数字id,"请将要更改五行的召唤兽参战")
			    end
			elseif 事件== "水（更改召唤兽五行）" then
				local 编号=玩家数据[数字id].角色:取参战宝宝编号()
			    if 编号~=0 then
			    	if 玩家数据[数字id].召唤兽:是否有装备(编号) then
						常规提示(数字id,"请先卸下召唤兽所穿戴的装备")
						return
					elseif 玩家数据[数字id].召唤兽.数据[编号].统御 ~= nil then
						常规提示(数字id,"该召唤兽处于统御状态，请解除统御后再进行此操作")
						return
					end
					玩家数据[数字id].召唤兽:重置五行("水",编号)
				else
				    常规提示(数字id,"请将要更改五行的召唤兽参战")
			    end
			elseif 事件== "火（更改召唤兽五行）" then
				local 编号=玩家数据[数字id].角色:取参战宝宝编号()
			    if 编号~=0 then
			    	if 玩家数据[数字id].召唤兽:是否有装备(编号) then
						常规提示(数字id,"请先卸下召唤兽所穿戴的装备")
						return
					elseif 玩家数据[数字id].召唤兽.数据[编号].统御 ~= nil then
						常规提示(数字id,"该召唤兽处于统御状态，请解除统御后再进行此操作")
						return
					end
					玩家数据[数字id].召唤兽:重置五行("火",编号)
				else
				    常规提示(数字id,"请将要更改五行的召唤兽参战")
			    end
			elseif 事件== "土（更改召唤兽五行）" then
				local 编号=玩家数据[数字id].角色:取参战宝宝编号()
			    if 编号~=0 then
			    	if 玩家数据[数字id].召唤兽:是否有装备(编号) then
						常规提示(数字id,"请先卸下召唤兽所穿戴的装备")
						return
					elseif 玩家数据[数字id].召唤兽.数据[编号].统御 ~= nil then
						常规提示(数字id,"该召唤兽处于统御状态，请解除统御后再进行此操作")
						return
					end
					玩家数据[数字id].召唤兽:重置五行("土",编号)
				else
				    常规提示(数字id,"请将要更改五行的召唤兽参战")
			    end
			end
	elseif 名称=="兰虎" then
			if 事件=="我要学习调息" then
				玩家数据[数字id].角色:学习剧情技能(数字id,"调息",3,5)
			end
	elseif 名称=="商会总管" then
			if 事件=="系统商店" then
				添加最后对话(数字id,"请选择道具类型",{"环装类","其他类"})
			elseif 事件=="其他类" then
				师门商店类:取系统商会数据(数字id,"打开商店")
			elseif 事件=="环装类" then
				师门商店类:取系统商会数据(数字id,"打开环装")
			else
				 添加最后对话(数字id,"商会系统正在搭建中……")
			end
	elseif 名称=="门派闯关使者" then
			if 事件=="准备好了，请告诉我们第一关的挑战地点" then
				门派闯关:对话事件处理(数字id,名称,事件)
			end
	elseif 名称=="驿站老板" then
			if 事件=="是的我要去" then
				地图处理类:跳转地图(数字id,1110,82,87)
			end
	elseif 名称=="帮派竞赛主持人" then
			 帮派PK:NPC对话事件处理(数字id,名称,事件)
	elseif 名称=="李将军" then
			if 事件=="我来帮你" then
			elseif 事件=="领取俸禄" then
				添加最后对话(数字id,format("你当前共有#Y%s#W点官职贡献度，每点官职贡献度可以兑换俸禄2000两银子。你当前一共可兑换#R%s#W两银子俸禄。只有官职贡献度达到10点及以上才可领取俸禄。每日只可以领取1次俸禄，每次领取俸禄后都将消耗当前%s的官职贡献度。请却是否要领取俸禄。",玩家数据[数字id].角色.官职点,玩家数据[数字id].角色.官职点*2000,"10%"),{"确认领取俸禄","我再想想"})
			elseif 事件=="确认领取俸禄" then
				if 玩家数据[数字id].角色.官职点<10 then
					添加最后对话(数字id,"你的官职贡献度没有达到10点，无法领取俸禄")
					return
				elseif 取年月日()==玩家数据[数字id].角色.俸禄时间 then
					添加最后对话(数字id,"你本日已经领取过俸禄了，请明日再来吧")
					return
				else
					local 银子=玩家数据[数字id].角色.官职点*2000
					玩家数据[数字id].角色:添加银子(银子,"官职领取俸禄",1)
					玩家数据[数字id].角色.官职点=qz(玩家数据[数字id].角色.官职点*0.9)
					添加最后对话(数字id,"领取俸禄成功，本次领取俸禄后你的官职贡献度为：#R/"..玩家数据[数字id].角色.官职点)
					玩家数据[数字id].角色.俸禄时间=取年月日()
				end
			elseif 事件=="取消任务" then
				if 玩家数据[数字id].角色:取任务(110)==0 then
					常规提示(数字id,"#Y/你还没有领取过官职任务")
				else
					local 任务id = 玩家数据[数字id].角色:取任务(110)
					if 任务数据[任务id].分类==1 then
						地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
					end
					玩家数据[数字id].角色:取消任务(任务id)
					任务数据[任务id]=nil
					常规提示(数字id,"#Y/你取消了官职任务，十分钟内无法再次领取官职任务，同时你的官职任务次数也被清空了")
					玩家数据[数字id].角色.官职数据.次数=0
					玩家数据[数字id].角色.官职数据.间隔=os.time()
				end
			end
	elseif 名称=="圣山传送人" then
			if 事件=="是的我要去" then
				地图处理类:跳转地图(数字id,1205,120,97)
			end
	elseif 名称=="皇宫护卫" then
			if 事件=="上交心魔宝珠" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="上交心魔宝珠"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="皇宫护卫",类型="NPC",等级="无"})
			end
	elseif 名称=="老花农" then
			if 事件=="正好有给你" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="上交暑假道具"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="老花农",类型="NPC",等级="无"})
			end
	elseif 名称=="礼部侍郎" then
			if 事件=="我要参加科举" then
				if 科举.开关 then
					游戏活动类:科举条件检测(id,数字id)
				else
					添加最后对话(数字id,"现在还不是活动时间")
				end
			end
	elseif 名称=="礼部侍郎嚄" then
			文韵墨香:对话事件处理(数字id,名称,事件)
			return
	elseif 名称=="超级神柚" then
			if 事件=="可我还没有见过你的能力（购买赐福道具）" then
			玩家数据[数字id].商品列表=商店处理类.商品列表[32]
			发送数据(id,9,{商品=商店处理类.商品列表[32],银子=玩家数据[数字id].角色.银子,MRSPXZ=table.copy(MRSPXZ)})
			 elseif 事件=="我的召唤兽需要你的赐福" then
	   		 	发送数据(连接id,16,玩家数据[数字id].召唤兽.数据)
	    		发送数据(玩家数据[数字id].连接id,352,{道具=玩家数据[数字id].道具:索要道具1(数字id),丸子赐福={进程=1,技能={},认证码=0}})

			elseif 事件=="超级技能都有哪些？" then
			添加最后对话(数字id,"少侠超级技能的魔兽要诀共有43种，其中38本是被动超级技能，5本是主动技能。具体介绍请打开召唤兽资质栏鼠标指定高级魔兽要诀按ALT即可显示详情。")

			elseif 事件=="我想了解下赐福" then
				发送数据(连接id,3513,玩家数据[数字id].道具:索要道具2(数字id))
                		发送数据(玩家数据[数字id].连接id,350,玩家数据[数字id].道具:索要道具1(数字id))
			elseif 事件=="我只是来找你玩的" then

			end
	elseif 名称=="兽诀回收" then
		if 事件=="回收背包兽诀" then
			for kn,vn in pairs(玩家数据[数字id].角色.道具) do
				if 玩家数据[数字id].道具.数据[vn]~=nil then
					if 玩家数据[数字id].道具.数据[vn].名称=="特殊魔兽要诀" then
						玩家数据[数字id].角色.道具[kn] = nil
						玩家数据[数字id].道具.数据[vn] = nil
						玩家数据[数字id].道具:给予道具(数字id,"特殊兽诀·碎片",10)
					elseif 玩家数据[数字id].道具.数据[vn].名称=="超级魔兽要诀" then
						玩家数据[数字id].角色.道具[kn] = nil
						玩家数据[数字id].道具.数据[vn] = nil
						玩家数据[数字id].道具:给予道具(数字id,"超级兽诀·碎片",20)
					end
				end
			end
			道具刷新(数字id)
                        -- 常规提示(数字id,"回收成功")
		end
	elseif 名称=="陈员外" then
		if 事件=="文韵墨香" then
			文韵墨香:陈员外对话(数字id)
			return
		elseif 事件=="我帮你带来了驱邪扇芝" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="我帮你带来了驱邪扇芝"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
		end
	elseif 名称=="张老财" then
		if 事件=="我帮你带来了驱邪扇芝" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="我帮你带来了驱邪扇芝"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
		end
	elseif 名称=="刘副将" then
		if 事件=="我帮你带来了驱邪扇芝" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="我帮你带来了驱邪扇芝"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
		end
	elseif 名称=="游奕灵官" then
			天降辰星:对话事件处理(数字id,名称,事件)
			return
	elseif 名称=="御林军" then
			if 事件=="领取一小时精修时间" then --领取一小时精修时间
				设置任务3(1,1,数字id)
			end
	elseif 名称=="袁天罡" then
		if 事件=="关于人物洗点" then
			if 玩家数据[数字id].角色.洗点次数==0 or 玩家数据[数字id].角色.武神坛角色 then
				local 对话="你当前拥有1次免费重置人物属性点的机会，请先卸下人物装备、灵饰。请确认是否需要重置人物属性点？"
				local xx={"重置人物属性点","什么也不做"}
				发送数据(玩家数据[数字id].连接id,1501,{名称="袁天罡",模型="袁天罡",对话=对话,选项=xx})
			elseif not 玩家数据[数字id].角色.强制洗点 then
				local 对话="你当前拥有1次免费重置人物属性点的机会，请先卸下人物装备、灵饰。请确认是否需要重置人物属性点？"
				local xx={"重置人物属性点","什么也不做"}
				发送数据(玩家数据[数字id].连接id,1501,{名称="袁天罡",模型="袁天罡",对话=对话,选项=xx})
			else
				local 对话="你的免费重置人物属性点的机会已经用完了。现在需要消耗#R"..(玩家数据[数字id].角色.洗点次数*1000000).."#W两银子才可重置人物属性点，请先卸下人物装备、灵饰。请确认是否需要重置人物属性点？"
				local xx={"重置人物属性点","什么也不做"}
				发送数据(玩家数据[数字id].连接id,1501,{名称="袁天罡",模型="袁天罡",对话=对话,选项=xx})
			end
		elseif 事件=="重置人物属性点" then
			玩家数据[数字id].角色:洗点操作(数字id)
		elseif 事件=="关于剧情技能" then
			local 对话="需要消耗#R1000000#W两银子来让我为你重置剧情技能吗？重置剧情技能会返还你所有剧情点，但会清空当前所学习的所有剧情技能。"
			local xx={"重置剧情技能点","什么也不做"}
			发送数据(玩家数据[数字id].连接id,1501,{名称="袁天罡",模型="袁天罡",对话=对话,选项=xx})
		elseif 事件=="重置剧情技能点" then
			if 玩家数据[数字id].角色:扣除银子(1000000,0,0,"重置剧情",1) then
				玩家数据[数字id].角色.剧情技能 = {}
				玩家数据[数字id].角色.剧情点.当前=玩家数据[数字id].角色.剧情点.总额
				添加最后对话(数字id,"已为你重置成功，你的剧情技能被重置了")
			end
		elseif 事件=="“神兜兜”相关" then
			添加最后对话(数字id,"神兜兜增加成长0.05，需要消耗199神兜兜，请将需要增加成长的宝宝参战，最高成长不超过1.35",{"我要兑换神兽","神兜兜增加成长","我要给宝宝打书","我要抽取特殊魔兽要诀","我愿献上神兽换取“神兜兜”"})
		-- elseif 事件=="听说你有传说中的五行神兽" then
		-- 	添加最后对话(数字id,"不错，不错，少侠果然消息灵通。凝聚天地精华，汇聚五行之力--若是哪位有缘人能交给老夫999999个神兜兜，便能召唤传说中的五行神兽",{"我要召唤“超级鲲鹏”","养不起，告辞"})
		-- elseif 事件=="我要召唤“超级鲲鹏”" then
		-- 	添加最后对话(数字id,"超级鲲鹏暂未开放")
		elseif 事件=="神兜兜增加成长" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="神兜兜增加成长"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="袁天罡",类型="NPC",等级="无"})
		elseif 事件=="我要兑换神兽" then
			添加最后对话(数字id,"您确定用99个“神兜兜”兑换一只神兽吗？特别提醒：该方法兑换的神兽为随机造型！",{"我要马上兑换","我还有“灵兜兜”，我要兑换生肖神兽。"--[[,"我还有“灵兜兜”，我要兑换指定神兽。"]]})
		elseif 事件=="我要给宝宝打书" then
			local 编号=玩家数据[数字id].角色:取参战宝宝编号()
				if 编号~=0 then
					-- if RpbARGB.序列==3 then
					-- 	if 玩家数据[数字id].召唤兽.数据[编号].种类~="神兽" then
					-- 		添加最后对话(数字id,"请先将需要打书的#Y神兽#W参战！非神兽不能进行此操作。")
					-- 		return
					-- 	end
					-- end
					if 玩家数据[数字id].召唤兽.数据[编号].打书次数==nil then
						 玩家数据[数字id].召唤兽.数据[编号].打书次数=0
					end

					-- local num=(玩家数据[数字id].召唤兽.数据[编号].打书次数+1)*10
					local num=99
					local xianzhi=24
					-- if 玩家数据[数字id].召唤兽.数据[编号].种类~="神兽" then
					-- 	-- num=(玩家数据[数字id].召唤兽.数据[编号].打书次数+1)*20
					-- 	num=159
					-- 	if RpbARGB.序列==2 then
					-- 	   xianzhi=24
					--     end
					-- end
					local xx={"我要替换宝宝技能","我要增加宝宝技能格子"}
					--local xx={"我要增加宝宝技能格子"}
					if #玩家数据[数字id].召唤兽.数据[编号].技能>=xianzhi then
				        local xx={"我要替换宝宝技能"}
					end
					 添加最后对话(数字id,"给#G"..玩家数据[数字id].召唤兽.数据[编号].名称.."#W替换技能或增加格子需要消耗#R"..num.."#W个“神兜兜”，且需要一本#R非低级、超级#W的“魔兽要诀”；\n（神兽消耗99个“神兜兜”，宝宝消耗159个“神兜兜”）",xx)
					 --添加最后对话(数字id,"给#G"..玩家数据[数字id].召唤兽.数据[编号].名称.."#W增加格子需要消耗#Y"..num.."#W个“神兜兜”，且需要一本附加技能的“兽诀”。（神兽打书消耗次数*10个“神兜兜”，宝宝消耗打书次数*20个“神兜兜”）",xx)
				else
					 添加最后对话(数字id,"请先将需要打书的宝宝参战！")
				end
		elseif 事件=="我要增加宝宝技能格子" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="增加神兽技能格子"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="袁天罡",类型="NPC",等级="无"})
		elseif 事件=="我要替换宝宝技能" then
		 	local 编号=玩家数据[数字id].角色:取参战宝宝编号()
		 		if 编号~=0 then
		 			if 玩家数据[数字id].召唤兽.数据[编号].打书次数==nil then
		 				 玩家数据[数字id].召唤兽.数据[编号].打书次数=0
		 			end
		 			-- local num=(玩家数据[数字id].召唤兽.数据[编号].打书次数+1)*10
		 			local num=99

		 			-- if 玩家数据[数字id].召唤兽.数据[编号].种类~="神兽" then
		 			-- 	num=(玩家数据[数字id].召唤兽.数据[编号].打书次数+1)*20
		 			-- end
		 			local xx={}
		 			for i=1,#玩家数据[数字id].召唤兽.数据[编号].技能 do
		 				if 玩家数据[数字id].召唤兽.数据[编号].法术认证 ~= 玩家数据[数字id].召唤兽.数据[编号].技能[i] then
		 					 xx[#xx+1]=玩家数据[数字id].召唤兽.数据[编号].技能[i]
		 				end
		 			end
		 			 添加最后对话(数字id,"本次给#G"..玩家数据[数字id].召唤兽.数据[编号].名称.."#W宝宝打书需要消耗#Y"..num.."#W个“神兜兜”，且需要消耗一本您将要附加的“魔兽要诀”(#R不含低、超级兽诀#W)。请选择你要替换的技能名称：",xx)
		 		else
		 			添加最后对话(数字id,"请先将需要打书的宝宝参战！")
		 		end
		elseif 事件=="我要马上兑换" then
			if 玩家数据[数字id].角色:取新增宝宝数量() then
				if 玩家数据[数字id].道具:消耗背包道具(玩家数据[数字id].连接id,数字id,"神兜兜",99) then
					local sj={"物理型（单点爆伤）","法术型（秒伤）"}
					local mc=取随机普通神兽()
					local 链接 = {提示=format("#P%s#W成功集齐了99个神兜兜在袁天罡处换取了一只",玩家数据[数字id].角色.名称),频道="xt",结尾="#32"}
					玩家数据[数字id].召唤兽:添加神兽(mc,sj[取随机数(1,2)],nil,链接)
					添加最后对话(数字id,"恭喜少侠，您获得了一只#Y"..mc.."#W！")
				else
					常规提示(数字id,"#Y/大侠还没有集齐“神兜兜”，不能兑换神兽哦")
				end
			end
		elseif 事件=="我还有“灵兜兜”，我要兑换生肖神兽。" then
			添加最后对话(数字id,"灵兜兜兑换指定神兽请在长安城天台下方（375，50）#Y【超级大熊猫】#W处进入“神兽乐园”兑换。")
		elseif 事件=="我愿献上神兽换取“神兜兜”" then
			local 对话="请选择要献上的神兽："
			local 选项=取符合献上神兽选项(数字id)
			添加最后对话(数字id,对话,选项)
			玩家数据[数字id].最后操作="献上神兽"
		elseif 玩家数据[数字id].最后操作=="献上神兽" then
			判断献上神兽选项(数字id,事件)
			玩家数据[数字id].最后操作=nil
			return true
		elseif 事件=="我要抽取特殊魔兽要诀" then
			local num=198
			if RpbARGB.序列==3 then
				num=99
			end
			添加最后对话(数字id,"老夫近口正在妆集“神兜兜”，若少侠愿意给我"..num.."个“神兜兜”，我便将一本特殊的魔兽要诀交给你，注意每兑换五次即可免费获得一次自选机会！",{"看看能获得那些魔兽要诀","我准备好了，来换吧！","此事我还是不参与了……"})
		elseif 事件=="看看能获得那些魔兽要诀" then
			添加最后对话(数字id,"少侠可能获得的魔兽要诀共有15种，每种魔兽要诀获得概率完全一致，至于其他的就要看少侠运气了：苍鸾怒击，浮云神马，欣欣向荣，须弥真言，净台妙谛，出其不意，理直气壮，凝光炼彩，风起龙游，柳暗花明，气贯长虹，义薄云天，与生俱来，无上正真，八凶法阵")
		elseif 事件=="我准备好了，来换吧！" then
			if 玩家数据[数字id].角色.兑特兽诀==nil then 玩家数据[数字id].角色.兑特兽诀=0 end
			if 玩家数据[数字id].角色.兑特兽诀 >=5 then
				local ms =  {"苍鸾怒击","浮云神马","欣欣向荣","须弥真言","净台妙谛","出其不意","理直气壮","凝光炼彩","风起龙游","柳暗花明","气贯长虹","义薄云天","与生俱来","无上正真","八凶法阵"}
				local xuanxiang = {}
				for an=1,#ms do
					if ms[an]~=nil then
						local abc="我选" ..ms[an]
						table.insert(xuanxiang,abc)
					end
				end
				添加最后对话(数字id,"每兑换特殊要诀五次可以自选一本兽诀",xuanxiang)
				return
			end
			local num=198
			if RpbARGB.序列==3 then
				num=99
			end
			if 玩家数据[数字id].道具:消耗背包道具(玩家数据[数字id].连接id,数字id,"神兜兜",num) then
				玩家数据[数字id].角色.兑特兽诀 = 玩家数据[数字id].角色.兑特兽诀 + 1
				if RpbARGB.序列==3 then
					local 链接 = {提示=format("#R%s#W成功使用神兜兜在袁天罡处兑换了特殊魔兽要诀",玩家数据[数字id].角色.名称),频道="xt",结尾="，你狂任你狂，梦幻世界我为王。"}
					玩家数据[数字id].道具:给予超链接道具(数字id,"特殊魔兽要诀",nil,兑换特殊要诀(),链接)
				else
					玩家数据[数字id].道具:给予道具(数字id,"特殊魔兽要诀",nil,兑换特殊要诀())
				end
			else
				添加最后对话(数字id,"少侠神兜兜数量不够啊。(需要"..num.."个神兜兜)")
			end
		elseif 玩家数据[数字id].角色:取参战神兽技能(事件)~=nil then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="替换神兽技能",替换技能=事件}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="袁天罡",类型="NPC",等级="无"})
		else
			local ms =  {"苍鸾怒击","浮云神马","欣欣向荣","龙魂","须弥真言","净台妙谛","出其不意","理直气壮","凝光炼彩","风起龙游","柳暗花明","气贯长虹","义薄云天","与生俱来","无上正真","超级三昧真火"}
			for an=1,#ms do
				if ms[an]~=nil then
					local abc="我选" ..ms[an]
					if 事件==abc then
					    local ddd=string.gsub(abc,"我选","")
					    玩家数据[数字id].道具:给予道具(数字id,"特殊魔兽要诀",nil,ddd)
					    玩家数据[数字id].角色.兑特兽诀 = 0
					    break
	              end
                end
            end
        end
	elseif 名称=="马副将" then
			if 双倍数据[数字id]==nil then
				双倍数据[数字id]={可领=7,冻结=0,间隔=os.time()}
			end
			if 事件=="领取一小时" then
				设置任务2(1,1,数字id)
			elseif 事件=="领取两小时" then
				设置任务2(2,1,数字id)
			elseif 事件=="领取四小时" then
				设置任务2(4,1,数字id)
			elseif 事件=="冻结双倍时间" then
				local 任务id=玩家数据[数字id].角色:取任务(2)
				if 任务id==0 or 任务数据[任务id]==nil then
					发送数据(玩家数据[数字id].连接id,1501,{名称="马副将",模型="男人_马副将",对话="你似乎还没有在我这里领取过双倍时间。"})
				else
					双倍数据[数字id].冻结=取分(任务数据[任务id].结束-(os.time()-任务数据[任务id].起始))
					发送数据(玩家数据[数字id].连接id,1501,{名称="马副将",模型="男人_马副将",对话="已经帮你冻结了#R/"..双倍数据[数字id].冻结.."#W/分钟的双倍时间。记得在24点前来找我解冻，否则所冻结的双倍时间将被直接清空。"})
					玩家数据[数字id].角色:取消任务(玩家数据[数字id].角色:取任务(2))
					发送数据(玩家数据[数字id].连接id,39)
					双倍数据[数字id].间隔=os.time()
				end
		elseif 事件=="恢复双倍时间" then
				if 双倍数据[数字id].冻结==0 then
					发送数据(玩家数据[数字id].连接id,1501,{名称="马副将",模型="男人_马副将",对话="你似乎还没有在我这里冻结过双倍时间。"})
				else
					设置任务2(双倍数据[数字id].冻结,2,数字id)
					双倍数据[数字id].冻结=0
				end
			end
	elseif 名称=="杜少海" then
			if 事件=="告诉我要怎么做吧！" then
				设置任务11(数字id)
			elseif 事件=="我要取消任务" then
				if 玩家数据[数字id].角色:取任务(11)==0 then
					添加最后对话(数字id,"你有在我这里领取任务吗？")
				elseif 玩家数据[数字id].角色.江湖时间 and os.time()< 玩家数据[数字id].角色.杜少海数据.间隔 then
					添加最后对话(数字id,"你距离上次取消任务时间尚未达到十分钟，请稍后再来。")
				else
					玩家数据[数字id].角色.杜少海数据.间隔=os.time()+600
					玩家数据[数字id].角色:取消任务(玩家数据[数字id].角色:取任务(11))
					添加最后对话(数字id,"已经成功帮你取消了任务。")
				end
			end
	elseif 名称=="袁守诚" then
		if 事件=="我要进行角色/门派转换" then
			发送数据(玩家数据[数字id].连接id,243)
		elseif 事件=="申请转换武器造型" then
			local wb = "我很善良，乐于助人是我的天性！如果你进行了门派转换，我还可以收费500W帮你转换对应的武器造型，你要将武器转换为什么造型？"
			local xx = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","我什么都不想做"}
			添加最后对话(数字id,wb,xx)
		elseif 事件=="申请转换装备造型" then
			local wb = "我很善良，乐于助人是我的天性！如果你进行了门派转换，我还可以收费500W帮你转换对应的武器造型，你要将装备转换为什么造型？"
			xx={"头盔","发钗","女衣","男衣","什么也不做"}
			添加最后对话(数字id,wb,xx)
		elseif 事件=="头盔" or 事件=="发钗" or 事件=="女衣" or 事件=="男衣" then
			玩家数据[数字id].给予数据={类型=1,事件="转换装备",转换造型=事件}
			发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC"})
		--elseif 事件=="我想了解角色/门派转换设置" then
		elseif 武器表[事件] ~= nil then
			武器转换临时数据[数字id] = 事件
			玩家数据[数字id].给予数据={类型=1,事件="转换武器造型"}
			发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC"})
	    elseif  事件=="我想合成器灵" then
                   添加最后对话(数字id,"#G/合成同等级器灵可#R/自选一个部位，#G/合成更高级器灵#R/将随机给予一个部位(属性为第一个上交的物品)，#G/请选择你要操作的事。",{"合成同等级自选部位(三合一)","合成更高级随机部位(三合一)"})
                elseif  事件=="合成同等级自选部位(三合一)" then
                 添加最后对话(数字id,"#G/请选择需要指定的器灵部位。",{"武器","衣服","腰带","项链","鞋子","头盔"})
                 elseif   事件=="武器" or    事件=="衣服"  or    事件=="腰带"  or    事件=="项链"  or    事件=="鞋子"  or    事件=="头盔" then
                 玩家数据[数字id].器灵部位= 事件
                 玩家数据[数字id].给予数据 = {类型 = 1, id = 0, 事件 = "器灵指定部位"}
                 发送数据(id, 3530, {道具 = 玩家数据[数字id].道具:索要道具1(数字id), 名称 = "千年古树", 类型 = "NPC", 等级 = "无"})
                 elseif  事件=="合成更高级随机部位(三合一)" then
                 玩家数据[数字id].给予数据 = {类型 = 1, id = 0, 事件 = "器灵升级等级"}
                 发送数据(id, 3530, {道具 = 玩家数据[数字id].道具:索要道具1(数字id), 名称 = "千年古树", 类型 = "NPC", 等级 = "无"})
            end

	  elseif 名称=="雁塔地宫守卫" then
		    雁塔地宫:对话事件处理(数字id,名称,事件)
	 --    elseif 名称=="云游仙人" then
		-- if 事件=="我想了解属性点更换" then
		-- 	添加最后对话(数字id,"你想了解哪方面的情况呢？",{"属性点如何保存","属性点如何更换","需要注意的问题"})
		-- elseif 事件=="属性点如何保存" then
		-- 	添加最后对话(数字id,"可以在本仙这里花费50万两白银保存你当前角色的属性点分配方案在混沌镜中，镜中可以共保存四套属性点分配方案")
		-- elseif 事件=="属性点如何更换" then
		-- 	添加最后对话(数字id,"如你有需要，想更换当前的属性，可以更换成之前保存在混沌镜中的属性点分配方案，每次需要消耗50万两银子以及50点体力。")
		-- elseif 事件=="需要注意的问题" then
		-- 	添加最后对话(数字id,"若保存在混沌镜中的分配方案存在潜力就无法进行属性更换，需要在我这里分配好后才能进行更换，每点潜力分配需要消耗5万两银子。封存的属性点分配方案将会随着你自身属性点的变化而变化（等级提升，人物飞升，服用粽子，月饼，潜能果，金砂丹等），除系统分配点外，其他点数均以潜力方式保存。如:保存时等级为60级，升了1级，除系统分配点数外，其他点数会作为潜力保存下来。")
		-- elseif 事件=="我要操作属性方案" then
		-- 	发送数据(玩家数据[数字id].连接id,244,玩家数据[数字id].角色.加点方案)
		-- elseif 事件=="我来进行属性点重置" then
		-- end
	    elseif 名称=="御林军左统领" then
			if 事件=="真是无法无天！我这就去帮你把他们抓回来" then
			GetUpMOB12(数字id)
		elseif 事件=="我打算去抓住这次活动的幕后黑手！" then
			AgainUpMOB12(数字id)
		elseif 事件=="我来取消任务" then
			if 玩家数据[数字id].角色:取任务(12)==0 then
			添加最后对话(数字id,"你有在我这里领取任务吗？")
				else
					皇宫飞贼[数字id]=nil
					皇宫飞贼.贼王[数字id]=nil
					玩家数据[数字id].角色:取消任务(玩家数据[数字id].角色:取任务(12))
					添加最后对话(数字id,"已经成功帮你取消了任务。")
				end
			end
	    elseif 名称=="御林军右统领" then
		if 事件=="领取长安战报" then
			if 长安保卫战.开关 then
				if not  玩家数据[数字id].道具:判定背包道具(数字id,"长安战报",1) then
					玩家数据[数字id].道具:给予道具(数字id,"长安战报")
				else
					添加最后对话(数字id,"你已领取了战报，快去上阵杀敌吧。")
				end
			else
					添加最后对话(数字id,"现在还不是活动时间。")
			end
		elseif 事件=="我要开启秘境降妖副本" then
			-- local zhouji=tonumber(os.date("%w", os.time()))
			-- if zhouji==7   then
			副本_秘境降妖:开启秘境降妖副本(数字id)
		-- else
		-- 	添加最后对话(数字id,"此副本每周日开启。")
			-- end
		elseif 事件=="请送我进去" then
			任务处理类:副本传送(数字id,90)
		end
	    elseif 名称=="PK申请人" then
		    if 事件=="我想了解更多细节" then
			添加最后对话(数字id,"开启PK开关，即表示自愿与别人进行生死决斗。每次开启后24小时（在线游戏时间)内不能关闭，期间可以与其他开启开关的玩家进行PK。战斗失败方会受到PK阵亡的损失，获胜方不会受到PK惩罚。")
		elseif 事件=="我要开启PK开关" then
			if 玩家数据[数字id].角色.等级<30 then
				 添加最后对话(数字id,"你等级不够，不要学大人打打杀杀的。")
		elseif 玩家数据[数字id].角色.PK开关 then
				添加最后对话(数字id,"你的PK开关已经打开了！")
			 else
				玩家数据[数字id].角色.PK开关=os.time()
				添加最后对话(数字id,"已经成功帮你开启了PK开关。")
			end
		elseif 事件=="我要关闭PK开关" then
			if 玩家数据[数字id].角色.等级<30 then
				添加最后对话(数字id,"你等级不够，不要学大人打打杀杀的。")
		elseif 玩家数据[数字id].角色.PK开关 then
			if os.time() - 玩家数据[数字id].角色.PK开关>=86400 then
				玩家数据[数字id].角色.PK开关=nil
				添加最后对话(数字id,"已经成功帮你关闭了PK开关。")
				else
				添加最后对话(数字id,"距上次开启PK开关时间不足24小时，无法关闭！")
				end
		elseif not 玩家数据[数字id].角色.PK开关 then
				添加最后对话(数字id,"你的PK开关已经处于关闭状态了！")
			end
		end
	    elseif 名称=="装备收购商" then
			if 事件=="出售" then
				玩家数据[数字id].给予数据={类型=1,id=0,事件="装备出售"}
				发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
			end
	    elseif 名称=="超级大熊猫" then---玩家数据[数字id].最后对话~=nil and ((玩家数据[数字id].最后对话.编号>=34 and 玩家数据[数字id].最后对话.编号<=57) or (玩家数据[数字id].最后对话.编号>=75 and 玩家数据[数字id].最后对话.编号<=76) or (玩家数据[数字id].最后对话.编号>=95 and 玩家数据[数字id].最后对话.编号<=101))  then--神兽购买操作
			if 事件=="我想进入神兽乐园" then
				地图处理类:跳转地图(数字id,5002,133,24)
			end
	    elseif 名称=="采矿大师" then
                if 事件=="查询采矿熟练度" then
                    添加最后对话(数字id,format("#Y这位矿友，你当前采矿熟练度为: #G"..玩家数据[数字id].角色.采矿数据.熟练度.." #Y采矿声望为: #G"..玩家数据[数字id].角色.采矿数据.矿业声望))
        elseif 事件=="上交采矿物品" then
                    玩家数据[数字id].给予数据={类型=1,id=0,事件="采矿大师上交物品"}
                    发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="采矿大师",类型="NPC",等级="无"})
        elseif 事件=="购买矿产" then
                if 玩家数据[数字id].角色.采矿数据.矿业声望 == nil then
                    玩家数据[数字id].角色.采矿数据.矿业声望 = 0
             end
                    玩家数据[数字id].商品列表=商店处理类.商品列表[54]
                    发送数据(id,9.4,{商品=商店处理类.商品列表[54],采矿声望=玩家数据[数字id].角色.采矿数据.矿业声望})
        elseif 事件=="兑换孩子" then
                    发送数据(id,6.1)
        elseif 事件=="召唤兽进化" then
                    发送数据(id,170)
             end
	    elseif 名称=="轿夫" then
			if 事件=="马上送我回家" then
				-- local fhz = 取房屋编号(数字id)
				-- if fhz ~= 0 then
				-- 	local id组 = 取id组(数字id)
				-- 	for i=1,#id组 do
				-- 		发送数据(玩家数据[id组[i]].连接id,1023,{房屋数据[fhz]})
				-- 	end
				-- 		if 房屋数据[fhz].庭院地图 == 1306 then
				-- 			地图处理类:跳转地图(数字id,房屋数据[fhz].庭院ID,11,85)
				-- 		elseif 房屋数据[fhz].庭院地图 == 1446 then
				-- 			地图处理类:跳转地图(数字id,房屋数据[fhz].庭院ID,11,76)
				-- 		elseif 房屋数据[fhz].庭院地图 == 1380 then
				-- 			地图处理类:跳转地图(数字id,房屋数据[fhz].庭院ID,28,27)
				-- 		elseif 房屋数据[fhz].庭院地图 == 1382 then
				-- 			地图处理类:跳转地图(数字id,房屋数据[fhz].庭院ID,74,81)
				-- 		end
				-- 	return
				-- else
				-- 	常规提示(数字id,"#Y你还没有房子！")
				-- 	return
				-- end
			elseif 事件=="我要拜访别人的家" then
				-- 发送数据(玩家数据[数字id].连接id,1028)
			end
	elseif 名称=="建房史" then
			-- if 事件=="我想进行房屋相关事宜" then
				-- 添加最后对话(数字id,"我是负责审批房屋建造的，你想做房屋么？",{"我要建房","我要拆房","我要搬迁","申请扩建","我要装修"})
			-- elseif 事件=="我要建房" then
			-- 	添加最后对话(数字id,"不知少侠要购买什么类型的豪宅，我这里有四种大型庭院供你挑选",{"农家小院","园林水榭","欢乐童年","白雪皑皑","我没钱就是看看"})
			-- elseif 事件=="我要装修" then
			-- 	添加最后对话(数字id,"我是负责审批房屋建造的，你想做房屋么？",{"装修庭院","装修房屋","装修牧场"})
			-- elseif 事件=="申请扩建" then
			-- 	添加最后对话(数字id,"我是负责审批房屋建造的，你想做房屋么？",{"申请宅邸扩建","申请扩建阁楼"})
			-- elseif 事件=="装修庭院" then
			-- 	添加最后对话(数字id,"你想要把庭院更换成什么风格，选好并缴纳费用我就安排人给你装修好",{"庭院农家小院","庭院园林水榭","庭院欢乐童年","庭院白雪皑皑"})
			-- elseif 事件=="装修房屋" then
			-- 	添加最后对话(数字id,"你想要把庭院更换成什么风格，选好并缴纳费用我就安排人给你装修好",{"复古大理石","复古青砖","复古地板","复古红地板","海洋系","粉红兔","中国风","卡通猫","冰雪屋","蓝色永恒"})
			-- elseif 事件=="装修牧场" then
			-- 	添加最后对话(数字id,"你想要把庭院更换成什么风格，选好并缴纳费用我就安排人给你装修好",{"主题田园流水","主题苍茫草原","主题热带雨林","主题清泉翠竹"})
			-- elseif 事件=="申请宅邸扩建" then
			-- 	房屋处理类:宅邸扩建(数字id,取房屋编号(数字id))
			-- elseif 事件=="申请扩建阁楼" then
			-- 	房屋处理类:扩建阁楼(数字id,取房屋编号(数字id))
			-- elseif 事件=="庭院农家小院" or 事件=="庭院园林水榭"  or 事件=="庭院欢乐童年" or 事件=="庭院白雪皑皑" then
			-- 	房屋处理类:装修庭院(数字id,取房屋编号(数字id),事件)
			-- elseif 事件=="复古大理石" or 事件=="复古青砖"  or 事件=="复古地板" or 事件=="复古红地板" or 事件=="海洋系" or 事件=="粉红兔" or 事件=="中国风" or 事件=="卡通猫" or 事件=="冰雪屋" or 事件=="蓝色永恒" then
			-- 	房屋处理类:装修房屋(数字id,取房屋编号(数字id),事件)
			-- elseif 事件=="主题田园流水" or 事件=="主题苍茫草原"  or 事件=="主题热带雨林" or 事件=="主题清泉翠竹" then
			-- 	房屋处理类:装修牧场(数字id,取房屋编号(数字id),事件)
			-- elseif 事件=="农家小院" or 事件=="园林水榭"  or 事件=="欢乐童年" or 事件=="白雪皑皑" then
			-- 	if not 玩家数据[数字id].角色.姻缘.婚姻 then
			-- 		if 取房屋编号(数字id) ~= 0 then
			-- 			添加最后对话(数字id,"#Y你已经有房子了！")
			-- 		end
			-- 		if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"购买房屋",1)== false then 添加最后对话(数字id,"你没有足够的银两，小心我告你诈骗") return end
			-- 		房屋处理类:购买房屋(数字id,事件)
			-- 		地图处理类:添加房屋(取房屋编号(数字id))
			-- 	else
			-- 		添加最后对话(数字id,"你已经结婚无法购置房屋")
			-- 	end
			-- end
	elseif 名称=="符石道人" then
			if 事件=="我来给装备开运" then
				发送数据(玩家数据[数字id].连接id,300,{"装备开运",{类型=1}})
			elseif 事件=="点化装备星位" then
				发送数据(玩家数据[数字id].连接id,300,{"装备开运",{类型=2}})
			elseif 事件=="我来合成符石" then
				--local 临时数据 = 玩家数据[数字id].道具:索要道具1(数字id)
				发送数据(玩家数据[数字id].连接id,306,{})
			end
	elseif 名称=="戴胄" then
		if 事件=="我要修改名字" then
			发送数据(玩家数据[数字id].连接id,237,{银子=1000000*(玩家数据[数字id].角色.改名.次数+1)})
		end
	elseif 名称=="帮派主管" then
			if 事件=="新建帮派" then
				if 玩家数据[数字id].角色.BPMC ~= "无帮派" and 帮派数据[玩家数据[数字id].角色.BPBH]  then
					常规提示(数字id,"你已经有一个帮派了")
					return
				end
				发送数据(玩家数据[数字id].连接id,204)
			elseif 事件=="加入帮派" then
				if 玩家数据[数字id].角色.BPMC == "无帮派" then
					帮派处理:加入帮派(数字id)
				else
					常规提示(数字id,"你已经有一个帮派了")
				end
			elseif 事件=="我要回到自己帮派！" then
				if 玩家数据[数字id].角色.BPMC ~= "无帮派" then
					地图处理类:跳转地图(数字id,1217,131,101)
				else
					常规提示(数字id,"你还没有帮派了")
				end
			end
	    elseif 名称=="比武大会主持人" then
		  return  比武大会:对话事件处理(数字id,名称,事件) --比武
	    elseif 名称=="欧冶子之灵" then
		     return  剑会:对话事件处理(数字id,名称,事件)
	    ------------------------------------剑会天下
	elseif 名称=="华山接引人" then
		return  剑会天下:对话事件处理(数字id,名称,事件)
	------------------------------------
	    elseif 名称=="驯兽艺人" then
		    if   not 小龟赛跑.开始比赛 then
			if 事件== "小龟村一郎5注" and 玩家数据[数字id].角色:扣除银子(500000,0,0,"小龟赛跑下注") then
				if 小龟赛跑.小龟村一郎[数字id] ~= nil then
				小龟赛跑.小龟村一郎[数字id].下注 = 小龟赛跑.小龟村一郎[数字id].下注 +5
				else
					小龟赛跑.小龟村一郎[数字id] = {id=数字id,下注=5,}
				end
				消息提示(数字id,"#Y你当前下注小龟村一郎总数"..小龟赛跑.小龟村一郎[数字id].下注.."注")
		elseif 事件== "小龟村一郎10注" and 玩家数据[数字id].角色:扣除银子(1000000,0,0,"小龟赛跑下注") then
				if 小龟赛跑.小龟村一郎[数字id] ~= nil then
				小龟赛跑.小龟村一郎[数字id].下注 = 小龟赛跑.小龟村一郎[数字id].下注 +10
				else
					小龟赛跑.小龟村一郎[数字id] = {id=数字id,下注=10,}
				end
				消息提示(数字id,"#Y你当前下注小龟村一郎总数"..小龟赛跑.小龟村一郎[数字id].下注.."注")
		elseif 事件== "小龟蹦二郎5注" and 玩家数据[数字id].角色:扣除银子(500000,0,0,"小龟赛跑下注") then
				if 小龟赛跑.小龟蹦二郎[数字id] ~= nil then
				小龟赛跑.小龟蹦二郎[数字id].下注 = 小龟赛跑.小龟蹦二郎[数字id].下注 +5
				else
					小龟赛跑.小龟蹦二郎[数字id] = {id=数字id,下注=5,}
				end
				消息提示(数字id,"#Y你当前下注小龟蹦二郎总数"..小龟赛跑.小龟蹦二郎[数字id].下注.."注")
		elseif 事件== "小龟蹦二郎10注" and 玩家数据[数字id].角色:扣除银子(1000000,0,0,"小龟赛跑下注") then
				if 小龟赛跑.小龟蹦二郎[数字id] ~= nil then
				小龟赛跑.小龟蹦二郎[数字id].下注 = 小龟赛跑.小龟蹦二郎[数字id].下注 +10
				else
					小龟赛跑.小龟蹦二郎[数字id] = {id=数字id,下注=10,}
				end
				消息提示(数字id,"#Y你当前下注小龟蹦二郎总数"..小龟赛跑.小龟蹦二郎[数字id].下注.."注")
		elseif 事件== "小龟驰三郎5注" and 玩家数据[数字id].角色:扣除银子(500000,0,0,"小龟赛跑下注") then
				if 小龟赛跑.小龟驰三郎[数字id] ~= nil then
				小龟赛跑.小龟驰三郎[数字id].下注 = 小龟赛跑.小龟驰三郎[数字id].下注 +5
				else
					小龟赛跑.小龟驰三郎[数字id] = {id=数字id,下注=5,}
				end
				消息提示(数字id,"#Y你当前下注小龟驰三郎总数"..小龟赛跑.小龟驰三郎[数字id].下注.."注")
		elseif 事件== "小龟驰三郎10注" and 玩家数据[数字id].角色:扣除银子(1000000,0,0,"小龟赛跑下注") then
				if 小龟赛跑.小龟驰三郎[数字id] ~= nil then
				小龟赛跑.小龟驰三郎[数字id].下注 = 小龟赛跑.小龟驰三郎[数字id].下注 +10
				else
					小龟赛跑.小龟驰三郎[数字id] = {id=数字id,下注=10,}
				end
				消息提示(数字id,"#Y你当前下注小龟驰三郎总数"..小龟赛跑.小龟驰三郎[数字id].下注.."注")
			end
		end
	    elseif 名称=="后裔英魂" then
			if 事件=="我要领取化圣任务" then
				if  玩家数据[数字id].角色.等级 == 175 and 玩家数据[数字id].角色.历劫.化圣 ==false then
					战斗准备类:创建战斗(数字id+0,120000)
				else
					添加最后对话(数字id,"小家伙，你现在功力有限，还不满足化圣的条件哦！")
				end
		elseif  事件=="我要提升化圣境界（需战斗，胜利后消耗10亿经验）" then
				if 玩家数据[数字id].角色.历劫.化圣 then
					if 玩家数据[数字id].角色.当前经验 >= 1000000000 then
						if 玩家数据[数字id].角色.历劫.化圣境界 == 0 then 玩家数据[数字id].角色.历劫.化圣境界 = 1 end
						if 玩家数据[数字id].角色.历劫.化圣境界 < 9 then
							战斗准备类:创建战斗(数字id+0,120000+玩家数据[数字id].角色.历劫.化圣境界)
						else
							添加最后对话(数字id,"你已经化圣9层无法在化圣")
						end
					else
						添加最后对话(数字id,"你没有足够的经验无法挑战")
					end
				else
				    添加最后对话(数字id,"你还没化圣成功不能提升！")
				end
			end
	        elseif 名称=="福禄童子" then
	        elseif 名称=="威武大将军" then
	        elseif 名称=="三界包打听" then
		      if 事件=="跳过剧情任务" then
			添加最后对话(数字id,"跳过剧情，请依次按照顺序跳过！",{"玄奘的身世","沙僧剧情","含冤小白龙","女娲神迹","八戒悟空"})
		elseif 事件=="玄奘的身世"  and 玩家数据[数字id].角色.剧情.主线 < 3 then
			玩家数据[数字id].角色:添加经验(10000000,"玄奘的身世")
			玩家数据[数字id].角色.剧情={主线=3,编号 = 9,地图 = 1070,进度 = 1,附加={}}
			发送数据(玩家数据[数字id].连接id,227,{剧情=玩家数据[数字id].角色.剧情})
		elseif 事件=="沙僧剧情"  and  玩家数据[数字id].角色.剧情.主线 < 4 then
			if  玩家数据[数字id].角色.剧情.主线 <= 3 then
				玩家数据[数字id].角色:添加经验(10000000,"沙僧剧情")
				玩家数据[数字id].角色:增加剧情点(5)
			end
			玩家数据[数字id].角色.剧情={主线=4,编号 = 32,地图 = 1173,进度 = 1,附加={}}
			发送数据(玩家数据[数字id].连接id,227,{剧情=玩家数据[数字id].角色.剧情})
		elseif 事件=="含冤小白龙"  and 玩家数据[数字id].角色.剧情.主线 < 5 then
			if 玩家数据[数字id].角色.等级 < 75 then
				常规提示(数字id,"#Y/跳过本剧情需要75级")
				return
			end
			if  玩家数据[数字id].角色.剧情.主线 <=  3 then
				玩家数据[数字id].角色:添加经验(10000000,"含冤的小白龙")
				玩家数据[数字id].角色:增加剧情点(2)
			elseif 玩家数据[数字id].角色.剧情.主线 == 4 then
				玩家数据[数字id].角色:添加经验(10000000,"含冤的小白龙")
				玩家数据[数字id].角色:增加剧情点(5)
			end
			玩家数据[数字id].角色.剧情={主线=5,编号 = 18,地图 = 1111,进度 = 1,附加={}}
			发送数据(玩家数据[数字id].连接id,227,{剧情=玩家数据[数字id].角色.剧情})
		elseif 事件=="女娲神迹"  and 玩家数据[数字id].角色.剧情.主线 < 6 then
			if 玩家数据[数字id].角色.等级 < 100 then
				常规提示(数字id,"#Y/跳过本剧情需要100级")
				return
			end
			if  玩家数据[数字id].角色.剧情.主线 <=  3 then
				玩家数据[数字id].角色:增加剧情点(5)
				玩家数据[数字id].角色:添加经验(10000000,"女娲神迹")
			elseif 玩家数据[数字id].角色.剧情.主线 == 4 then
				玩家数据[数字id].角色:添加经验(10000000,"女娲神迹")
				玩家数据[数字id].角色:增加剧情点(5)
			elseif 玩家数据[数字id].角色.剧情.主线 == 5  then
				玩家数据[数字id].角色:添加经验(10000000,"女娲神迹")
				玩家数据[数字id].角色:增加剧情点(5)
			end
			玩家数据[数字id].角色.剧情={主线=6,编号 = 2,地图 = 1174,进度 = 1,附加={}}
			发送数据(玩家数据[数字id].连接id,227,{剧情=玩家数据[数字id].角色.剧情})
		elseif 事件=="八戒悟空"  and 玩家数据[数字id].角色.剧情.主线 < 7 then
			if 玩家数据[数字id].角色.等级 < 120 then
				常规提示(数字id,"#Y/跳过本剧情需要120级")
				return
			end
			if  玩家数据[数字id].角色.剧情.主线 <=  3 then
				玩家数据[数字id].角色:增加剧情点(5)
				玩家数据[数字id].角色:添加经验(10000000,"八戒悟空")
			elseif 玩家数据[数字id].角色.剧情.主线 == 4 then
				玩家数据[数字id].角色:增加剧情点(5)
				玩家数据[数字id].角色:添加经验(10000000,"八戒悟空")
			elseif 玩家数据[数字id].角色.剧情.主线 == 5  then
				玩家数据[数字id].角色:添加经验(10000000,"八戒悟空")
				玩家数据[数字id].角色:增加剧情点(5)
			end
			玩家数据[数字id].角色.历劫.女娲 = true
			玩家数据[数字id].角色.剧情={主线=7,编号 = 2,地图 = 1114,进度 = 1,附加={}}
			发送数据(玩家数据[数字id].连接id,227,{剧情=玩家数据[数字id].角色.剧情})
		elseif 事件=="飞升剧情" and 玩家数据[数字id].角色.剧情.主线 < 12 then
			if  玩家数据[数字id].角色.剧情.主线 <= 3 then
				玩家数据[数字id].角色:增加剧情点(5)
			elseif  玩家数据[数字id].角色.剧情.主线 == 4 then
				玩家数据[数字id].角色:增加剧情点(5)
			elseif 玩家数据[数字id].角色.剧情.主线 == 5 then
				玩家数据[数字id].角色:增加剧情点(5)
			elseif 玩家数据[数字id].角色.剧情.主线 == 6 or  玩家数据[数字id].角色.剧情.主线 == 7 then
				玩家数据[数字id].角色:增加剧情点(5)
			end
			玩家数据[数字id].角色.剧情={主线=12,编号 = 1,地图 = 1114,进度 = 1,附加={}}
			发送数据(玩家数据[数字id].连接id,227,{剧情=玩家数据[数字id].角色.剧情})
		end
	    elseif 名称=="副本官员" then
		if     事件=="查看所有副本" then
			local wb = "我这里显示所有副本任君选择，并且我可以将你传送到相应副本处哦"
			local xx = {"乌鸡国","车迟斗法","水陆大会","通天河","五更寒","双城记","红孩儿","泾河龙王","大闹天宫","秘境降妖","七绝山","天火之殇","齐天大圣","我什么都不想做"}
			添加最后对话(数字id,wb,xx)
		elseif 事件=="乌鸡国" then
			地图处理类:跳转地图(数字id,1026,26,25)
			elseif 事件=="车迟斗法" then
				地图处理类:跳转地图(数字id,1070,131,143)
				elseif 事件=="水陆大会" then
					地图处理类:跳转地图(数字id,1002,34,78)
					elseif 事件=="通天河" then
						地图处理类:跳转地图(数字id,1070,47,71)
						elseif 事件=="五更寒" then
							地图处理类:跳转地图(数字id,1501,87,29)
							elseif 事件=="双城记" then
								地图处理类:跳转地图(数字id,1501,87,29)
								elseif 事件=="红孩儿" then
									地图处理类:跳转地图(数字id,1210,168,23)
									elseif 事件=="泾河龙王" then
										地图处理类:跳转地图(数字id,1044,70,52)
										elseif 事件=="大闹天宫" then
											地图处理类:跳转地图(数字id,1070,53,194)
											elseif 事件=="秘境降妖" then
												地图处理类:跳转地图(数字id,1001,110,49)
												elseif 事件=="七绝山" then
													地图处理类:跳转地图(数字id,1173,79,43)
													elseif 事件=="天火之殇" then
														地图处理类:跳转地图(数字id,1107,18,21)
														elseif 事件=="齐天大圣" then
															地图处理类:跳转地图(数字id,1092,198,13)


		elseif 事件=="我要拿物品奖励" then
			玩家数据[数字id].商品列表=商店处理类.商品列表[44]
			发送数据(id,9,{商品=商店处理类.商品列表[44],银子=玩家数据[数字id].角色.副本积分,类型="副本积分"})
		elseif 事件=="我要拿经验奖励" then
			local lssj = 2000
			if 玩家数据[数字id].角色.副本积分 < 2000 then
				lssj = 玩家数据[数字id].角色.副本积分
			end
			添加最后对话(数字id,format("你有%s副本积分，每次可以兑换的积分上限为2000点。\n#G每次兑换消耗2000点积分，不足2000点积分将消耗所有积分来进行兑换。\n#Y1点副本积分可兑换10000点经验。\n#Y按你现在的副本积分今天最多可兑换%s点经验。",玩家数据[数字id].角色.副本积分,lssj*1482),{"确定副本积分兑换经验","取消"})
		elseif 事件=="确定副本积分兑换经验" then
			local lssj = 2000
			if 玩家数据[数字id].角色.副本积分 < 2000 then
				lssj = 玩家数据[数字id].角色.副本积分
			end
			玩家数据[数字id].角色.副本积分 = 玩家数据[数字id].角色.副本积分 -lssj
			玩家数据[数字id].角色:添加经验(qz(lssj*10000),"副本积分兑换经验")
		end
	    elseif 名称=="宝石商人" then
		   if 事件=="我想购买一些珍品" then
			玩家数据[数字id].商品列表=商店处理类.商品列表[32]
			-- 发送数据(id,9,{商品=商店处理类.商品列表[32],银子=玩家数据[数字id].角色.银子})
			发送数据(id,9,{商品=商店处理类.商品列表[32],银子=玩家数据[数字id].角色.银子,MRSPXZ=table.copy(MRSPXZ)}) --超级技能
		end
        elseif 名称=="镇塔童子" then
            if 事件=="开始进塔" then
		      	      检测通过 = true
		          if 玩家数据[数字id].角色.等级<60 then
		            添加最后对话(数字id,"要求等级必须达到60级")
		            return
		          end
		          if 玩家数据[数字id].队伍==0 then 常规提示(数字id,"#Y必须组队才能触发该活动") return end
		          if 取队伍人数(数字id)<1 then 常规提示(数字id,"#Y/活动最少要有1人") return  end
		          for n=1,#队伍数据[玩家数据[数字id].队伍].成员数据 do
		            local id =队伍数据[玩家数据[数字id].队伍].成员数据[n]
		              if 通天塔数据[id] == nil then
		                通天塔数据[id] = {名称 = 玩家数据[id].角色.名称,层数 = 0}
		              end
		              if 通天塔数据[id].层数  ~= 通天塔数据[数字id].层数 then
		              	 检测通过 = false
		                广播队伍消息(玩家数据[数字id].队伍,"#y/" .. 玩家数据[id].角色.名称 .. "当前塔层数为:"..通天塔数据[id].层数.."与队长进度不一致。")
		                return
		              end
		            end
		            if 检测通过 then
		            战斗准备类:创建战斗(数字id,111108,数字id)
		        end
		    elseif 事件=="重置层数" then
	          if 通天塔数据[数字id] == nil then
	             通天塔数据[数字id] = {名称 = 玩家数据[数字id].角色.名称,层数 = 0}
	         end
	         if 通天塔重置记录[数字id]~=nil then
	         	添加最后对话(数字id,"本周已经重置过了，每周只可以重置一次！")
	         	return
	         end
	          if 玩家数据[数字id].角色.银子<1000000 then
	            发送数据(玩家数据[数字id].连接id,1501,{名称="镇塔童子",模型="小魔头",对话="你没有那么多的银子"})
	            return
	          else
	          	通天塔重置记录[数字id]=true
	           玩家数据[数字id].角色:扣除银子(1000000,0,0,"重置层数(100W)",1)
	           通天塔数据[数字id].层数 = 0
	           玩家数据[数字id].角色.通天塔数量= 0
	          end
            end

	elseif 名称=="木桩" then
		 if 事件=="与他切磋" then
			战斗准备类:创建战斗(数字id,111111)
		end
	-----------------武神坛
	elseif 名称=="武神之战" then
		local 账号 = 玩家数据[数字id].账号 or 玩家数据[数字id].角色.账号
		if 事件=="进入武神坛" and 玩家数据[数字id].账号 ~= nil and 武神坛数据[玩家数据[数字id].账号] ~= nil then
			if 玩家数据[数字id].角色.月卡==nil or not 玩家数据[数字id].角色.月卡.生效 then-----------进入武神坛进入限制
			    添加最后对话(数字id,"少侠尚未购买月卡暂时无法进入！")
	         	    return
			end
			if 武神坛数据[账号]~=nil then
				武神坛数据[账号]:进入武神坛(账号,数字id)
			end
		elseif 事件=="查看挑战蚩尤排行榜" then
		    发送数据(玩家数据[数字id].连接id,6154,wst蚩尤排行)
		elseif 事件=="领取蚩尤排行榜奖励" then
			local wstjl=table.loadstring(读入文件([[sql/蚩尤排行领取.txt]]))
		    if wstjl[数字id]~=nil then
		    	添加最后对话(数字id,"恭喜你在蚩尤挑战中获得第#Y/" ..wstjl[数字id].名次 .."#W/请领取你的排名奖励。",{"领取奖励","先不领吧"})
		    else
		        添加最后对话(数字id,"蚩尤排行榜上并没有你的名字，或你已领取过奖励了。")
		    end
		elseif 事件=="积分兑换" then --武神坛8.25 外面商店
			local wj账号 = 玩家数据[数字id].账号
			table.print(武神坛数据[wj账号])
			if 武神坛数据[wj账号]~=nil then
				local 积分 = _武神坛记录.积分[数字id] or 0
				local 临时道具 = 武神坛数据[wj账号]:取积分兑换商店()
				发送数据(玩家数据[数字id].连接id,6159,{积分=积分,道具=临时道具})
			end
		elseif 事件=="领取奖励" then
			local 账号 = 玩家数据[数字id].账号 or 玩家数据[数字id].角色.账号
			if 武神坛数据[账号]~=nil then
				武神坛数据[账号]:领取排名奖励(数字id)
			end
	    end
    end
end
function 胜利MOB_111108(胜利id,战斗数据,id组)
    local 通天塔层数 = 通天塔数据[id组[1]].层数
    for n=1,#id组 do
    local id=id组[n]
    local 等级=玩家数据[id].角色.等级
    local 经验=等级*666+20000
    local 银子=等级*10+10000
    local 仙玉=等级*0.1+10
    玩家数据[id].角色:添加经验(经验*(通天塔层数+1)*HDPZ["通天塔"].经验,"通天塔")
    玩家数据[id].角色:添加银子(银子*(通天塔层数+1)*HDPZ["通天塔"].银子,"通天塔",1)
    玩家数据[id].角色:添加仙玉(仙玉*(通天塔层数)*HDPZ["通天塔"].仙玉,"通天塔",1)
    通天塔数据[id].层数=通天塔数据[id].层数+1
    玩家数据[id].角色.通天塔数量 = 玩家数据[id].角色.通天塔数量+ 1
    if 玩家数据[id].角色.参战信息~=nil then
    玩家数据[id].召唤兽:获得经验(玩家数据[id].角色.参战宝宝.认证码,math.floor(经验*0.5),id,"通天塔")
      end
    local 奖励参数=取随机数()
    if 取随机数()<=HDPZ["通天塔"].爆率 then
        local 链接 = {提示=format("#P(镇妖塔)#R/%s#Y突破自我，以无敌姿势闯过镇妖塔，获得镇妖童子奖励的",玩家数据[id].角色.名称),频道="hd",结尾="#W作为奖励！#80"}
        local 名称,数量,参数=生成产出(产出物品计算(HDPZ["通天塔"].ITEM),"通天塔")
    if 数量== 9999 then
        玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
     else
        玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
           end
        end
    end
	战斗数据.连续战斗 = 111108
end
