-- @Author: 小神QQ190909219
-- @Date:   2023-08-31 23:34:34
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-10 20:01:18
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 16:46:24
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:44
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1002]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 3 then
		wb[1] = "阁下我送你去长安吧"
		local xx = {"是的我要去","我还要逛逛"}
		return {"男人_胖和尚","接引僧",wb[sj(1,#wb)],xx}
	elseif 编号 == 4 then
		wb[1] = "得即是失，失即是得，世事本是过往烟云，不必太过看重"
		wb[2] = "不可说，不可说"
		wb[3] = "苦海无边，回头是岸"
		wb[4] = "无色无相，无嗔无狂"
		return {"男人_胖和尚","慧海",wb[sj(1,#wb)]}
	elseif 编号 == 5 then
		wb[1] = "方丈又去碑林里净修了。"
		wb[2] = "不知道我什么时候才能熬到住持的位置。"
		wb[3] = "化瘀，还是疗伤？这是个问题。"
		wb[4] = "大悲无泪，大悟无言，大笑无声。"
		return {"男人_胖和尚","慧悲",wb[sj(1,#wb)]}
	elseif 编号 == 6 then
		wb[1] = "少侠捐献银两可以增加人气。你需要捐献吗？"
		local xx ={"我想提高点人气","怎么可能，我钱有用！"}
		return {"男人_老和尚","空慈方丈",wb[sj(1,#wb)],xx}
	elseif 编号 == 1 then
		wb[1] = "心静则万事静，心清则万事清。"
		wb[2] = "这位施主是来拜师学艺的吗？请到藏经阁找空度禅师。"
		wb[3] = "谁能告诉我小乘佛法与大乘佛法到底有何差异#47？"
		wb[4] = "宁静而致远。"
		return {"男人_胖和尚","慧静",wb[sj(1,#wb)]}
	elseif 编号 == 7 then
		wb[1] = "法明长老的病情越来越重了，这可如何是好……"
		wb[2] = "得即是失，失即是得，世事本是过眼烟云，不必太过看重。"
		wb[3] = "施主是来上香的吗？"
		wb[4] = "一花一世界，一叶一如来。"
		wb[5] = "身心清净方为道，退步原来是向前。"
		return {"男人_胖和尚","慧明",wb[sj(1,#wb)]}
	elseif 编号 == 2 then
		wb[1] = "今玄装承建大会，众有志之士不妨来帮忙帮忙。"
		  local xx = {"我要开启水陆大会副本","我只是一个路过的"}
	      if 玩家数据[数字id].角色:取任务(600)~=0 then
	        wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
	        xx={"请送我进去","我等会再进去"}
	      end
		return {"男人_胖和尚","疥癞和尚",wb[sj(1,#wb)],xx}
	end
	return
end

__NPCdh222[1002]=function (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="接引僧" then
        if 事件=="是的我要去" then
        	地图处理类:npc传送(数字id,1001,470,253)
        end
    elseif 名称=="疥癞和尚" then
        if 事件=="我要开启水陆大会副本" then
	        副本_水陆大会:开启副本(数字id)
        elseif 事件=="请送我进去" then
        	任务处理类:副本传送(数字id,2)
        end
    elseif 名称=="空慈方丈" then
        if 事件=="我想提高点人气" then
        	添加最后对话(数字id,"西游路上总会遇到一些曲折，少侠不论经历过什么，在做事之前都应三思而后行。",{"捐献100万两（10点人气）","捐献500万两（20点人气）","捐献1000万两（50点人气）","捐献2000万两（100点人气）","捐献5000万两（200点人气）","捐献一亿两（500点人气）","我再逛逛"})
		elseif 事件 =="捐献100万两（10点人气）" or 事件 =="捐献500万两（20点人气）" or 事件 =="捐献1000万两（50点人气）" or 事件 =="捐献2000万两（100点人气）" or 事件 =="捐献5000万两（200点人气）" or 事件 =="捐献一亿两（500点人气）" then
			   	local 银子=0
			   	local 人气数=0
			   	if 事件=="捐献100万两（10点人气）" then 银子=1000000		人气数=10  end
			   	if 事件=="捐献500万两（20点人气）" then 银子=5000000		人气数=20  end
			   	if 事件=="捐献1000万两（50点人气）" then 银子=10000000		人气数=50  end
			   	if 事件=="捐献2000万两（100点人气）" then 银子=20000000	人气数=100  end
			   	if 事件=="捐献5000万两（200点人气）" then 银子=50000000	人气数=200  end
			   	if 事件=="捐献一亿两（500点人气）" then 银子=100000000		人气数=500  end
			   	if 取年月日()==玩家数据[数字id].角色.捐献人气时间 then
					添加最后对话(数字id,"你本日已经捐献过了，请明日再来吧")
					return
			   	elseif 玩家数据[数字id].角色:扣除银子(银子,0,0,"捐献人气",1) then
			   		玩家数据[数字id].角色.人气 = 玩家数据[数字id].角色.人气 + 人气数
			   		if 玩家数据[数字id].角色.人气 >=1000 then 玩家数据[数字id].角色.人气 = 1000 end
					添加最后对话(数字id,"捐献成功，本次捐献后你的人气度为：#R/"..玩家数据[数字id].角色.人气)
					玩家数据[数字id].角色.捐献人气时间=取年月日()
				end
        end


    end
end