-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 16:42:12
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:16
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1022]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "人靠衣装马靠鞍，本店为您提供各种新款服装，就算不买也来看看吧。"
		wb[2] = "这里各种绸缎一应俱全，肯定有你想要的。只有大唐官府的玩家才能学会鉴定衣服的技能，而项链腰带的鉴定技能只有地府的玩家才能学。"
		wb[3] = "本店的服饰选用的都是上等丝绸布匹，做工细致，包您满意"
		wb[4] = "三分长相，七分打扮，挑件合身的衣服吧。店里的张裁缝可以让你提高裁缝熟练度。"
		wb[5] = "要自己做衣服请到那边的裁缝台吧，只收取您少量的加工费。"
		local xx = {"购买","我只是来看看"}
		return{"男人_服装店老板","服装店老板",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 2 then
		wb[1] = "我裁剪的衣服，穿过的人没有说不好的！我一眼看过去，不用尺，就知道你的三围是多少！"
		local xx = {"使用缝纫台","关于打造方式的介绍","打工增加熟练度","查看熟练度","路过"}
		return{"男人_服装店老板","张裁缝",wb[取随机数(1,#wb)],xx}
	end
	return
end

__NPCdh222[1022 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
		local 名称=内容[3]
		if 名称=="服装店老板" then  --建邺
			if 事件=="购买" then
				玩家数据[数字id].商品列表=商店处理类.商品列表[7]
				发送数据(id,9,{商品=商店处理类.商品列表[7],银子=玩家数据[数字id].角色.银子})
			end
		elseif 名称=="张裁缝" then
			if 事件=="关于打造方式的介绍" then
				local fssj={}
				fssj={}
				fssj.模型="男人_服装店老板"
				fssj.名称="张裁缝"
				fssj.对话="装备有两种打造方式，按普通方式打造出来的装备，鉴定后即可佩带；如果按强化方式打造装备，打造的过程会繁琐一些，但装备的基本属性会略强，如果刚好是带有附加属性的装备，所增加的属性也会有所提高。另外按强化方式打造的120级以上的武器还会有特殊的光效，你准备用哪种方式来打造呢？"
				fssj.选项={}
				发送数据(id,1501,fssj)
			elseif 事件=="打工增加熟练度" then
				添加最后对话(数字id,"我这里可以让你快速提升你的熟练度",{"打工一次","打工十次","我还是在考虑考虑"})
			elseif 事件 == "打工一次" then
				if 玩家数据[数字id].角色:扣除体力(40) then
					玩家数据[数字id].角色:增加生活技能熟练("裁缝技巧",5)
					添加最后对话(数字id,"你的#R/裁缝技巧/炼金术#W/增加了#R/5#W/熟练度",{"打工一次","打工十次","我还是在考虑考虑"})
				else
					常规提示(数字id,"当前体力不够!在干活就挂了,年轻人不要那么拼命!")
				end
			elseif 事件 == "打工十次"  then
				if 玩家数据[数字id].角色:扣除体力(400) then
					玩家数据[数字id].角色:增加生活技能熟练("裁缝技巧",50)
					添加最后对话(数字id,"你的#R/裁缝技巧/炼金术#W/增加了#R/50#W/熟练度",{"打工一次","打工十次","我还是在考虑考虑"})
				else
					常规提示(数字id,"当前体力不够!在干活就挂了,年轻人不要那么拼命!")
				end
			elseif 事件=="使用缝纫台" then
				发送数据(id,101,玩家数据[数字id].道具:索要道具1(数字id))
				玩家数据[数字id].打造方式=2
			elseif 事件=="查看熟练度" then
				fssj={}
				fssj.模型="男人_服装店老板"
				fssj.名称="张裁缝"
				fssj.对话="你当前的裁缝、炼金熟练度"..玩家数据[数字id].角色:取生活技能熟练("裁缝技巧").."点"
				fssj.选项={}
				发送数据(id,1501,fssj)
			end
	end

end