
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1024]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
			wb[1] = "保镖可是个危险行当，不过利润也高。想保镖的话也得有点本钱，我总不能凭空相信你吧，总得先附点押金我才放心。"
			wb[2] = "行走江湖，重要的是要讲信用。想保镖的话也得有点本钱，我总不能凭空相信你吧，总得先附点押金我才放心。"
			wb[3] = "客人有什么想保的吗？我们的信誉可是最好的。"
			wb[4] = "运镖路途凶险。等你修为高了可以找些朋友们来试试高级镖银#40"
			wb[5] = "少侠平时要多做些好事，积善行德，这样就不会趟趟都跑方寸山了#86"
			wb[6] = "吃得苦中苦，方为人上人。不信去问问那些闯荡江湖的，谁没来找我干过这差事？"
			xx={"我要报名参赛(镖王活动)","一级镖银（30级能运）","二级镖银（50级能运）","三级镖银（70级能运）","四级镖银（90级能运）","五级镖银（110级能运）","请帮我取消任务","请帮我取消任务(镖王活动)","我有押镖恐惧症"}
      		return{"男人_镖头","郑镖头",wb[取随机数(1,#wb)],xx}
		end
	return
end

__NPCdh222[1024 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="郑镖头" then
          if 事件=="我要报名参赛(镖王活动)" then
            发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="本活动需要要求最少三人组队参加，且队伍中的成员等级不能低于30级，活动期间内你将无法使用飞行道具。你可以选择下面三种镖银的任意一种进行押送，价值越高的镖银难度也会越高，但是奖励也会更高。高级镖银和珍贵镖银押送完成后将有一定几率获得",选项={"押送珍贵镖银","你让我想一想"}})
          elseif 事件=="押送珍贵镖银" then
            镖王任务:添加任务(数字id)
          elseif 事件=="请帮我取消任务(镖王活动)" then
            if 玩家数据[数字id].角色:取任务(208)==0 then
              发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="你没有领取过这样的任务啊"})
              return
            else
              local 队伍id=玩家数据[数字id].队伍
              for n=1,#队伍数据[队伍id].成员数据 do
                玩家数据[队伍数据[队伍id].成员数据[n]].角色.镖王间隔=os.time()+300
                玩家数据[队伍数据[队伍id].成员数据[n]].角色:取消任务(玩家数据[队伍数据[队伍id].成员数据[n]].角色:取任务(208))
                发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="已经帮你取消了此任务。"})
              end
              return
            end
          end





















		if 事件 == "一级镖银（30级能运）" then
			if 玩家数据[数字id].队伍~=0 or 取等级要求(数字id,30) == false then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="请单人并且等级大到30级再来接取押镖任务！"})
				return
			end
			押镖:添加任务(数字id,30)


		elseif 事件 == "二级镖银（50级能运）" then
			if 玩家数据[数字id].队伍~=0 or 取等级要求(数字id,50) == false then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="请单人并且等级大到50级再来接取押镖任务！"})
				return
			end
			押镖:添加任务(数字id,50)
		elseif 事件 == "三级镖银（70级能运）" then
			if 玩家数据[数字id].队伍~=0 or 取等级要求(数字id,70) == false then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="请单人并且等级大到70级再来接取押镖任务！"})
				return
			end
			押镖:添加任务(数字id,70)
		elseif 事件 == "四级镖银（90级能运）" then
			if 玩家数据[数字id].队伍~=0 or 取等级要求(数字id,90) == false then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="请单人并且等级大到90级再来接取押镖任务！"})
				return
			end
			押镖:添加任务(数字id,90)
		elseif 事件 == "五级镖银（110级能运）" then
			if 玩家数据[数字id].队伍~=0 or 取等级要求(数字id,110) == false then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="请单人并且等级大到110级再来接取押镖任务！"})
				return
			end
			押镖:添加任务(数字id,110)
		elseif 事件=="请帮我取消任务" then
			if 玩家数据[数字id].角色:取任务(300)==0 then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="你没有领取过这样的任务啊"})
				return
			elseif 押镖.数据[数字id]~=nil and 押镖.数据[数字id].取消>=os.time() then
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="取消任务后三分钟内不能重复取消任务。"})
				return
			else
				if 押镖.数据[数字id]==nil then
				    押镖.数据[数字id]={次数=0,取消=0}
				end
				押镖.数据[数字id].取消=os.time()+180
				玩家数据[数字id].角色:取消任务(玩家数据[数字id].角色:取任务(300))
				发送数据(玩家数据[数字id].连接id,1501,{名称="郑镖头",模型="男人_镖头",对话="已经帮你取消了此任务。"})
			end
		end
	end
end