local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1025]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
			wb[1] = "听说有的帮派在研究打造之术，想通过神兵利器称霸武林。#Y若要制造，修理召唤兽装备及坐骑装饰品请在打铁炉那里操作。"
			local xx = {"","有什么需要帮忙的（打工增加熟练度）", "解除装备专用","精铁换取熟练度","查看熟练度","我只是随便看看"}
			return {"男人_武器店老板","冯铁匠",wb[sj(1,#wb)],xx}
	elseif 编号 == 2 then--物件_打铁炉
			wb[1] = "（这是一个燃着暗红色火光的打铁炉，使用的时候请小心，烫到手就不好了。)"
			local xx = {"我来制造点东西","神器相关","路过"}
			return {"物件_打铁炉","物件_打铁炉",wb[sj(1,#wb)],xx}
	end
	return
end

__NPCdh222[1025 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称 == "冯铁匠" then
	    if 事件 == "有什么需要帮忙的（打工增加熟练度）" then
	    	添加最后对话(数字id,"最近闯荡江湖的人越来越多，人人都想要好兵器好灵饰，我都快忙不过来了，如果你能帮我就再好不过了，我会给酬劳的。(每次打工增加1点熟练度。打造技巧与淬灵之术共用同一个熟练度)",{"好吧，我来帮你。","我还忙着呢"})
    	elseif 事件 == "好吧，我来帮你。" then
			if 玩家数据[数字id].角色:扣除体力(40) then
				玩家数据[数字id].角色:增加生活技能熟练("打造技巧",1)
				玩家数据[数字id].角色:添加银子(10000,"冯铁匠打工",1)
				添加最后对话(数字id,"你的#R/打造技巧/淬灵之术#W/增加了#R/1#W/熟练度",{"好吧，我来帮你。","我还忙着呢"})
			else
				添加最后对话(数字id,"你现在看起来有点疲劳啊。（体力≥40)")
			end
		elseif 事件=="查看熟练度" then
			添加最后对话(数字id,"只要功夫深，铁杵磨成针。只要你持之以恒，不怕打国标，迟早会成为我这样的打造高手。呵呵不废话了，你的打造、淬灵熟练度是"..玩家数据[数字id].角色:取生活技能熟练("打造技巧").."点，裁缝、炼金熟练度是"..玩家数据[数字id].角色:取生活技能熟练("裁缝技巧").."点。")
		elseif 事件 == "精铁换取熟练度" then
			添加最后对话(数字id,"请选择你需要的增加熟练度的方法",{"打造/淬灵熟练度","裁缝/炼金熟练度","取消"})
		elseif 事件 == "打造/淬灵熟练度" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="打造/淬灵熟练度"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="冯铁匠",类型="NPC",等级="无"})
		elseif 事件 == "裁缝/炼金熟练度" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="裁缝/炼金熟练度"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="冯铁匠",类型="NPC",等级="无"})
		elseif 事件 == "解除装备专用" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="解除装备专用"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="冯铁匠",类型="NPC",等级="无"})
	    end
	elseif 名称 == "物件_打铁炉" then
		if 事件=="我来制造点东西"  then
			发送数据(id,101,玩家数据[数字id].道具:索要道具1(数字id))
			玩家数据[数字id].打造方式=1
		elseif 事件 == "神器相关" then
			添加最后对话(数字id,"你想进行哪种操作呢？",{"炼制灵犀之屑","合成灵犀玉","更换神器五行"})
		end
	end
end