-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-01 23:58:56
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-07-28 23:11:53
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1070]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号==1 then
		wb[1] = "风亦不动，树亦不动，乃汝心动也。"
		wb[2] = "这块碧绿色的小石块到底是什么呢？不像金属也不像玉。"
		wb[3] = "长寿村风景秀丽，是修身养性的好地方。"
		xx = {"我要开启车迟斗法副本","我只是一个路过的"}
		 if 玩家数据[数字id].角色:取任务(610)~=0 then
			wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
			xx={"请送我进去","我等会再进去"}
		 end
		return {"男人_胖和尚","慧觉和尚",wb[取随机数(1,#wb)],xx}
	elseif 编号==2 then
		wb[1] = "您想... ...？"
		xx={"我想领取任务链任务（花费500000两银子）","我想用50W替代任务链所需装备","我想查询我的善恶点","我想取消任务链","我只是看看"}
		return {"男人_老书生","陆萧然",wb[取随机数(1,#wb)],xx}
	elseif 编号==3 then
		wb[1] = "长寿村远近闻名，是一处不可多得的世外桃源。"
		wb[2] = "我家妹妹在傲来国，好久不常走动，姐妹俩都生分了#14"
		wb[3] = "北面上去就是方寸山，那里是菩提祖师的修道之所。"
		xx = {"我要开启通天河副本","我只是一个路过的"}
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="蝴蝶女" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		if 玩家数据[数字id].角色:取任务(710)~=0 then
			wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
			xx={"请送我进去","我等会再进去"} --这里显示
		 end
		return {"蝴蝶仙子","蝴蝶女",wb[取随机数(1,#wb)],xx}
	elseif 编号==4 then
		wb[1] = "种族任务目前尚未开放。"
		xx = {"开启大闹天宫副本","保存临时属性","恢复临时属性","了解临时属性保存"}
		if 玩家数据[数字id].角色:取任务(70)~=0 then
			wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
			xx={"请送我进去","我等会再进去"}
		 end
		return {"太白金星","太白金星",wb[取随机数(1,#wb)],xx}
	elseif 编号==5 then
		wb[1] = "前些天从天上掉下个东西，好像把慧觉和尚的头砸了个包，他还真是福大命大，要是砸在我老头子身上我可受不了。"
		wb[2] = "年轻人要心胸宽广，乐观豁达才有益健康。"
		wb[3] = "前几天村里赶毛驴的老张好像捡了根铁鞭子，他还拿着到处炫耀呢。"
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="海老先生" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		return {"男人_村长","海老先生",wb[取随机数(1,#wb)],xx}
	elseif 编号==6 then
		wb[1] = "前几天真是吓坏了，就听“轰”地一声，天上掉下个鞭子，差一点砸到我身上。"
		wb[2] = "三更灯火五更鸡，正是男儿读书时。"
		wb[3] = "“百无一用是书生”，那是市井粗人的调侃之词。"
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="钟书生" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="钟书生" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="钟书生" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"男人_书生","钟书生",wb[1],xx}
		end
		return {"男人_书生","钟书生",wb[取随机数(1,#wb)],xx}
	elseif 编号==7 then
		wb[1] = "逝者如斯，何日君再来？"
		wb[2] = "长寿村远近闻名，人杰地灵。"
		wb[3] = "“北面上去就是方寸山，听说菩提祖师就在那里。"
		if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="许姑娘" then
			xx = {"我帮你带来了驱邪扇芝","我点错了"}
		end
		return {"少女","许姑娘",wb[取随机数(1,#wb)],xx}
	elseif 编号==8 then
		wb[1] = "各位观众看过来，老夫擅长土木之术，制造的仓库坚固耐用又便宜，为促销现在可赠送你一个免费物品仓库，还可以租借召唤兽仓库，用过觉得好再来光顾老夫，多租借几个吧。"
		local xx={"我要进行仓库操作","离开"}
		return {"仓库保管员","仓库管理员",wb[取随机数(1,#wb)],xx}
	elseif 编号==9 then
		wb[1] = "你可以在我这里学习剧情技能仙灵店铺。每级消耗3点剧情点，最高可以学习到5级。"
		local xx={"学习仙灵店铺","我考虑考虑"}
		return {"南极仙翁","南极仙翁",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 10 then
		wb[1] = "少侠，我这里可是有些稀罕玩意，不知道你是否愿意出高价购买呢？"
		local xx = {"购买","我没钱"}
		return{"珍品商人","长寿珍品商人",wb[取随机数(1,#wb)],xx}

	elseif 编号 == 23 then
		-- wb[1] = "打斗不是解决恩怨的唯一办法，如果真的心有不甘，一定要与其一战才能平静的话，我也不拦你。但你必须知道，冤冤相报何时了，在这恩怨牵扯中受最大伤害的人，是你以及你的朋友们。（领取勾魂索需要500万两银子）"
		-- local xx = {"和他一战才能平复我的怒火！给我勾魂索！","我来归还勾魂索。","我要了解勾魂索的使用规则。","我休息下，冷静下就好了。"}
		-- return{"男人_兰虎","勾魂索PK申请人",wb[取随机数(1,#wb)],xx}
		wb[1] = "打斗不是解决恩怨的唯一办法，如果真的心有不甘，一定要与其一战才能平静的话，我也不拦你。但你必须知道，冤冤相报何时了，在这恩怨牵扯中受最大伤害的人，是你以及你的朋友们。\n不过我现在已经退休了，你去长安城钟楼附近(250,170)找那站岗的壮小伙吧！"
		local xx = {"","","好吧那再见！"}
		return{"男人_兰虎","勾魂索PK申请人",wb[取随机数(1,#wb)],xx}

	end
	return
end

__NPCdh222[1070 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="南极仙翁" then
		if 事件=="学习仙灵店铺" then
		  玩家数据[数字id].角色:学习剧情技能(数字id,"仙灵店铺",3,5)
		end
	elseif 名称=="长寿珍品商人" then  --建邺
		if 事件=="购买" then
		  玩家数据[数字id].商品列表=商店处理类.商品列表[22]
		  发送数据(id,9,{商品=商店处理类.商品列表[22],银子=玩家数据[数字id].角色.银子})
		end
	elseif 名称=="陆萧然" then
		if 事件=="我想领取任务链任务（花费500000两银子）" then
			if 玩家数据[数字id].角色:取任务(501)~=0 then
				发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="请先完成之前领取的任务。"})
				return
			else
				发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="领取任务链任务需要花费50万两银子，并且人物等级必须>=60级方可领取。",选项={"我要领取任务链任务","我再考虑考虑"}})
				return
			end
		elseif 事件=="我要领取任务链任务" then
			if 玩家数据[数字id].角色:取任务(501)~=0 then
				发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="请先完成之前领取的任务。"})
				return
			else
				设置任务501(数字id)
			end
		elseif 事件=="我想用50W替代任务链所需装备" then
			if 玩家数据[数字id].角色:取任务(501)==0 then
				发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="你有在我这里领取过任务吗？"})
				return
			else
				local 任务id=玩家数据[数字id].角色:取任务(501)
				if 任务数据[任务id].分类==12 then
					if 玩家数据[数字id].角色.银子<500000 then
						添加最后对话(数字id,"少侠是来寻我开心的么？至少也要把钱带够啊#24")
						return
					end
					玩家数据[数字id].角色:扣除银子(500000,0,0,"跑环银子",1)
					完成任务_501(数字id,任务id)
				else
					发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="我有让你上交装备吗？"})
				end
			end
		elseif 事件=="我想取消任务链" then
			if 玩家数据[数字id].角色:取任务(501)==0 then
				发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="你有在我这里领取过任务吗？"})
				return
			else
				local 任务id=玩家数据[数字id].角色:取任务(501)
				玩家数据[数字id].角色:取消任务(任务id)
				任务数据[任务id]=nil
				发送数据(玩家数据[数字id].连接id,1501,{名称="陆萧然",模型="男人_老书生",对话="已帮你取消了任务链。"})
				return
			end
		end
	elseif 名称=="慧觉和尚" then
		if 事件=="我要开启车迟斗法副本" then
			设置任务610(数字id)
		elseif 事件=="请送我进去" then
			任务处理类:副本传送(数字id,3)
		end
	elseif 名称=="海老先生"  or 名称=="许姑娘" or 名称=="钟书生" or 名称=="蝴蝶女"  then
		if 事件=="我帮你带来了驱邪扇芝" then
            玩家数据[数字id].给予数据={类型=1,id=0,事件="我帮你带来了驱邪扇芝"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
		end
		-- local zhouji=tonumber(os.date("%w", os.time()))
		if 事件=="我要开启通天河副本" then
			 -- if zhouji==1  or zhouji==3  then
			副本_通天河:开启副本(数字id)
			-- else
   --           添加最后对话(数字id,"此副本每周一和周三开启。")
        --    end
		elseif 事件=="请送我进去" then
            任务处理类:副本传送(数字id,12) --这里传送
		end
	elseif 名称=="勾魂索PK申请人" then
		if 事件=="和他一战才能平复我的怒火！给我勾魂索！" then
			if 玩家数据[数字id].角色.等级<30 then
			    添加最后对话(数字id,"您的等级还不高，还是不要动武的好，若是有仇怨，请30级之后再来找我吧。")
		    else
		    	if not 玩家数据[数字id].角色.PK开关 then
			    	添加最后对话(数字id,"先开启PK开关再来找我吧。")
			    	return
			    end
			    if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"勾魂索PK申请人") then
			        玩家数据[数字id].道具:给予道具(数字id,"无常勾魂索")
			        添加最后对话(数字id,"少侠可要三思后行之！")
			    else
			    	添加最后对话(数字id,"勾魂索需要500W两银子当作押金！")
			    end
			end
		elseif 事件=="我来归还勾魂索。" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="我来归还勾魂索。"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="勾魂索PK申请人",类型="NPC",等级="无"})

		elseif 事件=="我要了解勾魂索的使用规则。" then
			添加最后对话(数字id,"(1）使用勾魂索发动PK时，PK双方将会被锁定，300秒准备时间后，切入战斗（必须在PK双方队伍中的玩家才会切入战斗。不在队伍中的玩家将不会切入战斗)。\n(2）玩家领取勾魂索后，若不归还，下次领取所需押金将会翻倍。押金上限为8000万两梦幻币。每天24:00，押金倍数将会重置。")
		end

	elseif 名称=="太白金星" then
		-- local zhouji=tonumber(os.date("%w", os.time()))
		if 事件=="开启大闹天宫副本" then
		-- if zhouji==1  or zhouji==5  then
			副本_大闹天宫:开启大闹天宫副本(数字id)
			-- else
   --           添加最后对话(数字id,"此副本每周一和周五开启。")
          --  end
		elseif 事件=="请送我进去" then
                 任务处理类:副本传送(数字id,70)
		end
	end
end