-- @Author: baidwwy
-- @Date:   2024-05-23 06:02:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-11 00:07:12
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:29:56
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:16
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1092]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "我这里出售上好的鱼竿，如果打算钓鱼的话就买一根鱼竿去试试身手吧。"
		local xx = {"花费200000进鱼塘钓鱼","太贵了我没钱"}
		return {"男人_钓鱼","渔夫",wb[sj(1,#wb)],xx}
	elseif 编号 == 2 then
		wb[1] = "我可以送你去东海湾你要不要去呢？"
		local xx = {"是的我要去","我还要逛逛"}
		return {"男人_驿站老板","船夫",wb[sj(1,#wb)],xx}
	elseif 编号 == 3 then
		wb[1] = "我可以送你去蓬莱仙岛你要不要去呢？"
		local xx = {"是的我要去","我还要逛逛"}
		return {"男人_诗中仙","仙岛引路人",wb[sj(1,#wb)],xx}
    elseif 编号 == 4 then
		wb[1] = "我可以送你去长安城你要不要去呢？"
		local xx = {"是的我要去","我还要逛逛"}
		return {"男人_驿站老板","驿站老板",wb[sj(1,#wb)],xx}
    elseif 编号 == 5 then
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
		return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
    elseif 编号 == 6 then
		wb[1] = "掌上星初满，盘中月正弧~我就是精通宝石工艺的蝴蝶妹妹#2"
		local xx = {"我要学习宝石工艺","我只是路过"}
    if 玩家数据[数字id].角色:取任务(19)~=0 and 任务数据[玩家数据[数字id].角色:取任务(19)].任务NPC=="蝴蝶妹妹" then
       xx = {"我帮你带来了驱邪扇芝","我点错了"}
    end
		return {"蝴蝶仙子","蝴蝶妹妹",wb[sj(1,#wb)],xx}
    elseif 编号 == 7 then
		wb[1] = "魔族的生活本该逍遥自在，但是总有些魔族弟子不守本分，还有些神仙没事就来找茬，你去调查下究竟是个什么情况，必要时使用武力解决问题。"
		local xx = {"好啊，我也正想教训他们呢。","我不想去"}
		return {"九头精怪","九头精怪",wb[sj(1,#wb)],xx}
    elseif 编号 == 8 then
      	wb[1] = "游戏比赛可以在我这里报名哦，比赛时间内只要等级达到40级的玩家可以最少三人组队在我这里报名参赛。"
      	local xx = {"我要报名参赛","我不想淹死"}
      	return {"雨师","游泳报名官",wb[sj(1,#wb)],xx}
    elseif 编号 == 9 then
      	wb[1] = "你是要特赦令牌？我好不容易才得到的，除非你拿定魂珠、夜光珠、金刚石、避水珠和龙鳞这5个宝贝和我换。你是否已经带齐了？"
      	local xx = {"东西都在这，和你换。","查看上交的五宝","兑换炼兽真经","我才不和你换呢"}
      	return {"兔子怪","偷偷怪",wb[sj(1,#wb)],xx}
   -- elseif 编号 == 10 then
      	-- wb[1] = "每晚21-22点你可以在我这里参加迷宫活动哟。成功抵达第20层迷宫并找到迷宫守卫报道后可以获得丰厚奖励哟。"
      	-- local xx = {}
      	-- if 迷宫数据.开关 then
       --  	wb[1] = "幻域迷宫活动已经开启，你需要我送你进去吗？"
       --  	xx = {"请送我进去","不去,我怕迷路"}
      	-- end
      	-- return {"马猴","金毛猿",wb[sj(1,#wb)],xx}

    elseif 编号 == 10 then
        -- wb[1] = "每晚21-22点你可以在我这里参加迷宫活动哟。成功抵达第20层迷宫并找到迷宫守卫报道后可以获得丰厚奖励哟。"
        -- local xx = {}
        -- if 迷宫数据.开关 then
            wb[1] = "幻域迷宫活动已经开启，你需要我送你进去吗？"
            xx = {"开启齐天大圣副本","参加迷宫夺宝","不去,我怕迷路"}
            if 玩家数据[数字id].角色:取任务(191)~=0 then
            wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
            xx={"请送我进去吧","我等会再进去"}
            end
         return {"马猴","金毛猿",wb[sj(1,#wb)],xx}

    elseif 编号 == 16 then
        wb[1] = "我的事情太多了，忙不过来，请优先选择一件你要做的事情吧。"
        local xx = {"低内丹二换一","高内丹三换一","高兽诀三换一","我点错了"}
        return {"兔子怪","偷偷妖",wb[sj(1,#wb)],xx}
    elseif 编号 == 11 then
      	wb[1] = "少侠，我这里可是有些稀罕玩意，不知道你是否愿意出高价购买呢？"
      	local xx = {"购买","我没钱"}
      	return{"珍品商人","傲来珍品商人",wb[取随机数(1,#wb)],xx}
    elseif 编号 == 12 then
      	wb[1] = "贫道游走四方搜集了不少珍宝，现想凑点钱财修建一座道观，逼不得已只能将这些珍宝出售了。"
      	local xx = {"购买","我没钱"}
      	return{"男人_道士","云游道人",wb[取随机数(1,#wb)],xx}
	end
	return
end

__NPCdh222[1092 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="船夫" then
        if 事件=="是的我要去" then
          地图处理类:跳转地图(数字id,1506,70,93)
        end
    elseif 名称=="傲来珍品商人" then  --建邺
        if 事件=="购买" then
          玩家数据[数字id].商品列表=商店处理类.商品列表[23]
          发送数据(id,9,{商品=商店处理类.商品列表[23],银子=玩家数据[数字id].角色.银子})
        end
    elseif 名称=="云游道人" then  --建邺
        if 事件=="购买" then
          玩家数据[数字id].商品列表=商店处理类.商品列表[24]
          发送数据(id,9,{商品=商店处理类.商品列表[24],银子=玩家数据[数字id].角色.银子})
        end
    elseif 名称=="游泳报名官" then
        if 事件=="我要报名参赛" then
            游泳活动:添加任务(数字id)
        end
    -- elseif 名称=="金毛猿" then
    --     if 事件=="请送我进去" then
    --       if 迷宫数据.开关==false then
    --         添加最后对话(数字id,"当前不是活动时间。")
    --         return
    --       else
    --         local xy=地图处理类.地图坐标[1601]:取随机点()
    --         地图处理类:跳转地图(数字id,1601,xy.x,xy.y)
    --       end
    --     end
    elseif 名称=="金毛猿" then
        -- local zhouji=tonumber(os.date("%w", os.time()))
        if  事件=="开启齐天大圣副本" then
            -- if zhouji==3  or zhouji==5  then
            副本_齐天大圣:开启齐天大圣副本(数字id)
            -- else
            --  添加最后对话(数字id,"此副本每周三和周五开启。")
         --   end
        elseif 事件=="请送我进去吧" then
            任务处理类:副本传送(数字id,191)
        end

    elseif 名称=="渔夫" then
      --  if 事件=="花费200000进鱼塘钓鱼" then
          -- if 玩家数据[数字id].角色:扣除银子(200000,0,0,"钓鱼",1) then
          --   发送数据(id,222)
          -- end
      --  end
    elseif 名称=="偷偷怪" then
        if 事件=="东西都在这，和你换。" then
          玩家数据[数字id].给予数据={类型=1,id=0,事件="偷偷怪上交物品"}
          发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="偷偷怪",类型="NPC",等级="无"})
        elseif 事件=="查看上交的五宝" then
          添加最后对话(数字id,"你当前上交的东西有".."#G 夜光珠#R "..玩家数据[数字id].角色.五宝数据.夜光珠.."#G 龙鳞#R "..玩家数据[数字id].角色.五宝数据.龙鳞.."#G 定魂珠#R "..玩家数据[数字id].角色.五宝数据.定魂珠.."#G 避水珠#R "..玩家数据[数字id].角色.五宝数据.避水珠.."#G 金刚石#R "..玩家数据[数字id].角色.五宝数据.金刚石)
        elseif 事件=="兑换炼兽真经" then
          添加最后对话(数字id,"兑换一本“炼兽珍经”需要“#Y笔，墨，纸，砚#W”四种宝物，请集齐后再来找我兑换。")
        end
    elseif 名称=="仙岛引路人" then
        if 事件=="是的我要去" then
          地图处理类:跳转地图(数字id,1207,10,109)
        end
    elseif 名称=="蝴蝶妹妹" then
        if 事件=="我要学习宝石工艺" then
          玩家数据[数字id].角色:学习剧情技能(数字id,"宝石工艺",2,7)
    elseif 事件=="我帮你带来了驱邪扇芝" then
            玩家数据[数字id].给予数据={类型=1,id=0,事件="我帮你带来了驱邪扇芝"}
            发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
        end
    elseif 名称=="驿站老板" then
        if 事件=="是的我要去" then
          地图处理类:跳转地图(数字id,1001,363,198)
        end
    elseif 名称=="偷偷妖" then
        if 事件=="低内丹二换一" then
            玩家数据[数字id].给予数据={类型=1,id=0,事件="低内丹二换一"}
            发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="偷偷妖",类型="NPC",等级="无"})
        elseif 事件=="高内丹三换一" then
            玩家数据[数字id].给予数据={类型=1,id=0,事件="高内丹三换一"}
            发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="偷偷妖",类型="NPC",等级="无"})
        elseif 事件=="高兽诀三换一" then
            玩家数据[数字id].给予数据={类型=1,id=0,事件="高兽诀三换一"}
            发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="偷偷妖",类型="NPC",等级="无"})
        end
    end
end

