-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-11 00:07:11
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1110]=function (ID,编号,页数,已经在任务中,数字id)
  local wb = {}
  local xx = {}
  if 编号 == 4 then
    wb[1] = "我可以送你去长安城，你要去吗？"
    local xx = {"是的我要去","我还要逛逛"}
    return {"男人_驿站老板","驿站老板",wb[1],xx}
    elseif 编号 == 1 then
    wb[1] = "我可以送你去凌波城，你要去吗？"
    local xx = {"是的我要去","我还要逛逛"}
    return {"男人_土地","大唐国境土地",wb[1],xx}
    elseif 编号 == 2 then
    wb[1] = "我可以送你去普陀山，你要去吗？"
    local xx = {"是的我要去","我还要逛逛"}
    return {"普陀_接引仙女","普陀山接引仙女",wb[1],xx}
    elseif 编号==3 then
        wb[1] = "别看我们店小，回锅肉，十香素锦、桂花鸡样样齐全。"
        wb[2] = "客官你是要打尖还是住店？"
        wb[3] = "物价飞涨，小店生意不好做啊，老板迫不得已把酒钱都给涨了#14"
        local xx = {"开启黑风山副本","我还要逛逛"}
        if 玩家数据[数字id].角色:取任务(60)~=0 then
      wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
      xx={"请送我进去","我等会再进去"}
     end
      return {"男人_店小二","小二",wb[取随机数(1,#wb)],xx}
    elseif 编号 == 5 then
    wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
    local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
    return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
    elseif 编号==6 then
        wb[1] = "清净之心可除烦恼，至诚之心可入佛号。"
        wb[2] = "本寺的法明长老最近去长安城会朋友去了，你若是有急事可以到化生寺找他。"
        wb[3] = "师傅为我取法号“者释和尚”，意思是说，这是个和尚。"
        return {"男人_胖和尚","者释和尚",wb[取随机数(1,#wb)],xx}
    elseif 编号==7 then
        wb[1] = "酒肉和尚老是欺负玄奘，我们都看不过去，但是那酒肉和尚有几分蛮力，我们也不敢说什么。"
        wb[2] = "到庙里上香要怀着一颗虔诚之心。"
        wb[3] = "修行佛法贵在调心，“心生则法生，法生则心生”，只要心净，佛土自然清静。"
        return {"男人_胖和尚","业释和尚",wb[取随机数(1,#wb)],xx}
    elseif 编号==8 then
        wb[1] = "施主是来金山寺进香的吗？"
        wb[2] = "须菩提！以要言之，是经有不可思议，不可称量，无边功德……。"
        wb[3] = "本寺的法明长老最近去长安城会朋友去了，你若是有急事可以到化生寺找他。"
            local 任务id
            if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
              wb={"你找我有什么事情吗？"}
              xx={}
              任务id= 玩家数据[数字id].角色:取任务(301)
              if 任务id~=0 and 任务数据[任务id].人物=="海释和尚" then
                xx[#xx+1] = "青龙任务"
              end
              任务id= 玩家数据[数字id].角色:取任务(302)
              if 任务id~=0 and 任务数据[任务id].人物=="海释和尚" then
                xx[#xx+1] = "玄武任务"
              end
              xx[#xx+1] = "没什么，我只是看看"
              return {"男人_胖和尚","海释和尚",wb[1],xx}
            end
        return {"男人_胖和尚","海释和尚",wb[取随机数(1,#wb)],xx}
    elseif 编号==9 then
        wb[1] = "没了，终于知道什么是没了……"
        wb[2] = "发明那老头明明知道些什么，却那么嘴硬，不给点教训他还不知道本姑娘的厉害。"
        wb[3] = "为什么，为什么我总感觉冥冥之中有几个声音在耳边，而那声音又那么像我自己？"
        return {"星灵仙子","白琉璃",wb[取随机数(1,#wb)],xx}
    elseif 编号==10 then
        wb[1] = "丛山峻岭中呆久了，难免想到海边走走。"
        wb[2] = "山外有山，人外有人。这山神也是分三六九等的。"
        wb[3] = "从前有座山，山上有个庙，庙里有个神仙讲故事，他说从前有座山，山上有个庙，少侠你还想继续听么？"
            local 任务id
            if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
              wb={"你找我有什么事情吗？"}
              xx={}
              任务id= 玩家数据[数字id].角色:取任务(301)
              if 任务id~=0 and 任务数据[任务id].人物=="山神" then
                xx[#xx+1] = "青龙任务"
              end
              任务id= 玩家数据[数字id].角色:取任务(302)
              if 任务id~=0 and 任务数据[任务id].人物=="山神" then
                xx[#xx+1] = "玄武任务"
              end
              xx[#xx+1] = "没什么，我只是看看"
              return {"雨师","山神",wb[1],xx}
            end
        return {"雨师","山神",wb[取随机数(1,#wb)],xx}
    elseif 编号==11 then
        wb[1] = "三界之间的恩怨情仇，从来就和我们这种小角色无关#69"
        wb[2] = "瞧一瞧看一看了，东海龙宫宝贝大展销啦#51"
        wb[3] = "龙宫的宝贝真是多啊，随便偷得一两件拿到外面来卖都能发笔横财。"
        return {"虾兵","虾兵",wb[取随机数(1,#wb)],xx}
    elseif 编号==12 then
        wb[1] = "焘隆!轰隆!于大唐国境順水而行,便可至赤水洲,此地生古木曰“三珠”,灵"
        local xx = {"送我到赤水州","我还要逛逛"}
        return {"云游火","接引守卫",wb[取随机数(1,#wb)],xx}
    elseif 编号==13 then
        wb[1] = "你要进去看望朋友呀?我送你进去,不要惹事就好。"
        local xx = {"是的我要去","我还要逛逛"}
        return {"男人_衙役","牢房守卫",wb[取随机数(1,#wb)],xx}
    elseif 编号==31 then
        if 玩家数据[数字id].角色:取任务(1163)~=0 and 任务数据[玩家数据[数字id].角色:取任务(1163)].子类==1 and 任务数据[玩家数据[数字id].角色:取任务(1163)].护送地点=="大唐国境" then
          文韵墨香:见到西域使者(数字id)
          wb[1] = "少侠真实及时雨啊，我正苦于如何安全到达长安城呢。听说有些地方强盗闹的厉害，少侠可要避开这些区域啊。"
          return {"宝象国国王","西域使者",wb[1]}
        else
          wb[1] = "去长安是走这条路吗#111，少侠是来带我去长安的吗？"
          return {"宝象国国王","西域使者",wb[1]}
        end
    end
  return
end

__NPCdh222[1110 ]=function  (id,数字id,序号,内容)
  local 事件=内容[1]
  local 名称=内容[3]
  if 名称=="驿站老板" then
    if 事件=="是的我要去" then
      地图处理类:跳转地图(数字id,1001,362,198)
    end
 --     elseif 事件=="开启黑风山副本" then
      -- local zhouji=tonumber(os.date("%w", os.time()))
      -- if zhouji==4  or zhouji==6  then
--      副本_黑风山:开启黑风山副本(数字id)
      -- else
      --        添加最后对话(数字id,"此副本每周四和周六开启。")
       --     end
  -- elseif 事件=="请送我进去" then
  --     任务处理类:副本传送(数字id,80)
  elseif 名称=="大唐国境土地" then
    if 事件=="是的我要去" then
      地图处理类:跳转地图(数字id,1150,8,92)
    end
  elseif 名称=="普陀山接引仙女" then
    if 事件=="是的我要去" then
      地图处理类:跳转地图(数字id,1140,85,64)
    end
  elseif 名称=="接引守卫" then
    if 事件=="送我到赤水州" then
      地图处理类:跳转地图(数字id,1258,151,89)
    end
  elseif 名称=="牢房守卫" then
    if 事件=="是的我要去" then
      地图处理类:跳转地图(数字id,1175,31,41)
    end
  end
end