-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:01:03
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:16
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1116]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "我可以送你去#R/东海湾#W/，你要不要去呢？"
		local xx = {"是的 我要去","我还有逛逛"}
		return {"虾兵","虾兵",wb[sj(1,#wb)],xx}
	elseif 编号 == 2 then
		wb[1] = "有志的仙族青年应该投奔我龙宫，及早谋个好前程啊。"
		wb[2] = "最近宫里丢了颗定颜珠，千岁正发愁呢。"
		wb[3] = "海底地形复杂，当心可别迷了路。"
		wb[4] = "一只羊在吃草，一只狼在旁边过，但没吃羊，少侠可知这个谜语说的是谁#40"
		wb[5] = "前几日一只螃蟹爬出蒸锅说“我热”，我愤怒的教导他，想红就给我忍着点#4"
  		return {"蟹将","蟹将军",wb[sj(1,#wb)]}
	elseif (编号 == 3 or 编号== 7 or 编号 == 9 or 编号 == 10 or 编号 == 12 or 编号 == 13 or 编号 == 15) then
		wb[1] = "龙宫的宝贝真是多啊，随便偷得一两件拿到外面来卖都能发笔横财。"
		wb[2] = "瞧一瞧看一看了，东海龙宫宝贝大展销啦#51"
		wb[3] = "三界之间的恩怨情仇，从来就和我们这种小角色无关#109"
  		return {"虾兵","虾兵",wb[sj(1,#wb)]}
	elseif 编号 == 5 then
		wb[1] = "大家叫我龟千岁，可我看起来还是那么年轻吧？"
		wb[2] = "在海里呆得久了，想到陆地上走走。"
		wb[3] = "龙族的法术玄妙无比，要苦心修习方能领悟。"
		wb[4] = "龙宫里有数不尽的宝贝，有机缘之人才能得到。"
		wb[5] = "生蚝肉怎么这么好吃#89 "
		wb[6] = "年纪越大，越容易犯低级错误#76"
  		return {"龟丞相","龟千岁",wb[sj(1,#wb)]}
	elseif 编号 == 6 then
		wb[1] = "我爹爹只不过改了下雨的时辰点数就被斩首了，真不甘心！"
		wb[2] = "我一定要用袁守诚的人头祭祀我父王。"
  		return {"小龙女","小龙女",wb[sj(1,#wb)]}
	elseif 编号 == 8 then
		wb[1] = "有志青年应该投奔我龙宫，及早谋个好前程啊。"
		wb[2] = "整天就是在这里看门，真是没什么意思，不过真让我休息的话我也还是找个地方待着睡觉。"
		wb[3] = "千年王八万年龟，我今年已经一万零八岁了。"
		wb[4] = "学游泳，找我就对了，价格实惠，包学包会#39"
		wb[5] = "这太尉不过是个有名无实的闲职罢了！"
		return {"龟丞相","龟太尉",wb[sj(1,#wb)]}
	elseif 编号 == 11 then
		wb[1] = "有志青年应该投奔我龙宫，及早谋个好前程啊。"
		wb[2] = "我这出去就是海底的迷宫了，里面有不少怪物，最好结伴而行。"
		wb[3] = "没事别老找我说话，找那老龟吧，他喜欢侃。"
		wb[4] = "嘿哟嘿哟！强身健体，为我龙宫健康工作一万年！"
		wb[5] = "真的蛤蟆勇士，敢于直面先天的缺陷。"
		return {"蛤蟆精","蛤蟆勇士",wb[sj(1,#wb)]}
	elseif 编号 == 14 then
		wb[1] = "有志青年应该投奔我龙宫，及早谋个好前程啊。"
		wb[2] = "海底地形复杂，当心可别迷了路。"
		wb[3] = "最近宫里丢了颗定颜珠，千岁正发愁呢。"
		wb[4] = "论智慧我比蟹将军高那么一点点，可是他比我多了好多手脚，所以比我升的快。"
		wb[5] = "八只脚，抬面鼓，两把剪刀鼓前舞，生来横行又霸道，嘴里常把泡沫吐。少侠猜猜是谁？#86"
		wb[6] = "不想当龙虾的虾不是好虾#40"
      	return {"虾兵","虾将军",wb[sj(1,#wb)]}
	elseif 编号 == 16 then
		wb[1] = "小白龙真是个傻瓜，本公主略施小计就把他整的一点脾气也没有。"
		wb[2] = "九头虫怎么还不回来，不知道事情办妥了没有。"
		wb[3] = "龙族的法术玄妙无比，要苦心修习方能领悟。"
		wb[4] = "龙宫纵有千万般好处，可还是比不上我的乱石山碧波潭。"
		return {"女人_万圣公主","万圣公主",wb[sj(1,#wb)]}
	elseif 编号 == 4 then
		wb[1] = "我送阁下回长安吧。"
		local xx = {"是的我要去","我还要逛逛"}
		return {"蟹将","传送蟹将",wb[sj(1,#wb)],xx}
	end
	return
end

__NPCdh222[1116 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="虾兵" then
        if 事件=="是的 我要去" then
          地图处理类:npc传送(数字id,1506,95,37)
        end
    elseif 名称=="传送蟹将" then
        if 事件=="是的我要去" then
          地图处理类:npc传送(数字id,1001,470,253)
        end
    end
end