-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:24:07
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:17
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1150]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "能给我杨戬当徒儿的，都是人中龙凤。"
		wb[2] = "想听故事找你们那六个师叔去，为师忙得很！"
		wb[3] = "好久没和孙悟空那小子比试比试了，真是寂寞如雪啊。"
		wb[4] = "为师教给你的东西可都学会了？"
		local xx = {"交谈","给予","乾元丹学习","师门任务","学习技能","我想切换流派"}
		if 玩家数据[数字id].角色.门派 == "无" or 玩家数据[数字id].角色.门派 == "无门派" then
	        xx={"我还想去其他门派看看……","请收我为徒"}
	     elseif 玩家数据[数字id].角色.门派~="凌波城" then
	        xx={}
	    end
	    if 玩家数据[数字id].角色:取任务(300)~=0 then
			local 任务id= 玩家数据[数字id].角色:取任务(300)
			if 任务数据[任务id].人物=="二郎神" then
				wb={}
				xx={}
				wb[1] = "原来是你给我送东西来了。怎么改行当镖师了？"
				押镖:完成押镖任务(任务id,数字id,任务数据[任务id].人物地图)
			else
				wb={}
				xx={}
			    wb[1] = "少侠你的镖是不是运送错了地方呢，再仔细看看任务提示！"
			end
	     end
		return {"二郎神","二郎神",wb[sj(1,#wb)],xx,"门派师傅"}
	elseif 编号 == 2 then
		wb[1] = "啊呜啊呜……汪汪汪！"
		wb[2] = "天庭里那个二郎神长得好像和主人不是很像……"
		wb[3] = "跟随主人出生入死这么多年，我们一起经历了许多事情，不知道你想听我从那一件讲起呢？"
		return {"哮天犬","哮天犬",wb[sj(1,#wb)]}
	elseif 编号 == 3 or 编号 == 4 then
		wb[1] = "你整理一下形象再来进门，你这蓬头垢面的成何体统#4"
		wb[2] = "少侠，你没走错，这就大名鼎鼎，鼎鼎大名的凌波城了。"
		wb[3] = "喂……都说了没走错了，你怎么还不进门啊#4"
		return {"天兵","守门天将",wb[sj(1,#wb)]}
	elseif 编号 == 7 then
		wb[1] = "当年，真没想到跟大哥混还这么有前途#17"
		wb[2] = "哮天犬这小子最不厚道了，每次都是他给大哥惹麻烦#83"
		wb[3] = "我觉得大哥的优点就是长得帅#17"
		return {"狂豹","荒芜星",wb[sj(1,#wb)]}
	elseif 编号 == 8 then
		wb[1] = "真不明白大哥为什么和那个死猴子称兄道弟的#4"
		wb[2] = "天庭里的繁文缛节实在令人生厌#4"
		wb[3] = "天庭里的繁文缛节实在令人生厌#4"
		return {"鲛人","刀砧星",wb[sj(1,#wb)]}
	elseif 编号 == 9 then
		wb[1] = "我最喜欢的就是灌江口的涛声。"
		wb[2] = "小螃蟹爬来爬去，好像也挺开心的呢#86"
		wb[3] = "一晃好像过了很多年了，但是三界还是乱糟糟的……"
		return {"羊头怪","反吟星",wb[sj(1,#wb)]}
	elseif 编号 == 10 then
		wb[1] = "#75知不知道，能给大哥当徒弟，是你三生有幸！"
		wb[2] = "能跟大哥闯荡，真是畅快！"
		wb[3] = "天下之大，大哥要是称第二，就没人称第一#89"
		return {"犀牛将军_人","天瘟星",wb[sj(1,#wb)]}
	elseif 编号 == 11 then
		wb[1] = "这江水哗啦啦的声音最是扰人清梦#83"
		wb[2] = "小螃蟹爬来爬去真是烦死人了。"
		wb[3] = "好久都没去看外面的世界了，感觉有点寂寞啊#52"
		return {"野猪精","伏断星",wb[sj(1,#wb)]}
	elseif 编号 == 6 then
		wb[1] = "龙宫家的姑娘，长的还是挺好看的#17"
		wb[2] = "想知道你师父和龙宫家姑娘的故事么？问我就对啦！"
		wb[3] = "你要是真问我发生了什么，我也只能说个大概……"
		return {"百足将军","破碎星",wb[sj(1,#wb)]}
	elseif 编号 == 5 then
		wb[1] = "我送阁下回长安吧。"
		local xx = {"是的我要去","我还要逛逛"}
		return {"天兵","传送天将",wb[sj(1,#wb)],xx}
	end
	return
end

__NPCdh222[1150 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="传送天将" then
        if 事件=="是的我要去" then
          地图处理类:npc传送(数字id,1001,470,253)
        end
    elseif 名称=="二郎神" then
        local 门派类型="凌波城"
        if 事件=="请收我为徒" then
          玩家数据[数字id].角色:加入门派(数字id,门派类型)
        elseif 事件=="交谈" then
          --玩家数据[数字id].角色:门派交谈(数字id,门派类型)
        elseif 事件=="师门任务" then
          玩家数据[数字id].角色:门派任务(数字id,门派类型)

        elseif 事件=="学习技能" then
          --local 临时数据=玩家数据[数字id].角色:取总数据()
          发送数据(id,31,玩家数据[数字id].角色:取总数据1())
          发送数据(id,32)
        end
    end
end