-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-11 00:07:11
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1173]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号==1 then
			wb[1] = "我可以送你去西牛贺洲，你要去吗？"
		local xx = {"是的我要去","我还要逛逛"}
		return {"男人_土地","南瞻部洲土地",wb[1],xx}
		elseif 编号==2 then
			wb[1] = "我可以送你去碗子山，你要去吗？"
		local xx = {"送我过去","我还要逛逛"}
		return {"男人_驿站老板","驿站老板",wb[1],xx}
		elseif 编号 == 3 or 编号==13 then
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
		return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	elseif 编号==4 then
			wb[1] = "山贼不是贼，我和兄弟们都是绿林好汉。"
			wb[2] = "行走江湖靠的是拳头和刀枪，没点真本事是闯不出名堂的。"
			wb[3] = "这年头江湖凶险啊，不如投奔我们吧，保证有吃有喝。"
			wb[4] = "近日西北方向来了个奇怪的僧人，少侠去打探下，看看有何玄机。"
			wb[5] = "这里山林密布，靠近国境，是个立山头的好地方。"
			local 任务id
			if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
				wb={"你找我有什么事情吗？"}
				xx={}
				任务id= 玩家数据[数字id].角色:取任务(301)
				if 任务id~=0 and 任务数据[任务id].人物=="山贼头子" then
					xx[#xx+1] = "青龙任务"
				end
				任务id= 玩家数据[数字id].角色:取任务(302)
				if 任务id~=0 and 任务数据[任务id].人物=="山贼头子" then
					xx[#xx+1] = "玄武任务"
				end
				xx[#xx+1] = "没什么，我只是看看"
				return {"山贼","山贼头子",wb[1],xx}
			end
			return {"山贼","山贼头子",wb[取随机数(1,#wb)],xx}
	elseif 编号==5 then
			wb[1] = "少侠可是去墨家村？往东北方向一直走便是。"
			wb[2] = "我家大王最近正在广招门徒，欢迎魔族的有志青年前去，男女不限#51。"
			wb[3] = "听说九头精怪要来拜访我家大王，大王特派我在此迎接43"
			wb[4] = "我就是牛魔王座下巡山将，怎么样，投入我们大王门下吧，绝对没有人敢欺负你。"
			wb[5] = "南瞻部洲常有野兽出没，路过可要当心了。"
			xx={"好好好。迫不及待！","我准备准备就来。"}
			 if 玩家数据[数字id].角色:取任务(640)~=0 then
				wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
				xx={"请送我进去","我等会再进去"}
			 end
			return {"牛妖","牛将军",wb[取随机数(1,#wb)],xx}
	elseif 编号==6 then
			wb[1] = "我可以送你去长安城，你要去吗？"
			local xx = {"是的我要去","我还要逛逛"}
			return {"男人_驿站老板","驿站老板",wb[1],xx}
	elseif 编号==7 then
			wb[1] = "道，可道，非恒道。名，可名，非恒名。"
			wb[2] = "给我一双慧眼，让我看清这个纷繁复杂的世界吧！"
			wb[3] = "人到魔的转变往往就在一念之间。"
			wb[4] = "没事的话别在这一带逛，这附近…咳…咳…"
			wb[5] = "人法地，地法天，天法道，道法自然。"
			return {"逍遥生","白衣人",wb[取随机数(1,#wb)],xx}
	elseif 编号==8 then
			wb[1] = "有些人一辈子都在骗人，而有些人用一辈子去骗一个人！"
			wb[2] = "那么久没见面我真的好想念他，不知道他是否也这样想念着我呢？"
			wb[3] = "天下最远的距离，不是相隔天涯，而是我就在他身边，他却不知道……"
			wb[4] = "我已经心有所属，怎么可能再去喜欢别人呢？"
			wb[5] = "为什么，为什么我总感觉冥冥之中有几个声音在耳边，而那声音又那么像我自己？"
			return {"星灵仙子","阿紫",wb[取随机数(1,#wb)],xx}
	elseif 编号==9 then
			wb[1] = "二郎神的庙宇位于灌江口，那里可是块风水宝地。"
			wb[2] = "我们康张姚李四太尉是二郎神手下的四大天王。"
			wb[3] = "人称风度翩翩风流倜傥风靡天下少女的天下第一帅哥就是我们二郎神君。"
			local 任务id
			if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
				wb={"你找我有什么事情吗？"}
				xx={}
				任务id= 玩家数据[数字id].角色:取任务(301)
				if 任务id~=0 and 任务数据[任务id].人物=="姚太尉" then
					xx[#xx+1] = "青龙任务"
				end
				任务id= 玩家数据[数字id].角色:取任务(302)
				if 任务id~=0 and 任务数据[任务id].人物=="姚太尉" then
					xx[#xx+1] = "玄武任务"
				end
				xx[#xx+1] = "没什么，我只是看看"
				return {"天兵","姚太尉",wb[1],xx}
			end
			return {"天兵","姚太尉",wb[取随机数(1,#wb)],xx}
	elseif 编号==10 then
			wb[1] = "再往西走就是荒芜凶险之地，少侠可要一路多加保重。"
			wb[2] = "仁者乐山，智者乐水，游历可以怡情养性，豁达心情。"
			wb[3] = "下面田里的那对小夫妻带着一身妖气，好像是妖怪。"
			return {"空度禅师","云游僧",wb[取随机数(1,#wb)],xx}
	elseif 编号==11 then
			wb[1] = "总算是摆脱了寿星老头的控制，可以自由自在的生活了。"
			wb[2] = "我有个远方亲戚，他可是三界的神兽，在长安城天台你就能看见他。"
			wb[3] = "南极仙翁那里包吃包住，其实生活也算不错。"
			return {"赌徒","白鹿精",wb[取随机数(1,#wb)],xx}
	elseif 编号==12 then
			wb[1] = "在世为妖是多么自由啊，为什么要被那些神仙呼来喝去呢？"
			wb[2] = "我表姐可是个公主，听说最近爱上了牛魔王#35"
			wb[3] = "边上这就是我的夫君，别看他现在其貌不扬的，以前可是南极仙翁的坐骑。"
			return {"狐狸精","玉面狐狸",wb[取随机数(1,#wb)],xx}
	elseif 编号==14 then
		 wb[1] = "大唐境外那一家人看起来可不像凡夫俗子，是哪个妖怪变的？"
			wb[2] = "前面不远就是高老庄"
			wb[3] = "南瞻部洲地域辽阔，有居家百姓也有草莽野兽，有妖魔鬼怪也有佛道神仙。"
			return {"野猪","野猪王",wb[取随机数(1,#wb)],xx}
	elseif 编号==15 then
			wb[1] = "你见到鬼不害怕吗？"
			wb[2] = "盘丝岭近在眼前。可惜她们不招收男弟子#15"
			wb[3] = "五庄观就在附近，听说镇元大仙正在广招仙族弟子，不过只收男的。"
			return {"骷髅怪","偷尸鬼",wb[取随机数(1,#wb)],xx}
	elseif 编号==16 then
			wb[1] = "严肃点，正打劫呢！"
			wb[2] = "你看上去太搜了，再怎么有诚意地看着我我也不会吃你的！"
			wb[3] = "好多天没吃人肉了，你就委屈下做我的午餐吧。"
			return {"强盗","李彪",wb[取随机数(1,#wb)],xx}
	elseif 编号==17 then
			wb[1] = "俺老娘也是的，好吃好喝伺候着，还总是想东想西。"
			wb[2] = "善恶到头终有报，我的报应是快到了。"
			wb[3] = "做官就是舒服，好过平头百姓奔波操劳。"
			return {"男人_马副将","刘洪",wb[取随机数(1,#wb)],xx}
	elseif 编号==18 then
			wb[1] = "行走江湖靠的是拳头和刀枪，没点真本事是闯不出名堂的。"
			local xx={"学习技能","我点错了"}
			return {"强盗","强盗头子",wb[取随机数(1,#wb)],xx}
	elseif 编号==19 then
			wb[1] = "冤冤相报何时了？连做鬼都不得清静……"
			wb[2] = "那个土地老头真好欺负，下次再去和他玩#43"
			wb[3] = "生前再怎么风光，死后还不是一样堕入轮回……"
			return {"僵尸","冤魂",wb[取随机数(1,#wb)],xx}
	elseif 编号==35 then
		wb[1] = "我曾经做错了很多，所以我会用永远来赎罪。"
      	xx = {"神器任务序章","我要改变神器的力量","我要做其他事情","我点错了"}
    	return {"剑侠客","轩辕",wb[取随机数(1,#wb)],xx}
end
	return
end

__NPCdh222[1173 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="南瞻部洲土地" then
		if 事件=="是的我要去" then
			地图处理类:跳转地图(数字id,1091,85,157)
		end
	elseif 名称=="强盗头子" then
		if 事件=="学习技能" then
			玩家数据[数字id].角色:学习剧情技能(数字id,"妙手空空",3,10)
		end
	elseif 名称=="驿站老板" then
		if 事件=="送我过去" then
			地图处理类:跳转地图(数字id,1228,85,184)
		elseif 事件=="是的我要去" then
			地图处理类:跳转地图(数字id,1001,363,198)
		end
	elseif 名称=="牛将军" then
		-- local zhouji=tonumber(os.date("%w", os.time()))
		if 事件=="好好好。迫不及待！" then
		-- if zhouji==2  or zhouji==6  then
			 设置任务640(数字id)
		 --          else
   --           添加最后对话(数字id,"此副本每周二和周六开启。")
          --  end
		elseif 事件=="请送我进去" then
			任务处理类:副本传送(数字id,5)
		end
	elseif 名称=="轩辕" then
		local 门派神器名称 = {
				大唐官府 = "轩辕剑",化生寺 = "墨魂笔",方寸山 = "黄金甲",女儿村 = "泪痕碗",天宫 = "独弦琴",
				普陀山 = "华光玉",龙宫 = "清泽谱",五庄观 = "星斗盘",魔王寨 = "明火珠",狮驼岭 = "噬魂齿",
				盘丝洞 = "昆仑镜",阴曹地府 = "四神鼎",神木林 = "月光草",凌波城 = "天罡印",无底洞 = "玲珑结",
				花果山 = "鸿蒙石",九黎城 = "魔息角"
			}
		local sqmz = 门派神器名称[玩家数据[数字id].角色.门派]
		if 事件=="神器任务序章" then
			if 玩家数据[数字id].神器.数据.是否有 then
				添加最后对话(数字id,"你已经有了神器了#24")
			    return
			end
			if 玩家数据[数字id].角色.门派=="无门派" then
				添加最后对话(数字id,"你连门派都没有啊#24")
				return
			end
			sqmz = 门派神器名称[玩家数据[数字id].角色.门派]
			添加最后对话(数字id,"或许你可以看看#G我们以前走过的路#W...或许能发现一些蛛丝马迹。这东西就交给你了...虽然破损了，但是要珍惜啊，谁知道什么时候，它又会绽放力量。",{"接受神器“"..sqmz.."”！","我需要再磨炼自己。"})
		elseif 事件=="我要改变神器的力量" then

           玩家数据[数字id].神器:切换神器技能(数字id)

		elseif sqmz and 事件=="接受神器“"..sqmz.."”！" then
			if 玩家数据[数字id].角色.等级>=109 then
				玩家数据[数字id].神器:添加神器(数字id)
			else
				添加最后对话(数字id,"需要等级达到109级方可领取。")
			end
		end
	end
end