-- @Author: baidwwy
-- @Date:   2024-05-23 06:02:27
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-11 00:07:10
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:48:20
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-24 13:09:21
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1208]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号==1 then
			wb[1] = "正赶上这太平盛世，我看手下那几个兵挺闲的，哪天让它们背诵抄写下那些军令条例#18"
			wb[2] = "前日国王说想把金圣宫娘娘住的昭阳宫修缮一下，我得查查黄道良辰，好择日开工。"
			wb[3] = "自打国王失去金圣宫娘娘，连这朱紫国的天下都不要了#14"
			if f函数.读配置(程序目录..[[data\]]..玩家数据[数字id].账号..[[\账号信息.txt]],"账号配置","管理") == "1" then
			    xx={"打开管理器","设置物品出售表"}
			end
			return {"校尉","朱紫校尉",wb[取随机数(1,#wb)],xx}
	elseif 编号==2 then
			wb[1] = "是药三分毒，身体有恙，不可不吃药，也不可乱吃，一定要对症下药，方能药到病除。"
			local xx={"购买","我什么都不想做"}
			return {"男人_苦力","药店伙计",wb[取随机数(1,#wb)],xx}
	elseif 编号==3 then
			wb[1] = "朱紫国旁边就是麒麟山，山势险峻，怪石嶙峋，据说还有妖怪出没#35不过那里盛产珍奇药草#80"
			wb[2] = "神仙看病也须得先望闻问切，然后再配上老夫的灵丹妙药，保准药到病除。"
			wb[3] = "冬吃萝卜夏吃姜，不劳医生开药方。这位少侠请多多学习下养生之道！	"
			return {"男人_药店老板","紫阳药师",wb[取随机数(1,#wb)],xx}
	elseif 编号==4 then
			wb[1] = "听说西梁女国开了个挂毯商店，吸引了那些图新鲜的人。怪不得我的生意每况愈下#52"
			wb[2] = "如今人人家里都用上白虎皮了，我这手编的波斯地毯如何才能卖得出去啊#47"
			wb[3] = "苦恨年年压金线，为他人作嫁衣裳#24"
			return {"女人_王大嫂","端木娘子",wb[取随机数(1,#wb)],xx}
	elseif 编号==5 or 编号==6 then
			wb[1] = "行走江湖，安全第一。少侠到了大唐境外可要小心别被老虎给吃了#47"
			wb[2] = "等咱当了校尉，想吃香的吃香的，想喝辣的喝辣的。豆浆买两碗，喝一碗，倒一碗！#28"
			wb[3] = "近日校尉让我们严加防范，说是有可疑人在附近出没。可是我一个眼睛瞪成两个大，都没有看到#24"
			return {"校尉","朱紫侍卫",wb[取随机数(1,#wb)],xx}
	elseif 编号==7 then
			wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
			local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
			return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	elseif 编号==8 then
		wb[1] = "我可以送你去仙缘洞天"
		local xx = {"送我去仙缘洞天","我什么也不干"}
		return{"男人_村长","申太公",wb[取随机数(1,#wb)],xx}
	elseif 编号==9 then
  		wb[1] = "“千丈虹桥望入微，天光云影共楼飞。”唐王为天下英雄设下闯关竞技平台，欢迎能人志士一展拳脚！"
  		xx = {"我来报名","我要参加活动，请送我入场","我来领取活动称谓","哎呀，肚子疼，先上个茅房","","我想了解这个活动","我来取消任务"}
  		return {"男人_兰虎","彩虹大使",wb[取随机数(1,#wb)],xx}
	elseif 编号==13 then
		wb[1] = "朱紫国虽然地方不大，但物产丰富，尤其是我们这里的美食独具一格，颇受大唐人民的喜爱，在我这里做学徒就可以获得博大精深的异域烹饪食谱"
		local xx = {"请师傅吩咐","我要获得食谱","上交烹饪换取材料","我来借厨房做点烹饪","我对做饭没什么兴趣哦"}
		return{"男人_酒店老板","酒店老板",wb[取随机数(1,#wb)],xx}
	elseif 编号==14 then
		wb[1] = "这是哪里来的小孩子?怎么没有和家里的大人在一起﹖难道是迷路了"
		local xx = {"我要开启四季副本","我只是一个路过的"}
		if 玩家数据[数字id].角色:取任务(650)~=0 then
			wb[1]="你的副本已经开启了，是否需要我帮你传送进去？"
			xx={"请送我进去","我等会再进去"}
		 end
		return{"小桃红","豆蔻囡囡",wb[取随机数(1,#wb)],xx}
	end
	return
end

__NPCdh222[1208 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 名称=="药店伙计" then
		if 事件=="购买" then
			玩家数据[数字id].商品列表=商店处理类.商品列表[17]
			发送数据(id,9,{商品=商店处理类.商品列表[17],银子=玩家数据[数字id].角色.银子})
		end
	elseif 名称=="彩虹大使" then
		彩虹争霸:对话事件处理(数字id,名称,事件)
		return
	elseif 名称=="申太公" then
		if 事件=="送我去仙缘洞天" then
			地图处理类:跳转地图(数字id,1216,213,60)
		end
	elseif 名称=="朱紫校尉" then
		if 事件=="打开管理器" then
			发送数据(id,6566,QJHDSJ)
		elseif 事件=="设置物品出售表" then
			添加最后对话(数字id,"请先确定你客户端有#G【回收设置】#W这个文件。否则设置不会生效。",{"确定更新回收物品表","我点错了"})
		end
	elseif 名称=="酒店老板" then
		if 事件=="请师傅吩咐" then
			设置任务16(数字id)
		elseif 事件=="我要获得食谱" then
			玩家数据[数字id].商品列表=商店处理类.商品列表[43]
			发送数据(id,9,{商品=商店处理类.商品列表[43],银子=玩家数据[数字id].角色.秘制积分,类型="秘制积分"})
		elseif 事件=="上交烹饪换取材料" or 事件=="继续上交烹饪换取材料"  then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="上交烹饪换取材料"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
		elseif 事件=="我来借厨房做点烹饪"  or 事件=="继续烹饪" then
			local lsb = {}
			for k,v in pairs(玩家数据[数字id].角色.秘制食谱.食谱) do
				table.insert(lsb,k)
			end
			添加最后对话(数字id,"你可以用厨房来制作秘制烹饪",lsb)
		elseif 秘制食谱消耗()[事件] ~= nil then
			local lssj = 秘制食谱消耗()[事件]
			玩家数据[数字id].最后操作=事件
			添加最后对话(数字id,"烹饪"..事件.."需消耗#Y"..lssj.材料.."#W材料#Y"..lssj.银子.."#W银子#Y"..lssj.活力.."#W活力。剩余材料：#Y"..玩家数据[数字id].角色.秘制食谱.材料.."#W剩余次数：#Y"..玩家数据[数字id].角色.秘制食谱.食谱[事件].次数,{"开始烹饪1次","开始烹饪5次","开始烹饪10次","我什么也不干"})
		elseif 事件=="开始烹饪1次" then
			local lssj = 秘制食谱消耗()[玩家数据[数字id].最后操作]
			if 玩家数据[数字id].角色.秘制食谱.材料 > lssj.材料 and 玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数 > 1 and 玩家数据[数字id].角色:扣除银子(lssj.银子,0,0,"秘制烹饪") and 玩家数据[数字id].角色.活力 > lssj.活力 then
				玩家数据[数字id].角色.秘制食谱.材料=玩家数据[数字id].角色.秘制食谱.材料-lssj.材料
				玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数=玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数-1
				玩家数据[数字id].角色.活力 = 玩家数据[数字id].角色.活力-lssj.活力
				玩家数据[数字id].道具:给予道具(数字id,玩家数据[数字id].最后操作,nil,qz(玩家数据[数字id].角色:取生活技能等级("烹饪技巧") *(取随机数(8,12)/10)))
				玩家数据[数字id].最后操作 = nil
				添加最后对话(数字id,"烹饪成功获得了1个"..事件,{"继续烹饪","告辞"})
			else
			    	添加最后对话(数字id,"你没有足够的材料和银两无法进行烹饪")
			end
		elseif 事件=="开始烹饪5次" then
			local lssj = 秘制食谱消耗()[玩家数据[数字id].最后操作]
			if 玩家数据[数字id].角色.秘制食谱.材料 > lssj.材料*5 and 玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数 > 5 and 玩家数据[数字id].角色:扣除银子(lssj.银子*5,0,0,"秘制烹饪") and 玩家数据[数字id].角色.活力 > lssj.活力*5 then
				for i=1,5 do
					玩家数据[数字id].角色.秘制食谱.材料=玩家数据[数字id].角色.秘制食谱.材料-lssj.材料
					玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数=玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数-1
					玩家数据[数字id].角色.活力 = 玩家数据[数字id].角色.活力-lssj.活力
					玩家数据[数字id].道具:给予道具(数字id,玩家数据[数字id].最后操作,5,qz(玩家数据[数字id].角色:取生活技能等级("烹饪技巧") *(取随机数(8,12)/10)))
				end
				玩家数据[数字id].最后操作 = nil
				添加最后对话(数字id,"烹饪成功获得了5个"..事件,{"继续烹饪","告辞"})
			else
			    	添加最后对话(数字id,"你没有足够的材料和银两无法进行烹饪")
			end
		elseif 事件=="开始烹饪10次" then
			local lssj = 秘制食谱消耗()[玩家数据[数字id].最后操作]
			if 玩家数据[数字id].角色.秘制食谱.材料 > lssj.材料*10 and 玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数 > 10 and 玩家数据[数字id].角色:扣除银子(lssj.银子*10,0,0,"秘制烹饪") and 玩家数据[数字id].角色.活力 > lssj.活力*10 then
				for i=1,10 do
					玩家数据[数字id].角色.秘制食谱.材料=玩家数据[数字id].角色.秘制食谱.材料-lssj.材料
					玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数=玩家数据[数字id].角色.秘制食谱.食谱[玩家数据[数字id].最后操作].次数-1
					玩家数据[数字id].角色.活力 = 玩家数据[数字id].角色.活力-lssj.活力
					玩家数据[数字id].道具:给予道具(数字id,玩家数据[数字id].最后操作,10,qz(玩家数据[数字id].角色:取生活技能等级("烹饪技巧") *(取随机数(8,12)/10)))
				end
				玩家数据[数字id].最后操作 = nil
				添加最后对话(数字id,"烹饪成功获得了10个"..事件,{"继续烹饪","告辞"})
			else
			    	添加最后对话(数字id,"你没有足够的材料和银两无法进行烹饪")
			end
		end
	elseif 名称=="豆蔻囡囡" then
		if 事件=="我要开启四季副本" then
			-- 设置任务650(数字id)
		elseif 事件=="请送我进去" then
			任务处理类:副本传送(数字id,6)
		end
	end
end