-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-13 12:09:21
-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-09-01 17:08:10
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-15 12:07:48
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1501]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		xx = {"我要更换现在的宠物","我来兑换圣兽丹","我什么都不想做","","我想更换召唤兽装饰品的颜色","我要切换进阶召唤兽的造型","我要自定义宝宝造型"}
		return{"普陀山_接引仙女","宠物仙子","你可以在这里更换携带的#Y宠物#W，宠物可以在战斗中捕捉召唤兽和控制多只召唤兽为你作战。",xx}
	elseif 编号 == 2 then
		wb[1] = "好消息！最近老夫请到了京城梨园的名角来献艺，机会难得，各位千万不要错过了！"
		wb[2] = "听戏可是人生的一大乐趣啊~#51"
		wb[3] = "我们是远近闻名的草台班子，南腔北调昆腔越剧流行歌曲你想听什么都有"
		wb[4] = "真是太平盛世啊，老百姓衣食无忧，闲暇时间还是多听听戏吧。"
		wb[5] = "一到戏台开演的日子，建邺城总是万人空巷。"
		return{"男人_老伯","戏班班主",wb[取随机数(1,#wb)]}
	elseif 编号 == 3 then
		wb[1] = "如果说我现在说的是假话，你相信么？"
		wb[2] = "周猎户最喜欢和我拉家常了，他家就住在药店边上。"
		wb[3] = "嘘――千万不要告诉他们我爱吹牛啊，这会影响我的形象的！"
		wb[4] = "人生最痛快的事情莫过于和周猎户一起喝点小酒了！"
		wb[5] = "天上有只牛在飞，一定是我在地上吹。"
		return{"男人_苦力","吹牛王",wb[取随机数(1,#wb)]}
	elseif 编号 == 4 then
		return{"女人_赵姨娘","游戏推广员","你可以在我这里领取推广奖励哟。同时由管理员赠送的银子和储备也可以在我这里领取哟。",{"领取推广奖励","领取补偿奖励奖励","查询仙玉"}}
	elseif 编号 == 5 then
		wb[1] = "上面粉蒸出来的包子，客官想要几个。"
		wb[2] = "建邺虽小，可样样齐全，什么都有#2货栈边上那个王大嫂做的烤鸭真是好吃。"
		wb[2] = "包子有肉不在褶上,肚里有货不在嘴上。"
		local xx = {"购买","我什么也不想做"}
		return{"小孩_飞儿","飞儿",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 6 then
		wb[1] = "我的工作就是收取厌倦尘世生活的玩家性命，如果你不再留恋这个美好的世界，你的一切都将在我这里终结，请认真做出你的选择，你的朋友、亲人将再也见不到你，你永远只存在他们的记忆当中"
		local xx = {"我已经想清楚了","我保留意见"}
		return{"马面","勾魂马面",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 7 then
		wb[1] = "城北的海岸常有大风浪，岸边那艘沉船，也不知道是哪个年月遇到大风浪沉在那里的"
		wb[2] = "我丈夫出海死了，现在我也只好出来摆摊赚钱养活我那个两个孩子"
		wb[3] = "飞儿可真是个懂事的孩子，年纪轻轻就挑起了全家的重担。"
		wb[4] = "瞧一瞧！看一看！新鲜出炉的烤鸭！#51"
		wb[5] = "听过京城的人说，城里到处是亭台楼阁，红砖绿瓦，连皇上都住在那儿，真想去见识一下"
		wb[6] = "在我这里你可以学习烤鸭技巧，学会如何烹饪烤鸭之后你购买一只未煮熟的烤鸭，进行烹饪，烹饪之后的烤鸭不仅可以食用还可以500两银子出售给我"
		wb[7] = "无鸭不成席。来到建邺，你可一定得尝尝我家的烤鸭！"
		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="王大嫂" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="王大嫂" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"女人_王大嫂","王大嫂",wb[1],xx}
		end
		return{"女人_王大嫂","王大嫂",wb[取随机数(1,#wb)]}
	elseif 编号 == 8 then
		wb[1] = "我在收购附近的海产，什么大海龟、巨蛙、海毛虫之类的都收#R/（警告：请将不出售的海产召唤兽设置为参战状态）"
		local xx = {"我卖大海龟（250两银子/只或者300两储备金/只）给你","我卖巨蛙（350两银子/只或者400两储备金/只）给你","我卖海毛虫（500两银子/只或者600两储备金/只）给你","没什么，我只是看看"}
		return{"男人_钓鱼","海产收购商",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 9 then
		wb[1] = "几年前一次台风，这里沉了不少船，东海湾那里常年有个旋涡，沉掉的船都在下面。要下沉船，从海边的旋涡那潜下去即可。"
		wb[2] = "要下沉船，从海边的旋涡那潜下去即可。"
		wb[3] = "这几年风调雨顺，老百姓的日子过得都很富足，只是城外野兽横行，常有外出的百姓受到骚扰。"

		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="老孙头" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="老孙头" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"男人_老孙头","老孙头",wb[1],xx}
		end
		return{"男人_老孙头","老孙头",wb[取随机数(1,#wb)]}
	elseif 编号 == 10 then
		wb[1] = "这建邺小城真是风景如画。"
		wb[2] = "十级以下的新人我可以为你免费治疗伤势。"
		wb[3] = "我是行走江湖的郎中，治病救人是我份内之事。"
		wb[4] = "我是建邺城最精通医药之术的人。"
		wb[5] = "少肉多菜，少烦多眠，少欲多施，方能长寿。"
		local xx = {"快些治疗我吧","我点错了"}
		return{"男人_药店老板","陈长寿",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 11 then
		wb[1] = "我没事就去长安书店给颜如羽打工，出体力赚钱一点都不难。"
		wb[2] = "昨天我去长安商会总管那，妈呀，东西多到开天眼都看不过来了"
		return{"小孩_飞儿","罗招弟",wb[取随机数(1,#wb)]}
	elseif 编号 == 12 then
		wb[1] = "驱鬼除妖测字算命啦，前算五百年，后算五百年。"
		wb[2] = "这位朋友面带福相，印堂发亮，想是遇到什么喜事了吧。"
		wb[3] = "我就是英俊潇洒玉树临风嫉恶如仇斩妖除魔的方寸第一道士牛大胆！#51"
		wb[4] = "城里的渔夫出海打渔之前，都爱到我这里算上一卦。"
		wb[5] = "求神问卦，看人说话。这位你可要来让我瞧瞧？"
		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="牛大胆" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="牛大胆" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"男人_道士","牛大胆",wb[1],xx}
		end
		return{"男人_道士","牛大胆",wb[取随机数(1,#wb)],nil}
	elseif 编号 == 13 then
		wb[1] = "我收购一切装备，直接给我就可以估价了。"
		local xx = {"出售","我什么都不想做"}
		return{"男人_苦力","装备收购商",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 14 then
		wb[1] = "我鉴定一切武器，按物品收费，你自己给予给我就好了。（#R/鉴定价格为正常价格的10%#W/）"
		local xx = {"给予","我什么都不想做"}
		return{"男人_苦力","装备鉴定商",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 15 then
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
		return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 16 then
		wb[1] = "建邺虽然小，可是什么都不缺。"
		wb[2] = "前几天去了趟长安城，城里的过往客商可真多。"
		wb[3] = "建邺的风景还不错吧。"
		wb[4] = "老孙头最近好象有什么心事的样子，整天皱着个眉头在自言自语。"
		wb[5] = "俗话说无奸不商，如今像我这样清白做生意的商人可真是少见了啊#17"
		wb[6] = "建邺城可谓麻雀虽小，五脏俱全。长安城有的，你在这都能找到#43"
		return{"男人_老伯","赵元宝",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 17 then
		wb[1] = "面对世俗偏见，有情人终成眷属真的不容易#52"
		wb[2] = "货栈边上那个王大嫂做的烤鸭真是好吃"
		wb[3] = "又过冬了，得为咱家孩子添置几件棉袄了"
		wb[4] = "听说最近长安城集市热闹的很，过几天可要去看看"
		wb[5] = "听说东海里有数不尽的宝贝……"
		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="小花" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="小花" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"普陀山_接引仙女","小花",wb[1],xx}
		end
		return{"普陀山_接引仙女","小花",wb[取随机数(1,#wb)]}
	elseif 编号 == 18 and 页数 == nil then
		wb[1] = "最近有些事情忙不过来了，你愿意帮我分担一点吗？"
		local xx = {"我来领取赏金任务","我只是看看"}
		return{"男人_衙役","赵捕头",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 19 then
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
		return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 20 then
		wb[1] = "最近常有鬼鬼祟祟的家伙在门口探头探脑#35，我们镖局可不要这种来路不正的生意。"
		return{"男人_镖头","张来福",wb[取随机数(1,#wb)]}
	elseif  编号 == 21 then
		wb[1] = "找我干嘛呢？"
		local xx = {"交易","只是路过"}
		return{"男人_特产商人","建邺特产商人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 22 then
		wb[1] = "听说这里有动物的毛能治小儿惊风，此次我是特地来这收购货物的。"
		wb[2] = "我是专门走南闯北倒卖货物的商人。"
		wb[3] = "求老天保佑，早日除去城外的野兽，免得我们出城还要提心吊胆。"
		wb[4] = "衙门里的简师爷平日深居简出，低调得很。"
		wb[5] = "您要点什么，下次我给您带来。"
		wb[6] = "衙天南地北的特产我这都有，就连地府的东西我也能搞到。"
		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="马全有" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="马全有" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"男人_武器店老板","马全有",wb[1],xx}
		end
		return{"男人_武器店老板","马全有",wb[取随机数(1,#wb)]}

	elseif 编号 == 23 then
		wb[1] = "善哉善哉，佛祖有云：“一人出家，全家光荣”，这位施主看似颇有慧根，应该及早皈依我佛门才是啊。"
		wb[2] = "不知上次赵捕头有没有记得帮我替我带香烛回来。"
		wb[3] = "师傅常说，“心静则万事静，心清则万事清”，我特地到这个清静的小城来体验生活。"
		wb[4] = "不要问我从何而来，我站在这就是神仙一样的存在。"
		wb[5] = "和尚越老越值钱#18"
		return{"男人_胖和尚","迎客僧",wb[取随机数(1,#wb)]}
	elseif 编号 == 24 then
		wb[1] = "这是李老爷的府上，在这个小城里，我们老爷可是知名度最高的人了。"
		wb[2] = "我家老爷最近病的厉害，医生怎么查也查不出是什么原因。"
		wb[3] = "当个管家也不容易呀，每天忙里忙外，什么杂七杂八的事情都得打点。"
		wb[4] = "人说做一次善事容易，做一辈子善事就难咯，在这点上我是万分钦佩我家老爷的。"
		wb[5] = "建邺城啥时才能开个长安城那样的赌坊呢#80"
		local 任务id
		if 玩家数据[数字id].角色:取任务(301)~=0 or 玩家数据[数字id].角色:取任务(302)~=0 then --青龙玄武
			wb={"你找我有什么事情吗？"}
			xx={}
			任务id= 玩家数据[数字id].角色:取任务(301)
			if 任务id~=0 and 任务数据[任务id].人物=="管家" then
				xx[#xx+1] = "青龙任务"
			end
			任务id= 玩家数据[数字id].角色:取任务(302)
			if 任务id~=0 and 任务数据[任务id].人物=="管家" then
				xx[#xx+1] = "玄武任务"
			end
			xx[#xx+1] = "没什么，我只是看看"
			return {"男人_店小二","管家",wb[1],xx}
		end
		return{"男人_店小二","管家",wb[取随机数(1,#wb)]}
	elseif 编号 == 25 then
		wb[1] = "最近天气很好，海上没有大风浪。"
		wb[2] = "城外东海湾附近常有怪物出没，路过那里可要小心。"
		wb[3] = "咱家李善人老爷最近身体不适，我得去药店寻个方子。"
		wb[4] = "听说戏班老板请了京城的梨园弟子前来献艺，一定得去捧个场。"
		return{"男人_兰虎","符全",wb[取随机数(1,#wb)]}
	elseif 编号 == 26 then
		wb[1] = "天天在这边看门真是没意思，我也渴望刺激的生活。"
		wb[2] = "前面就是江南野外了，没有实力可不要硬闯，小心被野兽吃的骨头都不剩！"
		local xx = {"传送江南野外","我只是路过"}
		return{"男人_衙役","建邺守卫",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 27 then
		wb[1] = "城里有位好心的郎中陈长寿，给新人看病从不收银子。他一般都在去东海湾的城门口附近摆摊看病。"
		wb[2] = "我经常去找宠物仙子姐姐玩，她那里有好多可爱的小动物，上次还送了我一只做宠物呢#43"
		wb[3] = "城里什么都好，就是小伙伴太少。想去江南野外玩，妈妈又不让，说那里的怪物太凶，没一定的修为去了很危险。"
		wb[4] = "人之初，性本善，性相近，习相远。教书先生今天教的三字经，我一定得背熟。 "
		wb[5] = "建邺城里最好吃的就是马氏酸枣了#89"
		return{"小孩_雷黑子","雷黑子",wb[取随机数(1,#wb)]}
	elseif 编号 == 28 then
			wb[1] = "我是城里的教书先生，如果你不清楚接下来做些什么，我可以给你一些建议。"
			wb[2] = "黑发不知勤学早，白首方悔读书迟。少侠可不要荒废了学业！"
			wb[3] = "在我教过的学生里，雷黑子是最刻苦上进的一个。"
			return{"男人_书生","教书先生",wb[取随机数(1,#wb)]}
	elseif 编号 == 29 then
      wb[1] = "各位观众看过来，老夫擅长土木之术，制造的仓库坚固耐用又便宜，为促销现在可赠送你一个免费物品仓库，还可以租借召唤兽仓库，用过觉得好再来光顾老夫，多租借几个吧。"
      local xx={"我要进行仓库操作","离开"}
      return {"仓库保管员","仓库管理员",wb[取随机数(1,#wb)],xx}
    elseif 编号 == 30 then
		local xx = {"别废话，我是来买票的","这玩意有什么用","我想看的“如梦奇谭”本周没有，这可怎么办","没兴趣，路人而已"}
		return{"小孩_飞儿","梨园小贩","嘘，小声点，我这里卖的戏票可是从特殊渠道搞到的，你们不要太高调哦#99",xx}
    elseif 编号 == 31 then
    	local xx = {"我来开启“奇谭”任务","继续进行“奇谭”任务","查看本周戏班剧目","没有戏票怎么办呀","路过"}
    	return{"酒仙","癫散班主","半生潦倒，一事无成。幸得浮生乱世，不独我一个，大梦荒唐!",xx}
    end
	return
end

__NPCdh222[1501]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
	if 名称=="宠物仙子" then
		if 事件=="我要更换现在的宠物" then
			发送数据(id,6)
		elseif 事件=="我来兑换圣兽丹" then
			添加最后对话(数字id,"我这有玄天灵力铸造而成的圣兽丹可以兑换，凑齐玄天卷法上中下三卷可以在我这里兑换一颗圣兽丹。",{"我已经凑齐","我还没有凑齐"})
		elseif 事件=="我已经凑齐" then
			if 玩家数据[数字id].道具:判定背包道具(数字id,"玄天残卷·上卷",1) and 玩家数据[数字id].道具:判定背包道具(数字id,"玄天残卷·中卷",1) and 玩家数据[数字id].道具:判定背包道具(数字id,"玄天残卷·下卷",1) then
			    添加最后对话(数字id,"确定兑换一颗圣兽丹吗？",{"我要兑换！","取消"})
			    玩家数据[数字id].最后操作="兑换圣兽丹"
			else
			    添加最后对话(数字id,"你没有凑齐，无法兑换。")
			end
		elseif 事件=="我要兑换进阶召唤兽的饰品" then
			添加最后对话(数字id,"我可以帮您转换进阶前后的召唤兽饰品哦。#17",{"快帮我兑换吧！","取消"})
		elseif 事件=="快帮我兑换吧！" then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="转换召唤兽饰品"}
			发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="宠物仙子",类型="NPC",等级="无"})
		elseif 事件=="我想更换召唤兽装饰品的颜色" then
			if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要更换的宝宝参战！")
			    return
			end
			if 玩家数据[数字id].角色.参战宝宝.饰品 then
				添加最后对话(数字id,"装饰颜色每次更换需支付100W银子作为手续费哦#17",{"随机颜色","恢复默认","取消"})
			else
				添加最后对话(数字id,"你没有召唤兽装饰，无法更换颜色")
			    return
			end
		elseif 事件=="随机颜色" or 事件=="恢复默认" then
			local 编号=玩家数据[数字id].召唤兽:取编号(玩家数据[数字id].角色.参战宝宝.认证码)
			if 编号~=0 and 玩家数据[数字id].召唤兽.数据[编号] and 玩家数据[数字id].召唤兽.数据[编号].饰品 then
				if 玩家数据[数字id].角色:扣除银子(1000000,0,0,"饰品染色") then
					if 事件=="随机颜色" then
					    local ysb = {0xFFFF0000,0xFF0000FF,0xFFFCFF00,0xFF24FF00,0xFFDE00FF,0xFF00FFD3}
					    if 玩家数据[数字id].召唤兽.数据[编号].饰品颜色~=nil then
					        for i=1,6 do
					        	if ysb[i]==玩家数据[数字id].召唤兽.数据[编号].饰品颜色 then
					        	    table.remove(ysb, i)
					        	end
					        end
					    end
					    常规提示(数字id,"召唤兽装饰品染色成功！")
						玩家数据[数字id].召唤兽.数据[编号].饰品颜色 = ysb[取随机数(1,#ysb)]
					    发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
					elseif 事件=="恢复默认" then
						玩家数据[数字id].召唤兽.数据[编号].饰品颜色 = nil
						发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
						常规提示(数字id,"恢复成功！")
					    -- 发送数据(id,6556,{bb=玩家数据[数字id].召唤兽.数据[编号],rzm=玩家数据[数字id].召唤兽.数据[编号].认证码})
					end
				end
			else
			    添加最后对话(数字id,"你没有召唤兽装饰，无法更换颜色")
			    return
			end
		elseif 事件=="我要切换进阶召唤兽的造型" then
			if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要切换的宝宝参战！")
			    return
			end
			if 玩家数据[数字id].角色.参战宝宝.进阶 and 玩家数据[数字id].角色.参战宝宝.进阶.灵性>=50 then
				添加最后对话(数字id,"切换宝宝造型需要支付500W两银子作为手续费，少侠可要考虑好了。",{"我想好了，帮我切换吧！","取消"})
			else
			    添加最后对话(数字id,"少侠您的召唤兽好像无法转换造型。")
			end
		elseif 事件=="我要自定义宝宝造型" then
			添加最后对话(数字id,"自定义宝宝造型，每次需支付1000W两银子作为手续费，少侠可要考虑好了。",{"我想好了，开始吧！","取消"})
        elseif 事件=="我想好了，开始吧！" then
        	if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要自定义的宝宝参战！")
			    return
			end
			-- if 玩家数据[数字id].角色.参战宝宝.种类~="神兽" then
			-- 	添加最后对话(数字id,"只要神兽才可以进行切换哦")
			--     return
			-- end
			发送数据(id,68)
		elseif 事件=="我想好了，帮我切换吧！" then
			if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要切换的宝宝参战！")
			    return
			end
			local 编号=玩家数据[数字id].召唤兽:取编号(玩家数据[数字id].角色.参战宝宝.认证码)
			if 编号~=0 and 玩家数据[数字id].召唤兽.数据[编号] and 玩家数据[数字id].召唤兽.数据[编号].进阶 and 玩家数据[数字id].角色.参战宝宝.进阶.灵性>=50 then
				if 玩家数据[数字id].召唤兽.数据[编号].饰品~=nil then
					添加最后对话(数字id,"请先卸下召唤兽饰品！")
				    return
				end
				if string.find(玩家数据[数字id].召唤兽.数据[编号].模型,"进阶")~=nil then
					if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"切换宝宝造型") then
					    玩家数据[数字id].召唤兽.数据[编号].模型=string.gsub(玩家数据[数字id].召唤兽.数据[编号].模型,"进阶","")
					    发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
						添加最后对话(数字id,"恭喜你的召唤兽获得了新的形态！")
					end
				else
					local mx="进阶"..玩家数据[数字id].召唤兽.数据[编号].模型
					local go=false
					if 取进阶表(mx) then
						go=true
					end
					if go then
						if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"切换宝宝造型") then
							玩家数据[数字id].召唤兽.数据[编号].模型=mx
							发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
							添加最后对话(数字id,"恭喜你的召唤兽获得了新的形态！")
						end
					else
						添加最后对话(数字id,"#17少侠，该进阶召唤兽造型未开放哦")
					end
				end
			else
				添加最后对话(数字id,"少侠您的召唤兽好像无法转换造型。")
			end
		end
    elseif 名称=="杂货购买员" then
       	if 事件=="购买90书(150W银两)" then
          if 玩家数据[数字id].角色:扣除银子(1500000,0,0,"购买90制铁") then
             玩家数据[数字id].道具:给予道具(数字id,"制造指南书",{9,9})
          end
        elseif 事件=="购买90铁(150W银两)" then
          if 玩家数据[数字id].角色:扣除银子(1500000,0,0,"购买90制铁") then
             玩家数据[数字id].道具:给予道具(数字id,"百炼精铁",{9,9})
          end
        elseif 事件=="购买100书(200W银两)" then
          if 玩家数据[数字id].角色:扣除银子(2000000,0,0,"购买100制铁") then
            玩家数据[数字id].道具:给予道具(数字id,"制造指南书",{10,10})
          end
        elseif 事件=="购买100铁(200W银两)" then
          if 玩家数据[数字id].角色:扣除银子(2000000,0,0,"购买100制铁") then
            玩家数据[数字id].道具:给予道具(数字id,"百炼精铁",{10,10})
          end
        elseif 事件=="购买110书(251W银两)" then
          if 玩家数据[数字id].角色:扣除银子(2510000,0,0,"购买110制铁") then
            玩家数据[数字id].道具:给予道具(数字id,"制造指南书",{11,11})
          end
        elseif 事件=="购买110铁(251W银两)" then
          if 玩家数据[数字id].角色:扣除银子(2510000,0,0,"购买110制铁") then
            玩家数据[数字id].道具:给予道具(数字id,"百炼精铁",{11,11})
          end
        elseif 事件=="购买120书(400W银两)" then
          if 玩家数据[数字id].角色:扣除银子(4000000,0,0,"购买120制铁") then
            玩家数据[数字id].道具:给予道具(数字id,"制造指南书",{12,12})
          end
        elseif 事件=="购买120铁(400W银两)" then
          if 玩家数据[数字id].角色:扣除银子(4000000,0,0,"购买120制铁") then
            玩家数据[数字id].道具:给予道具(数字id,"百炼精铁",{12,12})
          end
        end
    elseif 名称=="建邺守卫" then
        if 事件=="传送江南野外" then
          if 取等级要求(数字id,10)==false then
            发送数据(玩家数据[数字id].连接id,1501,{名称="建邺守卫",模型="男人_衙役",对话="你或队伍中有玩家等级尚未达到10级，无法使用此传送功能。"})
            return
          elseif 取队长权限(数字id) then
            地图处理类:跳转地图(数字id,1193,149,65)
          end
        end
    elseif 名称=="赵捕头" then
        if 事件=="我来领取赏金任务" then
          if 玩家数据[数字id].角色:取任务(6)~=0 then
            发送数据(玩家数据[数字id].连接id,1501,{名称="赵捕头",模型="男人_衙役",对话="你已经领取过赏金任务了#24"})
            return
          -- elseif 玩家数据[数字id].角色.等级>=30 then
          --   发送数据(玩家数据[数字id].连接id,1501,{名称="赵捕头",模型="男人_衙役",对话="只有30级及以下的玩家才可领取赏金任务，你就不要来捣乱了#4"}) --测试模式
          --   return
          end
          设置任务6(数字id)
        end
    elseif 名称=="飞儿" then
        if 事件=="购买" then
          玩家数据[数字id].商品列表=商店处理类.商品列表[9]
          发送数据(id,9,{商品=商店处理类.商品列表[9],银子=玩家数据[数字id].角色.银子})
        end
    elseif 名称=="陈长寿" then
        if 事件=="快些治疗我吧" then
          if 玩家数据[数字id].角色.等级<=15 then
            玩家数据[数字id].角色:刷新信息("1")
            添加最后对话(数字id,"已帮你的角色恢复至最佳状态。")
          else
            添加最后对话(数字id,"我这里只能治疗十五级以下的玩家哟。")
          end
        end
    elseif 名称=="装备收购商" then
        if 事件=="出售" then
          玩家数据[数字id].给予数据={类型=1,id=0,事件="装备出售"}
          发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC",等级="无"})
        end
    elseif 名称=="梨园小贩" then
        if 事件=="别废话，我是来买票的" then
        	发送数据(id,304,{积分=玩家数据[数字id].角色.副本积分,价格={150,200,150}})
        end
    elseif 名称=="癫散班主" then
		if 事件=="我来开启“奇谭”任务" then
			if 玩家数据[数字id].队伍==0 or 玩家数据[数字id].队长==false  then
				常规提示(数字id,"#Y/该任务必须组队完成且由队长领取")
				return
			elseif 取队伍人数(数字id)<5 and 调试模式==false then
				常规提示(数字id,"#Y此副本要求队伍人数不低于5人")
				return
			elseif  取等级要求(数字id,50)==false then
				常规提示(数字id,"#Y此副本要求角色等级不能低于50级")
				return
			end
			local msg = {}
			for i=1,#队伍数据[玩家数据[数字id].队伍].成员数据 do
				local lsid = 队伍数据[玩家数据[数字id].队伍].成员数据[i]
				msg[i] = {id=lsid,名称=玩家数据[lsid].角色.名称,戏票={0,0,0}}
				local lsdj = 玩家数据[lsid].道具:索要道具1(lsid)
				for j=1,#lsdj.道具 do
					if lsdj.道具[j] and lsdj.道具[j].名称 then
					    if lsdj.道具[j].名称 == "癫散戏票·一斛珠" then
							msg[i].戏票[1] = 1
						elseif lsdj.道具[j].名称 == "癫散戏票·五更寒" then
							msg[i].戏票[2] = 1
						elseif lsdj.道具[j].名称 == "癫散戏票·双城记" then
							msg[i].戏票[3] = 1
						end
					end
				end
			end
			发送数据(id,305,msg)
		elseif 事件=="继续进行“奇谭”任务" then
			if 玩家数据[数字id].角色:取任务(670) ~= 0 then
				任务处理类:副本传送(数字id,8)
			elseif 玩家数据[数字id].角色:取任务(690) ~= 0  then
				任务处理类:副本传送(数字id,9)
			elseif 玩家数据[数字id].角色:取任务(800) ~= 0  then
				任务处理类:副本传送(数字id,10)
			else
				添加最后对话(数字id,"#Y/你尚未开启此副本")
			end
		elseif 事件 == "正等着这一刻哪！（一斛珠）" then
			-- local zhouji=tonumber(os.date("%w", os.time()))
			-- if zhouji==1  or zhouji==3  then
			副本_一斛珠:开启副本(数字id)
			-- else
   --           添加最后对话(数字id,"此副本每周一和周三开启。")
        --    end
		elseif 事件 == "正等着这一刻哪！（五更寒）" then
			-- local zhouji=tonumber(os.date("%w", os.time()))
			-- if zhouji==2  or zhouji==4  then
			副本_五更寒:开启副本(数字id)
			-- else
   --           添加最后对话(数字id,"此副本每周二和周四开启。")
   --          end
		elseif 事件 == "正等着这一刻哪！（双城记）" then
			-- local zhouji=tonumber(os.date("%w", os.time()))
			-- if zhouji==3  or zhouji==5  then
			副本_双城记:开启副本(数字id)
			-- else
   --           添加最后对话(数字id,"此副本每周三和周五开启。")
   --          end
		elseif 事件=="没有戏票怎么办呀" then
			添加最后对话(数字id,"在我右边的“梨园小贩”建邺城（44，13）处问问看，有没有戏票出售。")
		end
	end
end
