-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 17:47:00
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:17
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1513]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "盘丝洞几百年的规矩，不许男人入住，连收徒也只收女弟子。"
		wb[2] = "晶晶姑娘又发脾气了，把犯了门规的小妖挂在洞外七天七夜，差点咽了气。"
		wb[3] = "金琉璃最近老带着些人类女孩进进出出的，不知道在搞什么名堂。"
		wb[4] = "我已修行了千年，为何还未成仙？"
		wb[5] = "濯垢泉乃天然温泉，是姐妹们美容养颜的好去处#97"
		return {"芙蓉仙子","女妖",wb[sj(1,#wb)]}
	elseif 编号 == 2 then
		wb[1] = "我一直想验证一下，佛光中炼成的宝物，是不是也可以用恶魔之心加以感化呢？"
		wb[2] = "我从何处而生？又要去往何处？"
		wb[3] = "为什么，为什么我总感觉冥冥之中有几个声音在耳边，而那声音又那么象我自己？"
		wb[4] = "什么？你找女儿村的小姑娘？不认识！我从未去过女儿村！！"
		return {"如意仙子","金琉璃",wb[sj(1,#wb)]}
	elseif 编号 == 3 then
		wb[1] = "雨花桥边的芦花，不知是否已经飘飞？"
		wb[2] = "我娘找不到我一定担心死了。"
		wb[3] = "这是什么地方？我怎么会在这里？"
		wb[4] = "当我站在雨花桥边，觉得非常难过，我总觉得，应该是两个人站在这里。"
		wb[5] = "村里的姐妹都被妖怪抓去害死了，我好害怕"
		return {"女人_丫鬟","栗栗儿",wb[sj(1,#wb)]}
	elseif 编号 == 4 or 编号 == 5 then
		wb[1] = "我们洞主就是人称魔界一枝花的性感又感性的美女～春十三娘"
		wb[2] = "最近总在附近发现一些人类的骸骨，不知道又是谁吃东西没清理好。"
		wb[3] = "金姑娘就喜欢在亭子那里用餐，说是那里风景好，吃东西就吃东西，还用选什么风景。"
		wb[4] = "想拜见我们洞主么？找我就对了！"
		wb[5] = "盘丝岭的夕阳远望可谓梦幻中最美的风景。"
		return {"树怪","看门小妖",wb[sj(1,#wb)]}
	elseif 编号 == 6 then
		wb[1] = "我送阁下回长安吧。"
		local xx = {"是的我要去","我还要逛逛"}
		return {"蝴蝶仙子","引路小妖",wb[sj(1,#wb)],xx}
	end
	return
end

__NPCdh222[1513]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称=="引路小妖" then
        if 事件=="是的我要去" then
          地图处理类:npc传送(数字id,1001,470,253)
        end
    end
end