-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-03 01:28:18
-- @Author: ASUS
-- @Date:   2021-03-19 22:10:42
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-05-13 22:24:43
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local 认证技能={"上古灵符","水攻","落岩","雷击","烈火","地狱烈火","奔雷咒","水漫金山","泰山压顶"}
__NPCdh111[1514]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		玩家数据[数字id].QXRZ=nil
		玩家数据[数字id].QDFSRZ=nil
		玩家数据[数字id].SQFSRZ=nil
		wb[1] = "想当年天大圣在的时候,这里是多么热闹"
		wb[2] = "年纪大了,正好闲来无事帮大圣收养些仙灵异兽,也可发挥发挥余热。"
		wb[3] = "如果你的召唤兽拥有特定的攻击系法术，我可以帮你施法将此召唤兽认证为“法宠”哦#80怎么样？要不要找我帮你呀#18"
		xx = {"认证法宠需要什么条件？","我想认证法宠","我想取消法宠认证","我再考虑一下"}
		return {"马猴","老马猴",wb[sj(1,#wb)],xx}
	elseif 编号 == 5 then
		wb[1] = "通过食用潜能果，可以将人物经验转化为潜力点。"
		xx = {"1、潜能果相关。","2、机缘相关。","3、碰巧路过而已。"}
		return{"长眉灵猴","老猕猴",wb[取随机数(1,#wb)],xx}
	end
end

__NPCdh222[1514]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	local 返回信息=nil
	if 内容[5] then
	    返回信息=内容[5]
	end
  	if 名称=="老马猴" then
  		if 事件=="我想认证法宠" then
  			if 玩家数据[数字id].角色.参战信息~=nil and 玩家数据[数字id].角色.参战宝宝 then
  				local xx={玩家数据[数字id].角色.参战宝宝.模型}
	  			xx[#xx+1]="我再考虑考虑"
	  			玩家数据[数字id].SQFSRZ=true
	  			添加最后对话(数字id,"不是每个召唤兽都可以认证法宠的哦，我想你应该知道认证法宠需要什么条件了吧！你要选择哪知召唤兽来认证“法宠”呢？",xx)
	  		else
	  			添加最后对话(数字id,"考虑清楚了吗，要认证需将该宝宝参战才行哦。")
  			end
  		elseif 事件=="认证法宠需要什么条件？" then
  			添加最后对话(数字id,"拥有“雷击、落岩、水攻、烈火、奔雷咒、泰山压顶、水漫金山、地狱烈火、上古灵符”技能的召唤兽可以认证为法宠，召唤兽经过认证后它的攻击法术将会转换成永久携带的“天赋技能”，同时还会随机给予一个技能使它的技能数量不会减少。召唤兽一旦被认证为“法宠”它的物理攻击伤害及物理攻击命中率都将会降低，如果认证后的“法宠”与金柳露、超级金柳露进行炼妖或与其它召唤兽进行合成都将会取消它的“天赋技能”。")
  		elseif 事件=="我想取消法宠认证" then
  			if 玩家数据[数字id].角色.参战信息~=nil and 玩家数据[数字id].角色.参战宝宝 then
	  			local xx={玩家数据[数字id].角色.参战宝宝.模型}
	  			xx[#xx+1]="我再考虑考虑"
	  			玩家数据[数字id].QXRZ=true--玩家数据[数字id].角色.参战宝宝.认证码
	  			添加最后对话(数字id,"什么你想反悔那之前认证的工钱我可不退还哦#17，取消法术认证后，宝宝认证技能将消失。请您选择要取消哪只召唤兽的认证？(取消认证需消耗满体力)",xx)
	  		else
	  			添加最后对话(数字id,"考虑清楚了吗，要取消认证需将该宝宝参战才行哦。")
	  		end

		else
			if 事件~="我再考虑考虑" then
				local 编号=玩家数据[数字id].角色:取参战宝宝编号()
			    if 编号~=0 and 玩家数据[数字id].召唤兽.数据[编号] and 玩家数据[数字id].角色.参战信息~=nil then
			    	if 事件==玩家数据[数字id].角色.参战宝宝.模型 then
			    	    if 玩家数据[数字id].SQFSRZ then --申请法术认证
				    		玩家数据[数字id].SQFSRZ=nil
							local 认证技能={"上古灵符","水攻","落岩","雷击","烈火","地狱烈火","奔雷咒","水漫金山","泰山压顶"}
							local 找到技能={}

					    	if 玩家数据[数字id].召唤兽.数据[编号].法术认证~=nil then
					    		添加最后对话(数字id,"你的召唤兽已经认证过“法宠”了")
							    return
							end
					    	for n=1,#玩家数据[数字id].召唤兽.数据[编号].技能 do
								for i=1,#认证技能 do
									if 认证技能[i]==玩家数据[数字id].召唤兽.数据[编号].技能[n] then
										找到技能[#找到技能+1]=玩家数据[数字id].召唤兽.数据[编号].技能[n]
									end
								end
							end
						    if #找到技能==0 then
						    	添加最后对话(数字id,"你的召唤兽没有“指定”的攻击性法术技能哦#14")
						        return
						    end
						    local 等级=玩家数据[数字id].召唤兽.数据[编号].参战等级
						    local 金钱=等级*等级*160+等级*4000
						    if 玩家数据[数字id].召唤兽.数据[编号].种类=="神兽" then
						        金钱=1000000
						    end
						    local 对话="我身子骨比较单薄，其他活已经干不动了#74只好靠这个点绝活来赚点小钱呢#17帮你认证这只召唤兽需要#Y"..金钱.."#W两银子，你要认证吗#55"
						    找到技能[#找到技能+1]="我再考虑考虑"
	                        玩家数据[数字id].QDFSRZ=true
						    添加最后对话(数字id,对话,找到技能)

				    	elseif 玩家数据[数字id].QXRZ then
				    		玩家数据[数字id].QXRZ=nil
				            if 玩家数据[数字id].召唤兽.数据[编号].法术认证~=nil then
				            	for i=1,#玩家数据[数字id].召唤兽.数据[编号].技能 do
				            		if 玩家数据[数字id].召唤兽.数据[编号].技能[i]==玩家数据[数字id].召唤兽.数据[编号].法术认证 then
				            			table.remove(玩家数据[数字id].召唤兽.数据[编号].技能,i)
				            		    break
				            		end
				            	end
				            	常规提示(数字id,"取消法术认证成功。")
				            end
				            玩家数据[数字id].召唤兽.数据[编号].法术认证=nil
				            玩家数据[数字id].召唤兽.数据[编号]:刷新信息()
							发送数据(连接id,16,玩家数据[数字id].召唤兽.数据)--玩家数据[数字id].召唤兽.数据[返回信息["宝宝序号"]]

					    end
					else
						if 玩家数据[数字id].QDFSRZ then --确定法术认证
	                    	玩家数据[数字id].QDFSRZ=nil
	                    	local 等级=玩家数据[数字id].召唤兽.数据[编号].参战等级
							if #玩家数据[数字id].召唤兽.数据[编号].技能<2 then --为了防止打书循环卡死，小于2技能的宝宝不得认证
								添加最后对话(数字id,"你的召唤兽携带技能小于2，无法认证！")
							    return
							end
						    -- local 金钱=等级*等级*160+等级*4000
						    local 金钱=5000000
						    if 玩家数据[数字id].召唤兽.数据[编号].种类=="神兽" then
						        金钱=5000000
						    end

					        local 认证技能={"上古灵符","水攻","落岩","雷击","烈火","地狱烈火","奔雷咒","水漫金山","泰山压顶"}
					        local go =false
					        if 玩家数据[数字id].召唤兽.数据[编号] then
						    	for n=1,#玩家数据[数字id].召唤兽.数据[编号].技能 do
									for i=1,#认证技能 do
										if 认证技能[i]==事件 and 认证技能[i]==玩家数据[数字id].召唤兽.数据[编号].技能[n] then
											go = true
											break
										end
									end
								end
						    end
						    if go then
						    	if 玩家数据[数字id].角色:扣除银子(金钱,0,0,"法术认证") then
						    		认证技能={"冥思","再生","慧根"}
						    		local 添加技能={}
									for i=1,#认证技能 do
										local 重复=false
										for n=1,#玩家数据[数字id].召唤兽.数据[编号].技能 do
											if 玩家数据[数字id].召唤兽.数据[编号].技能[n]==认证技能[i] then
												重复=true
											end
										end
										if 重复==false then
											添加技能[#添加技能+1]=认证技能[i]
										end
									end
									if #添加技能==0 then
										认证技能={"迟钝","弱点雷","弱点火","弱点水","弱点土","雷属性吸收","火属性吸收","土属性吸收","水属性吸收"}
										for i=1,#认证技能 do
											local 重复=false
											for n=1,#玩家数据[数字id].召唤兽.数据[编号].技能 do
												if 玩家数据[数字id].召唤兽.数据[编号].技能[n]==认证技能[i] then
													重复=true
												end
											end
											if 重复==false then
												添加技能[#添加技能+1]=认证技能[i]
											end
										end
									end
									if #添加技能>0 and #玩家数据[数字id].召唤兽.数据[编号].技能<24 then
										local 新技能=添加技能[取随机数(1,#添加技能)]
										玩家数据[数字id].召唤兽.数据[编号].技能[#玩家数据[数字id].召唤兽.数据[编号].技能+1]=新技能
										常规提示(数字id,"法术认证成功！你的召唤兽获得了新技能#G"..新技能)
										玩家数据[数字id].召唤兽.数据[编号].法术认证=事件
										玩家数据[数字id].召唤兽.数据[编号]:刷新信息()
										发送数据(连接id,16,玩家数据[数字id].召唤兽.数据)--玩家数据[数字id].召唤兽.数据[返回信息["宝宝序号"]]
									else
										常规提示(数字id,"#W/24技能的我这点伎俩能给你认证个锤锤！这种恐怖能力的召唤兽，你还是找GM商议吧！但银子我就不退还了 嘿嘿~")
									end
						    	end
						    else
						    	添加最后对话(数字id,"你的召唤兽没有“指定”的攻击性法术技能哦#14，请区分召唤兽名称！")
						    end
						end
			    	end
			    end
			end
		end


	elseif 名称=="老猕猴" then
		if 事件=="1、潜能果相关。" then
       		local 总数 = 0
       		local 当前 = 玩家数据[数字id].角色.附加潜力.潜能果
       		local 经验 = 当前 * 120000+10000000
       		if 玩家数据[数字id].角色.等级 >= 60 then
       			总数 = 100
       		end
       		if 玩家数据[数字id].角色.等级 >= 90 then
       			总数 = 150
       		end
       		if 玩家数据[数字id].角色.等级 > 155 and 玩家数据[数字id].角色.历劫.渡劫 then
       			总数 = 200
       		end
       		if 玩家数据[数字id].角色.等级 > 170 and 玩家数据[数字id].角色.历劫.渡劫 then
       			总数 = 300
       		end
       		local 可兑换 = 总数 - 当前
       		发送数据(玩家数据[数字id].连接id,6559,{可用经验=玩家数据[数字id].角色.当前经验,下个经验=经验,已食用潜能果=当前,剩余潜能果=可兑换})
   		end
   	end
end
