-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 11:52:03
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:12:35
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1537]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "别看我官小，建邺城的贸易都是由我掌管的"
		wb[2] = "有钱可以使鬼推磨，恰好我有钱"
		local xx = {"我要招募队员","我要更改角色的名字","我随便逛逛 不好意思"}
		return{"男人_老财","贸易车队总管",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 2 then
		wb[1] = "公堂禁地，闲杂人等不许乱闯。"
		wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
		wb[3] = "作奸犯科可是要下大狱的。"
		wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
		wb[5] = "虽有石狮把门，安全还得靠人。"
		return{"男人_衙役","衙役1",wb[取随机数(1,#wb)]}
	elseif 编号 == 3 then
		wb[1] = "公堂禁地，闲杂人等不许乱闯。"
		wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
		wb[3] = "作奸犯科可是要下大狱的。"
		wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
		wb[5] = "虽有石狮把门，安全还得靠人。"
		return{"男人_衙役","衙役2",wb[取随机数(1,#wb)]}
	elseif 编号 == 4 then
		wb[1] = "公堂禁地，闲杂人等不许乱闯。"
		wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
		wb[3] = "作奸犯科可是要下大狱的。"
		wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
		wb[5] = "虽有石狮把门，安全还得靠人。"
		return{"男人_衙役","衙役3",wb[取随机数(1,#wb)]}
	elseif 编号 == 5 then
		wb[1] = "公堂禁地，闲杂人等不许乱闯。"
		wb[2] = "告状的话先把状纸准备好了到堂外排队去，别乱闯。"
		wb[3] = "作奸犯科可是要下大狱的。"
		wb[4] = "最近大唐国境总有强盗山贼出没，衙门里人手快不够用了。"
		wb[5] = "虽有石狮把门，安全还得靠人。"
		return{"男人_衙役","衙役4",wb[取随机数(1,#wb)]}
	elseif 编号 == 6 then
		wb[1] = "这日子有点太平过头了，半个月来一个告状的都没有。"
		wb[2] = "我们建邺城北门附近，有个有名的郎中叫陈长寿，他可以帮新朋友进行免费治疗。"
		wb[3] = "我们这里可是清水衙门，不收礼的。"
		wb[4] = "作奸犯科之事，衙门绝不会放过。"
		wb[5] = "清廉方正，一心为民，为官之道也。"
		return{"男人_师爷","简师爷",wb[取随机数(1,#wb)]}
	elseif 编号 == 7 then
		wb[1] = "不能体恤民情的官不是好官。"
		wb[2] = "公堂之上，岂容喧哗"
		wb[3] = "公正公平，廉洁高效，这词不错，明儿粉到墙上去"
		return{"男人_老书生","建邺县令",wb[取随机数(1,#wb)]}
	end
	return
end