local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1580]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 5 then
		wb[1] = "诸神抛弃魔域，遗落苍生。蚩尤，破天荒而立，为魔族称神，争得自由!"
		wb[2] = "人仙两族尚未察觉已临险境，唯吾蚩尤，能拯救三界于末世。"
		wb[3] = "黄帝，昔日尔胜余一筹，然乾坤之中，余重回三界。尔已消逝，余永驻。"
		wb[4] = "魔域之源，蛰伏深远，其力潜藏，未尽挖掘，尚有无穷奥秘待吾辈探寻。"
		wb[5] = "倾听蚩尤召唤，将赋予汝真正之力量，引领汝成为无上战士!"
		local xx = {"交谈","给予","乾元丹学习","师门任务","学习技能","我想切换流派"}
		if 玩家数据[数字id].角色.门派 == "无" or 玩家数据[数字id].角色.门派 == "无门派" then
			xx={"我还想去其他门派看看……","请收我为徒"}
	    elseif 玩家数据[数字id].角色.门派 ~= "九黎城" then
		    xx={}
		end
		return {"蚩尤","蚩尤幻影",wb[sj(1,#wb)],xx,"门派师傅"}
	elseif 编号 == 1 then
	    wb[1] = '如今的兵主还未完全解放他的力量，如果他能彻底释放，九黎城将无人可挡!'
	    local xx = {}
	    return {"雨师妾","雨师妾",wb[sj(1,#wb)],xx}
	elseif 编号 == 2 then
	    wb[1] = '曾为远古神族，弃之为魔，游走于神魔之间，无忌于天地，倒更恣意畅快。'
	    local xx = {"交谈","给予","师门任务"}
	    return {"刑天","刑天",wb[sj(1,#wb)],xx}
	elseif 编号 == 3 then
	    wb[1] = '让我用风送阁下前往长安吧。'
	    local xx = {'有劳风祖','暂时不用'}
	    return {"风祖飞廉","风祖飞廉",wb[sj(1,#wb)],xx}
	elseif 编号 == 4 then
	    wb[1] = '呜……好怀念和兵主一起征战的日子，那才是我食铁兽的黄金岁月!'
	    wb[2] = '铸兵太久，有点饿了……不行不行，忍住!铸兵的材料不能吃!我可是个负责的铸兵师!'
	    local 名称 = 玩家数据[数字id].角色.名称
	    wb[3] = ''..名称..'，你可算来了，快来看看我新研究的铸兵术!'
	    wb[4] = '呜!今天要铸的魔兵还没有完成呢，这可关系着九黎城的未来，没要紧事不要打扰我嗷!'
	    local xx = {'铸斧(乾)','铸斧(坤)','还原武器','围观一下'}
	    return {"食铁兽","食铁兽",wb[sj(1,#wb)],xx}
	end
	return
end

__NPCdh222[1580 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称 == "蚩尤幻影" then
		if 事件=="请收我为徒" then
          	玩家数据[数字id].角色:加入门派(数字id,'九黎城')
		elseif 事件=="师门任务" then
			玩家数据[数字id].角色:门派任务(数字id,'九黎城')
		elseif 事件=="学习技能" then
			发送数据(id,31,玩家数据[数字id].角色:取总数据1())
			发送数据(id,32)
        end
	elseif 名称 == '刑天' then
	    if 事件 == '师门任务' then
	        玩家数据[数字id].角色:门派任务(数字id,'九黎城')
	    end
	elseif 名称 == '风祖飞廉' then
	    if 事件 == '有劳风祖' then
	        地图处理类:跳转地图(数字id,1001,363,198)
	    end
	elseif 名称 == '食铁兽' then
	    if 事件 == '铸斧(乾)' then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="铸斧(乾)"}
			发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="食铁兽",类型="NPC",等级="无"})
	    elseif 事件 == '铸斧(坤)' then
	        玩家数据[数字id].给予数据={类型=1,id=0,事件="铸斧(坤)"}
	        发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="食铁兽",类型="NPC",等级="无"})
	    elseif 事件 == '还原武器' then
	        玩家数据[数字id].给予数据={类型=1,id=0,事件="还原武器"}
	        发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="食铁兽",类型="NPC",等级="无"})
	    end
	end
end