-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-06 17:09:53
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__NPCdh111[1854]=function (ID,编号,页数,已经在任务中,数字id)
	local wb = {}
	local xx = {}
	if 编号 == 1 then
		wb[1] = "要想在武学方面有所成就，拜师学艺固然重要，个人的潜心修行也是必不可少的。本帮有各种修行之法，提供给帮内弟子修炼，不同类别的修炼获得的效果也不同哦。"
		local xx = {"我要进行修炼（传统模式）","免资材修炼模式","提升修炼上限","我什么也不想做"}
		return{"男人_药店老板","修炼指导人",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 2 then
  		wb[1] = "我可以送您去帮派中的任何一间房间里，告诉我您要去的地方吧。"
  	 	xx={"帮派金库","帮派兽室","帮派药房","帮派聚义厅","帮派书院","帮派厢房","帮派青龙堂","送我回长安","路过，随便看看"}
  	 	return {"帮派机关人","红色机关人",wb[1],xx}
	end
	return
end

__NPCdh222[1854 ]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	local as = {"攻击修炼", "防御修炼", "法术修炼", "抗法修炼", "猎术修炼"}
	local as1 = {"攻击控制力", "防御控制力", "法术控制力", "抗法控制力"}
	if 名称=="修炼指导人" then
		if 事件=="我要进行修炼（传统模式）" then
		--	local xx={"人物修炼","宠物修炼","什么也不做"}
		local xx={"人物修炼","什么也不做"}
			if RpbARGB.序列==4 then
			    xx={"人物修炼","什么也不做"}
			end
			添加最后对话(数字id,"要想在武学方面有所成就，拜师学艺固然重要，个人的潜心修行也是必不可少的。本帮有各种修行之法，提供给帮内弟子修炼，不同类别的修炼获得的效果也不同哦。",xx)
		elseif 事件=="免资材修炼模式" then
			-- local xx={"人物修炼（免资材）","宠物修炼（免资材）","什么也不做"}
			local xx={"人物修炼（免资材）","什么也不做"}
			if RpbARGB.序列==4 then
			    xx={"人物修炼（免资材）","什么也不做"}
			end
			添加最后对话(数字id,"要想在武学方面有所成就，拜师学艺固然重要，个人的潜心修行也是必不可少的。本帮有各种修行之法，提供给帮内弟子修炼，不同类别的修炼获得的效果也不同哦。",xx)
		elseif 事件=="人物修炼" then
			发送数据(id,209,{人物修=玩家数据[数字id].角色.修炼,帮派资材=帮派数据[玩家数据[数字id].角色.BPBH].帮派资材.当前,银子=玩家数据[数字id].角色.银子,储备=玩家数据[数字id].角色.储备})
		elseif 事件=="宠物修炼" then
			发送数据(id,209,{宠物修=玩家数据[数字id].角色.bb修炼,帮派资材=帮派数据[玩家数据[数字id].角色.BPBH].帮派资材.当前,银子=玩家数据[数字id].角色.银子,储备=玩家数据[数字id].角色.储备})
		elseif 事件=="人物修炼（免资材）" then
			local cs=50
			if 玩家数据[数字id].角色.MZC==nil then
		        玩家数据[数字id].角色.MZC={次数=50,时间=os.time()+86400}
		    else
		    	if os.time()-玩家数据[数字id].角色.MZC.时间>0 then
				    玩家数据[数字id].角色.MZC={次数=50,时间=os.time()+86400}
				end
		    end
		    cs=玩家数据[数字id].角色.MZC.次数
			发送数据(id,209,{人物修=玩家数据[数字id].角色.修炼,帮派资材=帮派数据[玩家数据[数字id].角色.BPBH].帮派资材.当前,银子=玩家数据[数字id].角色.银子,储备=玩家数据[数字id].角色.储备,免资材=cs})
		elseif 事件=="宠物修炼（免资材）" then
			local cs=50
			if 玩家数据[数字id].角色.MZC==nil then
		        玩家数据[数字id].角色.MZC={次数=50,时间=os.time()+86400}
		    else
		    	if os.time()-玩家数据[数字id].角色.MZC.时间>0 then
				    玩家数据[数字id].角色.MZC={次数=50,时间=os.time()+86400}
				end
		    end
		    cs=玩家数据[数字id].角色.MZC.次数
			发送数据(id,209,{宠物修=玩家数据[数字id].角色.bb修炼,帮派资材=帮派数据[玩家数据[数字id].角色.BPBH].帮派资材.当前,银子=玩家数据[数字id].角色.银子,储备=玩家数据[数字id].角色.储备,免资材=cs})
		elseif 事件=="提升修炼上限" then
			if 玩家数据[数字id].角色.历劫.飞升 then
				添加最后对话(数字id,"请选择您需要提升的修炼项目，提升1级该修炼上限会降低1级当前修炼等级（注：降修需要修炼项目的上限等级=修炼项目当前等级时才能提升）。",{"攻击修炼","防御修炼","法术修炼","抗法修炼","猎术修炼","攻击控制力","防御控制力","法术控制力","抗法控制力","什么也不做"})
			else
		    	添加最后对话(数字id,"你没有飞升，无法降低修炼提升修炼上限")
			end
		elseif 事件=="攻击修炼" or 事件=="防御修炼" or 事件=="法术修炼"or 事件=="抗法修炼"or 事件=="猎术修炼"or 事件=="攻击控制力" or 事件=="防御控制力" or 事件=="法术控制力"  or 事件=="抗法控制力"  then
			玩家数据[数字id].角色:帮派降修(事件)
		end
	elseif 名称=="红色机关人" then
        if 事件=="帮派青龙堂" then
			地图处理类:跳转地图(数字id,1865,26,20)
		elseif 事件=="帮派金库" then
			地图处理类:跳转地图(数字id,1815,31,25)
		elseif 事件=="帮派兽室" then
			地图处理类:跳转地图(数字id,1835,29,25)
		elseif 事件=="帮派药房" then
			地图处理类:跳转地图(数字id,1854,22,22)
		elseif 事件=="帮派厢房" then
			地图处理类:跳转地图(数字id,1844,28,23)
		elseif 事件=="帮派聚义厅" then
			地图处理类:跳转地图(数字id,1874,31,28)
		elseif 事件=="帮派书院" then
			地图处理类:跳转地图(数字id,1825,23,23)
		elseif 事件=="送我回长安" then
			地图处理类:跳转地图(数字id,1001,387,13)
        end
	end
end