-- @Author: baidwwy
-- @Date:   2023-12-03 11:44:24
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2023-12-03 12:08:32
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 18:43:47
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:17:17
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
__NPCdh111[6018]=function (ID,编号,页数,已经在任务中,数字id)
  local wb = {}
  local xx = {}
 if 编号 == 1 then
    wb[1] = "肉多香啊，那和尚偏要吃斋，我娘叫我去摘采，可我一闻到菜味就腿软，你可以帮我吗？"
    local xx = {"我来帮你吧","我还要逛逛"}
    return {"男人_兰虎","镇山太保",wb[1],xx}
 elseif 编号 == 2 then
    wb[1] = "我咳咳！老身腿脚不方便，小侠能否帮忙打扫房间好招待贵客？"
    local xx = {"我来帮你吧","我还要逛逛"}
    return {"女人_孟婆","婆婆",wb[1],xx}
 elseif 编号 == 3 then
    wb[1] = "菩提本无树，明镜亦非台！你可以愿协助我抄写佛法？"
    local xx = {"我来帮你吧","我还要逛逛"}
    return {"唐僧","唐玄奘",wb[1],xx}
    end
  return
end

__NPCdh222[6018]=function  (id,数字id,序号,内容)
	local 事件=内容[1]
  	local 名称=内容[3]
	local 任务id=玩家数据[数字id].角色:取任务(80)
  if 任务数据[任务id] == nil then 添加最后对话(数字id,"你没有这样的任务！") return  end
  local 副本id=任务数据[任务id].副本id
  if 名称=="婆婆" and 事件=="我来帮你吧" then
    if 副本数据.黑风山.进行[副本id].协助任务 == nil or 副本数据.黑风山.进行[副本id].协助任务.婆婆 <= 0 then
      添加最后对话(数字id,"我这里么有什么任务可以交给你了，你去其他地方看看吧！")
    else
      副本_黑风山:黑风山打扫(数字id)
      玩家数据[数字id].道具:给予道具(数字id,"蒲扇")
      常规提示(数字id,"#Y/你得到了蒲扇")
    end
  elseif 名称=="镇山太保" and 事件=="我来帮你吧" then
    if 副本数据.黑风山.进行[副本id].协助任务 == nil or 副本数据.黑风山.进行[副本id].协助任务.镇山太保 <= 0 then
      添加最后对话(数字id,"我这里么有什么任务可以交给你了，你去其他地方看看吧！")
    else
      副本_黑风山:黑风山巡逻(数字id)
    end
  elseif 名称=="唐玄奘" and 事件=="我来帮你吧" then
    if 副本数据.黑风山.进行[副本id].协助任务 == nil or 副本数据.黑风山.进行[副本id].协助任务.唐玄奘 <= 0 then
      添加最后对话(数字id,"我这里么有什么任务可以交给你了，你去其他地方看看吧！")
    else
      local 语句组 = {"诸法因缘生我说是因缘因缘尽故灭我作如是说","若菩萨欲得净土当净其心随其心净则佛土净","法尚应舍何况非法","无我相无人相无众生相无寿者相","应无所住而生其心","此有故彼有此生故彼生此无故彼无此灭故彼灭","一切贤圣皆以无为法而有差别","凡所有相皆是虚妄若见诸相非相则见如来","一切法皆是佛法","善能分别诸法相于第一义而不动","诸可还者自然非汝不汝还者非汝而谁","若以色见我以音声求我是人行邪道不能见如来","一切有为法如梦幻泡影如露亦如电应作如是观","一切行无常生者必有尽不生则不死此灭最为乐","过去心不可得现在心不可得未来心不可得"}
      local 语句 = 语句组[取随机数(1,#语句组)]
      玩家数据[数字id].最后操作=语句
      发送数据(玩家数据[数字id].连接id,61.6,语句)
    end
  end

end