-- @Author: baidwwy
-- @Date:   2024-08-21 11:47:39
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-02 00:39:27
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
local 变身卡选项={"龟丞相","天兵","地狱战神","凤凰","蛟龙","天兵","巡游天神","星灵仙子","芙蓉仙子","幽灵","吸血鬼","鬼将","夜罗刹","炎魔神","噬天虎","进阶猫灵人形","进阶夜罗刹","进阶混沌兽","进阶曼珠沙华","进阶毗舍童子"}
------------------------------------------------------武神坛，新增lua
__NPCdh111[6227]=function (ID,编号,页数,已经在任务中,数字id)
    local wb = {}
	local xx = {}
	if 编号==1 then
		wb[1] = "少侠我看你鼻青脸肿的，需不需要我用砂锅大的拳头帮你治疗一下？"
		local xx={"救救我","给我来点药","下次再说"}
		return {"进阶涂山雪","沉默医馆",wb[取随机数(1,#wb)],xx}
	elseif 编号==2 then --不用写
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		local xx = {"我的召唤兽受伤了，请帮我救治一下吧","我的召唤兽忠诚度降低了，请帮我驯养一下吧","我要同时补满召唤兽的气血、魔法和忠诚","我要提升召唤兽忠诚","我只是看看","我要重置召唤兽属性点"}
		return{"男人_巫医","超级巫医",wb[取随机数(1,#wb)],xx}
	elseif 编号==3 then
		wb[1] = "在我这里可以拜师，你想加入哪个门派呢？"
		local xx={"女儿村","神木林","大唐官府","化生寺","方寸山","盘丝洞","无底洞","狮驼岭","魔王寨","阴曹地府","普陀山","天宫","凌波城","五庄观","龙宫","花果山","九黎城","下次再说"}
		return {"李靖","托大天王",wb[取随机数(1,#wb)],xx}
	elseif 编号==4 then
		wb[1] = "老夫潜心修炼，悟得一通天之术，可助你将毕生所学保留，转投其他门派；也可使你重塑造型，改头换面！少侠有兴趣否？"
		xx = {"我要进行角色/门派转换","申请转换武器造型","申请转换装备造型","关于人物洗点","我什么都不想做"}
		return {"男人_太上老君","袁守诚",wb[取随机数(1,#wb)],xx}
	elseif 编号==5 then
	    wb[1] = "（这是一个燃着暗红色火光的打铁炉，使用的时候请小心，烫到手就不好了。)"
		local xx = {"我来制造点东西","小爷需要材料","神器相关","路过"}
		if 玩家数据[数字id].角色:取任务(5)~=0 then
			table.insert(xx,"打造任务")
	    end
		return {"物件_打铁炉","物件_打铁炉",wb[sj(1,#wb)],xx}
	elseif 编号==6 then
	    wb[1] = "你想退出武神坛回到外面吗？"
		local xx = {"请送我回外面","我先随便逛逛"}
		return {"钻石","传送神石",wb[sj(1,#wb)],xx}
	elseif 编号==7 then
	    wb[1] = "装备需要通过开运增加开运孔数才能进行符石镶嵌,而点化此乃上古秘传道术贫道近期正修炼此法,你有兴趣的话可以来试试。你可考虑清楚,分到虽习得此法,但道行修行尚浅,且需运筹乾坤,难免开运失败。"
		local xx = {"我来给装备开运","点化装备星位","我来合成符石","我什么都不想做"}
		return{"男人_道童","符石道人",wb[取随机数(1,#wb)],xx}
	elseif 编号==8 then
		wb[1] = "我师父送我的法宝太多了，戴之过重弃之可惜,唉太富有也是一种烦恼啊！我身上的法宝你看中哪个随便拿"
		local xx = {"那我就勉为其难挑几样","我什么都不想做"}
		return{"男人_哪吒","法宝多多",wb[取随机数(1,#wb)],xx}
	elseif 编号==9 then
		wb[1] = "嘤嘤嘤，银家是个八千六百个月大的宝宝哦！好久没人叫我宝宝了呜呜呜，只要你喊银家宝宝我就送你灵宝哦"
		local xx = {"乖宝宝让我看看你都有什么灵宝","宝你妹啊宝，滚"}
		return{"禄星","灵灵宝宝",wb[取随机数(1,#wb)],xx}
	elseif 编号==10 then
		wb[1] = "吾乃武神坛无敌战神是也，看你能逼出我几成功力"
		local xx = {"我来挑战你","我要了解挑战规则","查看挑战蚩尤排行榜","我只是路过"}
		return{"蚩尤","武神坛BOSS",wb[取随机数(1,#wb)],xx}
	elseif 编号==11 then
		wb[1] = "呀嘿咻嘿咻，为啥召唤兽都自己跑进我我袋子里来，少侠你想烤哪只自己拿。"
		local xx = {"我看看哪只召唤兽比较香","我要帮召唤兽提升能力","我只是路过"}
		return{"风伯","疯伯",wb[取随机数(1,#wb)],xx}
	elseif 编号==12 then
		wb[1] = "家里不止有矿，还有矿山，唉不止有矿山，还有十万大矿山！天啊如此有钱该如何是好，怎么花掉啊，根本花不完啊！你要不要考虑打打劫？"
		local xx = {"我要宝石宝藏","我只是路过"}
		return{"男人_财主","宝石商人",wb[取随机数(1,#wb)],xx}
	elseif 编号==13 then
		wb[1] = "你想变成什么呢，沉默说你是猪！"
		local xx = {"我要变身","我只是路过"}
		return{"进阶夜罗刹","百变星君",wb[取随机数(1,#wb)],xx}
	elseif 编号==14 then
		wb[1] = "我这里有增加临时属性的强化符和让宝宝变换造型的进阶饰品，喜欢的话，来取吧！"
		local xx = {"我赶时间，我要你一键给我打好临时符","我这里有临时符和宝宝饰品","我只是路过"}
		return{"进阶雷龙","沉默亲卫",wb[取随机数(1,#wb)],xx}
	elseif 编号==15 then
		xx = {"我什么都不想做","","我想更换召唤兽装饰品的颜色","我要切换进阶召唤兽的造型"}
		return{"普陀山_接引仙女","宠物仙子","你可以在这里更换携带的#Y宠物#W，宠物可以在战斗中捕捉召唤兽和控制多只召唤兽为你作战。",xx}
	elseif 编号 == 16 then
		wb[1] = "每次进入染色界面需要消耗一颗彩果，你确定吗？"
		local xx = {"我想为人物染色","我点错了"}
		return{"女人_染色师","染色师",wb[取随机数(1,#wb)],xx}
	elseif 编号==17 then
				wb[1] = "本大师也曾游走西域，习得一些新鲜的巧匠秘籍。可以将一些闪闪发光的武器变个造型#2。想试试吗？"
				local xx={"我想进行光武拓印","我要还原装备拓印","我要进行武器染色","我想了解一下"}
				return {"男人_武器店老板","武器大师",wb[取随机数(1,#wb)],xx}
	elseif 编号 == 18 then

	    wb[1] = '呜……好怀念和兵主一起征战的日子，那才是我食铁兽的黄金岁月!'
	    wb[2] = '铸兵太久，有点饿了……不行不行，忍住!铸兵的材料不能吃!我可是个负责的铸兵师!'
	    local 名称 = 玩家数据[数字id].角色.名称
	    wb[3] = ''..名称..'，你可算来了，快来看看我新研究的铸兵术!'
	    wb[4] = '呜!今天要铸的魔兵还没有完成呢，这可关系着九黎城的未来，没要紧事不要打扰我嗷!'
	    local xx = {'铸斧(乾)','铸斧(坤)','还原武器','围观一下'}
	    return {"食铁兽","食铁兽",wb[sj(1,#wb)],xx}
		end
	end
__NPCdh222[6227]=function (id,数字id,序号,内容)
    local 事件=内容[1]
	local 名称=内容[3]
	local wj账号
  	if 玩家数据[数字id].账号 ~= nil then
  		wj账号 = 玩家数据[数字id].账号
  	elseif 玩家数据[数字id].角色.账号 ~= nil then
  	  wj账号 = 玩家数据[数字id].角色.账号
  	end
	if 名称=="沉默医馆" then
		if 事件=="救救我" then
			if 玩家数据[数字id].队伍==0 then
				玩家数据[数字id].角色.气血=玩家数据[数字id].角色.最大气血
	            玩家数据[数字id].角色.气血上限=玩家数据[数字id].角色.最大气血
	            玩家数据[数字id].角色.魔法=玩家数据[数字id].角色.最大魔法
	            体活刷新(数字id)
	            发送数据(玩家数据[数字id].连接id,47,{玩家数据[数字id].角色:取气血数据()})
	            发送数据(玩家数据[数字id].连接id,1501,{名称="沉默医馆",模型="进阶涂山雪",对话="我已经把你和你的队友都医治好了。欢迎下次再来。"})
	        else
	            local 队伍id= 玩家数据[数字id].队伍
	            for an=1,#队伍数据[玩家数据[数字id].队伍].成员数据 do
	            	local 临时id=队伍数据[玩家数据[数字id].队伍].成员数据[an]
	            	玩家数据[临时id].角色.气血=玩家数据[临时id].角色.最大气血
		            玩家数据[临时id].角色.气血上限=玩家数据[临时id].角色.最大气血
		            玩家数据[临时id].角色.魔法=玩家数据[临时id].角色.最大魔法
		            体活刷新(临时id)
		            发送数据(玩家数据[临时id].连接id,47,{玩家数据[临时id].角色:取气血数据()})
	            end
	            发送数据(玩家数据[数字id].连接id,1501,{名称="沉默医馆",模型="进阶涂山雪",对话="我已经把你和你的队友都医治好了。欢迎下次再来。"})
	        end
	    elseif 事件=="给我来点药" then
	        local 临时道具=武神坛数据[wj账号]:取wst药品商店()
			发送数据(玩家数据[数字id].连接id,6158,临时道具)
		end
	elseif 名称=="托大天王" then
		local xx={"女儿村","神木林","大唐官府","化生寺","方寸山","盘丝洞","无底洞","狮驼岭","魔王寨","阴曹地府","普陀山","天宫","凌波城","五庄观","龙宫","花果山","九黎城"}
		for an=1,#xx do
			if 事件 == xx[an] then
				玩家数据[数字id].角色:加入门派(数字id,事件)
				return
			end
		end
	elseif 名称=="袁守诚" then
		if 事件=="我要进行角色/门派转换" then
			发送数据(玩家数据[数字id].连接id,243)
		elseif 事件=="申请转换武器造型" then
			local wb = "我很善良，乐于助人是我的天性！如果你进行了门派转换，我还可以收费2000W帮你转换对应的武器造型，你要将武器转换为什么造型？"
			local xx = {"枪矛","斧钺","剑","双短剑","飘带","爪刺","扇","魔棒","锤","鞭","环圈","刀","法杖","弓弩","宝珠","巨剑","伞","灯笼","我什么都不想做"}
			添加最后对话(数字id,wb,xx)
		elseif 事件=="申请转换装备造型" then
			local wb = "我很善良，乐于助人是我的天性！如果你进行了门派转换，我还可以收费2000W帮你转换对应的武器造型，你要将装备转换为什么造型？"
			xx={"头盔","发钗","女衣","男衣","什么也不做"}
			添加最后对话(数字id,wb,xx)
		elseif 事件=="头盔" or 事件=="发钗" or 事件=="女衣" or 事件=="男衣" then
			玩家数据[数字id].给予数据={类型=1,事件="转换装备",转换造型=事件}
			发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC"})
		elseif 武器表[事件] ~= nil then
			武器转换临时数据[数字id] = 事件
			玩家数据[数字id].给予数据={类型=1,事件="转换武器造型"}
			发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=名称,类型="NPC"})
		elseif 事件=="关于人物洗点" then
			if 玩家数据[数字id].角色.洗点次数==0 then
				local 对话="你当前拥有1次免费重置人物属性点的机会，请先卸下人物装备、灵饰。请确认是否需要重置人物属性点？"
				local xx={"重置人物属性点","什么也不做"}
				发送数据(玩家数据[数字id].连接id,1501,{名称="袁守诚",模型="袁守诚",对话=对话,选项=xx})
			elseif not 玩家数据[数字id].角色.强制洗点 then
				local 对话="你当前拥有1次免费重置人物属性点的机会，请先卸下人物装备、灵饰。请确认是否需要重置人物属性点？"
				local xx={"重置人物属性点","什么也不做"}
				发送数据(玩家数据[数字id].连接id,1501,{名称="袁守诚",模型="袁守诚",对话=对话,选项=xx})
			else
				local 对话="你的免费重置人物属性点的机会已经用完了。现在需要消耗#R"..(玩家数据[数字id].角色.洗点次数*1000000).."#W两银子才可重置人物属性点，请先卸下人物装备、灵饰。请确认是否需要重置人物属性点？"
				local xx={"重置人物属性点","什么也不做"}
				发送数据(玩家数据[数字id].连接id,1501,{名称="袁守诚",模型="袁守诚",对话=对话,选项=xx})
			end
		elseif 事件=="重置人物属性点" then
			玩家数据[数字id].角色:洗点操作(数字id)
		end
	elseif 名称 == "物件_打铁炉" then
	    if 事件=="我来制造点东西"  then
			发送数据(玩家数据[数字id].连接id,101,玩家数据[数字id].道具:索要道具1(数字id))
			玩家数据[数字id].打造方式=1
	    elseif 事件 == "小爷需要材料" then
	    	local dja,djb,djc = 武神坛数据[wj账号]:取wst书铁商店()
	    	发送数据(玩家数据[数字id].连接id,6150,{指南书=table.copy(dja),其它=table.copy(djb),bb类=djc})
	    elseif 事件 == "打造任务" then
	    	local 任务id=玩家数据[数字id].角色:取任务(5)
	    	if 任务id~=0 then
		        玩家数据[数字id].给予数据={类型=1,id=0,事件="打造角色装备"}
				发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称=任务数据[任务id].npc.名称,类型="NPC",等级="无"})
			end
		elseif 事件 == "神器相关" then
			添加最后对话(数字id,"你想进行哪种操作呢？",{"炼制灵犀之屑","合成灵犀玉","更换神器五行"})
		end
	elseif 名称 == "传送神石" then
	    if 事件 == "请送我回外面" then
	  		if 武神坛数据[wj账号]:取角色类型(数字id) == 2 then
	  			local sjsid = 武神坛数据[wj账号]:取wst对应id(数字id)
	  			if sjsid then
	  				武神坛数据[wj账号]:角色互换_假角色(数字id,sjsid)
	  			end
	  		end
		end
	elseif 名称=="武器大师" then
		if 事件=="我想进行光武拓印" then
		    发送数据(id,307,{类型="光武拓印"})
		elseif 事件=="我要进行武器染色" then
		    发送数据(id,104,{类型="武器焕彩"})
	    elseif 事件=="我要还原装备拓印" then
	    	添加最后对话(数字id,"还原装备拓印的原造型后，装备的光武拓印将会消失，你确定要这样操作吗？（该操作免费）",{"我确定还原","不好意思手抖了"})
    	elseif 事件=="我确定还原" then
    		玩家数据[数字id].给予数据={类型=1,id=0,事件="我要还原装备拓印"}
            发送数据(id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="武器大师",类型="NPC",等级="无"})
		end
	elseif 名称=="符石道人" then
		if 事件=="我来给装备开运" then
			发送数据(玩家数据[数字id].连接id,300,{"装备开运",{类型=1}})
		elseif 事件=="点化装备星位" then
			发送数据(玩家数据[数字id].连接id,300,{"装备开运",{类型=2}})
		elseif 事件=="我来合成符石" then
			发送数据(玩家数据[数字id].连接id,306,{})
		end
	elseif 名称=="法宝多多" then
        local dja,djb,djc,djd = 武神坛数据[wj账号]:取wst法宝商店()
    	发送数据(玩家数据[数字id].连接id,6151,{法宝1=table.copy(dja),法宝2=table.copy(djb),法宝3=table.copy(djc),法宝4=table.copy(djd)})
	elseif 名称=="灵灵宝宝" then
		if 事件=="乖宝宝让我看看你都有什么灵宝" then
			local 临时道具=武神坛数据[wj账号]:取wst灵宝商店()
			发送数据(玩家数据[数字id].连接id,6152,临时道具)
		end
	 elseif 名称=="武神坛BOSS" then
	 	if 事件=="我来挑战你" then
	 		local dyid = 玩家数据[数字id].角色.wst对应id
	 		if 武神坛蚩尤[dyid]==nil then
	 			武神坛蚩尤[dyid]={名称=玩家数据[数字id].角色.名称,id=dyid,分数=0}
	 		end
	 		if tonumber(os.date("%w", os.time()))==0 and 服务端参数.小时+0 >= 23 then
	 			添加最后对话(数字id,"每周日的23点为奖励结算时间，不可再挑战。")
	 			return
	 		end
	 		战斗准备类:创建战斗(数字id,130101,1)
	 	elseif 事件=="我要了解挑战规则" then
	 		local xx="#W/挑战武神坛BOSS为无限战斗直至被BOSS打死或者主动退出战斗，按挑战所能达到的最高难度计算排名。击杀当前难度BOSS立即进入下一场难度BOSS。\n期间战败或退出会记录你历史达到的最高难度，若要冲击更高难度，需从头开始打。"
   	        添加最后对话(数字id,xx)
	 	elseif 事件=="查看挑战蚩尤排行榜" then
	 	    发送数据(玩家数据[数字id].连接id,6154,wst蚩尤排行)
	 	end
	elseif 名称=="疯伯" then
	    if 事件=="我看看哪只召唤兽比较香" then
	    	local 临时bb = 武神坛数据[wj账号]:取wst召唤兽商店()
	    	发送数据(玩家数据[数字id].连接id,6153,临时bb)
	    elseif 事件=="我要帮召唤兽提升能力" then
	    	if 玩家数据[数字id].角色.参战信息~=nil then
				local dh = "提升召唤兽能力需灵性达到110"
				local xx = {}
				local 认证码 = 玩家数据[数字id].角色.参战宝宝.认证码
				local 编号=玩家数据[数字id].召唤兽:取编号(认证码)
				if 玩家数据[数字id].召唤兽.数据[编号].进阶 and 玩家数据[数字id].召唤兽.数据[编号].进阶.灵性==110 then
				   dh = "苍天大地，小仙有生之年竟能再遇此等百年不遇的灵兽。来让小仙细细一看！多年前我曾机缘巧合掌握一秘法，可帮助灵兽脱胎换骨，寻觅多年现在终遇于此。你可以帮我找来#Y5个清灵仙露#W吗？我可以免费帮你提升该召唤兽的能力。\n#R/PS:打铁炉那里有BB道具卖哦"
				   xx[#xx+1] = 玩家数据[数字id].召唤兽.数据[编号].名称
				end
				发送数据(玩家数据[数字id].连接id,1501,{名称="疯伯",模型="风伯",对话=dh,选项=xx})
			else
				添加最后对话(数字id,"请先将要提升的召唤兽参战")
			end
		else
			if 事件~="我只是路过" then
				if 玩家数据[数字id].角色.参战信息~=nil then
					if 玩家数据[数字id].角色.参战宝宝.名称==事件 then
						local 认证码 = 玩家数据[数字id].角色.参战宝宝.认证码
						local 编号=玩家数据[数字id].召唤兽:取编号(认证码)
						发送数据(玩家数据[数字id].连接id,109,{宝宝=玩家数据[数字id].召唤兽.数据[编号]})
					else
						添加最后对话(数字id,"提升召唤兽能力需灵性达到110")
					end
				end
			end
	    end
	elseif 名称=="宝石商人" then
	    if 事件=="我要宝石宝藏" then
	    	local 临时道具=武神坛数据[wj账号]:取wst宝石商店()
			发送数据(玩家数据[数字id].连接id,6155,临时道具)
	    end
	elseif 名称=="百变星君" then
	    if 事件=="我要变身" then
	    	发送数据(玩家数据[数字id].连接id,1501,{名称="百变星君",模型="进阶夜罗刹",对话="请选择你要变身的动物",选项=变身卡选项})
	    else
	        for kk,vv in pairs(变身卡选项) do
    		    if 事件==vv then
	    			if 玩家数据[数字id].角色:取任务(1)~=0 then
						任务数据[玩家数据[数字id].角色:取任务(1)]=nil
						玩家数据[数字id].角色:取消任务(1)
					end
				    玩家数据[数字id].角色.变身数据=vv
				    玩家数据[数字id].角色:刷新信息()
			        发送数据(玩家数据[数字id].连接id,37,玩家数据[数字id].角色.变身数据)
			        发送数据(玩家数据[数字id].连接id,47,{玩家数据[数字id].角色:取气血数据()})
					发送数据(玩家数据[数字id].连接id,12)
					设置任务1(数字id,8,玩家数据[数字id].角色.变身数据)
					地图处理类:更改模型(数字id,玩家数据[数字id].角色.变身数据,1)
					常规提示(数字id,"你已变身为#R/" ..vv)
	    			break
	            end
	    	end
	    end
	elseif 名称=="沉默亲卫" then
	    if 事件=="我这里有临时符和宝宝饰品" then
	    	local 临时道具=武神坛数据[wj账号]:取wst强化符商店()
	    	发送数据(玩家数据[数字id].连接id,6156,临时道具)
	    elseif 事件=="我赶时间，我要你一键给我打好临时符" then
	    	发送数据(玩家数据[数字id].连接id,6587.1,{装备=玩家数据[数字id].角色:取装备数据(),灵饰=玩家数据[数字id].角色:取灵饰数据(),角色=玩家数据[数字id].角色:取观察数据()})
	    end
	elseif 名称=="染色师" then
			if 事件=="我想为人物染色" then
				发送数据(id,29)
			end
       elseif 名称 == '食铁兽' then
	       if 事件 == '铸斧(乾)' then
			玩家数据[数字id].给予数据={类型=1,id=0,事件="铸斧(乾)"}
			发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="食铁兽",类型="NPC",等级="无"})
	    elseif 事件 == '铸斧(坤)' then
	        玩家数据[数字id].给予数据={类型=1,id=0,事件="铸斧(坤)"}
	        发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="食铁兽",类型="NPC",等级="无"})
	    elseif 事件 == '还原武器' then
	        玩家数据[数字id].给予数据={类型=1,id=0,事件="还原武器"}
	        发送数据(玩家数据[数字id].连接id,3530,{道具=玩家数据[数字id].道具:索要道具1(数字id),名称="食铁兽",类型="NPC",等级="无"})
	    end
    elseif 名称=="宠物仙子" then
        if 事件=="我想更换召唤兽装饰品的颜色" then
			if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要更换的宝宝参战！")
			    return
			end
			if 玩家数据[数字id].角色.参战宝宝.饰品 then
				添加最后对话(数字id,"装饰颜色每次更换需支付100W银子作为手续费哦#17",{"随机颜色","恢复默认","取消"})
			else
				添加最后对话(数字id,"你没有召唤兽装饰，无法更换颜色")
			    return
			end
		elseif 事件=="随机颜色" or 事件=="恢复默认" then
			local 编号=玩家数据[数字id].召唤兽:取编号(玩家数据[数字id].角色.参战宝宝.认证码)
			if 编号~=0 and 玩家数据[数字id].召唤兽.数据[编号] and 玩家数据[数字id].召唤兽.数据[编号].饰品 then
				if 玩家数据[数字id].角色:扣除银子(1000000,0,0,"饰品染色") or 玩家数据[数字id].角色.武神坛角色 then
					if 事件=="随机颜色" then
					    local ysb = {0xFFFF0000,0xFF0000FF,0xFFFCFF00,0xFF24FF00,0xFFDE00FF,0xFF00FFD3}
					    if 玩家数据[数字id].召唤兽.数据[编号].饰品颜色~=nil then
					        for i=1,6 do
					        	if ysb[i]==玩家数据[数字id].召唤兽.数据[编号].饰品颜色 then
					        	    table.remove(ysb, i)
					        	end
					        end
					    end
					    常规提示(数字id,"召唤兽装饰品染色成功！")
						玩家数据[数字id].召唤兽.数据[编号].饰品颜色 = ysb[取随机数(1,#ysb)]
					    发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
					elseif 事件=="恢复默认" then
						玩家数据[数字id].召唤兽.数据[编号].饰品颜色 = nil
						发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
						常规提示(数字id,"恢复成功！")
					end
				end
			else
			    添加最后对话(数字id,"你没有召唤兽装饰，无法更换颜色")
			    return
			end



		elseif 事件=="我要切换进阶召唤兽的造型" then
			if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要切换的宝宝参战！")
			    return
			end
			if 玩家数据[数字id].角色.参战宝宝.进阶 and 玩家数据[数字id].角色.参战宝宝.进阶.灵性>=50 then
				添加最后对话(数字id,"切换宝宝造型需要支付500W两银子作为手续费，少侠可要考虑好了。",{"我想好了，帮我切换吧！","取消"})
			else
			    添加最后对话(数字id,"少侠您的召唤兽好像无法转换造型。")
			end
		-- elseif 事件=="我要自定义宝宝造型" then
		-- 	添加最后对话(数字id,"自定义宝宝造型，每次需支付1000W两银子作为手续费，少侠可要考虑好了。",{"我想好了，开始吧！","取消"})
        elseif 事件=="我想好了，开始吧！" then
        	if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要自定义的宝宝参战！")
			    return
			end
			发送数据(id,68)
		elseif 事件=="我想好了，帮我切换吧！" then
			if 玩家数据[数字id].角色.参战信息==nil then
				添加最后对话(数字id,"请将需要切换的宝宝参战！")
			    return
			end
			local 编号=玩家数据[数字id].召唤兽:取编号(玩家数据[数字id].角色.参战宝宝.认证码)
			if 编号~=0 and 玩家数据[数字id].召唤兽.数据[编号] and 玩家数据[数字id].召唤兽.数据[编号].进阶 and 玩家数据[数字id].角色.参战宝宝.进阶.灵性>=50 then
				if 玩家数据[数字id].召唤兽.数据[编号].饰品~=nil then
					添加最后对话(数字id,"请先卸下召唤兽饰品！")
				    return
				end
				if string.find(玩家数据[数字id].召唤兽.数据[编号].模型,"进阶")~=nil then
					if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"切换宝宝造型") or 玩家数据[数字id].角色.武神坛角色 then
					    玩家数据[数字id].召唤兽.数据[编号].模型=string.gsub(玩家数据[数字id].召唤兽.数据[编号].模型,"进阶","")
					    发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
						添加最后对话(数字id,"恭喜你的召唤兽获得了新的形态！")
					end
				else
					local mx="进阶"..玩家数据[数字id].召唤兽.数据[编号].模型
					local go=false
					if 取进阶表(mx) then
						go=true
					end
					if go then
						if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"切换宝宝造型") or 玩家数据[数字id].角色.武神坛角色 then
							玩家数据[数字id].召唤兽.数据[编号].模型=mx
							发送数据(id,6556,玩家数据[数字id].召唤兽.数据[编号])
							添加最后对话(数字id,"恭喜你的召唤兽获得了新的形态！")
						end
					else
						添加最后对话(数字id,"#17少侠，该进阶召唤兽造型未开放哦")
					end
				end
			else
				添加最后对话(数字id,"少侠您的召唤兽好像无法转换造型。")
			end
		end
	end
end