-- @Author: baidwwy
-- @Date:   2024-07-25 18:29:24
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-01-13 16:17:16
local 充值礼包类 = class()

function 充值礼包类:初始化()
end
function 充值礼包类:获取礼包(id,内容)
    self.礼包物品={}
	self.礼包物品.累充奖励={累充6={},累充30={},累充68={},累充128={},累充198={},累充328={},累充648={},累充1280={}}
	self.礼包物品.七日登录={星期1={},星期2={},星期3={},星期4={},星期5={},星期6={},星期7={}}
	self.礼包物品.等级礼包={等级60={},等级80={},等级100={},等级120={},等级140={},等级150={}}

	self.礼包物品.累充奖励[1]={
	[1]={名称="神兜兜",数量=20},
	[2]={名称="一亿银票",可叠加=true,数量=1},
	[3]={名称="九转金丹",数量=50,阶品=100},
	[4]={名称="修炼果",数量=50,阶品=100},
	[5]={名称="菩提果",数量=10},
	}
	self.礼包物品.累充奖励[2]={
	[1]={名称="神兜兜",数量=30},
	[2]={名称="修炼果",数量=100,阶品=100},
	[3]={名称="九转金丹",数量=100,阶品=100},
	[4]={名称="抽奖令牌",数量=10},
	[5]={名称="菩提果",数量=20},
	}
	self.礼包物品.累充奖励[3]={
	[1]={名称="神兜兜",数量=99},
	[2]={名称="特殊兽诀礼盒",数量=5},
	[3]={名称="稀有兽诀礼盒",数量=5},
	[4]={名称="抽奖令牌",数量=20},
	[5]={名称="菩提果",数量=30},
	}
	self.礼包物品.累充奖励[4]={
	[1]={名称="三打160plus",数量=1},
	[2]={名称="特殊兽诀礼盒",数量=5},
	[3]={名称="稀有兽诀礼盒",数量=5},
	[4]={名称="抽奖令牌",数量=30},
	[5]={名称="菩提果",数量=50},
	}
    self.礼包物品.累充奖励[5]={
	[1]={名称="特殊兽诀礼盒",数量=10},
	[2]={名称="稀有兽诀礼盒",数量=10},
	[3]={名称="技能突破符",可叠加=true,数量=2},
	[4]={名称="武器附神锤",可叠加=true,数量=2},
	[5]={名称="菩提果",数量=66},
	}
	self.礼包物品.累充奖励[6]={
	[1]={名称="超级兽诀礼盒",数量=2},
	[2]={名称="元素曜石礼包",可叠加=true,数量=1},
	[3]={名称="技能突破符",可叠加=true,数量=3},
	[4]={名称="武器附神锤",可叠加=true,数量=3},
	[5]={名称="菩提果",数量=88},
	}
	self.礼包物品.累充奖励[7]={
	[1]={名称="定制宠礼盒（法术）",数量=1},
	[2]={名称="定制宠礼盒（物理）",数量=1},
	[3]={名称="160无级别全套",可叠加=true,数量=5},
	[4]={名称="百亿银票",可叠加=true,数量=2},
	[5]={名称="菩提果",数量=200},
	}
	self.礼包物品.累充奖励[8]={
	[1]={名称="四象天罡印",可叠加=true,数量=500},
	[2]={名称="菩提果",数量=500},
	[3]={名称="抽奖仙令",数量=10},
	[4]={名称="百亿银票",可叠加=true,数量=3},
	[5]={名称="百万仙玉",可叠加=true,数量=3},
	}
	self.礼包物品.七日登录[1]={
	[1]={名称="150无级别礼包",数量=1,可叠加=true},
	[2]={名称="140灵饰礼包",数量=1},
	}
	self.礼包物品.七日登录[2]={
	[1]={名称="特殊兽诀礼盒",数量=1},
	[2]={名称="plus宝石箱",数量=6},
	}
	self.礼包物品.七日登录[3]={
	[1]={名称="稀有兽诀礼盒",数量=1},
	[2]={名称="plus星辉石礼包",数量=5},
	}
	self.礼包物品.七日登录[4]={
	[1]={名称="超级兽诀礼盒",数量=1},
	[2]={名称="一亿银票",可叠加=true,数量=1},
	}
	self.礼包物品.七日登录[5]={
	[1]={名称="特殊清灵仙露",数量=1},
	[2]={名称="九转金丹",数量=99},
	}
	self.礼包物品.七日登录[6]={
	[1]={名称="8级钟灵石礼包",数量=1},
	[2]={名称="修炼果",数量=99},
	}
	self.礼包物品.七日登录[7]={
	[1]={名称="特色兽诀礼盒",数量=1},
	[2]={名称="一亿银票",可叠加=true,数量=1},
	}
	self.礼包物品.等级礼包[1]={--60级等级礼包
	[1]={名称="130无级别礼包",专用=true,数量=1},---一套
	[2]={名称="80灵饰礼包",专用=true,数量=1},
	[3]={名称="修炼果礼包",专用=true,数量=5},
	[4]={名称="九转金丹礼包",专用=true,数量=2},
	[5]={名称="炫彩ID",可叠加=false,特效="绿色ID",专用=true,数量=1},
	}
    self.礼包物品.等级礼包[2]={--80级等级礼包
	[1]={名称="140无级别礼包",专用=true,数量=1},---一套
	[2]={名称="100灵饰礼包",专用=true,数量=1},
	[3]={名称="plus星辉石礼包",专用=true,数量=1},
	[4]={名称="plus宝石箱",专用=true,数量=1},
	[5]={名称="千万银票",专用=true,可叠加=true,数量=1},
	}
	self.礼包物品.等级礼包[3]={--100级等级礼包
	[1]={名称="150无级别礼包",专用=true,数量=1},---一套
	[2]={名称="120灵饰礼包",专用=true,数量=1},
	[3]={名称="plus星辉石礼包",专用=true,数量=1},
	[4]={名称="plus宝石箱",专用=true,数量=1},
	[5]={名称="160附魔宝珠礼包",专用=true,数量=2},
	}
	self.礼包物品.等级礼包[4]={--120级等级礼包
	[1]={名称="160附魔宝珠礼包",专用=true,数量=10},
	[2]={名称="千万银票",专用=true,可叠加=true,数量=5},
	[3]={名称="修炼果",专用=true,数量=99},
	[4]={名称="九转金丹",专用=true,数量=99},
	[5]={名称="140灵饰礼包",专用=true,数量=10},
	}
	self.礼包物品.等级礼包[5]={--140级等级礼包
	[1]={名称="千万银票",专用=true,可叠加=true,数量=30},
	[2]={名称="特殊兽诀礼盒",专用=true,数量=1},
	[3]={名称="稀有兽诀礼盒",专用=true,数量=1},
	[4]={名称="超级兽诀礼盒",专用=true,数量=1},
	[5]={名称="特色兽诀礼盒",专用=true,数量=1},
	}
	self.礼包物品.等级礼包[5]={--150级等级礼包
	[1]={名称="千万银票",专用=true,可叠加=true,数量=50},
	[2]={名称="特殊兽诀礼盒",专用=true,数量=3},
	[3]={名称="稀有兽诀礼盒",专用=true,数量=3},
	[4]={名称="超级兽诀礼盒",专用=true,数量=3},
	[5]={名称="特色兽诀礼盒",专用=true,数量=3},
	}

	local 类型=内容.类型
	local 充值数据=获取新建数据(id,"充值数据")
	if 玩家数据[id].角色.月卡 == nil then
      玩家数据[id].角色.月卡 = {生效=false,到期时间=0}
 	end
	发送数据(玩家数据[id].连接id,131.6,{数据=self.礼包物品[类型],充值=充值数据,月卡=玩家数据[id].角色.月卡})
end
function 充值礼包类:领取七日礼包(id,内容)
	local 充值数据=获取新建数据(id,"充值数据")
	local 编号=内容.编号
	if 充值数据.当天充值==nil then
		充值数据.当天充值=false
	end
	if 充值数据.七日领取天数==nil then
		充值数据.七日领取天数=0
	end
	if 充值数据.当天领取==nil then
		充值数据.当天领取=0
	end
	if 充值数据.当天领取==os.date("%d")+0 then
		发送数据(玩家数据[id].连接id, 7, "#y/您今天领取过了,请明天领取#37")
		return
	end
	if 编号<=充值数据.七日领取天数 then
		发送数据(玩家数据[id].连接id, 7, "#y/您已经领取过了,无法重复领取#37")
		return
	end
	if 编号~=充值数据.七日领取天数+1 then
		发送数据(玩家数据[id].连接id, 7, "#y/您似乎前面的奖励还没有领取#37")
		return
	end
	if 编号>7 then
		发送数据(玩家数据[id].连接id, 7, "#y/无法领取#37")
		return
	end
	if 充值数据.当天充值==false then
		-- 充值数据.当天领取=os.date("%d")+0
		-- 充值数据.七日领取天数=充值数据.七日领取天数+1
		-- 保存新建数据(id,"充值数据",充值数据)
		-- self.临时格子 = 玩家数据[id].角色:取道具格子()
		-- if self.临时格子 == 0 then
		-- 	发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
		-- 	return
		-- end
		-- self.道具编号 = 玩家数据[id].道具:取新编号()
		-- 玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.礼包物品.七日登录[编号][1]))
		-- 玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
		-- if self.礼包物品.七日登录[编号][1].可叠加 then
		--     玩家数据[id].道具.数据[self.道具编号].数量=self.礼包物品.七日登录[编号][1].数量
		-- end
		-- 玩家数据[id].角色.道具[self.临时格子]=self.道具编号
  --       发送数据(玩家数据[id].连接id, 7, "#y/您领取了礼包奖励")
        发送数据(玩家数据[id].连接id, 7, "#y/充值任意金额后可领取")
        return
	 else
	 	充值数据.当天领取=os.date("%d")+0
	 	充值数据.当天充值=false
	  	充值数据.七日领取天数=充值数据.七日领取天数+1
		保存新建数据(id,"充值数据",充值数据)
	   for n=1,#self.礼包物品.七日登录[编号] do
			self.临时格子 = 玩家数据[id].角色:取道具格子()
			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
				return
			end
			self.道具编号 = 玩家数据[id].道具:取新编号()
			玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.礼包物品.七日登录[编号][n]))
			玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
			if self.礼包物品.七日登录[编号][n].可叠加 then
			    玩家数据[id].道具.数据[self.道具编号].数量=self.礼包物品.七日登录[编号][n].数量
			end
			玩家数据[id].角色.道具[self.临时格子]=self.道具编号
            end
            发送数据(玩家数据[id].连接id, 7, "#y/您领取了礼包奖励")
	    end
end

function 充值礼包类:领取等级礼包(id,内容)
	local 充值数据=获取新建数据(id,"充值数据")
	local 编号=内容.编号
	local 等级档位={60,80,100,120,140,150}--,175
	if 充值数据.等级礼包==nil then
		充值数据.等级礼包={}
	end
    if 充值数据.等级礼包[编号]==true then
    	常规提示(id,"您已经领取过了")
    	return
    end
    if 玩家数据[id].角色.等级<等级档位[编号] then
    	常规提示(id,"#Y/您的等级不足，请您"..等级档位[编号].."级再来领取！")
    	return
    end
	-- if 玩家数据[id].角色.飞行时间限制 ==nil then
 --      玩家数据[id].角色.飞行时间限制=os.time()
 --    end
	-- if 玩家数据[id].角色.飞行时间限制< os.time() then
	-- 	常规提示(id,"#Y/时间验证有问题")
	-- 	return
	-- end
        充值数据.等级礼包[编号]=true
        保存新建数据(id,"充值数据",充值数据)
	   for n=1,#self.礼包物品.等级礼包[编号] do
					self.临时格子 = 玩家数据[id].角色:取道具格子()
					if self.临时格子 < 0 then
						发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
						return
					end
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.礼包物品.等级礼包[编号][n]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.礼包物品.等级礼包[编号][n].可叠加 then
					玩家数据[id].道具.数据[self.道具编号].数量=self.礼包物品.等级礼包[编号][n].数量
					end
					玩家数据[id].角色.道具[self.临时格子]=self.道具编号
            end
	               发送数据(玩家数据[id].连接id, 7, "#y/成功领取礼包奖励！")
end
function 充值礼包类:领取礼包(id,内容)
	local 充值数据=获取新建数据(id,"充值数据")
	local 编号=内容.编号
	local 充值档位={6,30,68,128,198,328,648,1280}
	if 充值数据.领取记录==nil then
		充值数据.领取记录={}
	end
	if 充值数据.充值数额==nil then
		充值数据.充值数额=0
	end
    if 充值数据.充值数额<充值档位[编号] then
    	常规提示(id,"#Y/你的累计充值为 "..充值数据.充值数额..",尚未达到"..充值档位[编号].."的领取条件#24")
    	return
    end
    if 充值数据.领取记录[编号]==true then
    	常规提示(id,"#Y/您已经领取过该礼包,无法重复领取#37")
    	return
    end
    充值数据.领取记录[编号]=true
    保存新建数据(id,"充值数据",充值数据)
	   for n=1,#self.礼包物品.累充奖励[编号] do
					self.临时格子 = 玩家数据[id].角色:取道具格子()
					if self.临时格子 == 0 then
						发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")
						return
					end
					self.道具编号 = 玩家数据[id].道具:取新编号()
					玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.礼包物品.累充奖励[编号][n]))
					玩家数据[id].道具.数据[self.道具编号].识别码=id.."_"..os.time().."_"..取随机数(1000,9999999).."_"..随机序列
					if self.礼包物品.累充奖励[编号][n].可叠加 then
					    玩家数据[id].道具.数据[self.道具编号].数量=self.礼包物品.累充奖励[编号][n].数量
					end
					玩家数据[id].角色.道具[self.临时格子]=self.道具编号
                 end
	                发送数据(玩家数据[id].连接id, 7, "#y/您领取了礼包奖励")

end
function 充值礼包类:购买VIP(id)
	if 玩家数据[id].角色.vip时间==nil then
		玩家数据[id].角色.vip时间=0
	end
	if 判断货币(id,150,"点卡")==false then
		发送数据(玩家数据[id].连接id, 7, "#y/您的点卡不足")
		return
	end
	扣除货币(id,150,"点卡")
	if 玩家数据[id].角色.vip时间> os.time() then
	玩家数据[id].角色.vip时间=玩家数据[id].角色.vip时间+604800
    else
    玩家数据[id].角色.vip时间=os.time()+604800
    end
    发送数据(玩家数据[id].连接id, 7, "#y/VIP成功续费7天#37")
    发送数据(玩家数据[id].连接id,31,玩家数据[id].角色:取总数据())
    广播消息({内容=format("#S[全服广播]#R/%s#Y成功续费了VIP特权七天,获得了大量特权#37#37#37#37",玩家数据[id].角色.名称),频道="jj"})
end
function 充值礼包类:更新(dt) end
function 充值礼包类:显示(x, y) end

return 充值礼包类
