-- @Author: ASUS
-- @Date:   2021-11-20 10:52:13
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-16 17:54:10
local 房屋处理类 = class()
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

function 房屋处理类:初始化()
end

function 房屋处理类:房屋生成(类型)
	-- local lsb = {}
	-- if 类型 == "农家小院" then
	-- 	lsb.庭院地图 = 1446
	-- 	lsb.房屋地图 = 1310
	-- 	lsb.牧场地图 = 1892
	-- 	lsb.庭院npc = self:庭院npc(1446)
	-- 	lsb.房屋npc = self:房屋npc(1310)
	-- 	lsb.牧场npc = self:牧场npc(1892)
	-- elseif 类型 == "园林水榭" then
	-- 	lsb.庭院地图 = 1306
	-- 	lsb.房屋地图 = 1310
	-- 	lsb.牧场地图 = 1892
	-- 	lsb.庭院npc = self:庭院npc(1306)
	-- 	lsb.房屋npc = self:房屋npc(1310)
	-- 	lsb.牧场npc = self:牧场npc(1892)
	-- elseif 类型 == "欢乐童年" then
	-- 	lsb.庭院地图 = 1380
	-- 	lsb.房屋地图 = 1310
	-- 	lsb.牧场地图 = 1892
	-- 	lsb.庭院npc = self:庭院npc(1380)
	-- 	lsb.房屋npc = self:房屋npc(1310)
	-- 	lsb.牧场npc = self:牧场npc(1892)
	-- elseif 类型 == "白雪皑皑" then
	-- 	lsb.庭院地图 = 1382
	-- 	lsb.房屋地图 = 1310
	-- 	lsb.牧场地图 = 1892
	-- 	lsb.庭院npc = self:庭院npc(1382)
	-- 	lsb.房屋npc = self:房屋npc(1310)
	-- 	lsb.牧场npc = self:牧场npc(1892)
	-- end
	-- return lsb
end

function 房屋处理类:庭院npc(地图)
	-- local lsb
	-- if 地图 == 1446 then
	-- 	lsb=  {
	-- 			[1] = {名称="牧场管理员",模型="轿夫",X=73,Y=35,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		}
	-- elseif 地图 == 1306 then
	-- 	lsb=  {
	-- 			[1] = {名称="牧场管理员",模型="轿夫",X=41,Y=41,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		}
	-- elseif 地图 == 1380 then
	-- 	lsb=  {
	-- 			[1] = {名称="牧场管理员",模型="轿夫",X=61,Y=30,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		}
	-- elseif 地图 == 1382 then
	-- 	lsb=  {
	-- 			[1] = {名称="牧场管理员",模型="轿夫",X=72,Y=37,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		}
	-- end
	-- return lsb
end

function 房屋处理类:房屋npc(id)
	-- local lsb
	-- if id == 1310 or id == 1311 or id == 1312 or id == 1313 or id == 1314 or id == 1315 or id == 1316 or id == 1317 or id == 1318 or id == 1319 then --高级
	-- 	lsb =  {
	-- 		[1] = {名称="管家",模型="管家",X=24,Y=43,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		[2] = {名称="佣人",模型="许大娘",X=35,Y=47,方向=1,事件ID=nil,执行事件="不执行"}
	-- 	}
	-- elseif id == 1320 or id == 1321 or id == 1322 or id == 1323 or id == 1324 or id == 1325 or id == 1326 or id == 1327 or id == 1328 or id == 1329 then--顶级
	-- 	lsb =  {
	-- 		[1] = {名称="管家",模型="管家",X=46,Y=63,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		[2] = {名称="佣人",模型="许大娘",X=53,Y=69,方向=1,事件ID=nil,执行事件="不执行"}
	-- 	}
	-- elseif id ==1933 or id ==1935 or id ==1937 or id ==1939 or id ==1941 or id ==1943 or id ==1945 or id ==1947 or id ==1949 or id ==1951 then--双层阁楼
	-- 	lsb =  {
	-- 		[1] = {名称="管家",模型="管家",X=40,Y=43,方向=1,事件ID=nil,执行事件="不执行"},
	-- 		[2] = {名称="佣人",模型="许大娘",X=50,Y=49,方向=1,事件ID=nil,执行事件="不执行"}
	-- 	}
	-- end
	-- return lsb
end

function 房屋处理类:牧场npc(地图)
	-- local lsb
	-- if 地图 == 1892 then
	-- 	lsb = {
	-- 		[1] = {名称="牧场看守",模型="轿夫",X=22,Y=44,方向=3,事件ID=nil,执行事件="不执行"},
	-- 	}
	-- elseif 地图 == 1885 then
	-- 	lsb = {
	-- 		[1] = {名称="牧场看守",模型="轿夫",X=38,Y=14,方向=0,事件ID=nil,执行事件="不执行"},
	-- 	}
	-- elseif 地图 == 1886 then
	-- 	lsb = {
	-- 		[1] = {名称="牧场看守",模型="轿夫",X=15,Y=28,方向=0,事件ID=nil,执行事件="不执行"},
	-- 	}
	-- elseif 地图 == 1887 then
	-- 	lsb = {
	-- 		[1] = {名称="牧场看守",模型="轿夫",X=49,Y=47,方向=3,事件ID=nil,执行事件="不执行"},
	-- 	}
	-- elseif 地图 == 1888 then
	-- 	lsb = {
	-- 		[1] = {名称="牧场看守",模型="轿夫",X=59,Y=18,方向=2,事件ID=nil,执行事件="不执行"},
	-- 	}
	-- end
	-- return lsb
end

function 房屋处理类:购买房屋(数字id,类型)
	-- local lssj = self:房屋生成(类型)
	-- 房屋数据[#房屋数据+1] = {
	-- 	ID = 数字id,
	-- 	庭院ID = tonumber(数字id..1),
	-- 	注销 = false,
	-- 	庭院地图 = lssj.庭院地图,
	-- 	庭院装饰 = {},
	-- 	庭院npc = lssj.庭院npc,
	-- 	房屋ID = tonumber(数字id..2),
	-- 	房屋地图 = lssj.房屋地图,
	-- 	室内装饰 = {},
	-- 	室内npc = lssj.房屋npc,
	-- 	子女 = {},
	-- 	牧场ID = tonumber(数字id..3),
	-- 	牧场地图 = lssj.牧场地图,
	-- 	牧场装饰 = {},
	-- 	牧场npc = lssj.牧场npc
	-- }
end

function 房屋处理类:宅邸扩建(数字id,编号)
	-- if 编号== 0 then return 添加最后对话(数字id,"#Y你还没有自己的房屋无法扩建！") end
	-- if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"购买房屋",1)== false then 添加最后对话(数字id,"你没有足够的银两，小心我告你诈骗") return end
	-- if 房屋数据[编号].房屋地图+10  <= 1329 then
	-- 	房屋数据[编号].房屋地图 = 房屋数据[编号].房屋地图+10
	-- 	房屋数据[编号].室内npc = self:房屋npc(房屋数据[编号].房屋地图)
	-- 	添加最后对话(数字id,"#Y宅邸扩建成功了！")
	-- else
	-- 	 return 添加最后对话(数字id,"#Y你已经拥有顶级豪宅了，可以扩建你的房屋阁楼！")
	-- end
end

function 房屋处理类:扩建阁楼(数字id,编号)
	-- if 编号== 0 then return 添加最后对话(数字id,"#Y你还没有自己的房屋无法扩建！") end
	-- if 房屋数据[编号].房屋地图 >= 1320 and 房屋数据[编号].房屋地图 <= 1329 then
	-- 	if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"购买房屋",1)== false then 添加最后对话(数字id,"你没有足够的银两，小心我告你诈骗") return end
	-- 	房屋数据[编号].阁楼ID = tonumber(数字id..4)
	-- 	房屋数据[编号].阁楼装饰 = {}
	-- 	房屋数据[编号].阁楼npc = {}
	-- 	if 房屋数据[编号].房屋地图 == 1320 then
	-- 		房屋数据[编号].房屋地图 = 1933
	-- 		房屋数据[编号].阁楼地图 = 1934
	-- 	elseif 房屋数据[编号].房屋地图 == 1321 then
	-- 		房屋数据[编号].房屋地图 = 1935
	-- 		房屋数据[编号].阁楼地图 = 1936
	-- 	elseif 房屋数据[编号].房屋地图 == 1322 then
	-- 		房屋数据[编号].房屋地图 = 1937
	-- 		房屋数据[编号].阁楼地图 = 1938
	-- 	elseif 房屋数据[编号].房屋地图 == 1323 then
	-- 		房屋数据[编号].房屋地图 = 1939
	-- 		房屋数据[编号].阁楼地图 = 1940
	-- 	elseif 房屋数据[编号].房屋地图 == 1324 then
	-- 		房屋数据[编号].房屋地图 = 1941
	-- 		房屋数据[编号].阁楼地图 = 1942
	-- 	elseif 房屋数据[编号].房屋地图 == 1325 then
	-- 		房屋数据[编号].房屋地图 = 1943
	-- 		房屋数据[编号].阁楼地图 = 1944
	-- 	elseif 房屋数据[编号].房屋地图 == 1326 then
	-- 		房屋数据[编号].房屋地图 = 1945
	-- 		房屋数据[编号].阁楼地图 = 1946
	-- 	elseif 房屋数据[编号].房屋地图 == 1327 then
	-- 		房屋数据[编号].房屋地图 = 1947
	-- 		房屋数据[编号].阁楼地图 = 1948
	-- 	elseif 房屋数据[编号].房屋地图 == 1328 then
	-- 		房屋数据[编号].房屋地图 = 1949
	-- 		房屋数据[编号].阁楼地图 = 1950
	-- 	elseif 房屋数据[编号].房屋地图 == 1329 then
	-- 		房屋数据[编号].房屋地图 = 1951
	-- 		房屋数据[编号].阁楼地图 = 1952
	-- 	end
	-- 	房屋数据[编号].室内npc = self:房屋npc(房屋数据[编号].房屋地图)
	-- 	地图处理类:添加房屋(编号)
	-- 	添加最后对话(数字id,"你的阁楼建造成功了！")
	-- else
	-- 	添加最后对话(数字id,"你的房屋不是顶级豪宅无法扩建！")
	-- end
end

function 房屋处理类:装修庭院(数字id,编号,事件)
	-- if 编号== 0 then return 添加最后对话(数字id,"#Y你还没有自己的房屋装修！") end
	-- if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"购买房屋",1)== false then 添加最后对话(数字id,"你没有足够的银两，小心我告你诈骗") return end
	-- if 事件 == "庭院农家小院" then
	-- 	房屋数据[编号].庭院地图=1446
	-- 	房屋数据[编号].庭院npc=self:庭院npc(1446)
	-- elseif 事件 == "庭院园林水榭" then
	-- 	房屋数据[编号].庭院地图=1306
	-- 	房屋数据[编号].庭院npc=self:庭院npc(1306)
	-- elseif 事件 == "庭院欢乐童年" then
	-- 	房屋数据[编号].庭院地图=1380
	-- 	房屋数据[编号].庭院npc=self:庭院npc(1380)
	-- elseif 事件 == "庭院白雪皑皑" then
	-- 	房屋数据[编号].庭院地图=1382
	-- 	房屋数据[编号].庭院npc=self:庭院npc(1382)
	-- end
end

function 房屋处理类:装修房屋(数字id,编号,事件)
	-- if 编号== 0 then return 添加最后对话(数字id,"#Y你还没有自己的房屋装修！") end
	-- if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"购买房屋",1)== false then 添加最后对话(数字id,"你没有足够的银两，小心我告你诈骗") return end
	-- if 事件 == "复古大理石" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1310
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1320
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1933
	-- 		房屋数据[编号].阁楼地图 = 1934
	-- 	end
	-- elseif 事件 == "复古青砖" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1311
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1321
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1935
	-- 		房屋数据[编号].阁楼地图 = 1936
	-- 	end
	-- elseif 事件 == "复古地板" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1312
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1322
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1937
	-- 		房屋数据[编号].阁楼地图 = 1938
	-- 	end
	-- elseif 事件 == "复古红地板" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1313
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1323
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1939
	-- 		房屋数据[编号].阁楼地图 = 1940
	-- 	end
	-- elseif 事件 == "海洋系" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1314
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1324
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1941
	-- 		房屋数据[编号].阁楼地图 = 1942
	-- 	end
	-- elseif 事件 == "粉红兔" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1315
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1325
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1943
	-- 		房屋数据[编号].阁楼地图 = 1944
	-- 	end
	-- elseif 事件 == "中国风" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1316
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1326
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1945
	-- 		房屋数据[编号].阁楼地图 = 1946
	-- 	end
	-- elseif 事件 == "卡通猫" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1317
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1327
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1947
	-- 		房屋数据[编号].阁楼地图 = 1948
	-- 	end
	-- elseif 事件 == "冰雪屋" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1318
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1328
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1949
	-- 		房屋数据[编号].阁楼地图 = 1950
	-- 	end
	-- elseif 事件 == "蓝色永恒" then
	-- 	if  房屋数据[编号].房屋地图 <= 1319 then
	-- 		房屋数据[编号].房屋地图 = 1919
	-- 	elseif 房屋数据[编号].房屋地图 <= 1329 then
	-- 		房屋数据[编号].房屋地图 = 1929
	-- 	else
	-- 	    	房屋数据[编号].房屋地图 = 1951
	-- 		房屋数据[编号].阁楼地图 = 1952
	-- 	end
	-- end
end

function 房屋处理类:装修牧场(数字id,编号,事件)
	-- if 编号== 0 then return 添加最后对话(数字id,"#Y你还没有自己的房屋装修！") end
	-- if 玩家数据[数字id].角色:扣除银子(5000000,0,0,"购买房屋",1)== false then 添加最后对话(数字id,"你没有足够的银两，小心我告你诈骗") return end
	-- if 事件 == "主题田园流水" then
	-- 	房屋数据[编号].牧场地图=1885
	-- 	房屋数据[编号].牧场npc=self:牧场npc(1885)
	-- elseif 事件 == "主题苍茫草原" then
	-- 	房屋数据[编号].牧场地图=1886
	-- 	房屋数据[编号].牧场npc=self:牧场npc(1886)
	-- elseif 事件 == "主题热带雨林" then
	-- 	房屋数据[编号].牧场地图=1887
	-- 	房屋数据[编号].牧场npc=self:牧场npc(1887)
	-- elseif 事件 == "主题清泉翠竹" then
	-- 	房屋数据[编号].牧场地图=1888
	-- 	房屋数据[编号].牧场npc=self:牧场npc(1888)
	-- end
end
return 房屋处理类