-- @Author: baidwwy
-- @Date:   2024-09-11 20:07:56
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-11-02 00:25:44
local 武神坛类 = class()
function 武神坛类:初始化(账号)
	self.账号 = 账号
end

function 武神坛类:wst数据处理(连接id,序号,数字id,数据)
end

function 武神坛类:检测在线踢出(数字id,武神坛id) --踢出武神坛角色
	-- if self.对应id组[数字id]~=nil and 玩家数据[武神坛id]~=nil then
	-- 	self.对应id组[数字id] = nil
	-- end
end

function 武神坛类:进入武神坛(账号,数字id) --首次进入
	self.账号 = 账号
	local 武神坛id = ("6" ..数字id)+0
	self:检测在线踢出(数字id,武神坛id)
	local 进入限制 = true
	if 玩家数据[数字id].队伍==0 then
		if 玩家数据[数字id].角色.进入武神坛~=nil and 进入限制 and 玩家数据[数字id].角色.进入武神坛 - os.time() >= 0 then
			local djs = 玩家数据[数字id].角色.进入武神坛 - os.time()
			添加最后对话(数字id,"不可频繁进入，还需等待#R/" ..djs .."#W/秒后方可进入武神坛")----------进出武神坛
		elseif 玩家数据[数字id].角色.武神坛角色==nil then
			if 玩家数据[数字id].角色.wst对应id == nil then
				玩家数据[数字id].角色.wst对应id = 武神坛id
			end
			玩家数据[数字id].角色.进入武神坛 = os.time() + 10 --------------武神坛进出时间 武神坛出入
			self:角色互换_实角色(数字id,武神坛id)
		end
	else
	  常规提示(数字id,"不可组队进入")
	end
end

function 武神坛类:角色互换_实角色(数字id,武神坛id) --实角色换成武神坛角色 每个端的进入不同，要对照系统处理类的进入游戏
	  local 模型 = 玩家数据[数字id].角色.模型
	  local 名称 = 玩家数据[数字id].角色.名称
	  local ip = 玩家数据[数字id].角色.ip
	  local 连接id = 玩家数据[数字id].角色.连接id
	  玩家数据[数字id].角色.进入武神坛 = os.time() + 10-------------武神坛进出时间
	  玩家数据[数字id].顶号进入 = os.time() + 1 --防止收到序号5而断开
       系统处理类:断开游戏(数字id)
		if f函数.文件是否存在(程序目录..[[data/]]..self.账号..[[/]]..武神坛id)==false then --双重保险
		  临时角色=角色处理类.创建()
		  临时角色:创建武神坛角色(连接id,self.账号,模型,名称,ip,0,nil,武神坛id,数字id)
		end
		LianjieID[武神坛id]=true
		玩家数据[武神坛id]={}
		玩家数据[武神坛id].角色=角色处理类:创建()
		玩家数据[武神坛id].道具=道具处理类:创建(武神坛id)
		玩家数据[武神坛id].召唤兽=召唤兽处理类:创建(武神坛id)
		玩家数据[武神坛id].道具:加载数据(self.账号,武神坛id)
		玩家数据[武神坛id].角色:加载数据(self.账号,武神坛id)
		玩家数据[武神坛id].召唤兽:加载数据(self.账号,武神坛id)
		玩家数据[武神坛id].神器=神器类:创建(武神坛id)
		玩家数据[武神坛id].神器:加载数据(self.账号,武神坛id)
		玩家数据[武神坛id].自动回收=自动回收类:创建(武神坛id)
		玩家数据[武神坛id].自动回收:加载数据(self.账号,武神坛id)
		---
		道具仓库数据[武神坛id]={}
		宝宝仓库数据[武神坛id]={}
		道具仓库数据[武神坛id].道具=道具仓库:创建(武神坛id)
		道具仓库数据[武神坛id].道具:加载数据(self.账号,武神坛id)
		宝宝仓库数据[武神坛id].召唤兽=召唤兽仓库:创建(武神坛id)
		宝宝仓库数据[武神坛id].召唤兽:加载数据(self.账号,武神坛id)
		---
		玩家数据[武神坛id].账号=self.账号
		玩家数据[武神坛id].角色.账号=self.账号
		玩家数据[武神坛id].结束等待=os.time()
		玩家数据[武神坛id].当前频道=os.time()
		玩家数据[武神坛id].世界频道=os.time()
		玩家数据[武神坛id].传闻频道=os.time()
		玩家数据[武神坛id].遇怪时间=os.time()+取随机数(10,20)
		玩家数据[武神坛id].队伍=0
		玩家数据[武神坛id].zhandou=0
		玩家数据[武神坛id].guanzhan=0
		玩家数据[武神坛id].角色.战斗开关 = false
		玩家数据[武神坛id].连接id=连接id
		玩家数据[武神坛id].商品列表=0
		if 玩家数据[武神坛id].角色.玄灵珠==nil then
		   玩家数据[武神坛id].角色.玄灵珠={类型="回春",破军=10,回春=10,空灵=10,噬魂=10}
		end
     if  玩家数据[武神坛id].角色.套装激活 == nil then
         玩家数据[武神坛id].角色.套装激活= 0
     end
     if  玩家数据[武神坛id].角色.套装名称 == nil then
         玩家数据[武神坛id].角色.套装名称= 0
     end
		玩家数据[武神坛id].子角色操作 =nil
		玩家数据[武神坛id].角色.连接id=连接id
		玩家数据[武神坛id].角色.地图数据.编号 = 6227
		玩家数据[武神坛id].角色.地图数据.x = (92 + 取随机数(1,8))*20
		玩家数据[武神坛id].角色.地图数据.y = (69 + 取随机数(1,8))*20
        玩家数据[武神坛id].角色.银子 = 0
		发送数据(连接id,9996,{效验码=__数据验证.效验码}) --防修改
		玩家数据[武神坛id].角色.当前称谓 = "武神坛"
		发送数据(连接id,5,玩家数据[武神坛id].角色:取总数据())
		玩家数据[武神坛id].道具:索要道具3(连接id,武神坛id)
		发送数据(连接id,16,玩家数据[武神坛id].召唤兽.数据)
		发送数据(连接id,25,宝宝队伍图)--每次进入游戏发送一次给玩家，到客户端去排序
		发送数据(连接id,997,{id=武神坛id,用户="正式用户",名称=玩家数据[武神坛id].角色.名称,账号=self.账号})
		发送数据(连接id,43,时辰信息.昼夜)
		地图处理类:加入玩家(武神坛id, 玩家数据[武神坛id].角色.地图数据.编号, 玩家数据[武神坛id].角色.地图数据.x, 玩家数据[武神坛id].角色.地图数据.y)
		if 玩家数据[武神坛id].队伍~=0 then
		  队伍处理类:退出队伍(武神坛id)
		end
		if 每日任务[武神坛id]==nil then
			每日任务[武神坛id]={日常任务={},副本任务={},活跃度={当前=0,总活跃=0},签到数据={}}
		end
		if 玩家数据[武神坛id].角色.变身数据 ~= nil and 玩家数据[武神坛id].角色:取任务(1) == 0 then
			玩家数据[武神坛id].角色:取消任务(玩家数据[武神坛id].角色:取任务(1))
			玩家数据[武神坛id].角色.变身数据 = nil
		end
		if 玩家数据[武神坛id]~=nil and 玩家数据[武神坛id].摊位数据~=nil then --可取消
			玩家数据[武神坛id].道具:收摊处理(玩家数据[武神坛id].连接id,武神坛id)
		end
     if  玩家数据[武神坛id].角色.套装激活 == nil then
         玩家数据[武神坛id].角色.套装激活= 0
     end
     if  玩家数据[武神坛id].角色.套装名称 == nil then
         玩家数据[武神坛id].角色.套装名称= 0
     end
		玩家数据[武神坛id].角色.剧情={}
		玩家数据[武神坛id].角色:清空任务()
		玩家数据[武神坛id].角色:更新任务()
		玩家数据[武神坛id].角色:刷新任务跟踪()
		玩家数据[武神坛id].角色:取快捷技能(武神坛id)
		玩家数据[武神坛id].角色.ip=ip
		if 玩家数据[武神坛id]~=nil and 玩家数据[武神坛id].角色 then
		系统处理类:进入事件(武神坛id,玩家数据[武神坛id].连接id)
        玩家数据[武神坛id].角色:刷新信息()
    	end
       系统处理类:加载进入信息(武神坛id,ip)
       系统处理类:清除进入数据(武神坛id)
       发送数据(连接id, 3705, 商城处理类.商品组[18])
       玩家数据[武神坛id].角色.进入武神坛 = os.time() + 10
       self:更新tp武神坛角色(武神坛id)
       玩家数据[武神坛id].角色.气血 = 玩家数据[武神坛id].角色.最大气血
	   玩家数据[武神坛id].角色.气血上限 = 玩家数据[武神坛id].角色.最大气血
	   玩家数据[武神坛id].角色.魔法 = 玩家数据[武神坛id].角色.最大魔法
end

function 武神坛类:角色互换_假角色(数字id,实角色id) --武神坛角色换成实角色
	if 玩家数据[数字id].角色.进入武神坛~=nil and 玩家数据[数字id].角色.进入武神坛 - os.time() >= 0 then
		local djs = 玩家数据[数字id].角色.进入武神坛 - os.time()
		添加最后对话(数字id,"不可频繁进出，还需等待#R/" ..djs .."#W/秒后方可，或直接重上游戏")
		return
	end
	玩家数据[数字id].角色.进入武神坛 = os.time() + 10
	local 连接id = 玩家数据[数字id].连接id
	local ip = 玩家数据[数字id].ip or 玩家数据[数字id].角色.ip
	系统处理类:断开游戏(数字id)
	系统处理类:进入游戏(连接id,self.账号,实角色id,ip)
	玩家数据[实角色id].角色.进入武神坛 = os.time() + 10
	self:更新tp武神坛角色(实角色id)
end

function 武神坛类:更新tp武神坛角色(数字id)
	local 是否=false
	if 玩家数据[数字id].角色.武神坛角色 then 是否=true end
	发送数据(玩家数据[数字id].连接id,6157,{是否=是否})
end

function 武神坛类:取wst对应id(数字id)
	if 玩家数据[数字id].角色.wst对应id~=nil then
		return 玩家数据[数字id].角色.wst对应id
	end
	return false
end

function 武神坛类:取角色类型(数字id) --判断是实角色还是武神坛角色
	if 玩家数据[数字id].角色.武神坛角色 then
		return 2
	else
	  return 1
	end
end

function 武神坛类:是否武神坛地图(数字id)
	if self:取角色类型(数字id) == 2 then --武神坛角色
		if 玩家数据[数字id].角色.地图数据.编号 ~= 6227 then
			发送数据(玩家数据[数字id].连接id, 998, "武神坛角色不可出现在武神坛地图外面!")
		end
	elseif self:取角色类型(数字id) == 1 then
		if 玩家数据[数字id].角色.地图数据.编号 == 6227 then
			if 玩家数据[数字id].队伍~=0 then
				队伍处理类:退出队伍(数字id)
			end
			local xy=地图处理类.地图坐标[1001]:取随机点()
			地图处理类:跳转地图(数字id,1001, xy.x, xy.y)
			消息提示(数字id,"#Y非武神坛角色#R不可进入#G武神坛地图!")
			常规提示(数字id,"#Y非武神坛角色#R不可进入#G武神坛地图!")
		end
	end
end

function 武神坛类:取wst书铁商店()
	local 指南书 = {}
	local bb类 = {}
  	local 其它 = {}
  	local djz={}
  	local djzb={
		{名称="140灵饰自选-佩饰"},
		{名称="140灵饰自选-耳饰"},
		{名称="140灵饰自选-手镯"},
		{名称="140灵饰自选-戒指"},
  		{名称="160无级别全套"},
  		{名称="愤怒符"},
  	    {名称="特效宝珠"},
  	    {名称="双加转换符"},
  	    {名称="特技书"},
  	    {名称="装备特效宝珠"},
  		{名称="青龙石",可叠加=true},
  		{名称="白虎石",可叠加=true},
  		{名称="朱雀石",可叠加=true},
  		{名称="玄武石",可叠加=true},
        {名称="彩果",可叠加=true},
  		{名称="海马",可叠加=true},
  		{名称="新三符石礼包"},
  		{名称="星石礼包"},
        {名称="月饼",可叠加=true},
  		{名称="种族坐骑"},
  		-- {名称="玄灵珠·回春",级别限制=10},
  		-- {名称="玄灵珠·破军",级别限制=10},
  		-- {名称="玄灵珠·空灵",级别限制=10},
  		-- {名称="玄灵珠·噬魂",级别限制=10},
  		{名称="福禄丹",可叠加=false},
  	}
  	local djzc={
  		{名称="上古锻造图策",种类="项圈"},
  		{名称="上古锻造图策",种类="护腕"},
  		{名称="上古锻造图策",种类="铠甲"},
  		{名称="九眼天珠"},
  		{名称="月华露",可叠加=true},
  		{名称="高级召唤兽内丹",特效="生死决"},
  		{名称="高级召唤兽内丹",特效="催心浪"},
  		{名称="高级召唤兽内丹",特效="玄武躯"},
        {名称="召唤兽内丹",特效="矫健"},
        {名称="召唤兽内丹",特效="狂怒"},
        {名称="召唤兽内丹",特效="迅敏"},
        {名称="召唤兽内丹",特效="撞击"},
        {名称="召唤兽内丹",特效="愤恨"},
        {名称="召唤兽内丹",特效="静岳"},
        {名称="召唤兽内丹",特效="灵光"},
        {名称="召唤兽内丹",特效="灵身"},
        {名称="召唤兽内丹",特效="擅咒"},
  		{名称="易经丹"},
  		{名称="玉葫灵髓",可叠加=false},
  		{名称="清灵净瓶",可叠加=true},
  		{名称="特殊清灵仙露",可叠加=false},
  		{名称="天赋符",可叠加=false},
  		{名称="灵犀玉",特性="蔓延",子类=3},
  		{名称="灵犀玉",特性="天平",子类=3},
  		{名称="灵犀玉",特性="水耀",子类=3},
  	}
  	for an=1,25 do
  		djz[an] = {名称="制造指南书",级别限制=150}
  	end
  	for an=1,#djz do
  		指南书[an]=物品类()
  		指南书[an]:置对象(djz[an].名称,djz[an])
  		指南书[an].名称 = djz[an].名称
			指南书[an].子类 = 150
			指南书[an].特效 = an
  	end
  	for an=1,#djzb do
  		其它[an]=物品类()
  		其它[an]:置对象(djzb[an].名称,djzb[an])
  		其它[an].名称 = djzb[an].名称
  		if djzb[an].名称=="百炼精铁" or djzb[an].名称=="神兵图鉴" or djzb[an].名称=="灵饰图鉴" or djzb[an].名称=="灵宝图鉴" then
  			其它[an].子类 = 160
  		elseif djzb[an].名称=="灵饰指南书" then
  			其它[an].子类 = 140
  			其它[an].特效 = djzb[an].特效
  		elseif djzb[an].名称=="元灵晶石" then
  			其它[an].子类 = 140
  		elseif djzb[an].名称=="百岁香" then
  			其它[an].阶品 = 300
  		end
  		if djzb[an].级别限制~=nil then
  			其它[an].级别限制 = djzb[an].级别限制
  		end
  		if djzb[an].可叠加 then
  			其它[an].可叠加 = true
  		else
  		  其它[an].可叠加 = false
  		end
  	end
  	for an=1,#djzc do
  		bb类[an]=物品类()
  		bb类[an]:置对象(djzc[an].名称,djzc[an])
  		bb类[an].名称 = djzc[an].名称
  		if djzc[an].名称=="上古锻造图策" then
  			bb类[an].级别限制 = 155
  			bb类[an].种类=djzc[an].种类
  			bb类[an].分类=10
  		elseif djzc[an].名称=="九眼天珠" then
  			bb类[an].级别限制 = 155
  			bb类[an].灵气 = 100
  		elseif djzc[an].名称=="月华露" then
  		   bb类[an].阶品 = 5000
  		end
  		 if djzc[an].特效~=nil then
			bb类[an].特效=djzc[an].特效
		end
		if djzc[an].特性~=nil then
			bb类[an].特性=djzc[an].特性
		end
		if djzc[an].子类~=nil then
			bb类[an].子类=djzc[an].子类
		end
  		if djzc[an].可叠加 then
  			bb类[an].可叠加 = true
  		else
  		  bb类[an].可叠加 = false
  		end
    end
  	return 指南书,其它,bb类
end

function 武神坛类:取wst法宝商店()
	local fb1j={"拭剑石","飞剑","风袋","定风珠","天师符","织女扇","雷兽","迷魂灯","幽灵珠","碧玉葫芦","汇灵盏","九黎战鼓","盘龙壁","神行飞剑","金甲仙衣","嗜血幡","惊魂铃","清心咒","缚妖索"}
	local fb2j={"七杀","宝烛","金刚杵","兽王令","分水","琉璃灯","赤焰","神木宝鼎","天煞","罗汉珠","摄魂","附灵玉","降魔斗篷","发瘟匣","断线木偶","五彩娃娃","番天印","现形符","捆仙绳"}
	local fb3j={"失心钹","五火神焰印","九幽","普渡","斩魔","金箍棒","干将莫邪","乾坤玄火塔","慈悲","救命毫毛","伏魔天书","镇海珠","奇门五行令","月影","曼陀罗","忘情","金蟾","混元伞","无魂傀儡","苍白纸人","照妖镜","无尘扇","鬼泣","无字经","七宝玲珑灯","缚龙索","影蛊","落宝金钱","驭魔笼"}
	local fb4j={"凌波仙符","流影云笛","宿幕星河","蟠龙玉璧","落星飞鸿","归元圣印","千斗金樽","重明战鼓","梦云幻甲","河图洛书","炽焰丹珠","翡翠芝兰","太虚玉液","软烟罗锦","谷玄星盘","翠碧玉箫","血魄元幡","北冥巨鳞","冷龙石磐","琉璃云罩","璞玉灵钵","九梵清莲","紫火如意","舞雪冰蝶","苍灵雪羽","烽火狼烟"}
	local 一级法宝={}
	local 二级法宝={}
	local 三级法宝={}
	local 四级法宝={}
	for an=1,#fb1j do
  		一级法宝[an]=物品类()
  		一级法宝[an]:置对象(fb1j[an])
  		一级法宝[an].可叠加 = false
  end
  for an=1,#fb2j do
  		二级法宝[an]=物品类()
  		二级法宝[an]:置对象(fb2j[an])
  		二级法宝[an].可叠加 = false
  end
  for an=1,#fb3j do
  		三级法宝[an]=物品类()
  		三级法宝[an]:置对象(fb3j[an])
  		三级法宝[an].可叠加 = false
  end
  for an=1,#fb4j do
  		四级法宝[an]=物品类()
  		四级法宝[an]:置对象(fb4j[an])
  		四级法宝[an].可叠加 = false
  end
  return 一级法宝,二级法宝,三级法宝,四级法宝
end

function 武神坛类:取wst灵宝商店()
	local lb = {"断穹巨剑","静心禅珠","锢魂命谱","化怨清莲","真阳令旗",	"天雷音鼓","定神仙琴","赤炎战笛"}
	local 临时道具={}
	for an=1,#lb do
  		临时道具[an]=物品类()
  		临时道具[an]:置对象(lb[an])
  		临时道具[an].可叠加 = false
  end
  return 临时道具
end

function 武神坛类:取wst召唤兽商店()
	local 临时bb={}
	临时bb[1] = {
		名称 = "毗舍童子",
		技能 = {"超级连击","高级偷袭","高级夜战","高级吸血","高级神佑复生","高级必杀","高级强力","浮云神马","净台妙谛","无上正真","高级幸运","高级防御"},
		资质={1700,1600,6500,3000,1400,1400,5000,1.35}, --1攻击资质、2防御资质、3体力资质、4法力资质、5速度资质、6躲闪资质、7寿命、8成长
		定位="物理"
	}
	临时bb[2] = {
		名称 = "毗舍童子",
		技能 = {"高级法术暴击","高级法术波动","柳暗花明","出其不意","高级神佑复生","净台妙谛","高级精神集中","奔雷咒","超级魔之心","须弥真言","高级遗志"},
		资质={1500,1600,5500,4500,1400,1400,5000,1.35},
		定位="法术"
	}
	临时bb[3] = {
		名称 = "白豹",
		技能 = {"高级必杀","高级偷袭","超级夜战","力劈华山","高级神佑复生","高级强力","浮云神马","无上正真","高级敏捷","高级吸血"},
		资质={2000,1600,5500,3000,1400,1400,5000,1.35},
		定位="高攻"
	}
	临时bb[4] = {
		名称 = "毗舍童子",
		技能 = {"超级防御","高级敏捷","浮云神马","死亡召唤","高级冥思","高级毒","净台妙谛","超级神柚复生","凝光炼彩","与生俱来","高级反震","法术防御"},
		资质={1400,1400,6500,3500,1400,1400,5000,1.35},
		定位="配速"
	}
	临时bb[5] = {
		名称 = "龙龟",
		技能 = {"法术防御","净台妙谛","高级防御","超级招架","超级神柚复生","高级幸运","高级反震","高级精神集中","高级雷属性吸收","高级土属性吸收","高级水属性吸收","高级火属性吸收"},
		资质={1600,1600,6500,3500,1400,1400,5000,1.35},
		定位="配速"
	}
	临时bb[6] = {
		名称 = "雷龙",
		技能 = {"高级敏捷","高级防御","高级招架","浮云神马","超级神柚复生","净台妙谛","超级幸运","高级反震","高级隐身","与生俱来","凝光炼彩","超级再生"},
		资质={1600,1600,6500,3000,1700,1400,5000,1.35},
		定位="千速"
	}
	临时bb[7] = {
		名称 = "毗舍童子",
		技能 = {"高级敏捷","高级防御","高级招架","浮云神马","超级神柚复生","净台妙谛","高级幸运","高级招架","超级隐身","与生俱来","高级水属性吸收","高级火属性吸收"},
		资质={1600,1600,6500,3000,1700,1400,5000,1.35},
		定位="千速"
	}
	临时bb[8] = {
		名称 = "毗舍童子",
		技能 = {"超级隐身","高级幸运","高级反震","迟钝","高级招架","净台妙谛","高级防御","超级神柚复生","与生俱来","浮云神马"},
		资质={1600,1600,6500,3000,100,1400,5000,1.35},
		定位="龟速"
	}
	临时bb[9] = {
		名称 = "执音",
		技能 = {"高级隐身","高级幸运","超级反震","高级敏捷","高级招架","净台妙谛","高级防御","超级神柚复生","凝光炼彩","高级反震"},
		资质={1600,1600,6500,3000,1500,1400,5000,1.35},
		定位="配速"
	}
	临时bb[10] = {
		名称 = "夜罗刹",
		技能 = {"高级必杀","超级偷袭","高级夜战","高级连击","大快朵颐","高级强力","高级吸血","无上正真","高级隐身","高级敏捷","高级幸运"},
		资质={2000,1600,4500,3000,1500,1500,5000,1.35},
		定位="隐功"
	}
	临时bb[11] = {
		名称 = "谛听",
		技能 = {"观照万象","超级偷袭","善恶有报","力劈华山","壁垒击破","惊心一剑","无上正真","剑荡四方","高级敏捷","死亡召唤","高级必杀","浮云神马"},
		资质={1800,1400,4000,3000,1500,1500,5000,1.35},
		定位="关照功"
	}
	临时bb[12] = {
		名称 = "谛听",
		技能 = {"观照万象","高级魔之心","高级法术连击","超级泰山压顶","水漫金山","奔雷咒","须弥真言","地狱烈火","高级敏捷","八凶法阵","上古灵符","浮云神马"},
		资质={1500,1400,4000,4500,1500,1500,5000,1.35},
		定位="关照法"
	}
	临时bb[13] = {
		名称 = "虬龙",
		技能 = {"高级必杀","高级偷袭","高级夜战","壁垒击破","高级神佑复生","高级强力","净台妙谛","无上正真","超级吸血","高级幸运","高级敏捷","高级慧根"},
		资质={1800,1600,6500,3000,1400,1400,5000,1.35},
		定位="物理"
	}
	临时bb[14] = {
		名称 = "自在心猿",
		技能 = {"高级必杀","高级偷袭","高级夜战","善恶有报","高级神佑复生","超级强力","净台妙谛","无上正真","高级吸血","高级幸运","高级冥思","高级防御"},
		资质={1800,1600,6500,3000,1400,1400,5000,1.35},
		定位="物理"
	}
	临时bb[15] = {
		名称 = "大力金刚",
		技能 = {"高级必杀","高级偷袭","高级夜战","理直气壮","高级鬼魂术","高级强力","浮云神马","无上正真","超级敏捷","高级吸血","高级冥思","高级反击"},
		资质={2000,1600,5500,3000,1400,1400,5000,1.35},
		定位="物理"
	}
	临时bb[16] = {
		名称 = "白豹",
		技能 = {"超级法术暴击","高级法术波动","柳暗花明","高级感知","高级神佑复生","净台妙谛","高级精神集中","超级地狱烈火","高级魔之心","须弥真言","高级招架","高级敏捷"},
		资质={1500,1600,5000,4500,1400,1400,5000,1.35},
		定位="法术"
	}
	临时bb[17] = {
		名称 = "毗舍童子",
		技能 = {"高级法术暴击","超级法术波动","高级驱鬼","义薄云天","高级神佑复生","净台妙谛","高级精神集中","超级泰山压顶","高级魔之心","须弥真言","高级感知","高级反震"},
		资质={1500,1600,5000,4500,1400,1400,5000,1.35},
		定位="法术"
		}
	临时bb[18] = {
		名称 = "超级红孩儿",
		技能 = {"圣婴大王","高级幸运","超级三昧真火","桀骜自恃","高级神佑复生","净台妙谛","高级敏捷","超级魔之心"},
		资质={1500,1600,5000,4500,1400,1400,5000,1.35},
		定位="耐法"
	}
	临时bb[19] = {
		名称 = "超级鲲鹏",
		技能 = {"高级偷袭","高级神佑复生","北冥之渊","逍遥游","超级必杀","水击三千","高级夜战","高级强力","无上正真","从天而降"},
		资质={2000,1600,5000,3500,1400,1400,5000,1.35},
		定位="鲲鹏"
	}
	临时bb[20] = {
		名称 = "超级鲲鹏",
		技能 = {"高级魔之心","高级神佑复生","北冥之渊","逍遥游","超级法术暴击","扶摇万里","高级法术波动","须弥真言","高级法术连击","高级遗志"},
		资质={1700,1600,5000,4500,1400,1400,5000,1.35},
		定位="鲲鹏"
	}
	return 临时bb
end

function 武神坛类:取wst宝石商店()
	local 类型={"速度","躲避","伤害","灵力","防御","气血"} --精魄灵石
	local 临时宝石={}
	local djz={
		{名称="红玛瑙",级别限制=18},
		{名称="太阳石",级别限制=18},
		{名称="舍利子",级别限制=18},
		{名称="黑宝石",级别限制=18},
		{名称="月亮石",级别限制=18},
		{名称="光芒石",级别限制=18},
		{名称="翡翠石",级别限制=18},
		{名称="钟灵石",级别限制=8,技能="健步如飞"},
		{名称="钟灵石",级别限制=8,技能="血气方刚"},
		{名称="钟灵石",级别限制=8,技能="回春之术"},
		{名称="钟灵石",级别限制=8,技能="锐不可当"},
		{名称="钟灵石",级别限制=8,技能="通真达灵"},
		{名称="钟灵石",级别限制=8,技能="气壮山河"},
		{名称="星辉石",级别限制=11},
		{名称="附魔宝珠",级别限制=160},
        {名称="珍珠",级别限制=160},
		{名称="精魄灵石",级别限制=10,子类=1,特效=类型[1]},
		{名称="精魄灵石",级别限制=10,子类=3,特效=类型[3]},
		{名称="精魄灵石",级别限制=10,子类=4,特效=类型[4]},
		{名称="精魄灵石",级别限制=10,子类=5,特效=类型[5]},
		{名称="精魄灵石",级别限制=10,子类=6,特效=类型[6]},
		{名称="点化石",附带技能="善恶有报"},
		{名称="点化石",附带技能="力劈华山"},
		{名称="点化石",附带技能="壁垒击破"},
		{名称="点化石",附带技能="惊心一剑"},
		{名称="点化石",附带技能="剑荡四方"},
		{名称="点化石",附带技能="夜舞倾城"},
		{名称="点化石",附带技能="死亡召唤"},
		{名称="点化石",附带技能="高级神迹"},
		{名称="点化石",附带技能="高级隐身"},
		{名称="点化石",附带技能="高级精神集中"},
		{名称="点化石",附带技能="迟钝"},
		{名称="点化石",附带技能="高级敏捷"},
		{名称="点化石",附带技能="泰山压顶"},
		{名称="点化石",附带技能="高级法术波动"},
		{名称="点化石",附带技能="高级法术连击"},
		{名称="点化石",附带技能="高级法术暴击"},
		{名称="点化石",附带技能="高级冥思"},
		{名称="点化石",附带技能="高级驱鬼"},
		{名称="点化石",附带技能="高级感知"},
		{名称="点化石",附带技能="高级反震"},
	}
	for an=1,#djz do
		临时宝石[an]=物品类()
		临时宝石[an]:置对象(djz[an].名称,djz[an])
		临时宝石[an].名称 = djz[an].名称
		临时宝石[an].级别限制 = djz[an].级别限制
		临时宝石[an].子类 = ItemData[djz[an].名称].wp_4
		if djz[an].子类~=nil then
			临时宝石[an].子类=djz[an].子类
		end
		if djz[an].特效~=nil then
			临时宝石[an].特效=djz[an].特效
		end
		if djz[an].技能~=nil then
			临时宝石[an].技能=djz[an].技能
		end
		if djz[an].附带技能~=nil then
			临时宝石[an].附带技能=djz[an].附带技能
		end
	end
	return 临时宝石
end

function 武神坛类:取wst强化符商店()
	local 临时道具={}
	local djz={
		{名称="强化符",技能="尸气漫天"},
		{名称="强化符",技能="神兵护法"},
		{名称="强化符",技能="嗜血"},
		{名称="强化符",技能="莲华妙法"},
		{名称="强化符",技能="担山赶月"},
		{名称="强化符",技能="轻如鸿毛"},
		{名称="强化符",技能="盘丝舞"},
		{名称="强化符",技能="魔王护持"},
		{名称="强化符",技能="龙附"},
		{名称="强化符",技能="元阳护体"},
		{名称="强化符",技能="浩然正气"},
		{名称="强化符",技能="一气化三清"},
		{名称="强化符",技能="神力无穷"},
		{名称="强化符",技能="穿云破空"},
		{名称="强化符",技能="拈花妙指"},
		{名称="强化符",技能="神木呓语"},
		{名称="进阶夜罗刹饰品",可叠加=false},
		{名称="进阶龙龟饰品",可叠加=false},
		{名称="进阶毗舍童子饰品",可叠加=false},
		{名称="进阶大力金刚饰品",可叠加=false},
		{名称="进阶雷龙饰品",可叠加=false},
		{名称="进阶执音饰品",可叠加=false},
		{名称="进阶谛听饰品",可叠加=false},
		{名称="进阶虬龙饰品",可叠加=false},
		{名称="进阶自在心猿饰品",可叠加=false},
		{名称="展翅高飞",可叠加=false},
        {名称="旗开得胜",可叠加=false},
        {名称="霸王雄风",可叠加=false},
        {名称="独眼观天",可叠加=false},
        {名称="威武不屈",可叠加=false},
        {名称="深藏不露",可叠加=false},
        {名称="异域浓情",可叠加=false},
        {名称="流星天马",可叠加=false},
        {名称="知情达理",可叠加=false},
        {名称="气宇轩昂",可叠加=false},
        {名称="如花似玉",可叠加=false},
        {名称="傲视天下",可叠加=false},
        {名称="铁血豪情",可叠加=false},
        {名称="唯我独尊",可叠加=false},
        {名称="叱咤风云",可叠加=false},
        {名称="异域风情",可叠加=false},
        {名称="假面勇者",可叠加=false},
        {名称="霓裳魅影",可叠加=false},
        {名称="披星戴月",可叠加=false},
        {名称="烈焰燃情",可叠加=false},
        {名称="天雨流芳",可叠加=false},
        {名称="灵光再现",可叠加=false},
        {名称="倾国倾城",可叠加=false},
	}
	for an=1,#djz do
		临时道具[an]=物品类()
		临时道具[an]:置对象(djz[an].名称,djz[an])
		临时道具[an].名称 = djz[an].名称
		临时道具[an].等级 = 186
		临时道具[an].技能 = djz[an].技能
		临时道具[an].分类 = 取强化符分类(djz[an].技能)
	end
	return 临时道具
end

function 武神坛类:取积分兑换商店() --8.25  武神坛积分兑换  积分商店
	local 临时道具={}
  	local data={
  		{名称="灵饰指南书",级别限制=140,特效="手镯",价格=399},
  		{名称="灵饰指南书",级别限制=140,特效="佩饰",价格=399},
  		{名称="灵饰指南书",级别限制=140,特效="戒指",价格=399},
  		{名称="灵饰指南书",级别限制=140,特效="耳饰",价格=399},
  		{名称="元灵晶石",级别限制=140,价格=399},
  		{名称="百炼精铁",级别限制=150,价格=199},
  		{名称="陨铁",级别限制=160,价格=99},
  		{名称="战魄",级别限制=160,价格=199},
  		{名称="灵犀玉礼包",价格=299},
  		{名称="上古锻造图策",种类="项圈",价格=199},
  		{名称="上古锻造图策",种类="护腕",价格=199},
  		{名称="上古锻造图策",种类="铠甲",价格=199},
  		{名称="九眼天珠",价格=599},
  		{名称="神兜兜",价格=99},
  		{名称="特殊兽诀·碎片",价格=99},
  	}
  	for an=1,#data do
  		临时道具[an]=物品类()
  		临时道具[an]:置对象(data[an].名称)
  		临时道具[an].名称 = data[an].名称
  		临时道具[an].价格 = data[an].价格
  		if data[an].名称=="百炼精铁"  then
  			临时道具[an].子类 = 150
  		elseif data[an].名称=="灵饰指南书" then
  			临时道具[an].子类 = 140
  			临时道具[an].特效 = data[an].特效
  		elseif data[an].名称=="元灵晶石" then
  			临时道具[an].子类 = 140
  		elseif data[an].名称=="九眼天珠" then
  			临时道具[an].级别限制 = 155
  			临时道具[an].灵气 = 100
  		end
  		if data[an].级别限制~=nil then
  			临时道具[an].级别限制 = data[an].级别限制
  		end
  		if data[an].可叠加 then
  			临时道具[an].可叠加 = true
  		else
  		  临时道具[an].可叠加 = false
  		end
  	end
  	return 临时道具
end

function 武神坛类:取wst药品商店()
	local djz = {
		{名称="火凤之睛",可叠加=true,数量=99},
		{名称="天龙水",可叠加=true,数量=99},
		{名称="金香玉",阶品=160,附加技能="藏神"},
		{名称="金香玉",阶品=160,附加技能="倍愈"},
		{名称="千年保心丹",阶品=160,附加技能="倍愈"},
		{名称="千年保心丹",阶品=160,附加技能="藏神"},
		{名称="九转回魂丹",阶品=160,附加技能="藏神"},
		{名称="九转回魂丹",阶品=160,附加技能="倍愈"},
		{名称="蛇蝎美人",阶品=160,附加技能="倍愈"},
		{名称="蛇蝎美人",阶品=160,附加技能="藏神"},
		{名称="五龙丹",阶品=160,附加技能="藏神"},
		{名称="五龙丹",阶品=160,附加技能="倍愈"},
		{名称="珍露酒",阶品=140},
		{名称="醉生梦死",阶品=140},
		{名称="蛇胆酒",阶品=140},
	}
	local 临时道具={}
	for an=1,#djz do
  		临时道具[an]=物品类()
  		临时道具[an]:置对象(djz[an].名称,djz[an])
  		临时道具[an].名称 = djz[an].名称
  		if djz[an].阶品 then
  			临时道具[an].阶品 = djz[an].阶品
  		end
  		if djz[an].附加技能 then
  			临时道具[an].附加技能 = djz[an].附加技能
  		end
  		if djz[an].可叠加 then
  			临时道具[an].可叠加 = true
  			if djz[an].数量 then
	  			临时道具[an].数量 = djz[an].数量
	  		end
  		else
	  		临时道具[an].可叠加 = false
	  	end
  end
  return 临时道具
end

function 武神坛类:领取排名奖励(数字id) --8.25
	local wstjl=table.loadstring(读入文件([[sql/蚩尤排行领取.txt]]))
	if wstjl~=nil and wstjl[数字id]~=nil then
		if _武神坛记录.积分[数字id]==nil then
			_武神坛记录.积分[数字id] = 0
		end
		local mc = wstjl[数字id].名次
		local jf = 50 - wstjl[数字id].名次 * 2 --获得积分公式
		if jf <= 0 then --最低5
			jf = 5
		end
		_武神坛记录.积分[数字id] = _武神坛记录.积分[数字id] + jf
		local 对话 = "恭喜你获得第#Y/" ..mc .."#W/名，获得积分#G" ..jf
		发送数据(玩家数据[数字id].连接id,1501,{名称="",模型="普陀_接引仙女",对话=对话})
	    wstjl[数字id] = nil
	    写出文件([[sql/蚩尤排行领取.txt]],table.tostring(wstjl))
	end
end

function 武神坛类:更新(dt) end
function 武神坛类:显示(x,y) end

return 武神坛类