-- @Author: baidwwy
-- @Date:   2024-12-14 19:53:29
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2025-03-08 12:38:27
-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:44
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-30 11:19:50
local 礼包奖励类 = class()
function 礼包奖励类:初始化()end

function 礼包奖励类:新手使者奖励(id)
end

function 礼包奖励类:设置拜师奖励(id)
	玩家数据[id].道具:给予道具(id,"超级合成旗",1)
	玩家数据[id].道具:给予道具(id,"体验月卡",1,nil,nil,"专用")
    玩家数据[id].角色:添加称谓("梦逍遥西游我最帅")
	玩家数据[id].道具:给予道具(id,"80灵饰礼包",1,nil,nil,"专用")
	玩家数据[id].道具:给予道具(id,"新春飞行符",50,nil,nil,"专用")
	玩家数据[id].角色:添加银子(500000,"拜师奖励",1)
	玩家数据[id].角色:增加剧情点(40)
	玩家数据[id].道具:给予道具(id,"秘制红罗羹",1,nil,nil,"专用")
	玩家数据[id].道具:给予道具(id,"秘制绿芦羹",1,nil,nil,"专用")
	-- 玩家数据[id].道具:给予道具(id,"三打160plus",1,nil,nil,"专用")

	self:全套专用装备(id,130,"无级别限制",id)
	玩家数据[id].道具:给予道具(id,"新手大礼包",nil,nil,nil,"专用")
  	self:增加宠物(id,"毗舍童子","法",79,1,100)
	消息提示(id,"获得剧情技能点100点")
	if RpbARGB.序列==3 then
	end
	发送数据(玩家数据[id].连接id,1501,{名称=玩家数据[id].最后对话.名称,模型=玩家数据[id].最后对话.模型,对话="既然你诚心要拜入本门派，那我就收你为徒。从即日起，我就是你的师傅了。你可要好好得尊师重道。这点礼物是为师的一点心意。"})
end

function 礼包奖励类:增加宠物(id,名称,类型,等级,额外技能数量,变异概率)
	--function 取超级要诀()
	local bbb = {"超级必杀","超级连击","超级吸血","超级偷袭","超级夜战","超级神迹","超级防御","超级幸运","超级敏捷","超级反震","超级招架","超级再生","超级反击","超级感知","超级强力","超级飞行","超级进击必杀"}
	local 技能组 = {}
	if 类型~="123" then
		类型概率=取随机数()
	end
	if 类型概率>50 then
		类型="攻"
	else
		类型="法"
	end
	if 类型=="攻" then
		for i=1,额外技能数量 do
			local xh = 取随机数(1,#bbb)
			技能组[#技能组+1] =  bbb[xh]
		end
		技能组[#技能组+1] =  "高级必杀"
		技能组[#技能组+1] =  "高级连击"
		技能组[#技能组+1] =  "高级吸血"
		技能组[#技能组+1] =  "高级偷袭"
		-- 技能组[#技能组+1] =  "气贯长虹"
		-- 技能组[#技能组+1] =  "超级神柚复生"
		技能组[#技能组+1] =  "无上正真"
	else
		bbb = {"超级法术暴击","超级法术连击","超级防御","超级幸运","超级法术波动","超级神迹","超级冥思","超级慧根","超级感知","超级敏捷","超级反震","超级招架","超级再生","超级魔之心","超级精神集中"}
		local daf = {"地狱烈火","奔雷咒","泰山压顶","水漫金山"}
		for i=1,额外技能数量 do
			local xh = 取随机数(1,#bbb)
			技能组[#技能组+1] =  bbb[xh]
		end
		技能组[#技能组+1] =  "圣婴大王"
		技能组[#技能组+1] =  "须弥真言"
		-- 技能组[#技能组+1] =  "高级幸运"
		技能组[#技能组+1] =  "高级法术暴击"
		技能组[#技能组+1] =  "高级魔之心"
		-- 技能组[#技能组+1] =  "超级神柚复生"
		技能组[#技能组+1] =  daf[取随机数(1,#daf)]
	end
	local 类型="宝宝"
	if 变异概率 then
		if 取随机数()<=变异概率 then
			类型="变异"
		end
	end

	local zz={1420,1220,3500,2020,1200,1200,5000}
	local cz=1.201
	玩家数据[id].召唤兽:添加召唤兽(名称, 名称, 类型, nil, 等级 , nil , 技能组,zz,cz,0)
	常规提示(id,"#Y/你获得了一只"..名称)
end






function 礼包奖励类:增加礼包宠物(id,礼包名称)
	local 技能组 = {}
	local 随机主动技能 = {"超级地狱烈火","超级奔雷咒","超级泰山压顶","超级水漫金山","八凶法阵","天降灵葫","食指大动","流沙轻音","叱咤风云","扶摇万里"}

	if 	   礼包名称 == "24技能善恶"    then
		技能组={"超级偷袭","超级夜战","超级吸血","超级神柚复生","超级必杀","超级强力","无上正真","超级感知","超级敏捷","超级幸运","超级慧根","超级冥思",
					"超级飞行","超级神迹","超级防御","超级驱鬼","超级再生","超级招架","风起龙游","净台妙谛","特色善恶有报","溜之大吉","超级否定信仰","虎虎生风"}

	elseif 礼包名称 == "24技能攻宠"    then
		技能组={"超级偷袭","超级夜战","超级吸血","超级神柚复生","超级必杀","超级强力","无上正真","超级感知","超级敏捷","超级幸运","超级慧根","超级冥思",
					"超级飞行","超级神迹","超级防御","超级驱鬼","超级再生","超级招架","净台妙谛","超级连击","溜之大吉","超级否定信仰","虎虎生风"}

	elseif 礼包名称 == "定制宠礼盒（法术）"    then
		技能组={"须弥真言","出其不意","水漫金山","高级法术暴击","高级法术波动","高级法术连击","高级魔之心","高级神佑复生","高级感知","超级敏捷"}

	elseif 礼包名称 == "定制宠礼盒（物理）"    then
		技能组={"无上正真","津津有味","高级连击","高级必杀","高级吸血","高级夜战","高级敏捷","高级神佑复生","高级感知","超级偷袭"}

	elseif 礼包名称 == "24技能法宠"    then
		技能组 = {"超级法术暴击","超级法术连击","超级防御","超级幸运","超级法术波动","超级神迹","超级冥思","超级慧根","超级感知","超级敏捷","超级反震",
					"超级招架","超级再生","超级魔之心","超级精神集中"}
		技能组[#技能组+1] =  随机主动技能[取随机数(1,#随机主动技能)]
	end

	local zz={1600,1600,5800,3800,1600,1600,5000}
	local cz=1.35
	local sj模型="进阶妙华天女" or "进阶雷龙" or "进阶大力金刚"
	玩家数据[id].召唤兽:添加召唤兽(sj模型, sj模型, "宝宝", nil, 0 , nil , 技能组,zz,cz,0)
	常规提示(id,"#Y/你获得了一只"..礼包名称)
end

function 礼包奖励类:增加礼包胚子(id,额外技能数量)
	local sj技能范围 = {"反震","吸血","反击","连击","飞行","驱鬼","隐身","感知","再生","冥思","慧根","必杀","幸运","神迹","招架","永恒","敏捷","强力","防御","偷袭","毒","驱鬼","鬼魂术","魔之心","神佑复生","精神集中","否定信仰","雷击","落岩","水攻","烈火","法术连击","法术暴击","法术波动","雷属性吸收","土属性吸收","火属性吸收","水属性吸收","迟钝"}
	local 技能组 = {}
	local sj技能范围2 = {"地狱烈火","奔雷咒","泰山压顶","水漫金山"}
	for i=1,额外技能数量 do
		local xh = 取随机数(1,#sj技能范围)
		技能组[#技能组+1] =  sj技能范围[xh]
		table.remove(sj技能范围,xh)
	end
local zz={2000,1800,8000,3800,1600,1600,5000}
local cz=1.3
local sj模型="毗舍童子"
玩家数据[id].召唤兽:添加召唤兽(sj模型, sj模型, "宝宝", nil, 0 , nil , 技能组,zz,cz,0)
常规提示(id,"#Y/你获得了一只"..额外技能数量.."技能"..sj模型)
end





function 礼包奖励类:新手宝石(id,宝石等级,门派,专用)
	if 门派~="无门派" then
		if 门派=="天宫" or 门派=="龙宫" or 门派=="魔王寨" or 门派=="神木林"  then
			玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,nil,专用)
			玩家数据[id].道具:给予道具(id,"舍利子",宝石等级,nil,nil,专用)
			玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,nil,专用)
		elseif 门派=="凌波城" or 门派=="花果山" or 门派=="狮驼岭" or 门派=="大唐官府" then
			玩家数据[id].道具:给予道具(id,"红玛瑙",宝石等级,nil,nil,专用)
			玩家数据[id].道具:给予道具(id,"红玛瑙",宝石等级,nil,nil,专用)
			玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,nil,专用)
		else
		    玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,nil,专用)
			玩家数据[id].道具:给予道具(id,"光芒石",宝石等级,nil,nil,专用)
			玩家数据[id].道具:给予道具(id,"月亮石",宝石等级,nil,nil,专用)
		end
	else
		  玩家数据[id].道具:给予道具(id,"黑宝石",宝石等级,nil,nil,专用)
		  玩家数据[id].道具:给予道具(id,"光芒石",宝石等级,nil,nil,专用)
		  玩家数据[id].道具:给予道具(id,"月亮石",宝石等级,nil,nil,专用)
	end
end

function 礼包奖励类:领取新手礼包(id,等级)
	if 玩家数据[id].角色.成长礼包==nil then
		常规提示(id,"你已经领取过了")
		return
	elseif 玩家数据[id].角色.等级<等级 then
		常规提示(id,"当前等级不足"..等级.."级，继续努力吧")
		return
	end
	if 等级==20 then
		if 玩家数据[id].角色.成长礼包.礼包一 then
			常规提示(id,"你已经领取过了")
			return
		end
		if #玩家数据[id].召唤兽.数据 >= 玩家数据[id].角色.召唤兽携带上限 then
			常规提示(id, "#Y/召唤兽已满，需保留两个召唤兽格子")
			return
		end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包一=true
	--	self:全套专用装备(id,110,"无级别限制",id)
		-- 玩家数据[id].角色:添加储备(500000,"新手礼包",1)

		local 临时道具 = {可叠加=false,总类=11,xy={[2]={y=11,x=495},[5]={y=273,x=12},[3]={y=117,x=457},[7]={y=105,x=192},[1]={y=7,x=312},[4]={y=186,x=389},[6]={y=240,x=277},[8]={y=248,x=474},[9]={y=197,x=475},[10]={y=167,x=364},[11]={y=86,x=292},[12]={y=180,x=130},[13]={y=19,x=383}  ,[14]={x=238,y=166},[15]={x=133,y=93},[16]={x=106,y=51},[17]={x=181,y=262},[18]={x=324,y=265},[19]={x=408,y=214},[20]={x=512,y=277},[21]={x=496,y=138},[22]={x=518,y=94},[23]={x=529,y=126},[24]={x=358,y=35},[25]={x=404,y=68} },地图=1001,子类=50,y=7,x=312,分类=2,次数=70,名称="红色合成旗"}
		玩家数据[id].道具:给予道具(id,nil,nil,nil,"领取新手","专用",临时道具,nil,nil,"新手礼包")


		-- if  RpbARGB.序列==5 then
		-- 	local zz={1220,1220,2500,1200,1200,1200,5000}
		-- 	local cz=1.0
		-- 	local jnz ={"必杀","连击","偷袭","吸血","夜战","隐身","敏捷","水攻","烈火","落岩","雷击"}
		-- 	玩家数据[id].召唤兽:添加召唤兽("海毛虫", "海毛虫", "变异", nil, 0 , nil , jnz,zz,cz,0)
		-- else
		-- end


	elseif 等级==30 then
		if 玩家数据[id].角色.成长礼包.礼包二 then
			常规提示(id,"你已经领取过了")
			return
		end
		   常规提示(id,"领取成功！")
		   玩家数据[id].角色.成长礼包.礼包二=true
		   玩家数据[id].角色:增加种族坐骑(id)
		   玩家数据[id].道具:给予道具(id,"金银锦盒",20,nil,nil)
		   -- self:新手宝石(id,1,玩家数据[id].角色.门派,"专用")
		   -- 玩家数据[id].角色:添加经验(100000,"新手礼包",1)
		   -- 玩家数据[id].道具:给予道具(id,"秘宝宝箱",nil,nil,nil,"专用")
		   -- 玩家数据[id].道具:给予道具(id,"机缘宝箱",nil,nil,nil,"专用")
	elseif 等级==40 then
		if 玩家数据[id].角色.成长礼包.礼包三 then
			常规提示(id,"你已经领取过了")
			return
		end
		-- if #玩家数据[id].召唤兽.数据 >= 玩家数据[id].角色.召唤兽携带上限 then
		-- 	常规提示(id, "#Y/召唤兽已满，需保留两个召唤兽格子")
		-- 	return
		-- end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包三=true
		-- if 取随机数()<=50 then
		-- end

		for i=1,5 do
			玩家数据[id].道具:给予道具(id,"九转金丹",10,nil,nil,"专用")
			玩家数据[id].道具:给予道具(id,"修炼果",i,nil,nil)
		end
		-- 玩家数据[id].角色:添加经验(100000,"新手礼包",1)
	elseif 等级==50 then
		if 玩家数据[id].角色.成长礼包.礼包四 then
			常规提示(id,"你已经领取过了")
			return
		end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包四=true
        -- self:新手宝石(id,1,玩家数据[id].角色.门派,"专用")
		-- 玩家数据[id].角色:添加储备(1000000,"新手礼包",1)
		-- 玩家数据[id].道具:给予道具(id,"金银锦盒",10,nil,nil)
		-- 玩家数据[id].道具:给予道具(id,"机缘宝箱",nil,nil,nil)
		玩家数据[id].道具:给予道具(id,"彩果",20,nil,nil)
		玩家数据[id].道具:给予道具(id,"鬼谷子",nil,"鸟翔阵")
		玩家数据[id].道具:给予道具(id,"修炼果",3,nil,nil)
		玩家数据[id].道具:给予道具(id,"九转金丹",10,nil,nil,"专用")
		玩家数据[id].道具:给予道具(id,"九转金丹",10,nil,nil,"专用")
		-- local 临时道具={可叠加=false,总类=11,xy={[1]={y=13,x=13},[2]={y=55,x=29},[3]={y=120,x=55},[4]={y=133,x=167},[5]={y=13,x=209}},地图=1092,子类=50,y=7,x=312,分类=2,次数=70,名称="黄色合成旗"}
		-- 玩家数据[id].道具:给予道具(id,nil,nil,nil,"领取新手","专用",临时道具,nil,nil,"新手礼包")
	elseif 等级==60 then
		if 玩家数据[id].角色.成长礼包.礼包五 then
			常规提示(id,"你已经领取过了")
			return
		end
		-- if #玩家数据[id].召唤兽.数据 >= 玩家数据[id].角色.召唤兽携带上限 then
		-- 	常规提示(id, "#Y/召唤兽已满，需保留一个召唤兽格子")
		-- 	return
		-- end
		常规提示(id,"领取成功！")
		玩家数据[id].角色.成长礼包.礼包五=true
		-- 玩家数据[id].道具:给予道具(id,"新春飞行符",10,nil,nil,"专用")
		-- if RpbARGB.序列==1 then
		-- else
		--self:增加宠物(id,"超级恶魔泡泡","攻",5,1,100)
		-- end
		玩家数据[id].道具:给予道具(id,"秘宝宝箱",nil,nil,nil,"专用")
		玩家数据[id].道具:给予道具(id,"机缘宝箱",nil,nil,nil,"专用")

		-- 玩家数据[id].道具:给予道具(id,"鬼谷子",nil,"鹰啸阵")

	end
	发送数据(玩家数据[id].连接id,3716,{内容=玩家数据[id].角色.成长礼包})
	if 玩家数据[id].角色.成长礼包.礼包一 and 玩家数据[id].角色.成长礼包.礼包二 and 玩家数据[id].角色.成长礼包.礼包三 and 玩家数据[id].角色.成长礼包.礼包四 and 玩家数据[id].角色.成长礼包.礼包五 then
		玩家数据[id].角色.成长礼包=nil
		玩家数据[id].道具:消耗背包道具(玩家数据[id].连接id,id,"新手大礼包",1)
	end
end

function 礼包奖励类:剧情奖励30(id)
	玩家数据[id].角色:添加经验(2000000,"35级奖励")
	玩家数据[id].角色:添加银子(50000,"35级奖励",1)
	玩家数据[id].角色:添加储备(500000,"35级奖励",1)
end

function 礼包奖励类:剧情奖励50(id)
	玩家数据[id].角色:添加经验(3000000,"55级奖励")
	玩家数据[id].角色:添加银子(50000,"55级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"55级奖励",1)
end

function 礼包奖励类:剧情奖励70(id)
	玩家数据[id].角色:添加经验(3000000,"75级奖励")
	玩家数据[id].角色:添加银子(150000,"75级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"75级奖励",1)
end

function 礼包奖励类:剧情奖励80(id)
	玩家数据[id].角色:添加经验(5000000,"80级奖励")
	玩家数据[id].角色:添加银子(200000,"80级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"80级奖励",1)
end

function 礼包奖励类:剧情奖励85(id)
	玩家数据[id].角色:添加经验(5000000,"85级奖励")
	玩家数据[id].角色:添加银子(250000,"85级奖励",1)
	玩家数据[id].角色:添加储备(1000000,"85级奖励",1)
end

function 礼包奖励类:剧情奖励20(id)
	玩家数据[id].角色:添加经验(3000000,"25级奖励")
	玩家数据[id].角色:添加银子(50000,"25级奖励",1)
	玩家数据[id].角色:添加储备(200000,"25级奖励",1)
end

function 礼包奖励类:全套灵饰(id,等级,无级别,专用)
	for n=1,#随机灵饰 do
		local 名称=制造装备[随机灵饰[n]][等级]
		local 临时道具 = 玩家数据[id].道具:灵饰处理(id,名称,等级,3,随机灵饰[n])
		if 玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,临时道具) then
			常规提示(id,"#Y/你得到了#R/"..名称)
		end
	end
end

function 礼包奖励类:固定属性装备(id,等级,无级别,专用)  --武神坛专用装备礼包
	if 等级>=100 then
		等级=等级/10
		等级=math.floor(等级)
	else
		等级=等级/10
		等级=math.floor(等级)
	end
	等级=math.floor(等级)
	local 模型=玩家数据[id].角色.模型
	local 武器序列=角色武器类型[模型][取随机数(1,#角色武器类型[模型])]
	local 武器名称=装备处理类.打造物品[武器序列][等级+1]
	if 等级>=9 and 等级<12 then
		武器名称=装备处理类.打造物品[武器序列][取随机数(10,12)]
	elseif 等级>=12 and 等级<16 then
		武器名称=装备处理类.打造物品[武器序列][取随机数(13,16)]
	end
	local 衣服类型=2
	if 玩家数据[id].角色.性别=="女" then
		衣服类型=1
	end
	local 衣服序列=21
	local 衣服名称= 装备处理类.打造物品[衣服序列][等级+1][衣服类型]
	local 头盔类型=1
	if 玩家数据[id].角色.性别=="女" then
		头盔类型=2
	end
	local 头盔序列=19
	local 头盔名称= 装备处理类.打造物品[头盔序列][等级+1][头盔类型]
	local 项链序列=20
	local 项链名称= 装备处理类.打造物品[项链序列][等级+1][取随机数(1,2)]
	if type(装备处理类.打造物品[项链序列][等级+1])=="table" then
		项链名称= 装备处理类.打造物品[项链序列][等级+1][取随机数(1,2)]
	else
		项链名称= 装备处理类.打造物品[项链序列][等级+1]
	end
	local 腰带序列=22
	local 腰带名称= 装备处理类.打造物品[腰带序列][等级+1][取随机数(1,2)]
	if type(装备处理类.打造物品[腰带序列][等级+1])=="table" then
		腰带名称= 装备处理类.打造物品[腰带序列][等级+1][取随机数(1,2)]
	else
		腰带名称= 装备处理类.打造物品[腰带序列][等级+1]
	end
	local 鞋子序列=23
	local 鞋子名称= 装备处理类.打造物品[鞋子序列][等级+1]
	local 临时道具 = 1
	装备处理类:生成固定属性装备(id,等级*10,武器序列,武器名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成固定属性装备(id,等级*10,衣服序列,衣服名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成固定属性装备(id,等级*10,头盔序列,头盔名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成固定属性装备(id,等级*10,项链序列,项链名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成固定属性装备(id,等级*10,腰带序列,腰带名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成固定属性装备(id,等级*10,鞋子序列,鞋子名称,"系统产出",nil,true,id,无级别)
	常规提示(id,"#Y/你获得了"..(等级*10).."级全套装备")
end

function 礼包奖励类:全套专用装备(id,等级,无级别,专用)
	if 等级>=100 then
		等级=等级/10
		等级=math.floor(等级)
	else
		等级=等级/10
		等级=math.floor(等级)
	end
	等级=math.floor(等级)
	local 模型=玩家数据[id].角色.模型
	local 武器序列=角色武器类型[模型][取随机数(1,#角色武器类型[模型])]
	local 武器名称=装备处理类.打造物品[武器序列][等级+1]
	if 等级>=9 and 等级<12 then
		武器名称=装备处理类.打造物品[武器序列][取随机数(10,12)]
	elseif 等级>=12 and 等级<15 then
		武器名称=装备处理类.打造物品[武器序列][取随机数(13,15)]
	end
	local 衣服类型=2
	if 玩家数据[id].角色.性别=="女" then
		衣服类型=1
	end
	local 衣服序列=21
	local 衣服名称= 装备处理类.打造物品[衣服序列][等级+1][衣服类型]
	local 头盔类型=1
	if 玩家数据[id].角色.性别=="女" then
		头盔类型=2
	end
	local 头盔序列=19
	local 头盔名称= 装备处理类.打造物品[头盔序列][等级+1][头盔类型]
	local 项链序列=20
	local 项链名称= 装备处理类.打造物品[项链序列][等级+1][取随机数(1,2)]
	if type(装备处理类.打造物品[项链序列][等级+1])=="table" then
		项链名称= 装备处理类.打造物品[项链序列][等级+1][取随机数(1,2)]
	else
		项链名称= 装备处理类.打造物品[项链序列][等级+1]
	end
	local 腰带序列=22
	local 腰带名称= 装备处理类.打造物品[腰带序列][等级+1][取随机数(1,2)]
	if type(装备处理类.打造物品[腰带序列][等级+1])=="table" then
		腰带名称= 装备处理类.打造物品[腰带序列][等级+1][取随机数(1,2)]
	else
		腰带名称= 装备处理类.打造物品[腰带序列][等级+1]
	end
	local 鞋子序列=23
	local 鞋子名称= 装备处理类.打造物品[鞋子序列][等级+1]
	local 临时道具 = 1
	装备处理类:生成打造装备(id,等级*10,武器序列,武器名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成打造装备(id,等级*10,衣服序列,衣服名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成打造装备(id,等级*10,头盔序列,头盔名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成打造装备(id,等级*10,项链序列,项链名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成打造装备(id,等级*10,腰带序列,腰带名称,"系统产出",nil,true,id,无级别)
	装备处理类:生成打造装备(id,等级*10,鞋子序列,鞋子名称,"系统产出",nil,true,id,无级别)
	常规提示(id,"#Y/你获得了"..(等级*10).."级全套装备")
end

return 礼包奖励类