-- @Author: 作者QQ381990860
-- @Date:   2023-05-07 18:07:46
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-12-13 11:10:26
-- @Author: 作者QQ381990860
-- @Date:   2023-01-25 16:24:35
-- @Last Modified by:   作者QQ381990860
-- @Last Modified time: 2023-05-06 23:45:57
-- @Author: 作者QQ381990860
-- @Date:   2022-10-26 09:35:14
-- @Last Modified by:   作者QQ381990860
-- @Last Modified time: 2023-01-28 03:14:07
-- @Author: 作者QQ381990860
-- @Date:   2022-09-27 00:49:38
-- @Last Modified by:   作者QQ381990860
-- @Last Modified time: 2022-10-05 00:40:53
魔你=class()
local 精炼消耗={
[1]={数量=100,名称="万能石",银子=10000,经验=5000},
[2]={数量=150,名称="万能石",银子=15000,经验=2000},
[3]={数量=200,名称="万能石",银子=20000,经验=3000},
[4]={数量=250,名称="万能石",银子=25000,经验=5000},
[5]={数量=300,名称="万能石",银子=30000,经验=8000},
[6]={数量=350,名称="万能石",银子=35000,经验=10000},
[7]={数量=400,名称="万能石",银子=40000,经验=15000},
[8]={数量=500,名称="万能石",银子=45000,经验=20000},
[9]={数量=600,名称="万能石",银子=60000,经验=30000},
[10]={数量=700,名称="万能石",银子=70000,经验=40000},
[11]={数量=111,名称="万能石",银子=80000,经验=50000},
}
local 备份消耗={
[1]={数量=1,名称="锻造成功石",银子=1111,经验=222},
[2]={数量=1,名称="锻造成功石",银子=22111,经验=222},
[3]={数量=1,名称="锻造成功石",银子=33111,经验=222},
[4]={数量=1,名称="锻造成功石",银子=44111,经验=222},
[5]={数量=1,名称="锻造成功石",银子=111,经验=222},
[6]={数量=1,名称="锻造成功石",银子=111,经验=222},
[7]={数量=1,名称="锻造成功石",银子=111,经验=222},
[8]={数量=1,名称="锻造成功石",银子=111,经验=222},
[9]={数量=1,名称="锻造成功石",银子=111,经验=222},
[10]={数量=1,名称="锻造成功石",银子=111,经验=222},  -------- 1-10无需更改无效
[11]={数量=5000,名称="锻造成功石",银子=100000000,经验=5000000},
}
local 载入消耗={
[1]={银子=122,经验=333},
[2]={银子=222,经验=333},
[3]={银子=322,经验=333},
[4]={银子=422,经验=333},
[5]={银子=522,经验=333},
[6]={银子=622,经验=333},
[7]={银子=722,经验=333},
[8]={银子=822,经验=333},
[9]={银子=922,经验=333},
[10]={银子=1022,经验=333},
[11]={银子=1000000,经验=0},
}
local 还原消耗={
[0]={数量=1,名称="锻造成功石",银子=100000,经验=10000},
[1]={数量=10,名称="锻造成功石",银子=120000,经验=10000},
[2]={数量=20,名称="锻造成功石",银子=130000,经验=10000},
[3]={数量=30,名称="锻造成功石",银子=140000,经验=10000},
[4]={数量=40,名称="锻造成功石",银子=150000,经验=10000},
[5]={数量=50,名称="锻造成功石",银子=160000,经验=10000},
[6]={数量=60,名称="锻造成功石",银子=170000,经验=10000},
[7]={数量=70,名称="锻造成功石",银子=180000,经验=10000},
[8]={数量=80,名称="锻造成功石",银子=190000,经验=10000},
[9]={数量=90,名称="锻造成功石",银子=200000,经验=10000},
[10]={数量=100,名称="锻造成功石",银子=210000,经验=10000},
[11]={数量=110,名称="锻造成功石",银子=220000,经验=10000},
}
local 兑换物品={神兜兜=2,修炼果=10,锻造成功石=300,翅膀碎片=10,
                等级150无级别礼包=2000,灵饰信物碎片=2500,初级宠物胚子碎片=100,召唤兽灵力铠甲礼包=100000,召唤兽灵力护腕礼包=100000
                ,召唤兽灵力项圈礼包=100000,召唤兽伤害铠甲礼包=100000,召唤兽伤害项圈礼包=100000,召唤兽伤害护腕礼包=100000
                ,银币礼包=3000,重置石=10000,随机圣装=10000,补天石=50000

               }  --万能石兑换

local 宠物进阶={"大千录","伏龙鼎","星盘","玄火鉴"}
local 装备属性={"命中","气血","法防","灵力","魔法","速度","防御","伤害"}
local bds = {"攻资","防资","体资","法资","速资","躲资"}
--定制飞行
local 消耗={
 幻化道具={名称="未开光的玉石",基础数量=1000,递增数量=2},
 幻化保护={名称="凤羽",基础数量=50,递增数量=3},
 进阶道具={名称="凤羽",基础数量=500,递增数量=4},
 进阶保护={名称="凤羽",基础数量=500,递增数量=5},
}
local 翅膀道具={[0]={"秒杀神石",1},{"秒杀神石",150},{"秒杀神石",250},{"秒杀神石",350},{"秒杀神石",500},{"秒杀神石",600},{"秒杀神石",700},{"秒杀神石",800},{"秒杀神石",900},{"秒杀神石",1000},{"秒杀神石",1200},}
local 翅膀银子={[0]=10000000,20000000,30000000,40000000,50000000,60000000,70000000,80000000,90000000,100000000,110000000,120000000,130000000,140000000,150000000,}
local 兑换积分={{"神兜兜",1},{"修炼果",1},{"高级魔兽要诀",100},{"魔兽要诀",50},{"特殊魔兽要诀",200},{"灵饰信物碎片",500},{"心魔宝珠",1},{"斗气",165},{"生机",165}
,{"极影",165},{"御敌",165},{"会神",165},{"健体",165},{"灭杀",165},{"甲身",165},{"藏隐",165},{"凝神",165},{"疾风",165},{"通灵",165},{"幸运苹果(小)",10},{"幸运苹果(中)",30},{"幸运苹果(大)",50},{"圣装石",15}
} --一键回收
local 宠物技能增幅消耗={
[1]={"神兜兜",300},
[2]={"神兜兜",400},
[3]={"神兜兜",500},
[4]={"神兜兜",600},
[5]={"神兜兜",700},
[6]={"神兜兜",800},
[7]={"神兜兜",900},
[8]={"神兜兜",1000},
[9]={"神兜兜",1100},
[10]={"神兜兜",1200},
[11]={"神兜兜",1300},
[12]={"神兜兜",1400},
}
 local 战将消耗={
 [1]={[1]={"万能石",100},[2]={"万能石",200},[3]={"万能石",300},[4]={"万能石",400},[5]={"万能石",500},战将={"万能石",500}},  --前面是宝石对应1-5 最后是战将升级材料以及个数
 [2]={[1]={"万能石",200},[2]={"万能石",300},[3]={"万能石",400},[4]={"万能石",500},[5]={"万能石",600},战将={"万能石",1000}},
 [3]={[1]={"万能石",300},[2]={"万能石",400},[3]={"万能石",500},[4]={"万能石",600},[5]={"万能石",700},战将={"万能石",1500}},
 [4]={[1]={"万能石",400},[2]={"万能石",500},[3]={"万能石",600},[4]={"万能石",700},[5]={"万能石",800},战将={"万能石",2000}},
 [5]={[1]={"万能石",500},[2]={"万能石",600},[3]={"万能石",700},[4]={"万能石",800},[5]={"万能石",900},战将={"万能石",2500}},
}
--
 local 线性消耗={
  [1]={{"会员物品卡",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",10}},
  [2]={{"会员银币卡",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",10}},
  [3]={{"会员经验卡",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",1},{"万能石",10}}
 }
 动画形象={
[1]={形象="海毛虫",增加=1,消耗="东海拓印石",数量=5},
[2]={形象="树怪",增加=1,消耗="江南拓印石",数量=10},
[3]={形象="山贼",增加=1,消耗="国境拓印石",数量=15},
[4]={形象="老虎",增加=1,消耗="境外拓印石",数量=20},
[5]={形象="花妖",增加=1,消耗="花果山拓印石",数量=25},
[6]={形象="兔子怪",增加=1,消耗="月宫拓印石",数量=30},
[7]={形象="古代瑞兽",增加=1,消耗="北俱拓印石",数量=35},
[8]={形象="蛟龙",增加=3,消耗="龙窟拓印石",数量=40},
[9]={形象="凤凰",增加=3,消耗="凤巢拓印石",数量=45},
[10]={形象="百足将军",增加=3,消耗="麒麟拓印石",数量=50},
[11]={形象="犀牛将军兽形",增加=3,消耗="解阳拓印石",数量=55},
[12]={形象="日游神",增加=3,消耗="太岁拓印石",数量=60},
[13]={形象="碧水夜叉",增加=3,消耗="子母拓印石",数量=65},
[14]={形象="吸血鬼",增加=3,消耗="鬼城拓印石",数量=70},
[15]={形象="律法女娲",增加=3,消耗="女娲拓印石",数量=75},
[16]={形象="超级大熊猫",增加=3,消耗="凌云渡拓印石",数量=80},
[17]={形象="葫芦宝贝",增加=3,消耗="碗子山拓印石",数量=85},
[18]={形象="狂豹人形",增加=3,消耗="波月拓印石",数量=90},
[19]={形象="夜罗刹",增加=3,消耗="西天拓印石",数量=95},
[20]={形象="大力金刚",增加=3,消耗="雷音寺拓印石",数量=100},
[21]={形象="进阶龙龟",增加=3,消耗="蓬莱拓印石",数量=105},
[22]={形象="进阶机关兽",增加=3,消耗="墨家拓印石",数量=110},
[23]={形象="进阶机关鸟",增加=3,消耗="墨家禁地拓印石",数量=115},
[24]={形象="修罗傀儡妖",增加=5,消耗="比丘拓印石",数量=120},
[25]={形象="修罗傀儡鬼",增加=5,消耗="柳林坡拓印石",数量=125},
[26]={形象="进阶毗舍童子",增加=5,消耗="须弥拓印石",数量=130},
[27]={形象="将军",增加=5,消耗="第二世界拓印石",数量=150,附体="将军"},
[28]={形象="龙将",增加=5,消耗="第二世界拓印石",数量=150,附体="龙将"},
[29]={形象="宁采臣",增加=5,消耗="第二世界拓印石",数量=150,附体="宁采臣"},
[30]={形象="白发魔王",增加=5,消耗="第二世界拓印石",数量=150,附体="白发魔王"},
[31]={形象="进阶超级大熊猫",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级大熊猫"},
[32]={形象="进阶超级赤焰兽",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级赤焰兽"},
[33]={形象="进阶超级人参娃娃",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级人参娃娃"},
 [34]={形象="进阶超级金猴",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级金猴"},
 [35]={形象="进阶超级麒麟",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级麒麟"},
 [36]={形象="进阶超级神龙",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级神龙"},
 [37]={形象="进阶超级六耳猕猴",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级六耳猕猴"},
 [38]={形象="进阶超级神牛",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级神牛"},
 [39]={形象="进阶超级泡泡",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级泡泡"},
 [40]={形象="进阶超级玉兔",增加=1,消耗="活动拓印石",数量=10,附体="进阶超级玉兔"},






}
local 扫荡奖励={
 [1]={奖励内容={"飞行符","飞行符","飞行符","飞行符"},公告="恭喜获得抓鬼奖励"},--
 [2]={奖励内容={"神兜兜","神兜兜","神兜兜","神兜兜"},公告="恭喜获得抓鬼奖励"},
 [3]={奖励内容={"修炼果","修炼果","修炼果","修炼果"},公告="恭喜获得抓鬼奖励"},
 [4]={奖励内容={"藏宝图","藏宝图","藏宝图","藏宝图"},公告="恭喜获得抓鬼奖励"},
 [5]={奖励内容={"九转金丹","九转金丹","九转金丹","九转金丹"},公告="恭喜获得抓鬼奖励"},
 [6]={奖励内容={"神兜兜","修炼果","藏宝图","九转金丹"},公告="恭喜获得抓鬼奖励"},
}
local 地图扫荡={
[1]={地图="东海湾",奖励={{"东海万能石700-850个",1},{"东海拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"东海圣装石1-50个",1}}},
[2]={地图="江南野外",奖励={{"江南万能石700-850个",1},{"江南拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"江南圣装石1-50个",1}}},
[3]={地图="大唐国境",奖励={{"国境万能石700-850个",1},{"国境拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"国境圣装石1-50个",1}}},
[4]={地图="大唐境外",奖励={{"境外万能石700-950个",1},{"境外拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"境外圣装石1-50个",1}}},
[5]={地图="花果山",奖励={{"花果山能石700-950个",1},{"花果山拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"花果山圣装石1-50个",1}}},
[6]={地图="月宫",奖励={{"月宫万能石700-950个",1},{"月宫拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"月宫圣装石1-50个",1}}},
[7]={地图="北俱芦洲",奖励={{"北俱万能石700-1050个",1},{"北俱拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"北俱圣装石1-50个",1}}},
[8]={地图="龙窟一层",奖励={{"龙窟万能石700-1050个",1},{"龙窟拓印石1-50个",1},{"场景地图苹果（小）10-50个",1},{"龙窟圣装石1-50个",1}}},
[9]={地图="凤巢一层",奖励={{"凤巢万能石700-1050个",1},{"凤巢拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"凤巢圣装石1-50个",1}}},
[10]={地图="麒麟山",奖励={{"麒麟山万能石700-1150个",1},{"麒麟拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"麒麟圣装石1-50个",1}}},
[11]={地图="解阳山",奖励={{"解阳山能石700-1150个",1},{"解阳拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"解阳圣装石1-50个",1}}},
[12]={地图="太岁府",奖励={{"太岁府能石700-1150个",1},{"太岁拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"太岁圣装石1-50个",1}}},
[13]={地图="子母河底",奖励={{"子母万能石700-1150个",1},{"子母拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"子母圣装石1-50个",1}}},
[14]={地图="无名鬼城",奖励={{"鬼城万能石700-1250个",1},{"鬼城拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"鬼城圣装石1-50个",1}}},
[15]={地图="女娲神迹",奖励={{"女娲万能石700-1250个",1},{"女娲拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"女娲圣装石1-50个",1}}},
[16]={地图="凌云渡",奖励={{"凌云渡万能石700-1250个",1},{"凌云渡拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"凌云渡拓印石1-50个",1}}},
[17]={地图="碗子山",奖励={{"碗子山万能石700-1250个",1},{"碗子山拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"碗子山圣装石1-50个",1}}},
[18]={地图="波月洞",奖励={{"波月洞万能石800-1250个",1},{"波月拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"波月圣装石1-50个",1}}},
[19]={地图="小西天",奖励={{"小西天万能石800-1250个",1},{"西天拓印石1-50个",1},{"场景地图苹果（中）10-50个",1},{"西天圣装石1-50个",1}}},
[20]={地图="小雷音寺",奖励={{"雷音寺万能石800-1250个",1},{"雷音寺拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"雷音寺圣装石1-50个",1}}},
[21]={地图="蓬莱仙岛",奖励={{"蓬莱万能石800-1350个",1},{"蓬莱拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"蓬莱圣装石1-50个",1}}},
[22]={地图="墨家村",奖励={{"墨家村万能石800-1350个",1},{"墨家拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"墨家圣装石1-50个",1}}},
[23]={地图="墨家禁地",奖励={{"墨家禁地万能石800-1350个",1},{"墨家禁地拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"墨家禁地圣装石1-50个",1}}},
[24]={地图="比丘国",奖励={{"比丘国万能石1000-1550个",1},{"比丘拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"比丘圣装石1-50个",1}}},
[25]={地图="柳林坡",奖励={{"柳林坡万能石1000-1550个",1},{"柳林坡拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"柳林坡圣装石1-50个",1}}},
[26]={地图="须弥东界",奖励={{"须弥东界万能石1000-1550个",1},{"须弥拓印石1-50个",1},{"场景地图苹果（大）10-50个",1},{"须弥圣装石1-50个",1}}},
}
local 随机词条=   {"龙卷雨击","似玉生香","金刚护法","横扫千军","普渡众生","幽冥鬼眼","飘渺式","含情脉脉",
         "飞砂走石","鹰击","雷霆万钧","落雷符","翻江搅海","落叶萧萧","明光宝烛",
         "神针撼海","破击","炽火流离","尸腐毒","百万神兵","灵动九天","天罗地网"
        ,"自在心法","龙吟","金刚护体","唧唧歪歪","日月乾坤","文韬武略","还阳术"
        ,"一苇渡江","威慑","狮搏","牛劲","大慈大悲","黄庭经","牛逼神功"



         }
local 技能词条={"扶摇万里","进阶善恶有报","水漫金山","进阶力劈华山","善恶有报","力劈华山","泰山压顶"
,"奔雷咒","地狱烈火","落岩","烈火","雷击","水攻","进阶开门见山","进阶蚩尤之搏","死亡召唤","壁垒击破"}
local 装备洗练消耗={
 洗练={
    [1]={"补天石",1},
    [2]={"补天石",1},
    [3]={"补天石",1},
    [4]={"补天石",1},
 },
 增加={
    [1]={"补天石",1},
    [2]={"补天石",1},
    [3]={"补天石",1},
    [4]={"补天石",1},
 }
}
local 套装洗练消耗={
 洗练={
    [1]={"修罗玉",10},
    [2]={"修罗玉",10},
    [3]={"修罗玉",10},
    [4]={"修罗玉",10},
    [5]={"修罗玉",10},
    [6]={"修罗玉",10},
 },
 增加={
    [1]={"修罗玉",10},
    [2]={"修罗玉",10},
    [3]={"修罗玉",10},
    [4]={"修罗玉",10},
    [5]={"修罗玉",10},
    [6]={"修罗玉",10},
 }
}
local 门派秘技消耗={
 {道具=1,保护=1,银子=1000000,经验=1000000},
 {道具=2,保护=1,银子=2000000,经验=2000000},
 {道具=4,保护=1,银子=4000000,经验=4000000},
 {道具=8,保护=1,银子=8000000,经验=8000000},
 {道具=10,保护=1,银子=10000000,经验=10000000},
 {道具=20,保护=1,银子=2000000,经验=20000000},
 {道具=40,保护=1,银子=40000000,经验=40000000},
 {道具=60,保护=1,银子=60000000,经验=60000000},
 {道具=80,保护=1,银子=80000000,经验=80000000},
 {道具=100,保护=1,银子=100000000,经验=100000000},
 {道具=110,保护=2,银子=110000000,经验=110000000},
 {道具=120,保护=2,银子=120000000,经验=120000000},
 {道具=130,保护=2,银子=130000000,经验=130000000},
 {道具=140,保护=2,银子=140000000,经验=140000000},
 {道具=150,保护=2,银子=150000000,经验=150000000},
 {道具=160,保护=3,银子=160000000,经验=160000000},
 {道具=170,保护=3,银子=170000000,经验=170000000},
 {道具=180,保护=3,银子=180000000,经验=180000000},
 {道具=999,保护=3,银子=999999999,经验=999999999},

 道具="菩提果",
 保护="祈福晶石",
 成功几率=30,
}

function 魔你:数据处理(项目,内容)
   -- table.print(内容)
  if 项目=="神祇密藏" then
     self:神祇密藏(内容)
  elseif 项目=="宠物进阶" then
     self:宠物进阶(内容)
  elseif 项目=="飞行" then
   local id=内容.数字id
          if  玩家数据[id].灰行==nil then
            玩家数据[id].灰行={状态="",y=0}
         end
           if  玩家数据[id].灰行.状态=="起飞" then
               玩家数据[id].灰行.状态="降落"
           else
               玩家数据[id].灰行.状态="起飞"
           end
          -- print(玩家数据[id].灰行.状态)
            发送数据(玩家数据[id].连接id,312, 玩家数据[id].灰行)
  elseif 项目=="斗战神" then
    self:斗战神(内容)
   elseif 项目=="挂机刷怪" then
    self:挂机刷怪(内容)
  elseif 项目=="兑换"  then
    self:兑换(内容)
  elseif 项目=="定制"  then
    self:定制(内容)
  elseif 项目=="副本"  then
    self:副本(内容)
  elseif 项目=="翅膀" then
    self:翅膀(内容)
  elseif 项目=="礼包" then
    self:礼包(内容)
  elseif 项目=="积分兑换" then
    self:积分兑换(内容)
  elseif 项目=="线性奖励" then
   self:线性奖励(内容)
  elseif 项目=="宠物技能增幅" then
   self:宠物技能增幅(内容)
  elseif 项目=="战将" then
   self:战将(内容)
   elseif 项目=="霸服" then
   self:霸服(内容)
   elseif 项目=="天赋装备" then
    self:天赋装备(内容)
    elseif 项目=="难度副本" then
    self:难度副本(内容)
    elseif 项目=="拓印" then
    self:拓印(内容)
    elseif 项目=="自动扫荡" then
    self:自动扫荡(内容)
    elseif 项目=="装备洗练" then
    self:装备洗练(内容)
   elseif 项目=="门派秘籍" then
    self:门派秘籍(内容)
  end

end
function 魔你:门派秘籍(内容)
  local 参数=内容.参数
  local id=内容.数字id
  local 序号=内容.序号1
  if 玩家数据[id].角色.门派秘籍==nil then
     玩家数据[id].角色.门派秘籍={}
  end
  if 参数~=0 then
     if 玩家数据[id].角色.门派秘籍[内容.文本]==nil then
        玩家数据[id].角色.门派秘籍[内容.文本]=0
     end
     if 玩家数据[id].角色.门派秘籍[内容.文本]>=180 then
         return 常规提示(id,"已达到满级!")
     end
     local lv=math.floor(玩家数据[id].角色.门派秘籍[内容.文本]/10)+1

     if 玩家数据[id].角色.银子 < 门派秘技消耗[lv].银子 then
         return 常规提示(id,"银子不足!")
     elseif  玩家数据[id].角色.当前经验<门派秘技消耗[lv].经验 then
         return 常规提示(id,"经验不足!")
     end

      local 几率=取随机数()
        if 参数==2 then
            if  not self:消耗道具(id,门派秘技消耗.道具,门派秘技消耗[lv].道具) then
                return
            else
                几率=0
            end
        end

        玩家数据[id].角色:扣除银子(门派秘技消耗[lv].银子,0,0,"门派秘技")
        玩家数据[id].角色:扣除经验(门派秘技消耗[lv].经验,"门派秘技")
        if 几率<=门派秘技消耗.成功几率 then
          玩家数据[id].角色.门派秘籍[内容.文本]=玩家数据[id].角色.门派秘籍[内容.文本]+1
          常规提示(id,"#G经过一番刻苦练习，你的这项#R《十八奇技》#G迈入了第#R"..玩家数据[id].角色.门派秘籍[内容.文本].."#G层！")
        -- if 几率==0 then
        --   常规提示(id,"恭喜保护强化成功")
        -- else
        --   常规提示(id,"恭喜强化成功")
        -- end
        else
            常规提示(id,"练习失败！勤能补拙，还需勤加练习。。。")
        end
 end
     发送数据(玩家数据[id].连接id,675.1,玩家数据[id].角色.门派秘籍)
end

function 魔你:重置窗口(内容)
    发送数据(玩家数据[内容.数字id].连接id,675.2,玩家数据[内容.数字id].角色.门派秘籍)
end
function 魔你:装备洗练(内容)
 -- table.print(内容)
  local 参数=内容.参数
  local id=内容.数字id
  local 序号=内容.序号
 if 测试1==nil then
    测试1=0
 end
  if 参数==1 then
   发送数据(玩家数据[id].连接id, 412, 道具处理类:索要道具1(id, "包裹"))
  elseif 参数==2 then
       内容.编号=内容.编号+0
      local 道具id=玩家数据[id].角色.道具.包裹[序号]
       local 道具=玩家数据[id].物品[道具id]
      -- if not 道具.神装 then
      --   return 常规提示(id,"只有神装可以进行此操作")
      -- end

       if 内容.文本=="增加" and  self:消耗道具(id,装备洗练消耗.增加[内容.编号+0][1],装备洗练消耗.增加[内容.编号+0][2]) then
          if 内容.编号==1  then
             道具.词条={技能=随机词条[取随机数(1,#随机词条)],数值=取随机数(150,350)/100}
          else
             if 道具.词条1==nil then
                道具.词条1={}
             end

             道具.词条1[内容.编号-1]={技能=技能词条[取随机数(1,#技能词条)],数值=取随机数(50,350)/100}
          end

       elseif 内容.文本=="洗练" and  self:消耗道具(id,装备洗练消耗.洗练[内容.编号][1],装备洗练消耗.洗练[内容.编号][2]) then
          if 内容.编号==1  then
             道具.词条={技能=随机词条[取随机数(1,#随机词条)],数值=取随机数(150,350)/100}
          else
             if 道具.词条1==nil then
                 道具.词条1={}
             end

             道具.词条1[内容.编号-1]={技能=技能词条[取随机数(1,#技能词条)],数值=取随机数(50,350)/100}
          end

       end
       发送数据(玩家数据[id].连接id, 412, 道具处理类:索要道具1(id, "包裹"))
  elseif 参数==3 then
       内容.编号=内容.编号+0
       local 道具id=玩家数据[id].角色.道具.包裹[序号]
        local 道具=玩家数据[id].物品[道具id]
        if not 道具.神装 then
        return 常规提示(id,"只有神装可以进行此操作")
      end
       local 套装属性={"伤害","灵力","防御","气血","速度","固定伤害"}
       if 道具.小歪套装==nil then
          道具.小歪套装={}
       end


       if 内容.文本=="增加" and  self:消耗道具(id,套装洗练消耗.增加[内容.编号][1],套装洗练消耗.增加[内容.编号][2]) then
             道具.小歪套装[内容.编号]=套装属性[取随机数(1,#套装属性)]
       elseif 内容.文本=="洗练" and  self:消耗道具(id,套装洗练消耗.洗练[内容.编号][1],套装洗练消耗.洗练[内容.编号][2]) then
             道具.小歪套装[内容.编号]=套装属性[取随机数(1,#套装属性)]
       end
       发送数据(玩家数据[id].连接id, 412, 道具处理类:索要道具1(id, "包裹"))
  end

end
function 魔你:地图扫荡()
    if 自动扫荡.地图扫荡==nil then
       自动扫荡.地图扫荡=0
    end
    自动扫荡.地图扫荡=自动扫荡.地图扫荡+1
    if 自动扫荡.地图扫荡>#地图扫荡 then
    自动扫荡.地图扫荡=1
    end
    local 当前奖励=地图扫荡[自动扫荡.地图扫荡]
    --table.print(当前奖励)
   for n,p in  pairs (玩家数据) do
           if 玩家数据[n]~=nil and 玩家数据[n].角色.地图扫荡==true  then
              for k=1,#当前奖励.奖励 do

                道具处理类:给予道具(n,当前奖励.奖励[k][1],1,nil,当前奖励.奖励[k][2])
                广播消息("#G[地图扫荡_"..当前奖励.地图.."]#W恭喜玩家#R"..玩家数据[n].角色.名称.."#W获得奖励#R"..当前奖励.奖励[k][1]..当前奖励.奖励[k][2].."个")
              end
          end
   end
end
function 魔你:自动扫荡(内容)
  --  table.print(内容)
  local id=内容.数字id
  local 序号=内容.序号
  local 参数=内容.参数
  if 序号==1 then
     if 自动扫荡[id]==nil then
        自动扫荡[id]={}
     end
  elseif 序号==2 then
     if  玩家数据[id].角色.地图扫荡==nil then
          return 常规提示(id,"请先开通扫荡")
     end
     if 参数==5 then
        return 常规提示(id,"#Y每2分钟依次动低级地图进行自动扫荡")
     end
     if 自动扫荡[id][参数]~=nil then
        return 常规提示(id,"今日已经扫荡完成了，每日0点更新")
     end
     自动扫荡[id][参数]=1
     if 参数==1 then
        for n=1,40 do
           local 随机数=取随机数()
           local 奖励=""
           local 数量=0
           local 等级=玩家数据[id].角色.等级
           local 银子=等级*等级*40*(1+(n%10)*0.1)
           local 经验=math.floor((等级*等级+math.random(2000,2500))*(n%10)*3)+80000
           角色处理类:添加经验(玩家数据[id],经验, "抓鬼")
           角色处理类:添加银子(玩家数据[id],银子,"抓鬼")
           if 随机数<=5 then
              奖励="抽奖礼包"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=20 then
              奖励="一大堆万能石"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=30 then
              奖励="一大堆万能石"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=40 then
              奖励="锻造成功石1-10个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=50 then
              奖励="初级宠物胚子碎片1-50个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=60 then
              奖励="战锦结晶石5-10个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=70 then
              奖励="祈福晶石"
              数量=2
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=80 then
              奖励="翅膀碎片10-30个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=90 then
              奖励="翅膀碎片10-30个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)



           end
           if 数量~=0 then
                广播消息("#G[门派扫荡]#W恭喜玩家#R"..玩家数据[id].角色.名称.."#W获得奖励#R"..奖励..数量.."个")
           end
        end
    elseif  参数==2 then
         for n=1,30 do
           local 随机数=取随机数()
           local 奖励=""
           local 数量=0
           local 等级=玩家数据[id].角色.等级
           local 银子=等级*等级*40*(1+(n%10)*0.1)
           local 经验=math.floor((等级*等级+math.random(2000,2500))*(n%10)*3)+80000
           角色处理类:添加经验(玩家数据[id],经验, "抓鬼")
           角色处理类:添加银子(玩家数据[id],银子,"抓鬼")
               if 随机数<=5 then
              奖励="抽奖礼包"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=20 then
              奖励="一大堆万能石"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=30 then
              奖励="一大堆万能石"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=40 then
              奖励="锻造成功石1-10个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=50 then
              奖励="初级宠物胚子碎片1-50个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=60 then
              奖励="战锦结晶石5-10个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=70 then
              奖励="祈福晶石"
              数量=2
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=80 then
              奖励="翅膀碎片10-30个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=90 then
              奖励="翅膀碎片10-30个"
              数量=1
              道具处理类:给予道具(id,奖励,1,nil,数量)


           end
           if 数量~=0 then
         广播消息("#G[群雄扫荡]#W恭喜玩家#R"..玩家数据[id].角色.名称.."#W获得奖励#R"..奖励..数量.."个")
          end
        end

     elseif 参数==3 then
        for n=1,30 do
           local 随机数=取随机数()
           local 奖励=""
           local 数量=0
           local 等级=玩家数据[id].角色.等级
           local 银子=等级*等级*40*(1+(n%10)*0.1)
           local 经验=math.floor((等级*等级+math.random(2000,2500))*(n%10)*3)+80000
           角色处理类:添加经验(玩家数据[id],经验, "抓鬼")
           角色处理类:添加银子(玩家数据[id],银子,"抓鬼")
           if 随机数<=10 then
              奖励="万能石"
              数量=1000
              道具处理类:给予道具(id,奖励,1,nil,数量)
           elseif 随机数<=20 then
              奖励="真言证明"
              数量=5
              道具处理类:给予道具(id,奖励,1,nil,数量)
           end
           if 数量~=0 then
                广播消息("#G[飞贼扫荡]#W恭喜玩家#R"..玩家数据[id].角色.名称.."#W获得奖励#R"..奖励..数量.."个")
           end
        end
      elseif 参数==4 then
        for n=1,30 do
           local 随机数=取随机数()
           local 奖励=""
           local 数量=0
           local 等级=玩家数据[id].角色.等级
           local 银子=等级*等级*40*(1+(n%10)*0.1)
           local 经验=math.floor((等级*等级+math.random(2000,2500))*(n%10)*3)+80000
           角色处理类:添加经验(玩家数据[id],经验, "抓鬼")
           角色处理类:添加银子(玩家数据[id],银子,"抓鬼")
           -- if 随机数<=20 then
           --    奖励="神兜兜"
           --    数量=10
           --    道具处理类:给予道具(id,奖励,1,nil,数量)
           -- elseif 随机数<=50 then
           --    奖励="修炼果"
           --    数量=20
           --    道具处理类:给予道具(id,奖励,1,nil,数量)
           -- end
           -- if 数量~=0 then
             --   广播消息("#G[飞贼扫荡]#W恭喜玩家#R"..玩家数据[id].角色.名称.."#W获得奖励#R"..奖励..数量.."个")
           -- end
        end
      end
  end
  发送数据(玩家数据[id].连接id,411,自动扫荡[id])
end
function 魔你:拓印(内容)
--    table.print(内容)
  local id=内容.数字id
  local 序号=内容.序号
  local 参数=内容.参数
  if 序号==1 then
    if 玩家数据[id].角色.拓印==nil then
       玩家数据[id].角色.拓印={}
    end
   发送数据(玩家数据[id].连接id,410,玩家数据[id].角色.拓印)
  elseif 序号==2 then
    if 玩家数据[id].角色.拓印[参数]==nil then
       玩家数据[id].角色.拓印[参数]=0
    end
    if 玩家数据[id].角色.拓印[参数]>=100 then
       return 常规提示(id,"#Y满级了")
    end
    local 保护=0
    if 内容.文本=="保护升级" then
      if  self:消耗道具(id,"拓印祈福石", 1) then
          保护=70
      else
       return
      end
    end
    if self:消耗道具(id,动画形象[参数].消耗,动画形象[参数].数量) then
       if 取随机数()<=50+保护 then
          玩家数据[id].角色.拓印[参数]=玩家数据[id].角色.拓印[参数]+1
          角色处理类:刷新战斗属性(玩家数据[id])
          发送数据(玩家数据[id].连接id,410,玩家数据[id].角色.拓印)
       else
          return 常规提示(id,"#Y升级失败,成功几率%50")
       end
    end
  elseif 序号==4 then
    for n=参数+1,参数+10 do
          if  玩家数据[id].角色.拓印[n]==nil or 玩家数据[id].角色.拓印[n]<100 then
              return 常规提示(id,"#Y第一页点满100级奖励#R抽奖礼包30个,#Y第二页点满奖励#R抽奖礼包50个,#Y第三页点满奖励#R抽奖礼包80个#Y第四页点满奖励#R挂机证明卷50个,#Y请把拓印全部点满")
          end
    end
    if 玩家数据[id].角色.拓印奖励==nil then
       玩家数据[id].角色.拓印奖励={}
    end
    if 玩家数据[id].角色.拓印奖励[参数] then
        return 常规提示(id,"#Y已经领取过本奖励")
    end

    --
    if 参数<10 and not 玩家数据[id].角色.拓印奖励[1] then
       玩家数据[id].角色.拓印奖励[1]=true
    道具处理类:给予道具(id,"抽奖礼包",1,nil,30)
    elseif 参数<20 and 参数>=10 and not 玩家数据[id].角色.拓印奖励[2] then
        玩家数据[id].角色.拓印奖励[2]=true
    道具处理类:给予道具(id,"抽奖礼包",1,nil,50)
    elseif 参数<30 and 参数>=20 and not 玩家数据[id].角色.拓印奖励[3] then
        玩家数据[id].角色.拓印奖励[3]=true
    道具处理类:给予道具(id,"抽奖礼包",1,nil,80)
    elseif 参数<40 and 参数>=30 and not 玩家数据[id].角色.拓印奖励[4] then
        玩家数据[id].角色.拓印奖励[4]=true
    道具处理类:给予道具(id,"挂机证明卷",1,nil,50)
else
     常规提示(id,"已经领取过了还想要?")
    end
  elseif 序号==3 then
    if  玩家数据[id].角色.拓印[参数]==nil or 玩家数据[id].角色.拓印[参数]<100 then
        return 常规提示(id,"#Y100级之后才可以附体")
    end
    if 动画形象[参数].附体==nil then
       return 常规提示(id,"#Y该拓印无法附体")
    end
            if  玩家数据[id].角色.变身.造型==动画形象[参数].附体 then
                玩家数据[id].角色.变身={造型=nil,技能=nil,属性={数值=0,类型=0,属性=""}}
                常规提示(id,"#Y取消附体")
            else
            玩家数据[id].角色.变身.造型=动画形象[参数].附体
            玩家数据[id].角色.变身.等级=CardData[动画形象[参数].附体].卡片等级
            玩家数据[id].角色.变身.技能=nil
            玩家数据[id].角色.变身.属性.数值 = CardData[动画形象[参数].附体].数值
            玩家数据[id].角色.变身.属性.类型 = CardData[动画形象[参数].附体].类型
            玩家数据[id].角色.变身.属性.属性 = CardData[动画形象[参数].附体].三维
            常规提示(id,"#附体成功")
            end
            角色处理类:刷新战斗属性(玩家数据[id])
            发送数据(玩家数据[id].连接id, 2010, 角色处理类:获取地图数据(玩家数据[id]))
            地图处理类:MapSend(玩家数据[id].id, 1016, 角色处理类:获取地图数据(玩家数据[id]), 玩家数据[id].地图)

  end
end
function 魔你:难度副本(内容)

     local id=内容.数字id
     local 副本=内容.参数
     local 序号=内容.序号
     local 难度地图={100118,100119,100120}
    -- local 难度地图={100106,100107,100108}
        if 序号==1 then
         if 难度副本[id]==nil then
            难度副本[id]={}
            for n=1,3 do
              难度副本[id][n]={难度=1}
            end
         end
         发送数据(玩家数据[id].连接id,409,难度副本[id])
    elseif 序号==3 then
        if not 难度副本[id][副本].完成 then
            return 常规提示(id,"免费次数无法重置")
        end
      if self:消耗道具(id,"重置石",1) then
          难度副本[id][副本].难度=取随机数(1,6)
          常规提示(id,"重置成功")
          发送数据(玩家数据[id].连接id,409,难度副本[id])
      end
    elseif 序号==2 then
        local 检查=true
        local 检查id
         local id组={}
        if 玩家数据[id].队伍==0 then
           id组={id}
        else
           id组=队伍数据[id].队员数据
        end
--检查
        for n=1,#id组 do
           -- print(id组[n])
           if 难度副本[id组[n]]==nil then
                 难度副本[id组[n]]={}
                for i=1,3 do
                   难度副本[id组[n]][i]={难度=取随机数(1,6)}
                end
           end
           if 难度副本[id组[n]][副本].完成 then
              检查=false
              检查id=id组[n]
           end
           if 玩家数据[id组[n]].角色.等级<=88 then
               return 常规提示(id,"#id"..id组[n].."等级不足或已经完成过该副本")
           end
        end
--判断检查

        if not 检查 and self:消耗道具(id,"副本令",1)  then
           检查=true
        end
--未通过
        if not 检查 then
           return 常规提示(id,"#id"..检查id.."已经完成过该副本,队长携带#R副本令#W可以据徐完成")
        end
--写入所有成员完成记录


        任务控制类:刷出难度副本(id,副本,难度副本[id][副本].难度)
         for n=1,#id组 do
             难度副本[id组[n]][副本].完成=true
             难度副本[id组[n]][副本].难度=1
         end
          发送数据(玩家数据[id].连接id,409,难度副本[id])
        地图处理类:Jump(id组[1], 难度地图[副本], 20, 30,true)
    end



end
function 魔你:天赋装备(内容)
 local 项目=内容.参数
 local id=内容.数字id
 if 玩家数据[id].角色.天赋装备[项目] >=160 then
     常规提示(id,"#Y已达到满级")
     return
 end
 local 等级= 玩家数据[id].角色.天赋装备[项目]
    if self:消耗道具(id,"万能石",等级*100) then  --天赋装备消耗材料
        玩家数据[id].角色.天赋装备[项目] =玩家数据[id].角色.天赋装备[项目]+1
         角色处理类:刷新装备属性(玩家数据[id])
        发送数据(玩家数据[id].连接id,1071,玩家数据[id].角色.天赋装备)
    else
         常规提示(id,"#Y材料不足")
     return
    end
end
function 魔你:霸服(内容)
      local 消耗= {300,500,700,900,1100,1300,1500,1700,1900,2100}
      local 消耗物品={"万能石","万能石","万能石","万能石","万能石","万能石","万能石","万能石","万能石","万能石"}
     -- local 进阶消耗={"万能石","神兜兜"}
      local 随机技能={"生命之泉" ,"普渡众生" ,"火甲术","颠倒五行","乾坤妙法","天地同寿","四面埋伏","灵动九天","神龙摆尾",
    "佛法无边","幽冥鬼眼","一苇渡江","金刚护体","金刚护法","不动如山","韦陀护法","明光宝烛","镇魂诀","金身舍利","蜜润","红袖添香",
    "达摩护体" ,"定心术","潜力激发","杀气诀","魔王回首","牛劲" ,"安神诀" ,"极度疯狂" ,"分身术","百毒不侵" ,"楚楚可怜","盘丝阵" ,"移魂化骨",
    "天神护法" ,"天神护体","逆鳞" ,"炎护" ,"碎星诀","乘风破浪","凝神术","匠心·削铁","匠心·固甲","无所遁形","铜头铁臂","气慑天军","无畏布施"
    ,"高级偷袭","高级夜战","高级必杀","高级神佑复生","高级反震","高级吸血","善恶有报","龙卷雨击","似玉生香","金刚护法","横扫千军","普渡众生","幽冥鬼眼","飘渺式","含情脉脉",
         "飞砂走石","鹰击","雷霆万钧","落雷符","翻江搅海","落叶萧萧","明光宝烛",
         "神针撼海","破击","炽火流离","尸腐毒","百万神兵","灵动九天","天罗地网"
        ,"自在心法","龙吟","金刚护体","唧唧歪歪","日月乾坤","文韬武略","还阳术"
        ,"一苇渡江","威慑","狮搏","牛劲","大慈大悲","黄庭经","牛逼神功",
        "扶摇万里","进阶善恶有报","水漫金山","进阶力劈华山","善恶有报","力劈华山","泰山压顶"
       ,"奔雷咒","地狱烈火","落岩","烈火","雷击","水攻","进阶开门见山","进阶蚩尤之搏","死亡召唤","壁垒击破"
 -- local 随机技能={"鹰击"

}
      local id=内容.数字id
      if 内容.文本=="霸服" then
         if 玩家数据[id].角色.霸服==nil then
            玩家数据[id].角色.霸服=1
         end
         if 玩家数据[id].角色.技能词条==nil then
            玩家数据[id].角色.技能词条={等级=1,词条={}}
         end
      elseif 内容.文本=="升级" then

        if 玩家数据[id].角色.霸服>=100 then
           常规提示(id,"#Y已达到满级")
          return
        end
        local 等级=math.floor(玩家数据[id].角色.霸服/10)+1
        if self:消耗道具(id,消耗物品[等级],消耗[等级]) then
            玩家数据[id].角色.霸服= 玩家数据[id].角色.霸服+1
        end
      elseif 内容.文本=="词条升级" then
        local lv= 玩家数据[id].角色.技能词条.等级
        if lv>=130 then
          return 常规提示(id,"已经满级了")
        end
          if self:消耗道具(id,"万能石",lv^2) then
             玩家数据[id].角色.技能词条.等级=玩家数据[id].角色.技能词条.等级+1
          end
      elseif 内容.文本=="词条洗练" then
        if 玩家数据[id].角色.技能词条.等级/10<内容.参数 then
           return 常规提示(id,"每十级才能增加洗练一个")
        end
        if self:消耗道具(id,"补天石",1) then
              玩家数据[id].角色.技能词条.词条[内容.参数]={技能=随机技能[取随机数(1,#随机技能)],数值=取随机数(1,100)/100}
        end

      end
      发送数据(玩家数据[id].连接id,408,{霸服=玩家数据[id].角色.霸服,进阶=玩家数据[id].角色.技能词条})
end
function 魔你:战将(内容)
  local id=内容.数字id
  if 内容.文本=="战将" then
    local 战将=玩家数据[id].角色.战将
    if 战将[内容.参数].等级>=500 then
       常规提示(id,"#Y已达到满级")
       return
    elseif 内容.参数~=1 and   战将[内容.参数-1].等级<100 then
        常规提示(id,"#Y请先将之前的魔神升置满级")
       return
    end
   if self:消耗道具(id,战将消耗[内容.参数]["战将"][1],战将消耗[内容.参数]["战将"][2])  then
       local 保护几率=0
        if 内容.编号+0==1 then
              local 岐阜市={"祈福晶石","祈福晶石","祈福晶石","高阶祈福晶石","高阶祈福晶石"}
           if self:消耗道具(id,岐阜市[内容.参数],1) then
              保护几率=100
           -- elseif 道具(id,"祈福晶石一段",1) then
           --    保护几率=60

           end
        end
      if 取随机数()<=魔你调试.战将.战将成功几率+保护几率 then
        local 加成=魔你调试.战将.基础属性加成[内容.参数][2]
        玩家数据[id].角色.战将[内容.参数].等级=玩家数据[id].角色.战将[内容.参数].等级+1
        玩家数据[id].角色.战将[内容.参数].数值=玩家数据[id].角色.战将[内容.参数].等级*加成
        角色处理类:刷新装备属性(玩家数据[id])
      else
        常规提示(id,"#Y魔神升级失败,升级成功几率为#%30")
        return
      end
   end
   发送数据(玩家数据[id].连接id,407,玩家数据[id].角色.战将)
  elseif 内容.文本=="加速" then
    local 加速=0
    for n=1,5 do
        if  玩家数据[id].角色.战将~=nil and 玩家数据[id].角色.战将[n][5].等级>=100 then
            加速=加速+19 --最高别过20
        end
    end
    if 加速>0 then
        if 玩家数据[id].队伍 ~= 0 then
           for n = 1, #队伍数据[玩家数据[id].队伍].队员数据 do

               发送数据(玩家数据[id].连接id, 20166,加速)

           end

        else
           发送数据(玩家数据[id].连接id, 20166,加速)
        end
    else
         常规提示(id,"#Y每级魔神第5颗宝石点满100级才能开启加速")
         return
    end
     常规提示(id,"#已为您开启加速")
  elseif  内容.文本=="减速" then
     if 玩家数据[id].队伍 ~= 0 then
           for n = 1, #队伍数据[玩家数据[id].队伍].队员数据 do
            --   最小属性[#最小属性+1] =队伍数据[玩家数据[id].队伍].队员数据[n]
               发送数据(玩家数据[id].连接id, 20166,0)
           end

        else
              发送数据(玩家数据[id].连接id, 20166,0)
        end
         常规提示(id,"#已为您关闭加速")
  elseif 内容.文本=="变身" then
   -- if self.参战单位[n].玩家id~=nil and 玩家数据[self.参战单位[n].玩家id].角色.战将~=nil and 玩家数据[self.参战单位[n].玩家id].角色.战将[5][5].等级>=100 then

     if  玩家数据[id].角色.战将~=nil and 玩家数据[id].角色.战将[5][5].等级>=100 then
            if  玩家数据[id].角色.变身.造型~="战将5" then
             玩家数据[id].角色.变身.造型="战将5"
             玩家数据[id].角色.变身.等级=10
             常规提示(id,"#Y已开启魔神附体,死亡时100%复活一次")
            else
             玩家数据[id].角色.变身.造型=nil
             玩家数据[id].角色.变身.等级=nil
             常规提示(id,"#Y已关闭魔神附体,死亡时不会触发复活")
            end
             发送数据(玩家数据[id].连接id, 2010, 角色处理类:获取地图数据(玩家数据[id]))
             地图处理类:MapSend(玩家数据[id].id, 1016, 角色处理类:获取地图数据(玩家数据[id]), 玩家数据[id].地图)
     else
         常规提示(id,"#Y魔神等级不足")
     end
  elseif 内容.文本=="宝石"  then
    local 战将=玩家数据[id].角色.战将
    if 战将[内容.参数].等级<100*内容.序号 then
       常规提示(id,"#Y每提升100级魔神激活一层宝石")
       return
    elseif 战将[内容.参数][内容.序号].等级>100 then
       常规提示(id,"#Y已达到满级")
       return
    elseif 内容.序号~=1 and 战将[内容.参数][内容.序号-1].等级<100 then
       常规提示(id,"#Y上一层宝石还没满级")
       return
    end
    if self:消耗道具(id,战将消耗[内容.参数][内容.序号][1],战将消耗[内容.参数][内容.序号][2]) then
        local 保护几率=0
        local 岐阜市={"祈福晶石","祈福晶石","祈福晶石","高阶祈福晶石","高阶祈福晶石"}
        if 内容.编号+0==1 then
          if  self:消耗道具(id,岐阜市[内容.参数],1)  then
              保护几率=100
          -- elseif  self:消耗道具(id,"祈福晶石一段",1)  then
          --     保护几率=80
          --  elseif  self:消耗道具(id,"祈福晶石十段",1)  then
          --     保护几率=50
           end
        end
        if 取随机数()<=魔你调试.战将.宝石成功几率+保护几率 then
           local 加成=魔你调试.战将.宝石属性加成[内容.参数][内容.序号][2]
           玩家数据[id].角色.战将[内容.参数][内容.序号].等级=玩家数据[id].角色.战将[内容.参数][内容.序号].等级+1
           玩家数据[id].角色.战将[内容.参数][内容.序号].数值=玩家数据[id].角色.战将[内容.参数][内容.序号].等级*加成
           角色处理类:刷新装备属性(玩家数据[id])
        else
          常规提示(id,"#Y宝石升级失败")
          return
        end
    end
    发送数据(玩家数据[id].连接id,407,玩家数据[id].角色.战将)
  elseif 内容.参数==1 then
     if 玩家数据[id].角色.战将==nil then
        local zj=魔你调试.战将.宝石属性加成
        玩家数据[id].角色.战将={}
        for n=1,5 do
           玩家数据[id].角色.战将[n]={等级=0,数值=0,属性=魔你调试.战将.基础属性加成[n][1]}
           for k=1,5 do
               玩家数据[id].角色.战将[n][k]={属性=zj[n][k][1],数值=0,等级=0}
           end
        end
     end
     发送数据(玩家数据[id].连接id,406,玩家数据[id].角色.战将)
  end
end
function 魔你:宠物技能增幅(内容)
 local 编号=内容.序号
 local id =内容.数字id
 local 技能编号=内容.参数
 local bb=玩家数据[id].召唤兽.数据[编号]
 if bb.技能[技能编号]~=nil then
   if bb.技能[技能编号].增幅==nil  then
       bb.技能[技能编号].增幅=1
   end
 end
local lv= bb.技能[技能编号].增幅
if lv >=10 then
  常规提示(id,"#Y已达到最大等级")
  return
end
 if self:消耗道具(id,宠物技能增幅消耗[lv][1],宠物技能增幅消耗[lv][2]) then
    bb.技能[技能编号].增幅=bb.技能[技能编号].增幅+1
 end

  发送数据(玩家数据[id].连接id,403,{lv=bb.技能[技能编号].增幅})
end
function 魔你:线性奖励(内容)

 id=内容.数字id
 if 内容.参数==1 then
   if 玩家数据[id].角色.线性奖励==nil then
      玩家数据[id].角色.线性奖励={0,0,0}
   end
   发送数据(玩家数据[id].连接id,400,{内容=玩家数据[id].角色.线性奖励,消耗=线性消耗})
 elseif 内容.参数==2 then
    if 玩家数据[id].角色.线性奖励[内容.序号]>=1 then  --等级
       return 常规提示(id,"你已经开通了")
    end
    local 消耗道具=线性消耗[内容.序号][玩家数据[id].角色.线性奖励[内容.序号]+1][1]
    local 消耗数量=线性消耗[内容.序号][玩家数据[id].角色.线性奖励[内容.序号]+1][2]
   if self:消耗道具(id,消耗道具,消耗数量) then
      玩家数据[id].角色.线性奖励[内容.序号]= 玩家数据[id].角色.线性奖励[内容.序号]+1
   else
      常规提示(id,"?????????????")
   end
   发送数据(玩家数据[id].连接id,401,{内容=玩家数据[id].角色.线性奖励})
 end
end
function 魔你:积分兑换(内容)
 local id=内容.数字id
 if 内容.参数==1 then
     if 玩家数据[id].角色.灵符==nil then
        玩家数据[id].角色.灵符=0
     end
     发送数据(玩家数据[id].连接id,125, {物品=兑换积分,灵符= 玩家数据[id].角色.灵符})
 elseif 内容.参数==2 then
    local 勾选= table.loadstring(内容.文本)
    for n,v in pairs(勾选) do
          local 物品=兑换积分[n][1]
          local 分数=兑换积分[n][2]
          local 总积分=分数*self:消耗全部道具(id,物品)
          if 总积分~=0 then
              道具处理类:给予道具(id,"万能石",1,nil,总积分)
             常规提示(id,"#Y一键回收完成,恭喜你获得了#R"..总积分.."个#Y万能石")--..玩家数据[id].角色.灵符)
          else
             常规提示(id,"未找到回收道具")
          end

    end
 end
end
function 魔你:礼包(内容)
   -- table.print(内容)
  local 参数=内容.参数
  local id=内容.数字id
  local 消耗道具={"充值卡","限时30天挂机卡","充值卡","充值卡","充值卡","充值卡","充值卡","充值卡","充值卡",}
  if self:消耗道具(id,消耗道具[参数],1) then
     for n=1,#累充奖励[参数].物品 do
          local 物品= 累充奖励[参数].物品[n].名称
          local 数量= 累充奖励[参数].物品[n].数量+0
            发送数据(玩家数据[id].连接id,7, "#恭喜获得"..物品..数量)
          道具处理类:给予道具(id,物品,1,nil,数量)

     end
  else
      发送数据(玩家数据[id].连接id,7, "#G单次充值或抽奖达到数额找GM领取,无累计.特殊定制功能联系GM")--..消耗道具[参数])
  end

end
function 魔你:翅膀(内容)
  --  table.print(内容)
   local 参数=内容.参数
   local 序号=内容.序号
   local id =内容.数字id
   if 玩家数据[id].角色.翅膀1==nil then
      玩家数据[id].角色.翅膀1={等级=0,经验=0,升级经验=100}
   end

   if 参数==1 then
       发送数据(玩家数据[id].连接id,324, 玩家数据[id].角色.翅膀1)
   elseif 参数==2 then
     local 等级=玩家数据[id].角色.翅膀1.等级
     if 等级>=9 then
        发送数据(玩家数据[id].连接id,7, "#Y已达到最高等级")
        return
     end
     local 银子=翅膀银子[等级]
     local 道具=翅膀道具[等级][1]
     local 数量=翅膀道具[等级][2]
     if 玩家数据[id].角色.道具.货币.银子 <银子 then
         发送数据(玩家数据[id].连接id,7, "#Y银子不足")
        return
     end
     if not self:消耗道具(id,道具,数量) then
         发送数据(玩家数据[id].连接id,7, "#Y"..道具.."不足"..数量.."个")
        return
     end
      角色处理类:扣除银子(玩家数据[id],银子,"翅膀消耗")
      玩家数据[id].角色.翅膀1.等级=玩家数据[id].角色.翅膀1.等级+1
      发送数据(玩家数据[id].连接id,325, 玩家数据[id].角色.翅膀1)
   end
end
function 魔你:副本(内容)
   local 参数=内容.参数
   local 序号=内容.序号
   local id =内容.数字id

   if 参数==1 then
       发送数据(玩家数据[id].连接id,323,"打开")
   elseif 参数==2 then
      local 副本,难度=内容.编号,序号

   end

end
function 魔你:定制(内容)

   local 参数=内容.参数
   local 序号=内容.序号
   local id =内容.数字id
 if 参数==1 then

    local 发送内容= 玩家数据[id].物品[玩家数据[id].角色.灵饰[35]]
    if 发送内容~=nil then
       if 发送内容.幻化==nil then
          发送内容.幻化={阶级=0,层级=1}
       end
       发送数据(玩家数据[id].连接id,320,发送内容)
    else
      常规提示(id,"#Y请先穿上定制")
    end
 elseif 参数==2 then --幻化进阶
   local 道具=玩家数据[id].物品[玩家数据[id].角色.灵饰[35]]
   if 道具.幻化.阶级>=10 then
      return 常规提示(id,"#Y已达到满级")
   end
   if 道具.幻化.层级>=10 then
      local 消耗保护=道具.幻化.阶级*消耗.进阶保护.递增数量+消耗.进阶保护.基础数量
      local 消耗道具=道具.幻化.阶级*消耗.进阶道具.递增数量+消耗.进阶保护.基础数量
      local 保护=0
      if  not self:消耗道具(id,消耗.进阶道具.名称,消耗道具) then
          return 常规提示(id,"本次需要消耗"..消耗.进阶道具.名称..消耗道具.."个!")
      end
      if 序号==1 and self:判断道具(id,消耗.进阶保护.名称,消耗保护)  then
         保护=20 --消耗道具增加进阶几率
      end
      if 取随机数() >=50-保护 then                 --------几率
          道具.幻化.阶级=道具.幻化.阶级+1
          道具.幻化.层级=0
          常规提示(id,"#Y恭喜进阶成功")
      else
         常规提示(id,"#Y很遗憾,进阶失败")
      end
   else
      local 消耗保护=道具.幻化.阶级*消耗.幻化保护.递增数量+消耗.幻化保护.基础数量
      local 消耗道具=(道具.幻化.阶级*10+道具.幻化.层级)*消耗.幻化道具.递增数量+消耗.幻化道具.基础数量

      local 保护
      if  not self:消耗道具(id,消耗.幻化道具.名称,消耗道具) then
          return 常规提示(id,"本次需要消耗"..消耗.幻化道具.名称..消耗道具.."个!")
      end
      if 序号==1 and self:判断道具(id,消耗.幻化保护.名称,消耗保护)  then
         保护=true--幻化保护
      end
      if 取随机数()>=50  then
          道具.幻化.层级=道具.幻化.层级+1
          常规提示(id,"#Y恭喜幻化成功")
          else
          常规提示(id,"$Y很遗憾幻化失败")
          if not  保护 then
            if 道具.幻化.层级>=1 then
               道具.幻化.层级=道具.幻化.层级-1
            end
          else
            常规提示(id,"$Y保护成功,本次失败不降级")
          end
      end
   end
    发送数据(玩家数据[id].连接id,321,道具)
 elseif 参数==3 then
   if 内容.文本=="开启加速" then
      local 加速=0
      local 道具=玩家数据[id].物品[玩家数据[id].角色.灵饰[35]]
      加速=道具.幻化.阶级*0.5   --每阶的加速
      发送数据(玩家数据[id].连接id,308,{加速=加速})
      常规提示(id,"#Y已为您开启了加速")
   elseif 内容.文本=="关闭加速" then
      发送数据(玩家数据[id].连接id,308,{加速=0})
      常规提示(id,"#Y已为关闭了加速")
   elseif 内容.文本=="起飞" then
      if 玩家数据[id].飞行==nil then
      玩家数据[id].飞行="起飞"
      else
      玩家数据[id].飞行=nil
      end
      发送数据(玩家数据[id].连接id,312,{状态="起飞"})
      常规提示(id,"#Y已为您切换了飞行模式")
   end
 end

end
function 魔你:兑换(内容)

   local 参数=内容.参数
   local 序号=内容.序号
   local id  =内容.数字id
   if 参数==1 then
      发送数据(玩家数据[id].连接id,317,兑换物品)
   elseif 参数==2 then
     local 数量=1
     local 兑换数量=1
     if ItemData[内容.文本].叠加 then
        兑换数量=内容.序号
        数量=兑换物品[内容.文本]*兑换数量
     end
     if  self:消耗道具(id,"万能石",数量) then
        道具处理类:给予道具(id, 内容.文本,1,nil,兑换数量)
        常规提示(id,"#Y兑换"..内容.文本..兑换数量.."个")
     else
        常规提示(id,"#Y道具不足,请检查背包")
     end
   end
end
function 魔你:斗战神(内容)

 local id=内容.数字id+0
 local 道具,精炼等级,消耗道具,消耗数量,消耗银子,消耗经验
 if 内容.参数==3 or 内容.参数==4 then

     if 内容.序号>20 then

       道具=玩家数据[id].物品[玩家数据[id].角色.装备数据[内容.序号]]
     else
       道具=玩家数据[id].物品[玩家数据[id].角色.道具.包裹[内容.序号]]
     end
      if 道具.斗战神==nil then
       道具.斗战神={}
       道具.斗战神={当前={},备份={}}
      end
      精炼等级=#道具.斗战神.当前+1
      if 内容.文本=="精炼" then
      消耗道具=精炼消耗[精炼等级].名称
      消耗数量=精炼消耗[精炼等级].数量
      消耗银子=精炼消耗[精炼等级].银子
      消耗经验=精炼消耗[精炼等级].经验
      elseif 内容.文本=="备份" then
      消耗道具=备份消耗[精炼等级].名称
      消耗数量=备份消耗[精炼等级].数量
      消耗银子=备份消耗[精炼等级].银子
      消耗经验=备份消耗[精炼等级].经验
      elseif 内容.文本=="还原" then
      消耗银子=载入消耗[精炼等级].银子
      消耗经验=载入消耗[精炼等级].经验
      elseif 内容.参数==4 then
      消耗银子=精炼消耗[精炼等级].银子
      消耗经验=精炼消耗[精炼等级].经验
      end
      if not self:判断银子(id,消耗银子) then
         return 常规提示(id,"银子不足")
      elseif not self:判断经验(id,消耗经验) then
         return 常规提示(id,"经验不足")
      elseif 内容.文本=="精炼" or 内容.文本=="备份"  then
         if not self:判断道具(id,消耗道具,消耗数量) then
           return 常规提示(id,"道具"..消耗道具.."不足"..消耗数量.."个")
         end
      end
 end
 if 内容.参数==1 then
     发送数据(玩家数据[id].连接id,313,角色处理类:索取装备信息(玩家数据[id]))
 elseif 内容.参数==2 then
    发送数据(玩家数据[id].连接id,3011,{名称="斗战神" ,id=59,道具=道具处理类:索要道具1(id,"包裹")})
 elseif 内容.参数==3 then
    if 内容.文本=="精炼" then
       if #道具.斗战神.当前>=10 then
          return 常规提示(id,"#Y已精炼到满级")
       end
       角色处理类:扣除经验(玩家数据[id],消耗经验,"斗战神")
       角色处理类:扣除银子(玩家数据[id],消耗银子,"斗战神")
       self:消耗道具(id,消耗道具,消耗数量)
       道具.斗战神.当前[#道具.斗战神.当前+1]={等级=取随机数(1,6),属性={}}
       local 随机数=取随机数(1,#装备属性)
       local 随机属性=装备属性[随机数]
       local 属性重置=table.copy(装备属性)
       local 属性范围={{1,100},{1,150},{1,200},{1,250},{1,300},{1,350},{1,450}}  --强化随机数值
       local s= 道具.斗战神.当前[#道具.斗战神.当前].等级
       table.remove(属性重置,随机数)
       道具.斗战神.当前[#道具.斗战神.当前].属性[随机属性]=取随机数(属性范围[s][1],属性范围[s][2])
      -- 道具.斗战神.当前[#道具.斗战神.当前].属性[属性重置[取随机数(1,#属性重置)]]=取随机数(属性范围[s][1],属性范围[s][2])  --2条属性


       常规提示(id,"精炼成功")
    elseif 内容.文本=="还原" then
      角色处理类:扣除经验(玩家数据[id],消耗经验,"斗战神")
      角色处理类:扣除银子(玩家数据[id],消耗银子,"斗战神")
      道具.斗战神.当前= table.copy(道具.斗战神.备份)
      常规提示(id,"还原成功")
    elseif 内容.文本=="备份" then
      if #道具.斗战神.当前<10 then
         return 常规提示(id,"强化等级未满,无法备份")
      end
      角色处理类:扣除经验(玩家数据[id],消耗经验,"斗战神")
      角色处理类:扣除银子(玩家数据[id],消耗银子,"斗战神")
      self:消耗道具(id,消耗道具,消耗数量)
      道具.斗战神.备份= table.copy(道具.斗战神.当前)
      常规提示(id,"备份成功")
    end
     if 内容.序号>20 then
     发送数据(玩家数据[id].连接id,315,角色处理类:索取装备信息(玩家数据[id]))
     else
     发送数据(玩家数据[id].连接id,316,玩家数据[id].物品[玩家数据[id].角色.道具.包裹[内容.序号]])
     end
 elseif 内容.参数==4 then
      local 勾选=table.loadstring(内容.文本)
      local 数量=0
      for n=1,#勾选 do
       if  勾选[n] then
          数量=数量+1
       end
      end
      if 数量>8 then
         return 常规提示(id,"最多只能选中8个")
      end
      local 消耗数量=还原消耗[数量].数量
      local 消耗道具=还原消耗[数量].名称
      if not self:消耗道具(id,消耗道具,消耗数量) then
           return 常规提示(id,"重置道具"..消耗道具.."不足"..消耗数量.."个")
      end
      角色处理类:扣除经验(玩家数据[id],消耗经验,"斗战神")
      角色处理类:扣除银子(玩家数据[id],消耗银子,"斗战神")
      for n=1,#道具.斗战神.当前 do
          if not 勾选[n] then
             道具.斗战神.当前[n]=nil
          end
      end
      local 临时={}
      for n,v in pairs(道具.斗战神.当前) do
         临时[#临时+1]=v
      end
      道具.斗战神.当前=临时
      常规提示(id,"重置成功")
     if 内容.序号>20 then
     发送数据(玩家数据[id].连接id,315,角色处理类:索取装备信息(玩家数据[id]))
     else
     发送数据(玩家数据[id].连接id,316,玩家数据[id].物品[玩家数据[id].角色.道具.包裹[内容.序号]])
     end
 end

end
function 魔你:挂机刷怪(内容)  --位置挂机2

   local id=内容.数字id
   local 参数=内容.参数+0
  if 参数==1 then
     if 玩家数据[id].角色.挂机刷怪==nil then
        玩家数据[id].角色.挂机刷怪={状态="关闭",剩余时间=0,开启时间=0}
     end
         玩家数据[id].角色.挂机刷怪.状态="关闭"
     发送数据(玩家数据[id].连接id,304,玩家数据[id].角色.挂机刷怪)
  elseif 参数==2 then --开始挂机

     if  玩家数据[id].角色.挂机刷怪.剩余时间<=0 then
         return 常规提示(id,"请使用道具增加时间")
     end
      if 玩家数据[id].角色.挂机刷怪.状态=="开启" then
         玩家数据[id].角色.挂机刷怪.状态="关闭"
        常规提示(id,"你关闭了自动刷怪")
     else
        玩家数据[id].角色.挂机刷怪.状态="开启"
        常规提示(id,"你开启了自动刷怪")
        玩家数据[id].角色.挂机刷怪.开启时间=os.time()
     end
      local 地图id=玩家数据[id].地图

      local 地图名称=MapData[地图id].名称
      刷怪记录[id]=table.loadstring(内容.文本)
      刷怪记录[id].地图=地图id
      发送数据(玩家数据[id].连接id,305,{人物=玩家数据[id].角色.挂机刷怪})
   elseif 参数==3 then  --停止移动之后
            --
             if 玩家数据[id].角色.挂机刷怪==nil then
                玩家数据[id].角色.挂机刷怪={状态="关闭",剩余时间=0,开启时间=0}
             end
             --
            if 玩家数据[id].角色.挂机刷怪.开启时间-os.time()>=60 then  --报错
                玩家数据[id].角色.挂机刷怪.开启时间=os.time()
            end

            玩家数据[id].角色.挂机刷怪.剩余时间=玩家数据[id].角色.挂机刷怪.剩余时间-os.time()+玩家数据[id].角色.挂机刷怪.开启时间
            玩家数据[id].角色.挂机刷怪.开启时间=os.time()
            if  玩家数据[id].角色.挂机刷怪.剩余时间<=0 then
                玩家数据[id].角色.挂机刷怪.状态="关闭"
            end
           发送数据(玩家数据[id].连接id,305,{人物=玩家数据[id].角色.挂机刷怪})
            local 地图id=玩家数据[id].地图
            if 地图id~=刷怪记录[id].地图 then
             地图处理类:Jump(id,刷怪记录[id].地图,50,50)
            end
         local 编号=内容.序号
         if 编号~=0 and 地图处理类.MapData[地图id].单位组[编号]~=nil and 任务数据[地图处理类.MapData[地图id].单位组[编号].任务id]~=nil and 取两点距离(玩家数据[id].角色.地图数据,{x=地图处理类.MapData[地图id].单位组[编号].X*20,y=地图处理类.MapData[地图id].单位组[编号].Y*20} ) < 500 and 任务数据[地图处理类.MapData[地图id].单位组[编号].任务id].战斗==false then
            local 任务id=地图处理类.MapData[地图id].单位组[编号].任务id
            if 任务数据[任务id].识别咯  then
                 TaskControl:触发任务(id,编号,"找打("..任务数据[任务id].类型..")")
            elseif 任务数据[任务id].识别啊  then

                  if 任务数据[任务id].类型=="团队副本一" then
                      TaskControl:触发团本一环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本二" then
                      TaskControl:触发团本二环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本三" then
                      TaskControl:触发团本三环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本四" then
                      TaskControl:触发团本四环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本五" then
                      TaskControl:触发团本五环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本六" then
                      TaskControl:触发团本六环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本七" then
                      TaskControl:触发团本七环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="团队副本八" then
                      TaskControl:触发团本八环怪物(id, 编号)
                  elseif 任务数据[任务id].类型=="难度副本" then
                      任务控制类:触发任务(id,编号)
                  end
            else
                 对话内容:刷新怪选项解析(玩家数据[id],编号,RefreshMonsterData[任务数据[任务id].类型].选项[1])
            end
         else
      local 怪物表={}
      local 角色坐标={x=玩家数据[id].角色.地图数据.x,y=玩家数据[id].角色.地图数据.y}
      local 团本难度={初级团队副本=26, 中级团队副本=27,高级团队副本=28,史诗团队副本=29, 传说团队副本=30,至尊团队副本=30}
      for n,v in pairs(地图处理类.MapData[地图id].单位组) do

       local 符合=false
       if  任务数据[v.任务id]~=nil and 任务数据[v.任务id].难度 then
           if 刷怪记录[id][任务数据[v.任务id].难度]==true then
              符合=true
           end
           if 任务数据[v.任务id].副本~=nil and 任务数据[v.任务id].副本~=玩家数据[id].副本 then
              符合=false
           end
       end
       if  任务数据[v.任务id]~=nil and 任务数据[v.任务id].难度  and 团本难度[任务数据[v.任务id].难度]~=nil then
           if   刷怪记录[id][团本难度[任务数据[v.任务id].难度]]==true then
                符合=true
           end
       end
       if 任务数据[v.任务id].战斗~=false or 任务数据[v.任务id].类型=="地煞" and 任务数据[v.任务id].类型=="天罡" then
          符合=false
       end
        if 符合==true then
            怪物表[#怪物表+1]={编号=n,距离=取两点距离(角色坐标,{x=v.X*20,y=v.Y*20})}
        end
     end
               if #怪物表>=2 then
                  table.sort(怪物表,function(a,b) return a.距离<b.距离 end)
                  local 临时编号=怪物表[1].编号
                  local 内容=地图处理类.MapData[地图id].单位组[临时编号].X.."*-*"..地图处理类.MapData[地图id].单位组[临时编号].Y
                       发送数据(玩家数据[id].连接id,305,{目标=地图处理类.MapData[地图id].单位组[临时编号],人物=玩家数据[id].角色.挂机刷怪})
                       地图处理类:玩家移动请求(id, 内容)
               end
         end

   elseif 参数==4 then --补充时间
       --if self:消耗道具(id,"挂机证明卷",1) then
       if self:消耗道具(id,"挂机证明卷",1) then
          if 玩家数据[id].角色.挂机刷怪.剩余时间<0 then
             玩家数据[id].角色.挂机刷怪.剩余时间=0
          end
          玩家数据[id].角色.挂机刷怪.剩余时间=玩家数据[id].角色.挂机刷怪.剩余时间+1800
          常规提示(id,"恭喜增加挂机事件30分钟")
           发送数据(玩家数据[id].连接id,305,{人物=玩家数据[id].角色.挂机刷怪})
       end

   end

end
function 魔你:神祇密藏(内容)
   -- table.print(内容)
  local id=内容.数字id+0
  if 神祇密藏[id]==nil then
     神祇密藏[id]={青龙密藏次数={[1]=0,[10]=0},烛龙密藏次数={[1]=0,[10]=0},领取={},道具={},青龙密藏={},烛龙密藏={}}
  end

  if 内容.参数==1 then
      发送数据(玩家数据[id].连接id,310,{密藏=神祇密藏[id],物品=道具处理类:索要道具7(id)})
  elseif 内容.参数==2 then
      if 内容.序号==1 then
          for n=1,10 do
            if 神祇密藏[n]==nil or 神祇密藏[n].状态==true then
               神祇密藏[id].青龙密藏[n]={等级=取随机数(2,2),状态=false}
               break
            end
          end
      elseif 内容.序号==2 then
             for n=1,10 do
                   神祇密藏[id].青龙密藏[n]={等级=取随机数(2,2),状态=false}
              end
      end
       发送数据(玩家数据[id].连接id,311,{密藏=神祇密藏[id],物品=道具处理类:索要道具7(id)})
   elseif 内容.参数==3 then   --抽奖单抽
      local 道具,数量
      if 内容.文本=="青龙密藏" then
         道具="修罗密藏抽奖卷"
         数量=1
      else
         道具="修罗密藏抽奖卷"  --烛龙大抽江
         数量=2
      end
      if not self:消耗道具(id,道具,数量) then  --单抽消耗
            return
      end
      if  神祇密藏[id][内容.文本.."次数"][1]>=10 or 神祇密藏[id][内容.文本.."次数"][10]>=100 then
           常规提示(id,"请先领取累计奖励")
           return
      end
      if 神祇密藏[id][内容.文本][内容.序号+0]==nil or 神祇密藏[id][内容.文本][内容.序号+0].状态~=true then
         神祇密藏[id][内容.文本][内容.序号+0]={等级=self:密藏几率(内容.文本),状态=false}
      end
      if 取随机数()>=50 then
      神祇密藏[id][内容.文本.."次数"][1] =神祇密藏[id][内容.文本.."次数"][1]+1
      end
      神祇密藏[id][内容.文本.."次数"][10]=神祇密藏[id][内容.文本.."次数"][10]+1
      发送数据(玩家数据[id].连接id,311,{密藏=神祇密藏[id],物品=道具处理类:索要道具7(id)})
   elseif 内容.参数==4 then  --一键抽取
        local 道具,数量
      if 内容.文本=="青龙密藏" then
         道具="修罗密藏抽奖卷"
         数量=10
      else
         道具="修罗密藏抽奖卷"  --烛龙大抽江
         数量=20
      end
       if  神祇密藏[id][内容.文本.."次数"][1]>=10 then --or 神祇密藏[id][内容.文本.."次数"][10]>=100 then
           常规提示(id,"请先领取累计奖励")
           return
      end
      if not self:消耗道具(id,道具,数量) then  --单抽消耗
            return
      end
         for n=1,10 do
           if 神祇密藏[id][内容.文本][n]==nil  then
                  神祇密藏[id][内容.文本][n]={等级=self:密藏几率(内容.文本),状态=false}
                  神祇密藏[id][内容.文本.."次数"][1] =神祇密藏[id][内容.文本.."次数"][1]+1
                  神祇密藏[id][内容.文本.."次数"][10]=神祇密藏[id][内容.文本.."次数"][10]+1
           end
         end

          常规提示(id,"已为您开启全部寻龙旌旗")
          发送数据(玩家数据[id].连接id,311,{密藏=神祇密藏[id],物品=道具处理类:索要道具7(id)})
    elseif 内容.参数==5 then
       for n=1,10 do
          if 神祇密藏[id][内容.文本][n]~=nil  then
              道具处理类:给予道具(id,密藏等级[神祇密藏[id][内容.文本][n].等级])
              神祇密藏[id][内容.文本][n]=nil
          end
       end
       发送数据(玩家数据[id].连接id,311,{密藏=神祇密藏[id],物品=道具处理类:索要道具7(id)})
    elseif 内容.参数==6 then   --累计奖励
        if 神祇密藏[id][内容.文本.."次数"][内容.序号+0]<内容.序号*10 then
           常规提示(id,"请等待奖池累计度满哦")
        else
        if 内容.文本=="青龙密藏" then
           if 内容.序号==1 then       --累计青龙10次奖励
             道具处理类:给予道具(id,密藏等级[1])
           elseif 内容.序号==10 then   --雷计青龙100此奖励
             道具处理类:给予道具(id,密藏等级[5])
           end
        elseif 内容.文本=="烛龙密藏" then  --累计烛龙奖励10次
           if 内容.序号==1 then
             道具处理类:给予道具(id,密藏等级[2])
           elseif 内容.序号==10 then   --累计烛龙奖励100次
            道具处理类:给予道具(id,密藏等级[5],10)
           end
        end
        神祇密藏[id][内容.文本.."次数"][内容.序号+0]=0
        发送数据(玩家数据[id].连接id,311,{密藏=神祇密藏[id],物品=道具处理类:索要道具7(id)})
        end
   end

end
function 魔你:密藏几率(密藏)
  local 密卷lv
  if 密藏=="青龙密藏" then ------------------青龙抽奖几率
            local 随机数=取随机数()
            if 随机数<=100 then
               密卷lv=1
            elseif 随机数<=70 then
               密卷lv=2
            elseif 随机数<=90 then
               密卷lv=3
            elseif 随机数<=95 then
               密卷lv=4
            else
               密卷lv=5
            end
         else
           local 随机数=取随机数()
           if 随机数<=100 then
               密卷lv=2
            elseif 随机数<=50 then
               密卷lv=2
            elseif 随机数<=60 then
               密卷lv=3
            elseif 随机数<=80 then
               密卷lv=4
            else
               密卷lv=5
            end
         end
  return 密卷lv
end
function 魔你:判断道具(id,名称,数量)

  local 消耗=数量 or 1
  for n=1,20 do
    local 道具id=玩家数据[id].角色.道具.包裹[n]

    if 道具id~=nil and 玩家数据[id].物品[道具id]~=nil and 玩家数据[id].物品[道具id].名称==名称 then

       if 数量==nil or 玩家数据[id].物品[道具id].数量>=数量 then
           return true
       end
    end
  end
end
function 魔你:消耗全部道具(id,名称) --消耗全部道具 并返回数量

  local 数量= 0
  for n=1,20 do
        local 道具id=玩家数据[id].角色.道具.包裹[n]

        if 道具id~=nil and 玩家数据[id].物品[道具id]~=nil and 玩家数据[id].物品[道具id].名称==名称 then
                if 玩家数据[id].物品[道具id].数量~=nil then
                   数量=玩家数据[id].物品[道具id].数量+数量
                else
                   数量=数量+1
                end
                 玩家数据[id].角色.道具.包裹[n]=nil
                 玩家数据[id].物品[道具id]=nil
        end

  end
  if 数量~=nil then
      return 数量
  end
  常规提示(id,"#Y本次操作需要消耗道具#R"..名称..":#G"..数量.."个")
end
function 魔你:消耗道具(id,名称,数量)
    local 临时数据=table.loadstring(读入文件(程序目录..[[data/]]..玩家数据[id].账号..[[/]]..id..[[/道具.txt]]))
  local 消耗=数量 or 1
  for n=1,20 do
    -- local 道具id=玩家数据[id].角色.道具.包裹[n]
    local 道具id=玩家数据[id].角色.道具[n]--玩家数据[id].道具.数据[玩家数据[id].角色.道具[n]]
    if 道具id~=nil and 玩家数据[id].道具.数据[道具id]~=nil and 玩家数据[id].道具.数据[道具id].名称==名称 then
       if 数量==nil or 玩家数据[id].道具.数据[道具id].数量>=数量 then
          if 数量==nil or 玩家数据[id].道具.数据[道具id].数量<=数量 then
             玩家数据[id].角色.道具[n]=nil
             玩家数据[id].道具.数据[道具id]=nil
           else
             玩家数据[id].道具.数据[道具id].数量=玩家数据[id].道具.数据[道具id].数量-数量
           end
           return true
       end
    end
  end
  常规提示(id,"#Y本次操作需要消耗道具#R"..名称..":#G"..数量.."个")
end
function 魔你:判断银子(id,数额)
  if 玩家数据[id].角色.道具.货币.银子>=数额 then
     return true
  end
end
function 魔你:判断经验(id,数额)
  if 玩家数据[id].角色.当前经验>=数额 then
     return true
  end
end
function 魔你:宠物进阶(内容)
  local id=内容.数字id+0
  local 编号=玩家数据[id].召唤兽:取编号(内容.编号)
  if 玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].等级>=9 then
     return 常规提示(id,"进阶已满无法献祭")
  end
 if self:消耗道具(id,宠物进阶[内容.参数+0],内容.序号+0) then
            玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].经验=玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].经验+内容.序号

       if   玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].经验>= 玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].等级*100+100 then
            玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].等级= 玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].等级+1
            玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].经验=  玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].经验-玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].等级*100
            --效果
           -- table.print(玩家数据[id].召唤兽.数据[编号])
            if 内容.参数==1 then
               for n=1,#bds do
                   玩家数据[id].召唤兽.数据[编号][bds[n]]= 玩家数据[id].召唤兽.数据[编号][bds[n]]+50
               end
            elseif 内容.参数==2 then
                   玩家数据[id].召唤兽.数据[编号].成长= 玩家数据[id].召唤兽.数据[编号].成长+0.1
            elseif 内容.参数==3 then
                    玩家数据[id].召唤兽.数据[编号].潜能= 玩家数据[id].召唤兽.数据[编号].潜能+10
            elseif 内容.参数==4 then
                   if 玩家数据[id].召唤兽.数据[编号].登阶爆率==nil then
                      玩家数据[id].召唤兽.数据[编号].登阶爆率=0
                   end
                   玩家数据[id].召唤兽.数据[编号].登阶爆率=玩家数据[id].召唤兽.数据[编号].登阶爆率+1.5
            end

      end
       常规提示(id,"恭喜增加经验"..内容.序号.."点,当前阶级"..玩家数据[id].召唤兽.数据[编号][宠物进阶[内容.参数+0]].等级)
       发送数据(玩家数据[id].连接id,319,玩家数据[id].召唤兽:获取指定数据(编号))
else
          常规提示(id,"未找到所需道具")

 end
end
 return 魔你