-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-02-03 22:34:18
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:42:27
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 22:15:06
-- @最后修改来自: baidwwy
-- @Last Modified time: 2021-02-01 21:36:40
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数
__GWdh111[250]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 对话数据.名称 == "蟠桃盛会使者" then
		对话数据.对话="爆竹声声除旧岁，雪花片片迎新春。春节是大家眼里的欢笑快乐!是大家眼里的幸福团圆!是三界全体的同乐会!漫天飞舞的雪花扬起新春的祝福，在”雪趣时分堆雪人，堆砌新春的欢笑与快乐!堆砌我们的梦想与希望!如果你已经找到堆雪人的道具，我可以将你们传送进入堆雪人的场票。"
		对话数据.选项={"送我去活动场地","我想了解活动规则","路过此地"}
	elseif 对话数据.名称 == "蟠桃园土地" then
		对话数据.对话="前面是九千年蟠桃树你是否要过去看一看"
		对话数据.选项={"我要过去","我要回长安","路过此地"}
	-- elseif 对话数据.名称 == "想念你的雪人" then
	-- 	对话数据.对话="这里在举行“雪趣”堆雪人活动，目前正在堆雪人，你找到用来堆雪人的物品直接交给它就可以了。"
	-- 	对话数据.选项={"送我出场地","一起堆雪人","路过此地"}
	end
	return 对话数据
end

__GWdh222[250]=function (连接id,数字id,序号,内容)
  	local 事件=内容[1]
  	local 名称=内容[3]
  	if 名称 == "蟠桃盛会使者" and 事件 == "送我去活动场地" then
  		地图处理类:跳转地图(数字id,5006,143,87)
  	elseif 名称 == "蟠桃园土地" and 事件 == "我要过去" then
  		地图处理类:跳转地图(数字id,5006,78,21)
  	elseif 名称 == "蟠桃园土地" and 事件 == "我要回长安" then
  	 	地图处理类:跳转地图(数字id,1001,421,76)
	end
end

__GWdh111[251]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 蟠桃盛会.进行[数字id] then
		if 蟠桃盛会.进行[数字id] > os.time() then
			常规提示(数字id, "你太累了请休息"..蟠桃盛会.进行[数字id]-os.time().."秒")
		else
			战斗准备类:创建战斗(数字id+0,100132,玩家数据[数字id].地图单位.标识)
		end
	else
		战斗准备类:创建战斗(数字id+0,100132,玩家数据[数字id].地图单位.标识)
	end
	任务处理类:删除单位(标识)
	return 对话数据
end

__GWdh111[252]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 蟠桃盛会.进行[数字id] then
		if 蟠桃盛会.进行[数字id] > os.time() then
			常规提示(数字id, "你太累了请休息"..蟠桃盛会.进行[数字id]-os.time().."秒")
		else
			战斗准备类:创建战斗(数字id+0,100133,玩家数据[数字id].地图单位.标识)
		end
	else
		战斗准备类:创建战斗(数字id+0,100133,玩家数据[数字id].地图单位.标识)
	end
	任务处理类:删除单位(标识)
	return 对话数据
end

__GWdh111[253]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 蟠桃盛会.进行[数字id] then
		if 蟠桃盛会.进行[数字id] > os.time() then
			常规提示(数字id, "你太累了请休息"..蟠桃盛会.进行[数字id]-os.time().."秒")
		else
			战斗准备类:创建战斗(数字id+0,100134,玩家数据[数字id].地图单位.标识)
		end
	else
		战斗准备类:创建战斗(数字id+0,100134,玩家数据[数字id].地图单位.标识)
	end
	任务处理类:删除单位(标识)
	return 对话数据
end

function 设置任务250()
	蟠桃盛会={开关=true,起始=os.time(),间隔=os.time(),进行={}}
	local 任务id="_250_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..5004
	任务数据[任务id]={
	id=任务id,
	起始=os.time(),
	结束=99999999,
	玩家id=0,
	队伍组={},
	名称="蟠桃盛会使者",
	模型="超级土地公公",
	x=245,
	y=168,
	方向=1,
	事件="明雷活动",
	地图编号=1001,
	地图名称=取地图名称(1001),
	类型=250
	}
	地图处理类:添加单位(任务id)
	local 任务id="_250_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..5004
	任务数据[任务id]={
	id=任务id,
	起始=os.time(),
	结束=99999999,
	玩家id=0,
	队伍组={},
	名称="蟠桃园土地",
	模型="超级土地公公",
	x=30,
	y=27,
	方向=1,
	事件="明雷活动",
	地图编号=5006,
	地图名称=取地图名称(5006),
	类型=250
	}
	地图处理类:添加单位(任务id)
	SetUpdate251()
end

function  SetUpdate251()
	蟠桃盛会.间隔=os.time()
	local 三千年1 = {[1]={["y"]=54,["x"]=115},[2]={["y"]=53,["x"]=111},[3]={["y"]=54,["x"]=108},[4]={["y"]=53,["x"]=105},[5]={["y"]=52,["x"]=107},[6]={["y"]=51,["x"]=110},[7]={["y"]=50,["x"]=107},[8]={["y"]=55,["x"]=106},[9]={["y"]=54,["x"]=100},[10]={["y"]=56,["x"]=102},[11]={["y"]=53,["x"]=103},[12]={["y"]=58,["x"]=107},[13]={["y"]=58,["x"]=104},[14]={["y"]=58,["x"]=101},[15]={["y"]=59,["x"]=99},[16]={["y"]=61,["x"]=98},[17]={["y"]=61,["x"]=100},[18]={["y"]=60,["x"]=102},[19]={["y"]=61,["x"]=104},[20]={["y"]=62,["x"]=105}}
	local 六千年1 = {[1]={["y"]=70,["x"]=89},[2]={["y"]=72,["x"]=89},[3]={["y"]=71,["x"]=87},[4]={["y"]=73,["x"]=83},[5]={["y"]=71,["x"]=84},[6]={["y"]=69,["x"]=85},[7]={["y"]=69,["x"]=81},[8]={["y"]=69,["x"]=78},[9]={["y"]=72,["x"]=79},[10]={["y"]=72,["x"]=75},[11]={["y"]=72,["x"]=72},[12]={["y"]=72,["x"]=68},[13]={["y"]=68,["x"]=70},[14]={["y"]=66,["x"]=74},[15]={["y"]=65,["x"]=77},[16]={["y"]=74,["x"]=62},[17]={["y"]=75,["x"]=69},[18]={["y"]=75,["x"]=71},[19]={["y"]=62,["x"]=70},[20]={["y"]=63,["x"]=73},[21]={["y"]=65,["x"]=78},[22]={["y"]=66,["x"]=62},[23]={["y"]=65,["x"]=58},[24]={["y"]=67,["x"]=58},[25]={["y"]=71,["x"]=59},[26]={["y"]=68,["x"]=54},[27]={["y"]=67,["x"]=50},[28]={["y"]=71,["x"]=52},[29]={["y"]=73,["x"]=55}}
	local 六千年2 = {[1]={["y"]=53,["x"]=40},[2]={["y"]=54,["x"]=44},[3]={["y"]=56,["x"]=45},[4]={["y"]=59,["x"]=45},[5]={["y"]=57,["x"]=49},[6]={["y"]=54,["x"]=48},[7]={["y"]=55,["x"]=51},[8]={["y"]=53,["x"]=52},[9]={["y"]=54,["x"]=54},[10]={["y"]=51,["x"]=53},[11]={["y"]=49,["x"]=47},[12]={["y"]=47,["x"]=50},[13]={["y"]=47,["x"]=52},[14]={["y"]=46,["x"]=24},[15]={["y"]=48,["x"]=31},[16]={["y"]=45,["x"]=30},[17]={["y"]=44,["x"]=30},[18]={["y"]=41,["x"]=31},[19]={["y"]=39,["x"]=34},[20]={["y"]=41,["x"]=37},[21]={["y"]=44,["x"]=37},[22]={["y"]=44,["x"]=41},[23]={["y"]=42,["x"]=41},[24]={["y"]=41,["x"]=43},[25]={["y"]=42,["x"]=47},[26]={["y"]=43,["x"]=50},[27]={["y"]=50,["x"]=54},[28]={["y"]=46,["x"]=52},[29]={["y"]=52,["x"]=58},[30]={["y"]=35,["x"]=34},[31]={["y"]=36,["x"]=36},[32]={["y"]=37,["x"]=41},[33]={["y"]=38,["x"]=37},[34]={["y"]=36,["x"]=43},[35]={["y"]=47,["x"]=28},[36]={["y"]=46,["x"]=31}}
	local 三千年2 = {[1]={["y"]=51,["x"]=13},[2]={["y"]=50,["x"]=10},[3]={["y"]=50,["x"]=7},[4]={["y"]=45,["x"]=4},[5]={["y"]=44,["x"]=4},[6]={["y"]=45,["x"]=8},[7]={["y"]=37,["x"]=17},[8]={["y"]=39,["x"]=14},[9]={["y"]=36,["x"]=15},[10]={["y"]=36,["x"]=11},[11]={["y"]=35,["x"]=11},[12]={["y"]=34,["x"]=16},[13]={["y"]=32,["x"]=13},[14]={["y"]=31,["x"]=8},[15]={["y"]=31,["x"]=5},[16]={["y"]=27,["x"]=18},[17]={["y"]=26,["x"]=21},[18]={["y"]=23,["x"]=19},[19]={["y"]=23,["x"]=16},[20]={["y"]=23,["x"]=14},[21]={["y"]=26,["x"]=14},[22]={["y"]=24,["x"]=11},[23]={["y"]=26,["x"]=5},[24]={["y"]=24,["x"]=4},[25]={["y"]=23,["x"]=7},[26]={["y"]=22,["x"]=5},[27]={["y"]=21,["x"]=4},[28]={["y"]=18,["x"]=7},[29]={["y"]=19,["x"]=10},[30]={["y"]=20,["x"]=13},[31]={["y"]=31,["x"]=42},[32]={["y"]=29,["x"]=45},[33]={["y"]=28,["x"]=47},[34]={["y"]=26,["x"]=50},[35]={["y"]=24,["x"]=50},[36]={["y"]=23,["x"]=49},[37]={["y"]=23,["x"]=46},[38]={["y"]=28,["x"]=60},[39]={["y"]=32,["x"]=59},[40]={["y"]=31,["x"]=62},[41]={["y"]=32,["x"]=51}}
	local 九千年 = {[1]={["y"]=10,["x"]=53},[2]={["y"]=7,["x"]=57},[3]={["y"]=10,["x"]=63},[4]={["y"]=14,["x"]=61},[5]={["y"]=16,["x"]=63},[6]={["y"]=13,["x"]=68},[7]={["y"]=12,["x"]=67},[8]={["y"]=7,["x"]=64},[9]={["y"]=3,["x"]=62},[10]={["y"]=0,["x"]=64},[11]={["y"]=1,["x"]=68},[12]={["y"]=0,["x"]=73},[13]={["y"]=4,["x"]=76},[14]={["y"]=5,["x"]=74},[15]={["y"]=7,["x"]=80},[16]={["y"]=3,["x"]=88},[17]={["y"]=14,["x"]=86},[18]={["y"]=9,["x"]=95},[19]={["y"]=6,["x"]=89},[20]={["y"]=10,["x"]=91},[21]={["y"]=0,["x"]=82},[22]={["y"]=0,["x"]=78},[23]={["y"]=5,["x"]=80},[24]={["y"]=0,["x"]=73},[25]={["y"]=9,["x"]=68},[26]={["y"]=6,["x"]=84},[27]={["y"]=0,["x"]=82},[28]={["y"]=6,["x"]=83},[29]={["y"]=4,["x"]=91},[30]={["y"]=5,["x"]=74}}
	local 地图=5006
	local x待发送数据 = {[地图]={}}
	for n=1,10 do
		local 任务id=地图.."_251_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
		local lssj = 取随机数(1,#三千年1)
		local xy=三千年1[lssj]
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=270,
			玩家id=0,
			队伍组={},
			名称="",
			模型="蟠桃"..取随机数(1,3),
			x=xy.x,
			y=xy.y,
			事件="明雷活动",
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=251,
			置顶层=true
		}
		table.remove(三千年1,lssj)
		table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))
	end
	for n=1,15 do
		local 任务id=地图.."_251_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
		local lssj = 取随机数(1,#三千年2)
		local xy=三千年2[lssj]
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=270,
			玩家id=0,
			队伍组={},
			名称="",
			模型="蟠桃"..取随机数(1,3),
			x=xy.x,
			y=xy.y,
			事件="明雷活动",
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=251,
			置顶层=true
		}
		table.remove(三千年2,lssj)
		table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))
	end
	for n=1,10 do
		local 任务id=地图.."_252_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
		local lssj = 取随机数(1,#六千年1)
		local xy=六千年1[lssj]
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=270,
			玩家id=0,
			队伍组={},
			名称="",
			模型="蟠桃"..取随机数(1,3),
			x=xy.x,
			y=xy.y,
			事件="明雷活动",
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=252,
			置顶层=true
		}
		table.remove(六千年1,lssj)
		table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))
	end
	for n=1,15 do
		local 任务id=地图.."_252_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
		local lssj = 取随机数(1,#六千年2)
		local xy=六千年2[lssj]
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=270,
			玩家id=0,
			队伍组={},
			名称="",
			模型="蟠桃"..取随机数(1,3),
			x=xy.x,
			y=xy.y,
			事件="明雷活动",
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=252,
			置顶层=true
		}
		table.remove(六千年2,lssj)
		table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))
	end
	for n=1,15 do
		local 任务id=地图.."_253_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
		local lssj = 取随机数(1,#九千年)
		local xy=九千年[lssj]
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=270,
			玩家id=0,
			队伍组={},
			名称="",
			模型="蟠桃"..取随机数(1,3),
			x=xy.x,
			y=xy.y,
			事件="明雷活动",
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=253,
			置顶层=true
		}
		table.remove(九千年,lssj)
		table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))
	end
	for n, v in pairs(地图处理类.地图玩家[地图]) do
		if n~=id and 地图处理类:取同一地图(地图,id,n,1)  then
			发送数据(玩家数据[n].连接id,1021,x待发送数据[地图])
		end
	end
	x待发送数据={}
end



function rwgx251(任务id)
	if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then -- 任务时间到期
		if 任务数据[任务id].zhandou==nil  then
			地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
			任务数据[任务id]=nil
		end
	end
end