-- @Author: baidwwy
-- @Date:   2024-07-01 11:50:43
-- @Last Modified by:   baidwwy
-- @Last Modified time: 2024-08-15 18:21:48
-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 22:13:32
-- @最后修改来自: baidwwy
-- @Last Modified time: 2024-05-14 18:24:52
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__GWdh111[205]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
	对话数据.模型=任务数据[标识].模型
	对话数据.名称=任务数据[标识].名称
	if 任务数据[标识].zhandou==nil then
		local dh={"敢打扰我修炼，我要让你们知道“后悔”两个字怎么写的#4","上一次在我面前站的人，被我捏成九十九块，这次我要向一百块冲刺#90"}
		对话数据.对话=dh[取随机数(1,2)]
		对话数据.选项={"休得在此放肆","我帮你去打听下"}
	else
		对话数据.对话="我正在战斗中，请勿打扰。"
	end
	return 对话数据
end

__GWdh222[205]=function (连接id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件=="休得在此放肆" then
		if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
		if 取队伍人数(数字id)<3 and 调试模式==false then 常规提示(数字id,"#Y降服妖王最少必须由三人进行") return  end
		if 取等级要求(数字id,50)==false and 调试模式==false then 常规提示(数字id,"#Y/降服妖王至少要达到50级") return  end
		战斗准备类:创建战斗(数字id+0,100020,玩家数据[数字id].地图单位.标识)
		任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
		玩家数据[数字id].地图单位=nil
		return
	end
end

function 设置任务205(id)
	local 地图范围={1177,1186,1201,1203}
	local 地图=地图范围[取随机数(1,#地图范围)]
	for n=1,取随机数(3,5) do
		local 任务id="_"..n.."_"..取随机数(8888,9999).."_205_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
		随机序列=随机序列+1
		local xy=地图处理类.地图坐标[地图]:取随机点()
		local 名称="避世老妖"
		local 模型="炎魔神"
		local 随机参数=取随机数()
		if 随机参数<=30 then
			名称="冥府妖王"
			模型="鬼将"
		elseif 随机参数<=60 then
			名称="猪仙大圣"
			模型="净瓶女娲"
		end
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=1800,
			玩家id=0,
			销毁=true,
			队伍组={},
			名称=名称,
			模型=模型,
			x=xy.x,
			y=xy.y,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=205
		}
		地图处理类:添加单位(任务id)
	end
	local 玩家名称 = "某某人"
	if 玩家数据[id] then
		玩家名称 = 玩家数据[id].角色.名称
	end
	广播消息({内容=format("#Y%s#W挖宝时候一不小心在#R妖王#W脑袋上敲出了一个大包，妖王气得正在#G%s#W寻衅闹事，各路英雄快前往平乱啊！",玩家名称,取地图名称(地图)),频道="xt"})
end

function 胜利MOB_100020(胜利id,战斗数据,id组) --妖王
	if 任务数据[战斗数据.任务id]==nil then
		return
	end
	地图处理类:删除单位(任务数据[战斗数据.任务id].地图编号,任务数据[战斗数据.任务id].单位编号)
	任务数据[战斗数据.任务id]=nil
	for n=1,#id组 do
		local id=id组[n]
		local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
		local 经验=qz(平均等级*取随机数(1100,1150))
		local 银子=qz(平均等级*取随机数(120,145))+5000
		玩家数据[id].角色:添加经验(经验*HDPZ["妖王"].经验,"妖王",1)
		玩家数据[id].角色:添加储备(qz(银子*HDPZ["妖王"].银子),"妖王",1)
		if 取随机数()<=HDPZ["妖王"].爆率 then
			local 链接 = {提示=format("#S(妖王)#G/%s#Y与妖王厮杀中幸运的获得了",玩家数据[id].角色.名称),频道="xt",结尾="#Y。#85"}
			local 名称,数量,参数=生成产出(产出物品计算(HDPZ["妖王"].ITEM),"妖王")
			if 数量== 9999 then --环
				玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
			else
				玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
			end
		end
	end
end

--------------------封妖
__GWdh111[101]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
		对话数据.模型=任务数据[标识].模型
		对话数据.名称=任务数据[标识].名称
		if 任务数据[标识].zhandou==nil then
			对话数据.对话="被压在地下千年了，是谁放我出来的#24我保证留你半条小命#24"
			对话数据.选项={"少说废话,开打","青山不转，绿水长流，我们后会有期"}
		else
			对话数据.对话="我正在战斗中，  请勿打扰。"
		end
	return 对话数据
end

__GWdh222[101]=function (连接id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件=="少说废话,开打" then
		if 任务数据[玩家数据[数字id].地图单位.标识].zhandou~=nil then 常规提示(数字id,"#Y/对方正在战斗中") return  end
		if 调试模式==false and 取队伍人数(数字id)<3 then 常规提示(数字id,"#Y/封妖活动最少要有三人") return  end
		战斗准备类:创建战斗(数字id+0,100004,玩家数据[数字id].地图单位.标识)
		任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
		玩家数据[数字id].地图单位=nil
		return
	end
end

function 设置任务101(id)
	local 地图范围={1501,1193,1110,1173,1092,1091,1174,1210}
	local 地图=地图范围[取随机数(1,#地图范围)]
	local mx={"黑山老妖","地狱战神","净瓶女娲","猫灵兽形","如意仙子","兔子怪","蝎子精","混沌兽","夜罗刹","狂豹兽形","修罗傀儡鬼"}
	local 封妖等级={[1501]=25,[1193]=35,[1110]=45,[1173]=45,[1092]=55,[1091]=65,[1174]=75,[1210]=95}
	local 临时数量=#mx
	for n=1,临时数量 do
		local 任务id="_101_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
		随机序列=随机序列+1
		local xy=地图处理类.地图坐标[地图]:取随机点()
		local biany=false
		if 临时数量-n<=3 then --最后三只 变异
			biany=true
		end
		任务数据[任务id]={
			id=任务id,
			起始=os.time(),
			结束=1800,
			玩家id=0,
			变异=biany,
			销毁=true,
			队伍组={},
			名称="远古"..mx[n],
			模型=mx[n],
			等级=封妖等级[地图],
			x=xy.x,
			y=xy.y,
			地图编号=地图,
			地图名称=取地图名称(地图),
			类型=101
		}
		地图处理类:添加单位(任务id)
	end
	local 玩家名称 = "某某人"
	if 玩家数据[id] then
		玩家数据[id].角色:添加储备(临时数量*5000,"挖宝放妖")
		常规提示(id,"#Y/你不慎挖塌了妖怪家的房子，却意外的发现了#R/"..(临时数量*5000).."#Y/点储备金")
		玩家名称 = 玩家数据[id].角色.名称
	end
	广播消息({内容=format("#Y/%s#W/在挖宝时不慎挖塌了妖怪家的房子，现在一群无家可归的妖怪正在#Y/%s#w/寻衅闹事，各路英雄赶快前往平乱啊！#35",玩家名称,取地图名称(地图)),频道="xt"})
end

function 胜利MOB_100004(胜利id,战斗数据,id组)
	local 任务id=战斗数据.任务id
	if 任务数据[任务id]==nil then
		return
	end
	local gl=0
	local 变异=false
	local 额外经验,额外银子=0,0
	if 任务数据[任务id].变异 then
		变异=true
		gl=15
		额外经验,额外银子=50000,40000
	end
	-- local 等级=任务数据[任务id].等级
	地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
	任务数据[任务id]=nil
	-- local 经验=等级*等级+30000
	-- local 银子=等级*125+10000
	for n=1,#id组 do
		local id=id组[n]
		更新玩家每日(id,"日常任务","封妖任务")
		local 平均等级 = 取队伍平均等级(玩家数据[id].队伍,id)
		local 经验=qz(平均等级*取随机数(850,900))+额外经验
		local 银子=qz(平均等级*取随机数(90,95))+4000+额外银子
		玩家数据[id].角色:添加经验(经验*HDPZ["封妖"].经验,"封妖任务",1)
		玩家数据[id].角色:添加银子(qz(银子*HDPZ["封妖"].银子),"封妖任务",1)
		if 取随机数()<=HDPZ["封妖"].爆率+gl then
			local 链接 = {提示=format("#S(封妖任务)#G/%s#Y在封妖时候竟意外获得从#R变异远古妖#Y身上掉落的",玩家数据[id].角色.名称),频道="xt",结尾="#Y！"}
							local 名称,数量,参数=生成产出(产出物品计算(HDPZ["封妖"].ITEM),"封妖")
							if 数量== 9999 then --环
								玩家数据[id].道具:给予道具(id,nil,nil,nil,nil,nil,名称,nil,nil,nil,链接)
							else
										玩家数据[id].道具:给予超链接道具(id,名称,数量,参数,链接)
							end
		end
	end
end