-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 21:41:24
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:42:28
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

--======================================================================--
-- @作者: GGE研究群: 342119466
-- @创建时间:   2018-03-03 02:34:19
-- @Last Modified time: 2019-08-31 11:56:31
-- 梦幻西游游戏资源破解 baidwwy@vip.qq.com(313738139) 老毕   和 C++PrimerPlus 717535046 这俩位大神破解所以资源
--======================================================================--
local 宝图名字={
	姓={
		[1]="张",
		[2]="吴",
		[3]="王",
		[4]="郑",
		[5]="周",
		[6]="赵",
		[7]="钱",
		[8]="李",
		[9]="孙",
		[10]="欧阳",
		[11]="南宫",
		[12]="上官",
		[13]="许",
		[14]="西门",
		[15]="毛",
		[16]="韦",
		[17]="曾",
		[18]="江",
		[19]="林",
		[20]="徐"
	},
	名={
		[1]="大",
		[2]="二",
		[3]="三",
		[4]="发",
		[5]="杰",
		[6]="紫",
		[7]="青",
		[8]="则",
		[9]="玉",
		[10]="宝",
		[11]="若",
		[12]="可",
		[13]="恩",
		[14]="倭",
		[15]="武",
		[16]="金",
		[17]="又",
		[18]="本",
		[19]="复",
		[20]="开"
},
	氏={
		[1]="强",
		[2]="伦",
		[3]="空",
		[4]="财",
		[5]="飞",
		[6]="天",
		[7]="井",
		[8]="来",
		[9]="狗",
		[10]="麻",
		[11]="若",
		[12]="佳",
		[13]="文",
		[14]="武",
		[15]="全",
		[16]="不二",
		[17]="男",
		[18]="黑",
		[19]="白",
		[20]="之"
	},
}

__GWdh111[4]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
		对话数据.模型=任务数据[标识].模型
		对话数据.名称=任务数据[标识].名称
		if 数字id==任务数据[标识].玩家id then
			对话数据.对话="看什么看，没见过这么英俊潇洒的强盗？"
			对话数据.选项={"交出宝藏","不好意思，我认错人了"}
		else
			对话数据.对话="我好像不认识你吧？？？"
		end
	return 对话数据
end

__GWdh222[4]=function (连接id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件=="交出宝藏" then
		战斗准备类:创建战斗(数字id+0,100002,玩家数据[数字id].地图单位.标识)
		任务数据[玩家数据[数字id].地图单位.标识].zhandou=true
		玩家数据[数字id].地图单位=nil
		return
	end
end

function 设置任务4(id)
	local 任务id,ZU=取唯一任务(4,id)
	local 地图范围={1501,1092,1193,1070,1142}
	local 地图=地图范围[取随机数(1,#地图范围)]
	local xy=地图处理类.地图坐标[地图]:取随机点()
	local 名称=宝图名字.姓[取随机数(1,#宝图名字.姓)]..宝图名字.名[取随机数(1,#宝图名字.名)]
	if 取随机数()<=70 then
		名称=名称..宝图名字.氏[取随机数(1,#宝图名字.氏)]
	end
	local 结束时间=3600
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=结束时间,
		玩家id=id,
		销毁=true,
		队伍组=ZU,
		DWZ=ZU,
		名称=名称,
		模型="强盗",
		x=xy.x,
		y=xy.y,
		地图编号=地图,
		地图名称=取地图名称(地图),
		类型=4
	}
	玩家数据[id].角色:添加任务(任务id)
	发送数据(玩家数据[id].连接id,39)
	发送数据(玩家数据[id].连接id,1501,{名称="店小二",模型="男人_店小二",对话=format("听说近日有强盗#Y/%s#W/被官府通缉，现已逃到了#G/%s(%s,%s)#W/处。若是能找到他，肯定能搜出不少宝物。",任务数据[任务id].名称,任务数据[任务id].地图名称,任务数据[任务id].x,任务数据[任务id].y)})
	地图处理类:添加单位(任务id)
end

function 胜利MOB_100002(胜利id,战斗数据) --宝图强盗
	local 任务id=战斗数据.任务id
 	if 战斗数据.进入战斗玩家id==任务数据[任务id].玩家id then
		local 临时金钱=取随机数(1000,5000)+3000
		local id=任务数据[任务id].玩家id
		玩家数据[id].角色:添加银子(qz(临时金钱),"完成宝图任务",1)
		if 取随机数(1,100)<=75 then
			玩家数据[id].道具:给予道具(id,"藏宝图",1)
		end
		玩家数据[id].角色:取消任务(任务id)
	end
end

-- function 奖励MOB100003(id,战斗数据) --挖宝图遇怪
  -- 	if id== 战斗数据.进入战斗玩家id then
		-- 玩家数据[id].道具:完成宝图遇怪(id)
  -- 	end
-- end

function 任务说明4(玩家id,任务id)
	local 说明 = {}
	说明={"宝图任务",format("前往#Y/%s(%s,%s)#W/#L/处缉拿强盗#R/%s#W。",取地图名称(任务数据[任务id].地图编号),任务数据[任务id].x,任务数据[任务id].y,任务数据[任务id].名称),"完成后可获得少量金钱、几率获得藏宝图"}
	return 说明
end