-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-02-01 22:54:59
-- @最后修改来自: baidwwy
-- @Last Modified time: 2022-12-16 08:32:22
function 设置任务10(id,气血,魔法,气血上限)
	local 任务id=id.."_10_"..os.time()
	local 结束时间=99999999
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=结束时间,
		玩家id=id,
		销毁=true,
		是存档=true,
		气血=气血,
		气血上限=气血上限,
		魔法=魔法,
		队伍组={},
		类型=10
	}
	玩家数据[id].角色:添加任务(任务id)
	发送数据(玩家数据[id].连接id,39)
end

function 任务说明10(玩家id,任务id)
	local 说明 = {}
	说明={"罗羹效果",format("#L/在每场战斗结束后都将自动恢复人物气血和魔法。当前还可恢复#R/%s#L点气血、当前还可恢复#R/%s#L点伤势、#R/%s#L/点魔法",任务数据[任务id].气血,任务数据[任务id].气血上限,任务数据[任务id].魔法),nil,{任务数据[任务id].气血,任务数据[任务id].气血上限,任务数据[任务id].魔法}}
	return 说明
end