-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-01-31 22:23:16
-- @最后修改来自: baidwwy
-- @Last Modified time: 2023-05-13 14:42:27
local sj = 取随机数
local format = string.format
local insert = table.insert
local ceil = math.ceil
local floor = math.floor
local wps = 取物品数据
local typ = type
local random = 取随机数

__GWdh111[127]=function(连接id,数字id,序列,标识,地图)
	local 对话数据={}
		对话数据.模型=任务数据[标识].模型
		对话数据.名称=任务数据[标识].名称
		if 对话数据.模型=="银两" then
			local wb = {}
			wb[1] = "哎啊!我什么在这里了#24？"
			wb[2] = "啊!我是一个刚刚成精的银子,我偷跑出来迷路了#69？"
			wb[3] = "奇怪!刚刚我还在银堆里面......#45"
			wb[4] = "这..!都怪那阵死风,什么把我吹这么远了....我要回去!回去!#60"
			对话数据.对话=wb[random(1,#wb)]
			对话数据.选项={"捡起来,放口袋里","我只是路过的"}
		elseif 对话数据.模型=="食物" or 对话数据.模型=="口粮" or 对话数据.模型=="摄妖香" or 对话数据.模型=="药品" then
			local wb = {}
			wb[1] = "哎啊!我什么在这里了#24？"
			wb[2] = "啊!我还是是一个刚刚成精的孩子,我偷跑出来迷路了#69？"
			wb[3] = "奇怪!刚刚我还在孩子堆里面......#45"
			wb[4] = "这..!都怪那阵死风,什么把我吹这么远了....我要回去!回去!#60"
			对话数据.对话=wb[random(1,#wb)]
			对话数据.选项={"捡物品,放口袋里","我只是路过的"}
		elseif 对话数据.模型=="海星" or 对话数据.模型=="海毛虫" or 对话数据.模型=="大海龟" or 对话数据.模型=="巨蛙" then
			local wb = {}
			wb[1] = "哎啊!我什么在这里了".."#"..random(1,110).."？"
			wb[2] = "啊!我偷跑出来迷路了".."#"..random(1,110).."？"
			wb[3] = "奇怪!刚刚我还在海里游......".."#"..random(1,110).."。"
			wb[4] = "这..!都怪那阵死风,什么把我吹这么远了....我要回去!回去!#60"
			对话数据.对话=wb[random(1,#wb)]
			对话数据.选项={"抓起来,做宠物","我们后会有期"}
		end
	return 对话数据
end

__GWdh222[127]=function (连接id,数字id,序号,内容)
	local 事件=内容[1]
	local 名称=内容[3]
	if 事件=="捡起来,放口袋里" then
		local x银子 = random(1,50)
		玩家数据[数字id].角色:添加银子(x银子,"地图捡银子",1)
		地图处理类:删除单位(任务数据[玩家数据[数字id].地图单位.标识].地图编号,任务数据[玩家数据[数字id].地图单位.标识].单位编号)
		任务数据[玩家数据[数字id].地图单位.标识]=nil
		return
	elseif 事件=="捡物品,放口袋里" then
		local x数量 = random(1,3)
		local 临时品质=0
		local 临时等级=10
		local 物品表={"包子","烤鸭","佛跳墙"}
		local 临时物品=物品表[random(1,#物品表)]
		local x模型 = 任务数据[玩家数据[数字id].地图单位.标识].模型
		if x模型=="食物" then
			物品表={"包子","烤鸭","佛跳墙"}
			临时物品=物品表[random(1,#物品表)]
			if 临时物品~="包子" then
				x数量 =1
				临时品质=random(math.floor(临时等级*0.5),临时等级)
			end
		elseif x模型=="口粮" or x模型=="摄妖香" or x模型=="药品" then
			if x模型=="药品" then
				物品表={"灵脂","曼陀罗花","鬼切草","佛手","四叶花","鬼切草"}
				临时物品=物品表[random(1,#物品表)]
				x数量 =1
				临时品质=random(math.floor(临时等级*0.5),临时等级)
			else
				临时物品=x模型
			end
		end
		if 玩家数据[数字id].道具:给予道具(数字id,临时物品,x数量,临时品质) then
			地图处理类:删除单位(任务数据[玩家数据[数字id].地图单位.标识].地图编号,任务数据[玩家数据[数字id].地图单位.标识].单位编号)
			任务数据[玩家数据[数字id].地图单位.标识]=nil
			常规提示(数字id,"#Y/恭喜你得到了"..x数量.."个"..临时物品.."...")
		end
		return
	elseif 事件=="抓起来,做宠物" then
			local 种类="宝宝"
			if random(1,150)<=20 then
				种类="变异"
			end
			local x模型 = 任务数据[玩家数据[数字id].地图单位.标识].模型
			if 玩家数据[数字id].召唤兽:添加召唤兽(x模型,"宝宝",种类,属性,1,染色方案,技能组,资质组,成长,参战等级,属性表) then
				常规提示(数字id,"#Y/你获得了一只"..x模型)
				地图处理类:删除单位(任务数据[玩家数据[数字id].地图单位.标识].地图编号,任务数据[玩家数据[数字id].地图单位.标识].单位编号)
				任务数据[玩家数据[数字id].地图单位.标识]=nil
			end
		return
	end
end

function 设置任务127(id)
	local 地图范围={1501,1506}
	local x待发送数据 = {}
	for i=1,#地图范围 do
		local 临时数量=取随机数(1,5)
		local 地图=地图范围[i]
		x待发送数据[地图]={}
		for n=1,临时数量 do
			local 任务id=地图.."_127_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999).."_"..n
			随机序列=随机序列+1
			local xy=地图处理类.地图坐标[地图]:取随机点()
			local 模型范围={"银两","食物","摄妖香","药品","海星","海毛虫","大海龟","巨蛙"}--"宠物口粮",
			local 模型=模型范围[取随机数(1,#模型范围)]
			local x称谓 = nil
			if 模型=="海星" or 模型=="海毛虫" or 模型=="大海龟" or 模型=="巨蛙" then
				x称谓="宝宝"
			end
			任务数据[任务id]={
				id=任务id,
				起始=os.time(),
				结束=1500,
				玩家id=0,
				队伍组={},
				名称=模型,
				模型=模型,
				等级=取随机数(1,140),
				称谓=x称谓,
				x=xy.x,
				y=xy.y,
				事件="明雷活动",
				地图编号=地图,
				地图名称=取地图名称(地图),
				类型=127
			}
			-- 地图处理类:添加单位(任务id)
			table.insert(x待发送数据[地图], 地图处理类:批量添加单位(任务id))--修改
		end
	end
	for i=1,#地图范围 do--修改
		local 地图编号=地图范围[i]
		for n, v in pairs(地图处理类.地图玩家[地图编号]) do
			if n~=id and 地图处理类:取同一地图(地图编号,id,n,1)  then
				发送数据(玩家数据[n].连接id,1021,x待发送数据[地图编号])
			end
		end
	end
	x待发送数据={}
end

function rwgx127(任务id)
	if os.time()-任务数据[任务id].起始>=任务数据[任务id].结束 and 任务数据[任务id].结束 ~= 99999999 then -- 任务时间到期
		if 任务数据[任务id].zhandou==nil  then
			地图处理类:删除单位(任务数据[任务id].地图编号,任务数据[任务id].单位编号)
			任务数据[任务id]=nil
		end
	end
end