-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-02-01 22:07:47
-- @最后修改来自: baidwwy
-- @Last Modified time: 2022-12-05 00:19:04
function 设置任务503(id)
	if 玩家数据[id].角色:取任务(503)~=0 then 添加最后对话(id,"你已经有青龙堂任务了")return end
	local 任务id=id.."_503_"..os.time().."_"..随机序列.."_"..取随机数(88,99999999)
	local 结束时间=3600
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=结束时间,
		玩家id=id,
		队伍组={},
		名称=1,
		模型=1,
		地图编号=1001,
		地图名称=1,
		积分=0,
		类型=503
	}
	玩家数据[id].角色:添加任务(任务id)
	GetUpMOB503(id,任务id)
end
function GetUpMOB503(id,任务id)
	local 类型=11
	local 地图=1865
	local 名称="青龙堂主管"
	--地图=1111
	--名称="马真人"
	任务数据[任务id].地图编号=地图
	任务数据[任务id].地图名称=取地图名称(地图)
	任务数据[任务id].名称=名称
	任务数据[任务id].分类=类型
	if 类型==11 then
		local  物品表 = {}
		local  物品表1={"天不老","紫石英","鹿茸","血色茶花","六道轮回","熊胆","凤凰尾","硫磺草","龙之心屑","火凤之睛","丁香水","月星子","仙狐涎","地狱灵芝","麝香","血珊瑚","餐风饮露","白露为霜","天龙水","孔雀红"}
		local  物品表2={"醉生梦死","蛇胆酒","百味酒","梅花酒","长寿面","翡翠豆腐","桂花丸","佛跳墙","佛跳墙","佛跳墙","珍露酒","烤鸭","烤鸭","豆斋果","烤鸭","臭豆腐","佛跳墙","烤鸭","虎骨酒"}
		if 取随机数()<10 then
			物品表= 物品表2
		else
			物品表=物品表1
		end
	 任务数据[任务id].物品=物品表[取随机数(1,#物品表)]
	 添加最后对话(id,format("听闻%s的%s正在四处搜寻#Y%s#W，请你帮他寻找一个吧。",任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].物品))
	end
	玩家数据[id].角色:刷新任务跟踪()
end
function 完成任务_503(id,任务id)
	if 任务数据[任务id]==nil then return  end
	local 点数 = 取随机数(5,10)
		玩家数据[id].角色.BG = 玩家数据[id].角色.BG+点数
		玩家数据[id].角色:添加经验(4000,"青龙堂任务")
		玩家数据[id].角色:取消任务(任务id)
		消息提示(id,"#Y恭喜你完成了青龙任务奖励帮贡"..点数.."点")
		任务数据[任务id]=nil
	-- body
end

function 任务说明503(玩家id,任务id)
	local 说明 = {}
	if 任务数据[任务id].分类==11  then
		说明={"青龙堂任务",format("#L将#Y%s#L交给%s的%s",任务数据[任务id].物品,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].积分),"本任务可获得帮贡奖励"}
	elseif 任务数据[任务id].分类==12 or 任务数据[任务id].分类==13 or 任务数据[任务id].分类==14 then
		说明={"青龙堂任务",format("#L将#Y%s#L交给%s的%s",任务数据[任务id].物品,任务数据[任务id].地图名称,任务数据[任务id].名称,任务数据[任务id].次数),"本任务可获得帮贡奖励"}
	end
	return 说明
end