-- @作者: baidwwy
-- @邮箱:  313738139@qq.com
-- @创建时间:   2021-02-01 22:47:39
-- @最后修改来自: baidwwy
-- @Last Modified time: 2022-12-04 21:53:19
function 设置任务6(id)
	local 任务id=id.."_5_"..os.time()..取随机数(1,9999)..随机序列
	随机序列=随机序列+1
	local 结束时间=99999999
	local 数量=10
	任务数据[任务id]={
		id=任务id,
		起始=os.time(),
		结束=结束时间,
		玩家id=id,
		队伍组={},
		数量=数量,
		类型=6
	}
	玩家数据[id].角色:添加任务(任务id)
	发送数据(玩家数据[id].连接id,39)
	常规提示(id,"#Y/你获得了赏金任务")
	发送数据(玩家数据[id].连接id,1501,{名称="赵捕头",模型="男人_衙役",对话="野外的怪物们十分不安分，老是袭击过往的村民，还请你去教训教训它们，让它们能安分守己些。"})
end

function 任务说明6(玩家id,任务id)
	local 说明 = {}
	说明={"赏金任务",format("#L/在#R/东海湾、东海岩洞、东海海底、海底沉船、江南野外#L/完成指定的战斗次数。你还需要在这些场景中战斗#Y/%s#L/次才可获得奖励。",任务数据[任务id].数量),"可获得经验、银子或储备"}
	return 说明
end